      ****************************************************
      * HISTORICAL OUTMIGRATION ADJUSTMENT FACTOR TABLE  *
      * FOR USE WITH THE OPPS FINAL RULE                 *
      * REVISED 10/21/2020 (CN 2021 PROD)                *
      ****************************************************
       01  OUTM-ADJ-TABLE.
           02  OUTM-ADJ-DATA.
               05  FILLER   PIC X(20)  VALUE     '01003 00149 20180101'.
               05  FILLER   PIC X(20)  VALUE     '01003 00149 20190101'.
               05  FILLER   PIC X(20)  VALUE     '01003 00140 20200101'.
               05  FILLER   PIC X(20)  VALUE     '01003 00140 20210101'.
               05  FILLER   PIC X(20)  VALUE     '01013 00176 20180101'.
               05  FILLER   PIC X(20)  VALUE     '01013 00176 20190101'.
               05  FILLER   PIC X(20)  VALUE     '01013 00299 20200101'.
               05  FILLER   PIC X(20)  VALUE     '01013 00299 20210101'.
               05  FILLER   PIC X(20)  VALUE     '01019 00038 20180101'.
               05  FILLER   PIC X(20)  VALUE     '01019 00038 20190101'.
               05  FILLER   PIC X(20)  VALUE     '01019 01030 20200101'.
               05  FILLER   PIC X(20)  VALUE     '01019 01030 20210101'.
               05  FILLER   PIC X(20)  VALUE     '01025 00165 20180101'.
               05  FILLER   PIC X(20)  VALUE     '01025 00165 20190101'.
               05  FILLER   PIC X(20)  VALUE     '01041 00119 20180101'.
               05  FILLER   PIC X(20)  VALUE     '01041 00119 20190101'.
               05  FILLER   PIC X(20)  VALUE     '01043 00399 20180101'.
               05  FILLER   PIC X(20)  VALUE     '01043 00399 20190101'.
               05  FILLER   PIC X(20)  VALUE     '01043 00408 20200101'.
               05  FILLER   PIC X(20)  VALUE     '01043 00408 20210101'.
               05  FILLER   PIC X(20)  VALUE     '01049 00446 20180101'.
               05  FILLER   PIC X(20)  VALUE     '01049 00446 20190101'.
               05  FILLER   PIC X(20)  VALUE     '01053 00251 20180101'.
               05  FILLER   PIC X(20)  VALUE     '01055 00074 20180101'.
               05  FILLER   PIC X(20)  VALUE     '01055 00074 20190101'.
               05  FILLER   PIC X(20)  VALUE     '01055 00149 20200101'.
               05  FILLER   PIC X(20)  VALUE     '01055 00149 20210101'.
               05  FILLER   PIC X(20)  VALUE     '01071 00584 20180101'.
               05  FILLER   PIC X(20)  VALUE     '01071 00584 20190101'.
               05  FILLER   PIC X(20)  VALUE     '01071 00599 20200101'.
               05  FILLER   PIC X(20)  VALUE     '01071 00599 20210101'.
               05  FILLER   PIC X(20)  VALUE     '01077 00217 20200101'.
               05  FILLER   PIC X(20)  VALUE     '01077 00217 20210101'.
               05  FILLER   PIC X(20)  VALUE     '01081 00176 20180101'.
               05  FILLER   PIC X(20)  VALUE     '01081 00176 20190101'.
               05  FILLER   PIC X(20)  VALUE     '01081 00303 20200101'.
               05  FILLER   PIC X(20)  VALUE     '01081 00303 20210101'.
               05  FILLER   PIC X(20)  VALUE     '01095 00529 20180101'.
               05  FILLER   PIC X(20)  VALUE     '01095 00529 20190101'.
               05  FILLER   PIC X(20)  VALUE     '01103 00332 20180101'.
               05  FILLER   PIC X(20)  VALUE     '01103 00332 20190101'.
               05  FILLER   PIC X(20)  VALUE     '01103 00332 20200101'.
               05  FILLER   PIC X(20)  VALUE     '01103 00422 20210101'.
               05  FILLER   PIC X(20)  VALUE     '01109 00067 20180101'.
               05  FILLER   PIC X(20)  VALUE     '01109 00082 20190101'.
               05  FILLER   PIC X(20)  VALUE     '01109 00082 20200101'.
               05  FILLER   PIC X(20)  VALUE     '01109 00082 20210101'.
               05  FILLER   PIC X(20)  VALUE     '01111 00874 20180101'.
               05  FILLER   PIC X(20)  VALUE     '01111 00874 20190101'.
               05  FILLER   PIC X(20)  VALUE     '01119 00137 20180101'.
               05  FILLER   PIC X(20)  VALUE     '01119 00137 20190101'.
               05  FILLER   PIC X(20)  VALUE     '01121 00321 20180101'.
               05  FILLER   PIC X(20)  VALUE     '01121 00321 20190101'.
               05  FILLER   PIC X(20)  VALUE     '01121 00469 20200101'.
               05  FILLER   PIC X(20)  VALUE     '01121 00469 20210101'.
               05  FILLER   PIC X(20)  VALUE     '01123 00285 20180101'.
               05  FILLER   PIC X(20)  VALUE     '01123 00305 20190101'.
               05  FILLER   PIC X(20)  VALUE     '01123 00305 20200101'.
               05  FILLER   PIC X(20)  VALUE     '01123 00305 20210101'.
               05  FILLER   PIC X(20)  VALUE     '01127 00670 20210101'.
               05  FILLER   PIC X(20)  VALUE     '01133 00407 20180101'.
               05  FILLER   PIC X(20)  VALUE     '01133 00407 20190101'.
               05  FILLER   PIC X(20)  VALUE     '01133 00389 20200101'.
               05  FILLER   PIC X(20)  VALUE     '01133 00389 20210101'.
               05  FILLER   PIC X(20)  VALUE     '05027 00348 20180101'.
               05  FILLER   PIC X(20)  VALUE     '05027 00348 20190101'.
               05  FILLER   PIC X(20)  VALUE     '05043 00135 20180101'.
               05  FILLER   PIC X(20)  VALUE     '05043 00218 20200101'.
               05  FILLER   PIC X(20)  VALUE     '05043 00218 20210101'.
               05  FILLER   PIC X(20)  VALUE     '05055 00111 20180101'.
               05  FILLER   PIC X(20)  VALUE     '05055 00111 20190101'.
               05  FILLER   PIC X(20)  VALUE     '05057 00117 20180101'.
               05  FILLER   PIC X(20)  VALUE     '05059 00561 20180101'.
               05  FILLER   PIC X(20)  VALUE     '05059 00561 20190101'.
               05  FILLER   PIC X(20)  VALUE     '05059 00529 20200101'.
               05  FILLER   PIC X(20)  VALUE     '05059 00529 20210101'.
               05  FILLER   PIC X(20)  VALUE     '05069 00001 20180101'.
               05  FILLER   PIC X(20)  VALUE     '05069 00001 20190101'.
               05  FILLER   PIC X(20)  VALUE     '05069 00131 20210101'.
               05  FILLER   PIC X(20)  VALUE     '05071 00041 20180101'.
               05  FILLER   PIC X(20)  VALUE     '05093 00212 20180101'.
               05  FILLER   PIC X(20)  VALUE     '05107 00003 20180101'.
               05  FILLER   PIC X(20)  VALUE     '05107 00027 20190101'.
               05  FILLER   PIC X(20)  VALUE     '05107 00027 20200101'.
               05  FILLER   PIC X(20)  VALUE     '05107 00027 20210101'.
               05  FILLER   PIC X(20)  VALUE     '05121 00147 20180101'.
               05  FILLER   PIC X(20)  VALUE     '05121 00147 20190101'.
               05  FILLER   PIC X(20)  VALUE     '05145 00126 20180101'.
               05  FILLER   PIC X(20)  VALUE     '05145 00126 20190101'.
               05  FILLER   PIC X(20)  VALUE     '05145 00129 20200101'.
               05  FILLER   PIC X(20)  VALUE     '05145 00129 20210101'.
               05  FILLER   PIC X(20)  VALUE     '06001 00023 20180101'.
               05  FILLER   PIC X(20)  VALUE     '06001 00023 20190101'.
               05  FILLER   PIC X(20)  VALUE     '06001 00233 20200101'.
               05  FILLER   PIC X(20)  VALUE     '06001 00233 20210101'.
               05  FILLER   PIC X(20)  VALUE     '06005 00917 20180101'.
               05  FILLER   PIC X(20)  VALUE     '06005 00917 20190101'.
               05  FILLER   PIC X(20)  VALUE     '06005 00867 20200101'.
               05  FILLER   PIC X(20)  VALUE     '06005 00867 20210101'.
               05  FILLER   PIC X(20)  VALUE     '06041 00158 20210101'.
               05  FILLER   PIC X(20)  VALUE     '06047 00302 20210101'.
               05  FILLER   PIC X(20)  VALUE     '06055 00472 20180101'.
               05  FILLER   PIC X(20)  VALUE     '06055 00472 20190101'.
               05  FILLER   PIC X(20)  VALUE     '06055 00688 20200101'.
               05  FILLER   PIC X(20)  VALUE     '06055 00688 20210101'.
               05  FILLER   PIC X(20)  VALUE     '06057 00755 20180101'.
               05  FILLER   PIC X(20)  VALUE     '06057 00755 20190101'.
               05  FILLER   PIC X(20)  VALUE     '06057 00714 20200101'.
               05  FILLER   PIC X(20)  VALUE     '06057 00714 20210101'.
               05  FILLER   PIC X(20)  VALUE     '06059 00027 20210101'.
               05  FILLER   PIC X(20)  VALUE     '06071 00028 20210101'.
               05  FILLER   PIC X(20)  VALUE     '06077 00618 20180101'.
               05  FILLER   PIC X(20)  VALUE     '06077 00478 20190101'.
               05  FILLER   PIC X(20)  VALUE     '06077 00478 20200101'.
               05  FILLER   PIC X(20)  VALUE     '06077 00478 20210101'.
               05  FILLER   PIC X(20)  VALUE     '06081 00050 20180101'.
               05  FILLER   PIC X(20)  VALUE     '06081 00050 20190101'.
               05  FILLER   PIC X(20)  VALUE     '06087 00042 20200101'.
               05  FILLER   PIC X(20)  VALUE     '06087 00042 20210101'.
               05  FILLER   PIC X(20)  VALUE     '06095 00070 20180101'.
               05  FILLER   PIC X(20)  VALUE     '06095 00070 20190101'.
               05  FILLER   PIC X(20)  VALUE     '06097 00195 20180101'.
               05  FILLER   PIC X(20)  VALUE     '06097 00195 20190101'.
               05  FILLER   PIC X(20)  VALUE     '06097 00195 20200101'.
               05  FILLER   PIC X(20)  VALUE     '06097 00211 20210101'.
               05  FILLER   PIC X(20)  VALUE     '06099 00391 20180101'.
               05  FILLER   PIC X(20)  VALUE     '06099 00391 20190101'.
               05  FILLER   PIC X(20)  VALUE     '06099 00402 20200101'.
               05  FILLER   PIC X(20)  VALUE     '06099 00402 20210101'.
               05  FILLER   PIC X(20)  VALUE     '06101 00494 20210101'.
               05  FILLER   PIC X(20)  VALUE     '06103 00226 20180101'.
               05  FILLER   PIC X(20)  VALUE     '06103 00226 20190101'.
               05  FILLER   PIC X(20)  VALUE     '06103 00058 20200101'.
               05  FILLER   PIC X(20)  VALUE     '06103 00058 20210101'.
               05  FILLER   PIC X(20)  VALUE     '06115 00972 20180101'.
               05  FILLER   PIC X(20)  VALUE     '06115 00972 20190101'.
               05  FILLER   PIC X(20)  VALUE     '06115 00919 20200101'.
               05  FILLER   PIC X(20)  VALUE     '06115 00919 20210101'.
               05  FILLER   PIC X(20)  VALUE     '08013 00032 20180101'.
               05  FILLER   PIC X(20)  VALUE     '08013 00032 20190101'.
               05  FILLER   PIC X(20)  VALUE     '08043 00025 20180101'.
               05  FILLER   PIC X(20)  VALUE     '08043 00025 20190101'.
               05  FILLER   PIC X(20)  VALUE     '08123 00112 20180101'.
               05  FILLER   PIC X(20)  VALUE     '08123 00050 20190101'.
               05  FILLER   PIC X(20)  VALUE     '08123 00050 20200101'.
               05  FILLER   PIC X(20)  VALUE     '08123 00050 20210101'.
               05  FILLER   PIC X(20)  VALUE     '09001 00024 20190101'.
               05  FILLER   PIC X(20)  VALUE     '09001 00024 20200101'.
               05  FILLER   PIC X(20)  VALUE     '09001 00024 20210101'.
               05  FILLER   PIC X(20)  VALUE     '09005 00677 20180101'.
               05  FILLER   PIC X(20)  VALUE     '09005 00017 20190101'.
               05  FILLER   PIC X(20)  VALUE     '09005 00017 20200101'.
               05  FILLER   PIC X(20)  VALUE     '09005 00017 20210101'.
               05  FILLER   PIC X(20)  VALUE     '09007 00317 20180101'.
               05  FILLER   PIC X(20)  VALUE     '09009 00101 20180101'.
               05  FILLER   PIC X(20)  VALUE     '09009 00013 20190101'.
               05  FILLER   PIC X(20)  VALUE     '09009 00013 20200101'.
               05  FILLER   PIC X(20)  VALUE     '09009 00013 20210101'.
               05  FILLER   PIC X(20)  VALUE     '10001 00099 20180101'.
               05  FILLER   PIC X(20)  VALUE     '10001 00225 20190101'.
               05  FILLER   PIC X(20)  VALUE     '10001 00225 20200101'.
               05  FILLER   PIC X(20)  VALUE     '10001 00225 20210101'.
               05  FILLER   PIC X(20)  VALUE     '12011 00007 20210101'.
               05  FILLER   PIC X(20)  VALUE     '12015 00161 20180101'.
               05  FILLER   PIC X(20)  VALUE     '12015 00161 20190101'.
               05  FILLER   PIC X(20)  VALUE     '12015 00108 20210101'.
               05  FILLER   PIC X(20)  VALUE     '12017 00078 20180101'.
               05  FILLER   PIC X(20)  VALUE     '12017 00078 20190101'.
               05  FILLER   PIC X(20)  VALUE     '12023 00294 20180101'.
               05  FILLER   PIC X(20)  VALUE     '12023 00243 20190101'.
               05  FILLER   PIC X(20)  VALUE     '12023 00243 20200101'.
               05  FILLER   PIC X(20)  VALUE     '12023 00243 20210101'.
               05  FILLER   PIC X(20)  VALUE     '12035 00223 20180101'.
               05  FILLER   PIC X(20)  VALUE     '12035 00223 20190101'.
               05  FILLER   PIC X(20)  VALUE     '12035 00125 20210101'.
               05  FILLER   PIC X(20)  VALUE     '12045 00013 20210101'.
               05  FILLER   PIC X(20)  VALUE     '12061 00025 20180101'.
               05  FILLER   PIC X(20)  VALUE     '12061 00061 20190101'.
               05  FILLER   PIC X(20)  VALUE     '12061 00061 20200101'.
               05  FILLER   PIC X(20)  VALUE     '12061 00061 20210101'.
               05  FILLER   PIC X(20)  VALUE     '12075 00011 20180101'.
               05  FILLER   PIC X(20)  VALUE     '12075 00011 20190101'.
               05  FILLER   PIC X(20)  VALUE     '12083 00205 20180101'.
               05  FILLER   PIC X(20)  VALUE     '12083 00111 20190101'.
               05  FILLER   PIC X(20)  VALUE     '12083 00111 20200101'.
               05  FILLER   PIC X(20)  VALUE     '12083 00111 20210101'.
               05  FILLER   PIC X(20)  VALUE     '12105 00076 20180101'.
               05  FILLER   PIC X(20)  VALUE     '12105 00105 20190101'.
               05  FILLER   PIC X(20)  VALUE     '12105 00105 20200101'.
               05  FILLER   PIC X(20)  VALUE     '12105 00105 20210101'.
               05  FILLER   PIC X(20)  VALUE     '12107 00748 20180101'.
               05  FILLER   PIC X(20)  VALUE     '12107 00748 20190101'.
               05  FILLER   PIC X(20)  VALUE     '12119 00293 20180101'.
               05  FILLER   PIC X(20)  VALUE     '12119 00293 20190101'.
               05  FILLER   PIC X(20)  VALUE     '12119 00293 20200101'.
               05  FILLER   PIC X(20)  VALUE     '12119 00255 20210101'.
               05  FILLER   PIC X(20)  VALUE     '13009 00224 20180101'.
               05  FILLER   PIC X(20)  VALUE     '13009 00224 20190101'.
               05  FILLER   PIC X(20)  VALUE     '13009 00224 20210101'.
               05  FILLER   PIC X(20)  VALUE     '13019 00082 20180101'.
               05  FILLER   PIC X(20)  VALUE     '13031 00179 20180101'.
               05  FILLER   PIC X(20)  VALUE     '13031 00086 20190101'.
               05  FILLER   PIC X(20)  VALUE     '13031 00086 20200101'.
               05  FILLER   PIC X(20)  VALUE     '13031 00086 20210101'.
               05  FILLER   PIC X(20)  VALUE     '13039 00594 20180101'.
               05  FILLER   PIC X(20)  VALUE     '13039 00611 20190101'.
               05  FILLER   PIC X(20)  VALUE     '13039 00611 20200101'.
               05  FILLER   PIC X(20)  VALUE     '13039 00611 20210101'.
               05  FILLER   PIC X(20)  VALUE     '13081 00364 20180101'.
               05  FILLER   PIC X(20)  VALUE     '13087 00202 20180101'.
               05  FILLER   PIC X(20)  VALUE     '13091 00099 20180101'.
               05  FILLER   PIC X(20)  VALUE     '13105 00550 20180101'.
               05  FILLER   PIC X(20)  VALUE     '13109 00226 20180101'.
               05  FILLER   PIC X(20)  VALUE     '13109 00226 20190101'.
               05  FILLER   PIC X(20)  VALUE     '13111 00167 20180101'.
               05  FILLER   PIC X(20)  VALUE     '13111 00031 20200101'.
               05  FILLER   PIC X(20)  VALUE     '13111 00031 20210101'.
               05  FILLER   PIC X(20)  VALUE     '13119 00195 20180101'.
               05  FILLER   PIC X(20)  VALUE     '13119 00177 20190101'.
               05  FILLER   PIC X(20)  VALUE     '13119 00177 20200101'.
               05  FILLER   PIC X(20)  VALUE     '13119 00177 20210101'.
               05  FILLER   PIC X(20)  VALUE     '13123 00237 20180101'.
               05  FILLER   PIC X(20)  VALUE     '13123 00237 20190101'.
               05  FILLER   PIC X(20)  VALUE     '13129 00368 20180101'.
               05  FILLER   PIC X(20)  VALUE     '13129 00368 20190101'.
               05  FILLER   PIC X(20)  VALUE     '13129 00404 20200101'.
               05  FILLER   PIC X(20)  VALUE     '13129 00404 20210101'.
               05  FILLER   PIC X(20)  VALUE     '13131 00125 20180101'.
               05  FILLER   PIC X(20)  VALUE     '13131 00143 20190101'.
               05  FILLER   PIC X(20)  VALUE     '13131 00143 20200101'.
               05  FILLER   PIC X(20)  VALUE     '13131 00143 20210101'.
               05  FILLER   PIC X(20)  VALUE     '13137 00335 20180101'.
               05  FILLER   PIC X(20)  VALUE     '13137 00335 20190101'.
               05  FILLER   PIC X(20)  VALUE     '13139 00006 20180101'.
               05  FILLER   PIC X(20)  VALUE     '13139 00006 20190101'.
               05  FILLER   PIC X(20)  VALUE     '13139 00006 20200101'.
               05  FILLER   PIC X(20)  VALUE     '13139 00016 20210101'.
               05  FILLER   PIC X(20)  VALUE     '13147 00686 20180101'.
               05  FILLER   PIC X(20)  VALUE     '13153 00517 20180101'.
               05  FILLER   PIC X(20)  VALUE     '13153 00552 20190101'.
               05  FILLER   PIC X(20)  VALUE     '13153 00552 20200101'.
               05  FILLER   PIC X(20)  VALUE     '13153 00552 20210101'.
               05  FILLER   PIC X(20)  VALUE     '13157 00870 20180101'.
               05  FILLER   PIC X(20)  VALUE     '13157 00870 20190101'.
               05  FILLER   PIC X(20)  VALUE     '13163 00579 20180101'.
               05  FILLER   PIC X(20)  VALUE     '13163 00579 20190101'.
               05  FILLER   PIC X(20)  VALUE     '13187 01000 20180101'.
               05  FILLER   PIC X(20)  VALUE     '13187 01000 20190101'.
               05  FILLER   PIC X(20)  VALUE     '13187 01000 20200101'.
               05  FILLER   PIC X(20)  VALUE     '13257 00191 20180101'.
               05  FILLER   PIC X(20)  VALUE     '13261 00277 20180101'.
               05  FILLER   PIC X(20)  VALUE     '13261 00212 20190101'.
               05  FILLER   PIC X(20)  VALUE     '13261 00212 20200101'.
               05  FILLER   PIC X(20)  VALUE     '13261 00212 20210101'.
               05  FILLER   PIC X(20)  VALUE     '13285 00258 20180101'.
               05  FILLER   PIC X(20)  VALUE     '13285 00286 20190101'.
               05  FILLER   PIC X(20)  VALUE     '13285 00286 20200101'.
               05  FILLER   PIC X(20)  VALUE     '13285 00286 20210101'.
               05  FILLER   PIC X(20)  VALUE     '16011 00316 20180101'.
               05  FILLER   PIC X(20)  VALUE     '16055 00354 20180101'.
               05  FILLER   PIC X(20)  VALUE     '16055 00354 20190101'.
               05  FILLER   PIC X(20)  VALUE     '16055 00351 20200101'.
               05  FILLER   PIC X(20)  VALUE     '16055 00351 20210101'.
               05  FILLER   PIC X(20)  VALUE     '16065 00395 20180101'.
               05  FILLER   PIC X(20)  VALUE     '16065 00207 20190101'.
               05  FILLER   PIC X(20)  VALUE     '16065 00207 20200101'.
               05  FILLER   PIC X(20)  VALUE     '16065 00207 20210101'.
               05  FILLER   PIC X(20)  VALUE     '16069 00294 20180101'.
               05  FILLER   PIC X(20)  VALUE     '16069 00294 20190101'.
               05  FILLER   PIC X(20)  VALUE     '16069 00331 20200101'.
               05  FILLER   PIC X(20)  VALUE     '16069 00331 20210101'.
               05  FILLER   PIC X(20)  VALUE     '17057 00150 20180101'.
               05  FILLER   PIC X(20)  VALUE     '17057 00150 20190101'.
               05  FILLER   PIC X(20)  VALUE     '17075 00378 20180101'.
               05  FILLER   PIC X(20)  VALUE     '17075 00378 20190101'.
               05  FILLER   PIC X(20)  VALUE     '17089 00179 20180101'.
               05  FILLER   PIC X(20)  VALUE     '17089 00179 20190101'.
               05  FILLER   PIC X(20)  VALUE     '17089 00179 20200101'.
               05  FILLER   PIC X(20)  VALUE     '17091 00296 20180101'.
               05  FILLER   PIC X(20)  VALUE     '17091 00296 20190101'.
               05  FILLER   PIC X(20)  VALUE     '17091 00296 20200101'.
               05  FILLER   PIC X(20)  VALUE     '17091 00296 20210101'.
               05  FILLER   PIC X(20)  VALUE     '17095 00059 20180101'.
               05  FILLER   PIC X(20)  VALUE     '17095 00098 20190101'.
               05  FILLER   PIC X(20)  VALUE     '17095 00098 20200101'.
               05  FILLER   PIC X(20)  VALUE     '17095 00098 20210101'.
               05  FILLER   PIC X(20)  VALUE     '17097 00050 20210101'.
               05  FILLER   PIC X(20)  VALUE     '17099 00333 20180101'.
               05  FILLER   PIC X(20)  VALUE     '17099 00333 20190101'.
               05  FILLER   PIC X(20)  VALUE     '17105 00101 20180101'.
               05  FILLER   PIC X(20)  VALUE     '17105 00101 20190101'.
               05  FILLER   PIC X(20)  VALUE     '17105 00129 20200101'.
               05  FILLER   PIC X(20)  VALUE     '17105 00129 20210101'.
               05  FILLER   PIC X(20)  VALUE     '17111 00023 20180101'.
               05  FILLER   PIC X(20)  VALUE     '17137 00183 20180101'.
               05  FILLER   PIC X(20)  VALUE     '17137 00183 20190101'.
               05  FILLER   PIC X(20)  VALUE     '17137 00188 20210101'.
               05  FILLER   PIC X(20)  VALUE     '17177 00564 20180101'.
               05  FILLER   PIC X(20)  VALUE     '17177 00564 20190101'.
               05  FILLER   PIC X(20)  VALUE     '17183 00047 20180101'.
               05  FILLER   PIC X(20)  VALUE     '18005 00026 20180101'.
               05  FILLER   PIC X(20)  VALUE     '18005 00026 20190101'.
               05  FILLER   PIC X(20)  VALUE     '18017 00146 20180101'.
               05  FILLER   PIC X(20)  VALUE     '18017 00146 20190101'.
               05  FILLER   PIC X(20)  VALUE     '18033 00305 20180101'.
               05  FILLER   PIC X(20)  VALUE     '18033 00305 20190101'.
               05  FILLER   PIC X(20)  VALUE     '18033 00305 20200101'.
               05  FILLER   PIC X(20)  VALUE     '18035 00087 20180101'.
               05  FILLER   PIC X(20)  VALUE     '18035 00021 20190101'.
               05  FILLER   PIC X(20)  VALUE     '18035 00021 20200101'.
               05  FILLER   PIC X(20)  VALUE     '18035 00021 20210101'.
               05  FILLER   PIC X(20)  VALUE     '18039 00024 20180101'.
               05  FILLER   PIC X(20)  VALUE     '18039 00042 20190101'.
               05  FILLER   PIC X(20)  VALUE     '18039 00042 20200101'.
               05  FILLER   PIC X(20)  VALUE     '18039 00042 20210101'.
               05  FILLER   PIC X(20)  VALUE     '18053 00155 20180101'.
               05  FILLER   PIC X(20)  VALUE     '18053 00220 20190101'.
               05  FILLER   PIC X(20)  VALUE     '18053 00220 20200101'.
               05  FILLER   PIC X(20)  VALUE     '18053 00220 20210101'.
               05  FILLER   PIC X(20)  VALUE     '18065 00857 20180101'.
               05  FILLER   PIC X(20)  VALUE     '18065 00857 20190101'.
               05  FILLER   PIC X(20)  VALUE     '18065 00679 20200101'.
               05  FILLER   PIC X(20)  VALUE     '18065 00679 20210101'.
               05  FILLER   PIC X(20)  VALUE     '18067 00108 20180101'.
               05  FILLER   PIC X(20)  VALUE     '18067 00104 20190101'.
               05  FILLER   PIC X(20)  VALUE     '18067 00104 20200101'.
               05  FILLER   PIC X(20)  VALUE     '18067 00104 20210101'.
               05  FILLER   PIC X(20)  VALUE     '18069 00346 20180101'.
               05  FILLER   PIC X(20)  VALUE     '18069 00346 20190101'.
               05  FILLER   PIC X(20)  VALUE     '18069 00183 20200101'.
               05  FILLER   PIC X(20)  VALUE     '18069 00183 20210101'.
               05  FILLER   PIC X(20)  VALUE     '18071 00338 20180101'.
               05  FILLER   PIC X(20)  VALUE     '18071 00299 20190101'.
               05  FILLER   PIC X(20)  VALUE     '18071 00299 20200101'.
               05  FILLER   PIC X(20)  VALUE     '18071 00299 20210101'.
               05  FILLER   PIC X(20)  VALUE     '18085 00253 20180101'.
               05  FILLER   PIC X(20)  VALUE     '18085 00253 20190101'.
               05  FILLER   PIC X(20)  VALUE     '18089 00146 20180101'.
               05  FILLER   PIC X(20)  VALUE     '18089 00211 20190101'.
               05  FILLER   PIC X(20)  VALUE     '18089 00211 20200101'.
               05  FILLER   PIC X(20)  VALUE     '18089 00211 20210101'.
               05  FILLER   PIC X(20)  VALUE     '18091 00054 20180101'.
               05  FILLER   PIC X(20)  VALUE     '18091 00054 20190101'.
               05  FILLER   PIC X(20)  VALUE     '18091 00054 20200101'.
               05  FILLER   PIC X(20)  VALUE     '18091 00068 20210101'.
               05  FILLER   PIC X(20)  VALUE     '18099 00513 20180101'.
               05  FILLER   PIC X(20)  VALUE     '18099 00513 20190101'.
               05  FILLER   PIC X(20)  VALUE     '18099 00399 20200101'.
               05  FILLER   PIC X(20)  VALUE     '18099 00399 20210101'.
               05  FILLER   PIC X(20)  VALUE     '18107 00459 20180101'.
               05  FILLER   PIC X(20)  VALUE     '18107 00459 20190101'.
               05  FILLER   PIC X(20)  VALUE     '18107 00397 20200101'.
               05  FILLER   PIC X(20)  VALUE     '18107 00397 20210101'.
               05  FILLER   PIC X(20)  VALUE     '18113 00287 20180101'.
               05  FILLER   PIC X(20)  VALUE     '18113 00287 20190101'.
               05  FILLER   PIC X(20)  VALUE     '18113 00287 20200101'.
               05  FILLER   PIC X(20)  VALUE     '18113 00444 20210101'.
               05  FILLER   PIC X(20)  VALUE     '18149 00497 20180101'.
               05  FILLER   PIC X(20)  VALUE     '18149 00497 20190101'.
               05  FILLER   PIC X(20)  VALUE     '19045 00191 20180101'.
               05  FILLER   PIC X(20)  VALUE     '19045 00191 20190101'.
               05  FILLER   PIC X(20)  VALUE     '19045 00107 20200101'.
               05  FILLER   PIC X(20)  VALUE     '19045 00107 20210101'.
               05  FILLER   PIC X(20)  VALUE     '19099 00447 20180101'.
               05  FILLER   PIC X(20)  VALUE     '19099 00447 20190101'.
               05  FILLER   PIC X(20)  VALUE     '19099 00447 20200101'.
               05  FILLER   PIC X(20)  VALUE     '19113 00277 20180101'.
               05  FILLER   PIC X(20)  VALUE     '19113 00311 20190101'.
               05  FILLER   PIC X(20)  VALUE     '19113 00311 20200101'.
               05  FILLER   PIC X(20)  VALUE     '19113 00311 20210101'.
               05  FILLER   PIC X(20)  VALUE     '19127 00159 20180101'.
               05  FILLER   PIC X(20)  VALUE     '19127 00169 20190101'.
               05  FILLER   PIC X(20)  VALUE     '19127 00169 20200101'.
               05  FILLER   PIC X(20)  VALUE     '19127 00169 20210101'.
               05  FILLER   PIC X(20)  VALUE     '19139 00646 20180101'.
               05  FILLER   PIC X(20)  VALUE     '19139 00646 20190101'.
               05  FILLER   PIC X(20)  VALUE     '19169 00002 20200101'.
               05  FILLER   PIC X(20)  VALUE     '19169 00002 20210101'.
               05  FILLER   PIC X(20)  VALUE     '20011 00045 20180101'.
               05  FILLER   PIC X(20)  VALUE     '20011 00035 20200101'.
               05  FILLER   PIC X(20)  VALUE     '20011 00035 20210101'.
               05  FILLER   PIC X(20)  VALUE     '20021 00110 20180101'.
               05  FILLER   PIC X(20)  VALUE     '20021 00110 20190101'.
               05  FILLER   PIC X(20)  VALUE     '20021 00121 20200101'.
               05  FILLER   PIC X(20)  VALUE     '20021 00121 20210101'.
               05  FILLER   PIC X(20)  VALUE     '20035 00114 20180101'.
               05  FILLER   PIC X(20)  VALUE     '20035 00114 20190101'.
               05  FILLER   PIC X(20)  VALUE     '20037 00039 20180101'.
               05  FILLER   PIC X(20)  VALUE     '20037 00028 20200101'.
               05  FILLER   PIC X(20)  VALUE     '20037 00028 20210101'.
               05  FILLER   PIC X(20)  VALUE     '20045 00125 20180101'.
               05  FILLER   PIC X(20)  VALUE     '20045 00125 20190101'.
               05  FILLER   PIC X(20)  VALUE     '20045 00125 20200101'.
               05  FILLER   PIC X(20)  VALUE     '20045 00243 20210101'.
               05  FILLER   PIC X(20)  VALUE     '20059 00509 20200101'.
               05  FILLER   PIC X(20)  VALUE     '20059 00509 20210101'.
               05  FILLER   PIC X(20)  VALUE     '20111 00073 20180101'.
               05  FILLER   PIC X(20)  VALUE     '20125 00058 20180101'.
               05  FILLER   PIC X(20)  VALUE     '20125 00058 20190101'.
               05  FILLER   PIC X(20)  VALUE     '21009 00085 20180101'.
               05  FILLER   PIC X(20)  VALUE     '21009 00085 20190101'.
               05  FILLER   PIC X(20)  VALUE     '21009 00017 20200101'.
               05  FILLER   PIC X(20)  VALUE     '21009 00017 20210101'.
               05  FILLER   PIC X(20)  VALUE     '21021 00163 20180101'.
               05  FILLER   PIC X(20)  VALUE     '21021 00160 20190101'.
               05  FILLER   PIC X(20)  VALUE     '21021 00160 20200101'.
               05  FILLER   PIC X(20)  VALUE     '21021 00160 20210101'.
               05  FILLER   PIC X(20)  VALUE     '21073 00563 20180101'.
               05  FILLER   PIC X(20)  VALUE     '21073 00563 20190101'.
               05  FILLER   PIC X(20)  VALUE     '21073 00563 20200101'.
               05  FILLER   PIC X(20)  VALUE     '21073 00480 20210101'.
               05  FILLER   PIC X(20)  VALUE     '21093 00105 20180101'.
               05  FILLER   PIC X(20)  VALUE     '21093 00105 20190101'.
               05  FILLER   PIC X(20)  VALUE     '21093 00091 20200101'.
               05  FILLER   PIC X(20)  VALUE     '21093 00091 20210101'.
               05  FILLER   PIC X(20)  VALUE     '21095 00019 20180101'.
               05  FILLER   PIC X(20)  VALUE     '21097 00264 20180101'.
               05  FILLER   PIC X(20)  VALUE     '21097 00264 20190101'.
               05  FILLER   PIC X(20)  VALUE     '21133 00015 20180101'.
               05  FILLER   PIC X(20)  VALUE     '21141 00358 20180101'.
               05  FILLER   PIC X(20)  VALUE     '21141 00358 20190101'.
               05  FILLER   PIC X(20)  VALUE     '21151 00547 20180101'.
               05  FILLER   PIC X(20)  VALUE     '21151 00547 20190101'.
               05  FILLER   PIC X(20)  VALUE     '21151 00448 20200101'.
               05  FILLER   PIC X(20)  VALUE     '21151 00448 20210101'.
               05  FILLER   PIC X(20)  VALUE     '21173 00198 20180101'.
               05  FILLER   PIC X(20)  VALUE     '21173 00198 20190101'.
               05  FILLER   PIC X(20)  VALUE     '21173 00632 20200101'.
               05  FILLER   PIC X(20)  VALUE     '21173 00632 20210101'.
               05  FILLER   PIC X(20)  VALUE     '21179 00375 20180101'.
               05  FILLER   PIC X(20)  VALUE     '21179 00375 20190101'.
               05  FILLER   PIC X(20)  VALUE     '21179 00375 20200101'.
               05  FILLER   PIC X(20)  VALUE     '21179 00324 20210101'.
               05  FILLER   PIC X(20)  VALUE     '22009 00321 20180101'.
               05  FILLER   PIC X(20)  VALUE     '22009 00321 20190101'.
               05  FILLER   PIC X(20)  VALUE     '22011 00053 20180101'.
               05  FILLER   PIC X(20)  VALUE     '22011 00053 20190101'.
               05  FILLER   PIC X(20)  VALUE     '22011 00080 20200101'.
               05  FILLER   PIC X(20)  VALUE     '22011 00080 20210101'.
               05  FILLER   PIC X(20)  VALUE     '22021 00349 20180101'.
               05  FILLER   PIC X(20)  VALUE     '22021 00349 20190101'.
               05  FILLER   PIC X(20)  VALUE     '22021 00349 20200101'.
               05  FILLER   PIC X(20)  VALUE     '22021 00218 20210101'.
               05  FILLER   PIC X(20)  VALUE     '22027 00259 20190101'.
               05  FILLER   PIC X(20)  VALUE     '22027 00259 20200101'.
               05  FILLER   PIC X(20)  VALUE     '22027 00259 20210101'.
               05  FILLER   PIC X(20)  VALUE     '22039 00165 20180101'.
               05  FILLER   PIC X(20)  VALUE     '22039 00232 20190101'.
               05  FILLER   PIC X(20)  VALUE     '22039 00232 20200101'.
               05  FILLER   PIC X(20)  VALUE     '22039 00232 20210101'.
               05  FILLER   PIC X(20)  VALUE     '22041 00102 20180101'.
               05  FILLER   PIC X(20)  VALUE     '22041 00102 20190101'.
               05  FILLER   PIC X(20)  VALUE     '22053 00104 20180101'.
               05  FILLER   PIC X(20)  VALUE     '22053 00104 20190101'.
               05  FILLER   PIC X(20)  VALUE     '22059 00217 20180101'.
               05  FILLER   PIC X(20)  VALUE     '22059 00217 20190101'.
               05  FILLER   PIC X(20)  VALUE     '22061 00106 20180101'.
               05  FILLER   PIC X(20)  VALUE     '22061 00106 20190101'.
               05  FILLER   PIC X(20)  VALUE     '22061 00188 20200101'.
               05  FILLER   PIC X(20)  VALUE     '22061 00188 20210101'.
               05  FILLER   PIC X(20)  VALUE     '22067 00186 20180101'.
               05  FILLER   PIC X(20)  VALUE     '22067 00186 20190101'.
               05  FILLER   PIC X(20)  VALUE     '22083 00145 20180101'.
               05  FILLER   PIC X(20)  VALUE     '22085 00266 20180101'.
               05  FILLER   PIC X(20)  VALUE     '22097 00173 20180101'.
               05  FILLER   PIC X(20)  VALUE     '22097 00173 20190101'.
               05  FILLER   PIC X(20)  VALUE     '22101 00117 20180101'.
               05  FILLER   PIC X(20)  VALUE     '22101 00116 20190101'.
               05  FILLER   PIC X(20)  VALUE     '22101 00116 20200101'.
               05  FILLER   PIC X(20)  VALUE     '22101 00116 20210101'.
               05  FILLER   PIC X(20)  VALUE     '22105 00003 20190101'.
               05  FILLER   PIC X(20)  VALUE     '22105 00003 20200101'.
               05  FILLER   PIC X(20)  VALUE     '22105 00003 20210101'.
               05  FILLER   PIC X(20)  VALUE     '22117 00540 20180101'.
               05  FILLER   PIC X(20)  VALUE     '22117 00437 20190101'.
               05  FILLER   PIC X(20)  VALUE     '22117 00437 20200101'.
               05  FILLER   PIC X(20)  VALUE     '22117 00437 20210101'.
               05  FILLER   PIC X(20)  VALUE     '22119 00459 20210101'.
               05  FILLER   PIC X(20)  VALUE     '23001 00234 20180101'.
               05  FILLER   PIC X(20)  VALUE     '23001 00234 20190101'.
               05  FILLER   PIC X(20)  VALUE     '23001 00220 20200101'.
               05  FILLER   PIC X(20)  VALUE     '23001 00220 20210101'.
               05  FILLER   PIC X(20)  VALUE     '23009 00253 20180101'.
               05  FILLER   PIC X(20)  VALUE     '23009 00253 20190101'.
               05  FILLER   PIC X(20)  VALUE     '23009 00305 20200101'.
               05  FILLER   PIC X(20)  VALUE     '23009 00305 20210101'.
               05  FILLER   PIC X(20)  VALUE     '23015 00231 20180101'.
               05  FILLER   PIC X(20)  VALUE     '23015 00221 20190101'.
               05  FILLER   PIC X(20)  VALUE     '23015 00221 20200101'.
               05  FILLER   PIC X(20)  VALUE     '23015 00221 20210101'.
               05  FILLER   PIC X(20)  VALUE     '24003 00100 20180101'.
               05  FILLER   PIC X(20)  VALUE     '24003 00100 20190101'.
               05  FILLER   PIC X(20)  VALUE     '24003 00100 20200101'.
               05  FILLER   PIC X(20)  VALUE     '24003 00076 20210101'.
               05  FILLER   PIC X(20)  VALUE     '24013 00028 20200101'.
               05  FILLER   PIC X(20)  VALUE     '24013 00028 20210101'.
               05  FILLER   PIC X(20)  VALUE     '24023 00025 20180101'.
               05  FILLER   PIC X(20)  VALUE     '24027 00081 20200101'.
               05  FILLER   PIC X(20)  VALUE     '24027 00081 20210101'.
               05  FILLER   PIC X(20)  VALUE     '24029 00579 20180101'.
               05  FILLER   PIC X(20)  VALUE     '24029 00720 20190101'.
               05  FILLER   PIC X(20)  VALUE     '24029 00720 20200101'.
               05  FILLER   PIC X(20)  VALUE     '24029 00720 20210101'.
               05  FILLER   PIC X(20)  VALUE     '24031 00386 20180101'.
               05  FILLER   PIC X(20)  VALUE     '24031 00144 20190101'.
               05  FILLER   PIC X(20)  VALUE     '24031 00144 20200101'.
               05  FILLER   PIC X(20)  VALUE     '24031 00144 20210101'.
               05  FILLER   PIC X(20)  VALUE     '24037 00178 20180101'.
               05  FILLER   PIC X(20)  VALUE     '24037 00178 20190101'.
               05  FILLER   PIC X(20)  VALUE     '24037 00178 20200101'.
               05  FILLER   PIC X(20)  VALUE     '24037 00254 20210101'.
               05  FILLER   PIC X(20)  VALUE     '24041 00157 20180101'.
               05  FILLER   PIC X(20)  VALUE     '24041 00112 20190101'.
               05  FILLER   PIC X(20)  VALUE     '24041 00112 20200101'.
               05  FILLER   PIC X(20)  VALUE     '24041 00112 20210101'.
               05  FILLER   PIC X(20)  VALUE     '24043 00259 20180101'.
               05  FILLER   PIC X(20)  VALUE     '24043 00259 20190101'.
               05  FILLER   PIC X(20)  VALUE     '24043 00242 20200101'.
               05  FILLER   PIC X(20)  VALUE     '24043 00242 20210101'.
               05  FILLER   PIC X(20)  VALUE     '25001 00084 20180101'.
               05  FILLER   PIC X(20)  VALUE     '25001 00084 20190101'.
               05  FILLER   PIC X(20)  VALUE     '25005 00047 20180101'.
               05  FILLER   PIC X(20)  VALUE     '25017 00082 20180101'.
               05  FILLER   PIC X(20)  VALUE     '26021 00221 20180101'.
               05  FILLER   PIC X(20)  VALUE     '26021 00221 20190101'.
               05  FILLER   PIC X(20)  VALUE     '26021 00152 20200101'.
               05  FILLER   PIC X(20)  VALUE     '26021 00152 20210101'.
               05  FILLER   PIC X(20)  VALUE     '26023 00266 20180101'.
               05  FILLER   PIC X(20)  VALUE     '26023 00266 20190101'.
               05  FILLER   PIC X(20)  VALUE     '26025 00019 20180101'.
               05  FILLER   PIC X(20)  VALUE     '26025 00019 20190101'.
               05  FILLER   PIC X(20)  VALUE     '26025 00165 20200101'.
               05  FILLER   PIC X(20)  VALUE     '26025 00165 20210101'.
               05  FILLER   PIC X(20)  VALUE     '26035 00044 20180101'.
               05  FILLER   PIC X(20)  VALUE     '26057 00266 20190101'.
               05  FILLER   PIC X(20)  VALUE     '26057 00266 20200101'.
               05  FILLER   PIC X(20)  VALUE     '26057 00266 20210101'.
               05  FILLER   PIC X(20)  VALUE     '26059 00372 20180101'.
               05  FILLER   PIC X(20)  VALUE     '26059 00372 20190101'.
               05  FILLER   PIC X(20)  VALUE     '26063 00142 20180101'.
               05  FILLER   PIC X(20)  VALUE     '26075 00283 20180101'.
               05  FILLER   PIC X(20)  VALUE     '26075 00283 20190101'.
               05  FILLER   PIC X(20)  VALUE     '26075 00265 20200101'.
               05  FILLER   PIC X(20)  VALUE     '26075 00265 20210101'.
               05  FILLER   PIC X(20)  VALUE     '26087 00291 20180101'.
               05  FILLER   PIC X(20)  VALUE     '26087 00291 20190101'.
               05  FILLER   PIC X(20)  VALUE     '26087 00209 20200101'.
               05  FILLER   PIC X(20)  VALUE     '26087 00209 20210101'.
               05  FILLER   PIC X(20)  VALUE     '26091 00138 20180101'.
               05  FILLER   PIC X(20)  VALUE     '26091 00138 20190101'.
               05  FILLER   PIC X(20)  VALUE     '26091 00876 20200101'.
               05  FILLER   PIC X(20)  VALUE     '26091 00876 20210101'.
               05  FILLER   PIC X(20)  VALUE     '26107 00234 20180101'.
               05  FILLER   PIC X(20)  VALUE     '26107 00234 20190101'.
               05  FILLER   PIC X(20)  VALUE     '26111 00059 20180101'.
               05  FILLER   PIC X(20)  VALUE     '26111 00059 20190101'.
               05  FILLER   PIC X(20)  VALUE     '26115 00470 20180101'.
               05  FILLER   PIC X(20)  VALUE     '26115 00470 20190101'.
               05  FILLER   PIC X(20)  VALUE     '26115 00358 20200101'.
               05  FILLER   PIC X(20)  VALUE     '26115 00358 20210101'.
               05  FILLER   PIC X(20)  VALUE     '26129 00195 20180101'.
               05  FILLER   PIC X(20)  VALUE     '26149 00556 20180101'.
               05  FILLER   PIC X(20)  VALUE     '26149 00556 20190101'.
               05  FILLER   PIC X(20)  VALUE     '26155 01104 20180101'.
               05  FILLER   PIC X(20)  VALUE     '26155 01104 20190101'.
               05  FILLER   PIC X(20)  VALUE     '26163 00158 20180101'.
               05  FILLER   PIC X(20)  VALUE     '26163 00215 20190101'.
               05  FILLER   PIC X(20)  VALUE     '26163 00215 20200101'.
               05  FILLER   PIC X(20)  VALUE     '26163 00215 20210101'.
               05  FILLER   PIC X(20)  VALUE     '27005 00187 20180101'.
               05  FILLER   PIC X(20)  VALUE     '27005 00187 20190101'.
               05  FILLER   PIC X(20)  VALUE     '27049 00238 20180101'.
               05  FILLER   PIC X(20)  VALUE     '27049 00238 20190101'.
               05  FILLER   PIC X(20)  VALUE     '27049 00995 20200101'.
               05  FILLER   PIC X(20)  VALUE     '27049 00995 20210101'.
               05  FILLER   PIC X(20)  VALUE     '27061 00166 20180101'.
               05  FILLER   PIC X(20)  VALUE     '27061 00166 20190101'.
               05  FILLER   PIC X(20)  VALUE     '27061 00136 20200101'.
               05  FILLER   PIC X(20)  VALUE     '27061 00136 20210101'.
               05  FILLER   PIC X(20)  VALUE     '27085 00265 20180101'.
               05  FILLER   PIC X(20)  VALUE     '27085 00281 20190101'.
               05  FILLER   PIC X(20)  VALUE     '27085 00281 20200101'.
               05  FILLER   PIC X(20)  VALUE     '27085 00281 20210101'.
               05  FILLER   PIC X(20)  VALUE     '27099 00779 20180101'.
               05  FILLER   PIC X(20)  VALUE     '27099 00779 20190101'.
               05  FILLER   PIC X(20)  VALUE     '27131 00710 20180101'.
               05  FILLER   PIC X(20)  VALUE     '27131 00710 20190101'.
               05  FILLER   PIC X(20)  VALUE     '27131 00820 20200101'.
               05  FILLER   PIC X(20)  VALUE     '27131 00820 20210101'.
               05  FILLER   PIC X(20)  VALUE     '27147 00523 20180101'.
               05  FILLER   PIC X(20)  VALUE     '27147 00523 20190101'.
               05  FILLER   PIC X(20)  VALUE     '27147 00489 20200101'.
               05  FILLER   PIC X(20)  VALUE     '27147 00489 20210101'.
               05  FILLER   PIC X(20)  VALUE     '27169 00069 20180101'.
               05  FILLER   PIC X(20)  VALUE     '27169 00069 20190101'.
               05  FILLER   PIC X(20)  VALUE     '28067 00054 20180101'.
               05  FILLER   PIC X(20)  VALUE     '28085 00098 20180101'.
               05  FILLER   PIC X(20)  VALUE     '28085 00204 20190101'.
               05  FILLER   PIC X(20)  VALUE     '28085 00204 20200101'.
               05  FILLER   PIC X(20)  VALUE     '28085 00204 20210101'.
               05  FILLER   PIC X(20)  VALUE     '28091 00109 20180101'.
               05  FILLER   PIC X(20)  VALUE     '28107 00130 20180101'.
               05  FILLER   PIC X(20)  VALUE     '28107 00130 20190101'.
               05  FILLER   PIC X(20)  VALUE     '28109 00320 20180101'.
               05  FILLER   PIC X(20)  VALUE     '28109 00320 20190101'.
               05  FILLER   PIC X(20)  VALUE     '28129 00121 20180101'.
               05  FILLER   PIC X(20)  VALUE     '28129 00121 20190101'.
               05  FILLER   PIC X(20)  VALUE     '28149 00046 20180101'.
               05  FILLER   PIC X(20)  VALUE     '29007 00058 20180101'.
               05  FILLER   PIC X(20)  VALUE     '29007 00058 20190101'.
               05  FILLER   PIC X(20)  VALUE     '29007 00175 20200101'.
               05  FILLER   PIC X(20)  VALUE     '29007 00175 20210101'.
               05  FILLER   PIC X(20)  VALUE     '29027 00015 20210101'.
               05  FILLER   PIC X(20)  VALUE     '29101 00462 20180101'.
               05  FILLER   PIC X(20)  VALUE     '29101 00462 20190101'.
               05  FILLER   PIC X(20)  VALUE     '29101 00564 20200101'.
               05  FILLER   PIC X(20)  VALUE     '29101 00564 20210101'.
               05  FILLER   PIC X(20)  VALUE     '29105 00037 20180101'.
               05  FILLER   PIC X(20)  VALUE     '29105 00037 20190101'.
               05  FILLER   PIC X(20)  VALUE     '29105 00042 20200101'.
               05  FILLER   PIC X(20)  VALUE     '29105 00042 20210101'.
               05  FILLER   PIC X(20)  VALUE     '29127 00102 20180101'.
               05  FILLER   PIC X(20)  VALUE     '29127 00179 20190101'.
               05  FILLER   PIC X(20)  VALUE     '29127 00179 20200101'.
               05  FILLER   PIC X(20)  VALUE     '29127 00179 20210101'.
               05  FILLER   PIC X(20)  VALUE     '29147 00213 20180101'.
               05  FILLER   PIC X(20)  VALUE     '29147 00256 20190101'.
               05  FILLER   PIC X(20)  VALUE     '29147 00256 20200101'.
               05  FILLER   PIC X(20)  VALUE     '29147 00256 20210101'.
               05  FILLER   PIC X(20)  VALUE     '29175 00156 20180101'.
               05  FILLER   PIC X(20)  VALUE     '29175 00200 20190101'.
               05  FILLER   PIC X(20)  VALUE     '29175 00200 20200101'.
               05  FILLER   PIC X(20)  VALUE     '29175 00200 20210101'.
               05  FILLER   PIC X(20)  VALUE     '29185 00142 20180101'.
               05  FILLER   PIC X(20)  VALUE     '29187 00116 20180101'.
               05  FILLER   PIC X(20)  VALUE     '29187 00116 20190101'.
               05  FILLER   PIC X(20)  VALUE     '29187 00172 20200101'.
               05  FILLER   PIC X(20)  VALUE     '29187 00172 20210101'.
               05  FILLER   PIC X(20)  VALUE     '29201 00061 20210101'.
               05  FILLER   PIC X(20)  VALUE     '29213 00044 20180101'.
               05  FILLER   PIC X(20)  VALUE     '29213 00039 20190101'.
               05  FILLER   PIC X(20)  VALUE     '29213 00039 20200101'.
               05  FILLER   PIC X(20)  VALUE     '29213 00039 20210101'.
               05  FILLER   PIC X(20)  VALUE     '31053 00182 20180101'.
               05  FILLER   PIC X(20)  VALUE     '31053 00182 20190101'.
               05  FILLER   PIC X(20)  VALUE     '31053 00092 20200101'.
               05  FILLER   PIC X(20)  VALUE     '31053 00092 20210101'.
               05  FILLER   PIC X(20)  VALUE     '32510 00011 20200101'.
               05  FILLER   PIC X(20)  VALUE     '32510 00011 20210101'.
               05  FILLER   PIC X(20)  VALUE     '33011 00203 20180101'.
               05  FILLER   PIC X(20)  VALUE     '33011 00203 20190101'.
               05  FILLER   PIC X(20)  VALUE     '33011 00203 20200101'.
               05  FILLER   PIC X(20)  VALUE     '33011 00576 20210101'.
               05  FILLER   PIC X(20)  VALUE     '33015 00325 20180101'.
               05  FILLER   PIC X(20)  VALUE     '33015 00325 20190101'.
               05  FILLER   PIC X(20)  VALUE     '33015 00325 20200101'.
               05  FILLER   PIC X(20)  VALUE     '34007 00082 20190101'.
               05  FILLER   PIC X(20)  VALUE     '34007 00082 20200101'.
               05  FILLER   PIC X(20)  VALUE     '34007 00082 20210101'.
               05  FILLER   PIC X(20)  VALUE     '34009 00086 20180101'.
               05  FILLER   PIC X(20)  VALUE     '34009 00316 20190101'.
               05  FILLER   PIC X(20)  VALUE     '34009 00316 20200101'.
               05  FILLER   PIC X(20)  VALUE     '34009 00316 20210101'.
               05  FILLER   PIC X(20)  VALUE     '34011 00131 20190101'.
               05  FILLER   PIC X(20)  VALUE     '34011 00131 20200101'.
               05  FILLER   PIC X(20)  VALUE     '34011 00131 20210101'.
               05  FILLER   PIC X(20)  VALUE     '34013 00371 20180101'.
               05  FILLER   PIC X(20)  VALUE     '34013 00371 20190101'.
               05  FILLER   PIC X(20)  VALUE     '34013 00387 20200101'.
               05  FILLER   PIC X(20)  VALUE     '34013 00387 20210101'.
               05  FILLER   PIC X(20)  VALUE     '34021 00242 20180101'.
               05  FILLER   PIC X(20)  VALUE     '34021 00242 20190101'.
               05  FILLER   PIC X(20)  VALUE     '34021 00242 20200101'.
               05  FILLER   PIC X(20)  VALUE     '34021 00190 20210101'.
               05  FILLER   PIC X(20)  VALUE     '34023 00491 20210101'.
               05  FILLER   PIC X(20)  VALUE     '34027 00371 20180101'.
               05  FILLER   PIC X(20)  VALUE     '34027 00276 20190101'.
               05  FILLER   PIC X(20)  VALUE     '34027 00276 20200101'.
               05  FILLER   PIC X(20)  VALUE     '34027 00276 20210101'.
               05  FILLER   PIC X(20)  VALUE     '34041 00883 20200101'.
               05  FILLER   PIC X(20)  VALUE     '34041 00883 20210101'.
               05  FILLER   PIC X(20)  VALUE     '35039 00619 20180101'.
               05  FILLER   PIC X(20)  VALUE     '35039 00619 20190101'.
               05  FILLER   PIC X(20)  VALUE     '35039 00619 20200101'.
               05  FILLER   PIC X(20)  VALUE     '35039 00435 20210101'.
               05  FILLER   PIC X(20)  VALUE     '35047 00548 20180101'.
               05  FILLER   PIC X(20)  VALUE     '35047 00548 20190101'.
               05  FILLER   PIC X(20)  VALUE     '35047 00548 20200101'.
               05  FILLER   PIC X(20)  VALUE     '35047 00384 20210101'.
               05  FILLER   PIC X(20)  VALUE     '36009 00257 20180101'.
               05  FILLER   PIC X(20)  VALUE     '36009 00257 20190101'.
               05  FILLER   PIC X(20)  VALUE     '36011 00272 20180101'.
               05  FILLER   PIC X(20)  VALUE     '36011 00272 20190101'.
               05  FILLER   PIC X(20)  VALUE     '36011 00428 20200101'.
               05  FILLER   PIC X(20)  VALUE     '36011 00428 20210101'.
               05  FILLER   PIC X(20)  VALUE     '36021 00624 20180101'.
               05  FILLER   PIC X(20)  VALUE     '36021 00624 20190101'.
               05  FILLER   PIC X(20)  VALUE     '36021 00886 20200101'.
               05  FILLER   PIC X(20)  VALUE     '36021 00886 20210101'.
               05  FILLER   PIC X(20)  VALUE     '36023 00196 20180101'.
               05  FILLER   PIC X(20)  VALUE     '36023 00196 20190101'.
               05  FILLER   PIC X(20)  VALUE     '36027 00439 20210101'.
               05  FILLER   PIC X(20)  VALUE     '36037 00146 20210101'.
               05  FILLER   PIC X(20)  VALUE     '36079 01062 20180101'.
               05  FILLER   PIC X(20)  VALUE     '36079 01062 20190101'.
               05  FILLER   PIC X(20)  VALUE     '36079 01062 20200101'.
               05  FILLER   PIC X(20)  VALUE     '36081 00078 20180101'.
               05  FILLER   PIC X(20)  VALUE     '36081 00060 20190101'.
               05  FILLER   PIC X(20)  VALUE     '36081 00060 20200101'.
               05  FILLER   PIC X(20)  VALUE     '36081 00060 20210101'.
               05  FILLER   PIC X(20)  VALUE     '36091 00005 20190101'.
               05  FILLER   PIC X(20)  VALUE     '36091 00005 20200101'.
               05  FILLER   PIC X(20)  VALUE     '36091 00005 20210101'.
               05  FILLER   PIC X(20)  VALUE     '36105 01224 20180101'.
               05  FILLER   PIC X(20)  VALUE     '36105 01224 20190101'.
               05  FILLER   PIC X(20)  VALUE     '36105 01278 20200101'.
               05  FILLER   PIC X(20)  VALUE     '36105 01278 20210101'.
               05  FILLER   PIC X(20)  VALUE     '36111 01040 20180101'.
               05  FILLER   PIC X(20)  VALUE     '36111 01040 20190101'.
               05  FILLER   PIC X(20)  VALUE     '36111 01315 20200101'.
               05  FILLER   PIC X(20)  VALUE     '36111 01315 20210101'.
               05  FILLER   PIC X(20)  VALUE     '36113 00004 20180101'.
               05  FILLER   PIC X(20)  VALUE     '36121 00263 20180101'.
               05  FILLER   PIC X(20)  VALUE     '36121 00263 20190101'.
               05  FILLER   PIC X(20)  VALUE     '37001 00679 20180101'.
               05  FILLER   PIC X(20)  VALUE     '37001 00679 20190101'.
               05  FILLER   PIC X(20)  VALUE     '37001 00751 20200101'.
               05  FILLER   PIC X(20)  VALUE     '37001 00751 20210101'.
               05  FILLER   PIC X(20)  VALUE     '37007 00340 20180101'.
               05  FILLER   PIC X(20)  VALUE     '37007 00340 20190101'.
               05  FILLER   PIC X(20)  VALUE     '37007 00340 20200101'.
               05  FILLER   PIC X(20)  VALUE     '37013 00539 20180101'.
               05  FILLER   PIC X(20)  VALUE     '37013 00539 20190101'.
               05  FILLER   PIC X(20)  VALUE     '37019 00254 20210101'.
               05  FILLER   PIC X(20)  VALUE     '37031 00078 20180101'.
               05  FILLER   PIC X(20)  VALUE     '37031 00078 20190101'.
               05  FILLER   PIC X(20)  VALUE     '37031 00078 20200101'.
               05  FILLER   PIC X(20)  VALUE     '37035 00093 20180101'.
               05  FILLER   PIC X(20)  VALUE     '37035 00093 20190101'.
               05  FILLER   PIC X(20)  VALUE     '37035 00093 20200101'.
               05  FILLER   PIC X(20)  VALUE     '37035 00094 20210101'.
               05  FILLER   PIC X(20)  VALUE     '37039 00006 20180101'.
               05  FILLER   PIC X(20)  VALUE     '37045 00203 20180101'.
               05  FILLER   PIC X(20)  VALUE     '37045 00203 20190101'.
               05  FILLER   PIC X(20)  VALUE     '37045 00348 20200101'.
               05  FILLER   PIC X(20)  VALUE     '37045 00348 20210101'.
               05  FILLER   PIC X(20)  VALUE     '37047 00052 20180101'.
               05  FILLER   PIC X(20)  VALUE     '37047 00052 20190101'.
               05  FILLER   PIC X(20)  VALUE     '37061 00082 20180101'.
               05  FILLER   PIC X(20)  VALUE     '37061 00122 20200101'.
               05  FILLER   PIC X(20)  VALUE     '37061 00122 20210101'.
               05  FILLER   PIC X(20)  VALUE     '37077 00808 20180101'.
               05  FILLER   PIC X(20)  VALUE     '37077 00943 20190101'.
               05  FILLER   PIC X(20)  VALUE     '37077 00943 20200101'.
               05  FILLER   PIC X(20)  VALUE     '37077 00943 20210101'.
               05  FILLER   PIC X(20)  VALUE     '37083 00196 20180101'.
               05  FILLER   PIC X(20)  VALUE     '37083 00196 20190101'.
               05  FILLER   PIC X(20)  VALUE     '37085 00336 20180101'.
               05  FILLER   PIC X(20)  VALUE     '37085 00336 20190101'.
               05  FILLER   PIC X(20)  VALUE     '37105 00329 20180101'.
               05  FILLER   PIC X(20)  VALUE     '37105 00329 20190101'.
               05  FILLER   PIC X(20)  VALUE     '37105 00433 20200101'.
               05  FILLER   PIC X(20)  VALUE     '37105 00433 20210101'.
               05  FILLER   PIC X(20)  VALUE     '37107 00164 20180101'.
               05  FILLER   PIC X(20)  VALUE     '37107 00164 20190101'.
               05  FILLER   PIC X(20)  VALUE     '37107 00207 20200101'.
               05  FILLER   PIC X(20)  VALUE     '37107 00207 20210101'.
               05  FILLER   PIC X(20)  VALUE     '37111 00079 20180101'.
               05  FILLER   PIC X(20)  VALUE     '37125 00160 20180101'.
               05  FILLER   PIC X(20)  VALUE     '37125 00142 20190101'.
               05  FILLER   PIC X(20)  VALUE     '37125 00142 20200101'.
               05  FILLER   PIC X(20)  VALUE     '37125 00142 20210101'.
               05  FILLER   PIC X(20)  VALUE     '37155 00152 20180101'.
               05  FILLER   PIC X(20)  VALUE     '37155 00061 20190101'.
               05  FILLER   PIC X(20)  VALUE     '37155 00061 20200101'.
               05  FILLER   PIC X(20)  VALUE     '37155 00061 20210101'.
               05  FILLER   PIC X(20)  VALUE     '37161 00024 20180101'.
               05  FILLER   PIC X(20)  VALUE     '37163 00188 20180101'.
               05  FILLER   PIC X(20)  VALUE     '37163 00188 20190101'.
               05  FILLER   PIC X(20)  VALUE     '37171 00184 20180101'.
               05  FILLER   PIC X(20)  VALUE     '37183 00111 20180101'.
               05  FILLER   PIC X(20)  VALUE     '37183 00111 20190101'.
               05  FILLER   PIC X(20)  VALUE     '37183 00111 20200101'.
               05  FILLER   PIC X(20)  VALUE     '37183 00047 20210101'.
               05  FILLER   PIC X(20)  VALUE     '37195 00341 20180101'.
               05  FILLER   PIC X(20)  VALUE     '37195 00341 20190101'.
               05  FILLER   PIC X(20)  VALUE     '37195 00368 20200101'.
               05  FILLER   PIC X(20)  VALUE     '37195 00368 20210101'.
               05  FILLER   PIC X(20)  VALUE     '39007 00260 20180101'.
               05  FILLER   PIC X(20)  VALUE     '39007 00260 20190101'.
               05  FILLER   PIC X(20)  VALUE     '39011 00467 20180101'.
               05  FILLER   PIC X(20)  VALUE     '39011 00467 20190101'.
               05  FILLER   PIC X(20)  VALUE     '39011 00467 20200101'.
               05  FILLER   PIC X(20)  VALUE     '39011 00214 20210101'.
               05  FILLER   PIC X(20)  VALUE     '39023 00187 20180101'.
               05  FILLER   PIC X(20)  VALUE     '39023 00187 20190101'.
               05  FILLER   PIC X(20)  VALUE     '39023 00143 20200101'.
               05  FILLER   PIC X(20)  VALUE     '39023 00143 20210101'.
               05  FILLER   PIC X(20)  VALUE     '39027 00228 20180101'.
               05  FILLER   PIC X(20)  VALUE     '39027 00228 20190101'.
               05  FILLER   PIC X(20)  VALUE     '39029 00058 20180101'.
               05  FILLER   PIC X(20)  VALUE     '39029 00058 20190101'.
               05  FILLER   PIC X(20)  VALUE     '39031 00230 20180101'.
               05  FILLER   PIC X(20)  VALUE     '39031 00275 20190101'.
               05  FILLER   PIC X(20)  VALUE     '39031 00275 20200101'.
               05  FILLER   PIC X(20)  VALUE     '39031 00275 20210101'.
               05  FILLER   PIC X(20)  VALUE     '39037 00221 20180101'.
               05  FILLER   PIC X(20)  VALUE     '39037 00221 20190101'.
               05  FILLER   PIC X(20)  VALUE     '39043 00202 20180101'.
               05  FILLER   PIC X(20)  VALUE     '39043 00202 20190101'.
               05  FILLER   PIC X(20)  VALUE     '39053 00048 20180101'.
               05  FILLER   PIC X(20)  VALUE     '39063 00163 20180101'.
               05  FILLER   PIC X(20)  VALUE     '39063 00148 20190101'.
               05  FILLER   PIC X(20)  VALUE     '39063 00148 20200101'.
               05  FILLER   PIC X(20)  VALUE     '39063 00148 20210101'.
               05  FILLER   PIC X(20)  VALUE     '39077 00123 20180101'.
               05  FILLER   PIC X(20)  VALUE     '39077 00123 20190101'.
               05  FILLER   PIC X(20)  VALUE     '39077 00123 20200101'.
               05  FILLER   PIC X(20)  VALUE     '39077 00101 20210101'.
               05  FILLER   PIC X(20)  VALUE     '39081 00030 20180101'.
               05  FILLER   PIC X(20)  VALUE     '39081 00047 20190101'.
               05  FILLER   PIC X(20)  VALUE     '39081 00047 20200101'.
               05  FILLER   PIC X(20)  VALUE     '39081 00047 20210101'.
               05  FILLER   PIC X(20)  VALUE     '39083 00600 20180101'.
               05  FILLER   PIC X(20)  VALUE     '39083 00600 20190101'.
               05  FILLER   PIC X(20)  VALUE     '39083 00590 20200101'.
               05  FILLER   PIC X(20)  VALUE     '39083 00590 20210101'.
               05  FILLER   PIC X(20)  VALUE     '39091 00283 20180101'.
               05  FILLER   PIC X(20)  VALUE     '39091 00333 20190101'.
               05  FILLER   PIC X(20)  VALUE     '39091 00333 20200101'.
               05  FILLER   PIC X(20)  VALUE     '39091 00333 20210101'.
               05  FILLER   PIC X(20)  VALUE     '39101 00293 20180101'.
               05  FILLER   PIC X(20)  VALUE     '39101 00351 20190101'.
               05  FILLER   PIC X(20)  VALUE     '39101 00351 20200101'.
               05  FILLER   PIC X(20)  VALUE     '39101 00351 20210101'.
               05  FILLER   PIC X(20)  VALUE     '39119 00164 20180101'.
               05  FILLER   PIC X(20)  VALUE     '39119 00159 20200101'.
               05  FILLER   PIC X(20)  VALUE     '39119 00159 20210101'.
               05  FILLER   PIC X(20)  VALUE     '39143 00104 20180101'.
               05  FILLER   PIC X(20)  VALUE     '39143 00104 20190101'.
               05  FILLER   PIC X(20)  VALUE     '39143 00144 20200101'.
               05  FILLER   PIC X(20)  VALUE     '39143 00144 20210101'.
               05  FILLER   PIC X(20)  VALUE     '39145 00046 20180101'.
               05  FILLER   PIC X(20)  VALUE     '39149 00253 20180101'.
               05  FILLER   PIC X(20)  VALUE     '39149 00253 20190101'.
               05  FILLER   PIC X(20)  VALUE     '39149 00384 20200101'.
               05  FILLER   PIC X(20)  VALUE     '39149 00384 20210101'.
               05  FILLER   PIC X(20)  VALUE     '39151 00041 20190101'.
               05  FILLER   PIC X(20)  VALUE     '39151 00041 20200101'.
               05  FILLER   PIC X(20)  VALUE     '39151 00041 20210101'.
               05  FILLER   PIC X(20)  VALUE     '39153 00201 20180101'.
               05  FILLER   PIC X(20)  VALUE     '39153 00137 20190101'.
               05  FILLER   PIC X(20)  VALUE     '39153 00137 20200101'.
               05  FILLER   PIC X(20)  VALUE     '39153 00137 20210101'.
               05  FILLER   PIC X(20)  VALUE     '39155 00077 20180101'.
               05  FILLER   PIC X(20)  VALUE     '39155 00065 20190101'.
               05  FILLER   PIC X(20)  VALUE     '39155 00065 20200101'.
               05  FILLER   PIC X(20)  VALUE     '39155 00065 20210101'.
               05  FILLER   PIC X(20)  VALUE     '39157 00026 20180101'.
               05  FILLER   PIC X(20)  VALUE     '39157 00026 20190101'.
               05  FILLER   PIC X(20)  VALUE     '39161 00055 20180101'.
               05  FILLER   PIC X(20)  VALUE     '39161 00055 20190101'.
               05  FILLER   PIC X(20)  VALUE     '39161 00213 20200101'.
               05  FILLER   PIC X(20)  VALUE     '39161 00213 20210101'.
               05  FILLER   PIC X(20)  VALUE     '39169 00137 20180101'.
               05  FILLER   PIC X(20)  VALUE     '39169 00137 20190101'.
               05  FILLER   PIC X(20)  VALUE     '39169 00118 20200101'.
               05  FILLER   PIC X(20)  VALUE     '39169 00118 20210101'.
               05  FILLER   PIC X(20)  VALUE     '40013 00319 20180101'.
               05  FILLER   PIC X(20)  VALUE     '40013 00319 20190101'.
               05  FILLER   PIC X(20)  VALUE     '40013 00305 20200101'.
               05  FILLER   PIC X(20)  VALUE     '40013 00305 20210101'.
               05  FILLER   PIC X(20)  VALUE     '40035 00017 20180101'.
               05  FILLER   PIC X(20)  VALUE     '40035 00017 20190101'.
               05  FILLER   PIC X(20)  VALUE     '40041 00214 20180101'.
               05  FILLER   PIC X(20)  VALUE     '40041 00126 20190101'.
               05  FILLER   PIC X(20)  VALUE     '40041 00126 20200101'.
               05  FILLER   PIC X(20)  VALUE     '40041 00126 20210101'.
               05  FILLER   PIC X(20)  VALUE     '40049 00213 20180101'.
               05  FILLER   PIC X(20)  VALUE     '40049 00213 20190101'.
               05  FILLER   PIC X(20)  VALUE     '40075 00050 20180101'.
               05  FILLER   PIC X(20)  VALUE     '40075 00050 20190101'.
               05  FILLER   PIC X(20)  VALUE     '40091 00035 20180101'.
               05  FILLER   PIC X(20)  VALUE     '40091 00035 20190101'.
               05  FILLER   PIC X(20)  VALUE     '40097 00030 20180101'.
               05  FILLER   PIC X(20)  VALUE     '40097 00030 20190101'.
               05  FILLER   PIC X(20)  VALUE     '40101 00025 20180101'.
               05  FILLER   PIC X(20)  VALUE     '40101 00117 20190101'.
               05  FILLER   PIC X(20)  VALUE     '40101 00117 20200101'.
               05  FILLER   PIC X(20)  VALUE     '40101 00117 20210101'.
               05  FILLER   PIC X(20)  VALUE     '40103 00205 20180101'.
               05  FILLER   PIC X(20)  VALUE     '40115 00115 20180101'.
               05  FILLER   PIC X(20)  VALUE     '40115 00025 20200101'.
               05  FILLER   PIC X(20)  VALUE     '40115 00025 20210101'.
               05  FILLER   PIC X(20)  VALUE     '40125 00396 20180101'.
               05  FILLER   PIC X(20)  VALUE     '40125 00396 20190101'.
               05  FILLER   PIC X(20)  VALUE     '40125 00374 20200101'.
               05  FILLER   PIC X(20)  VALUE     '40125 00374 20210101'.
               05  FILLER   PIC X(20)  VALUE     '40137 00029 20180101'.
               05  FILLER   PIC X(20)  VALUE     '40137 00029 20190101'.
               05  FILLER   PIC X(20)  VALUE     '40139 00023 20180101'.
               05  FILLER   PIC X(20)  VALUE     '40147 00025 20180101'.
               05  FILLER   PIC X(20)  VALUE     '40147 00116 20190101'.
               05  FILLER   PIC X(20)  VALUE     '40147 00116 20200101'.
               05  FILLER   PIC X(20)  VALUE     '40147 00116 20210101'.
               05  FILLER   PIC X(20)  VALUE     '41003 00028 20190101'.
               05  FILLER   PIC X(20)  VALUE     '41003 00028 20200101'.
               05  FILLER   PIC X(20)  VALUE     '41003 00028 20210101'.
               05  FILLER   PIC X(20)  VALUE     '41033 00075 20180101'.
               05  FILLER   PIC X(20)  VALUE     '41033 00016 20190101'.
               05  FILLER   PIC X(20)  VALUE     '41033 00016 20200101'.
               05  FILLER   PIC X(20)  VALUE     '41033 00016 20210101'.
               05  FILLER   PIC X(20)  VALUE     '41043 00138 20180101'.
               05  FILLER   PIC X(20)  VALUE     '41043 00138 20190101'.
               05  FILLER   PIC X(20)  VALUE     '41043 00168 20200101'.
               05  FILLER   PIC X(20)  VALUE     '41043 00168 20210101'.
               05  FILLER   PIC X(20)  VALUE     '41047 00115 20180101'.
               05  FILLER   PIC X(20)  VALUE     '41047 00090 20190101'.
               05  FILLER   PIC X(20)  VALUE     '41047 00090 20200101'.
               05  FILLER   PIC X(20)  VALUE     '41047 00090 20210101'.
               05  FILLER   PIC X(20)  VALUE     '42009 00572 20180101'.
               05  FILLER   PIC X(20)  VALUE     '42009 00572 20190101'.
               05  FILLER   PIC X(20)  VALUE     '42011 00058 20180101'.
               05  FILLER   PIC X(20)  VALUE     '42011 00058 20190101'.
               05  FILLER   PIC X(20)  VALUE     '42011 00058 20200101'.
               05  FILLER   PIC X(20)  VALUE     '42015 00129 20180101'.
               05  FILLER   PIC X(20)  VALUE     '42015 00129 20190101'.
               05  FILLER   PIC X(20)  VALUE     '42015 00129 20200101'.
               05  FILLER   PIC X(20)  VALUE     '42015 00143 20210101'.
               05  FILLER   PIC X(20)  VALUE     '42021 00188 20180101'.
               05  FILLER   PIC X(20)  VALUE     '42021 00188 20190101'.
               05  FILLER   PIC X(20)  VALUE     '42021 00151 20200101'.
               05  FILLER   PIC X(20)  VALUE     '42021 00151 20210101'.
               05  FILLER   PIC X(20)  VALUE     '42029 00296 20180101'.
               05  FILLER   PIC X(20)  VALUE     '42029 00296 20190101'.
               05  FILLER   PIC X(20)  VALUE     '42029 00296 20200101'.
               05  FILLER   PIC X(20)  VALUE     '42029 00306 20210101'.
               05  FILLER   PIC X(20)  VALUE     '42031 00076 20180101'.
               05  FILLER   PIC X(20)  VALUE     '42033 00456 20180101'.
               05  FILLER   PIC X(20)  VALUE     '42033 00456 20190101'.
               05  FILLER   PIC X(20)  VALUE     '42035 00352 20180101'.
               05  FILLER   PIC X(20)  VALUE     '42035 00352 20190101'.
               05  FILLER   PIC X(20)  VALUE     '42035 00352 20200101'.
               05  FILLER   PIC X(20)  VALUE     '42035 00522 20210101'.
               05  FILLER   PIC X(20)  VALUE     '42059 00084 20180101'.
               05  FILLER   PIC X(20)  VALUE     '42059 00084 20190101'.
               05  FILLER   PIC X(20)  VALUE     '42061 00531 20180101'.
               05  FILLER   PIC X(20)  VALUE     '42061 00531 20190101'.
               05  FILLER   PIC X(20)  VALUE     '42063 00133 20180101'.
               05  FILLER   PIC X(20)  VALUE     '42063 00135 20190101'.
               05  FILLER   PIC X(20)  VALUE     '42063 00135 20200101'.
               05  FILLER   PIC X(20)  VALUE     '42063 00135 20210101'.
               05  FILLER   PIC X(20)  VALUE     '42071 00100 20190101'.
               05  FILLER   PIC X(20)  VALUE     '42071 00100 20200101'.
               05  FILLER   PIC X(20)  VALUE     '42071 00100 20210101'.
               05  FILLER   PIC X(20)  VALUE     '42073 00119 20180101'.
               05  FILLER   PIC X(20)  VALUE     '42073 00119 20190101'.
               05  FILLER   PIC X(20)  VALUE     '42075 00117 20200101'.
               05  FILLER   PIC X(20)  VALUE     '42075 00117 20210101'.
               05  FILLER   PIC X(20)  VALUE     '42083 00049 20180101'.
               05  FILLER   PIC X(20)  VALUE     '42089 01094 20180101'.
               05  FILLER   PIC X(20)  VALUE     '42089 01094 20190101'.
               05  FILLER   PIC X(20)  VALUE     '42089 00657 20200101'.
               05  FILLER   PIC X(20)  VALUE     '42089 00657 20210101'.
               05  FILLER   PIC X(20)  VALUE     '42091 00392 20180101'.
               05  FILLER   PIC X(20)  VALUE     '42091 00392 20190101'.
               05  FILLER   PIC X(20)  VALUE     '42091 00392 20200101'.
               05  FILLER   PIC X(20)  VALUE     '42091 00432 20210101'.
               05  FILLER   PIC X(20)  VALUE     '42095 00286 20180101'.
               05  FILLER   PIC X(20)  VALUE     '42095 00286 20190101'.
               05  FILLER   PIC X(20)  VALUE     '42095 00286 20200101'.
               05  FILLER   PIC X(20)  VALUE     '42097 00763 20190101'.
               05  FILLER   PIC X(20)  VALUE     '42097 00763 20200101'.
               05  FILLER   PIC X(20)  VALUE     '42097 00763 20210101'.
               05  FILLER   PIC X(20)  VALUE     '42107 00370 20180101'.
               05  FILLER   PIC X(20)  VALUE     '42107 00522 20190101'.
               05  FILLER   PIC X(20)  VALUE     '42107 00522 20200101'.
               05  FILLER   PIC X(20)  VALUE     '42107 00522 20210101'.
               05  FILLER   PIC X(20)  VALUE     '42111 00135 20180101'.
               05  FILLER   PIC X(20)  VALUE     '42117 00172 20180101'.
               05  FILLER   PIC X(20)  VALUE     '42117 00172 20190101'.
               05  FILLER   PIC X(20)  VALUE     '42117 00172 20200101'.
               05  FILLER   PIC X(20)  VALUE     '42119 00297 20180101'.
               05  FILLER   PIC X(20)  VALUE     '42119 00297 20190101'.
               05  FILLER   PIC X(20)  VALUE     '42119 00297 20200101'.
               05  FILLER   PIC X(20)  VALUE     '42119 00234 20210101'.
               05  FILLER   PIC X(20)  VALUE     '42127 00274 20180101'.
               05  FILLER   PIC X(20)  VALUE     '42127 00422 20190101'.
               05  FILLER   PIC X(20)  VALUE     '42127 00422 20200101'.
               05  FILLER   PIC X(20)  VALUE     '42127 00422 20210101'.
               05  FILLER   PIC X(20)  VALUE     '42133 00015 20190101'.
               05  FILLER   PIC X(20)  VALUE     '42133 00015 20200101'.
               05  FILLER   PIC X(20)  VALUE     '42133 00015 20210101'.
               05  FILLER   PIC X(20)  VALUE     '45021 00124 20180101'.
               05  FILLER   PIC X(20)  VALUE     '45021 00124 20190101'.
               05  FILLER   PIC X(20)  VALUE     '45025 00110 20180101'.
               05  FILLER   PIC X(20)  VALUE     '45029 00120 20180101'.
               05  FILLER   PIC X(20)  VALUE     '45029 00120 20190101'.
               05  FILLER   PIC X(20)  VALUE     '45029 00097 20200101'.
               05  FILLER   PIC X(20)  VALUE     '45029 00097 20210101'.
               05  FILLER   PIC X(20)  VALUE     '45043 00050 20180101'.
               05  FILLER   PIC X(20)  VALUE     '45043 00050 20190101'.
               05  FILLER   PIC X(20)  VALUE     '45043 00050 20200101'.
               05  FILLER   PIC X(20)  VALUE     '45043 00078 20210101'.
               05  FILLER   PIC X(20)  VALUE     '45053 00011 20180101'.
               05  FILLER   PIC X(20)  VALUE     '45053 00011 20190101'.
               05  FILLER   PIC X(20)  VALUE     '45053 00011 20200101'.
               05  FILLER   PIC X(20)  VALUE     '45071 00049 20180101'.
               05  FILLER   PIC X(20)  VALUE     '45071 00049 20190101'.
               05  FILLER   PIC X(20)  VALUE     '45073 00167 20180101'.
               05  FILLER   PIC X(20)  VALUE     '45073 00236 20190101'.
               05  FILLER   PIC X(20)  VALUE     '45073 00236 20200101'.
               05  FILLER   PIC X(20)  VALUE     '45073 00236 20210101'.
               05  FILLER   PIC X(20)  VALUE     '45075 00040 20180101'.
               05  FILLER   PIC X(20)  VALUE     '45075 00040 20190101'.
               05  FILLER   PIC X(20)  VALUE     '45075 00067 20200101'.
               05  FILLER   PIC X(20)  VALUE     '45075 00067 20210101'.
               05  FILLER   PIC X(20)  VALUE     '45083 00130 20180101'.
               05  FILLER   PIC X(20)  VALUE     '45083 00130 20190101'.
               05  FILLER   PIC X(20)  VALUE     '45083 00049 20200101'.
               05  FILLER   PIC X(20)  VALUE     '45083 00049 20210101'.
               05  FILLER   PIC X(20)  VALUE     '45085 00044 20180101'.
               05  FILLER   PIC X(20)  VALUE     '45085 00044 20190101'.
               05  FILLER   PIC X(20)  VALUE     '45085 00044 20200101'.
               05  FILLER   PIC X(20)  VALUE     '47003 00714 20180101'.
               05  FILLER   PIC X(20)  VALUE     '47003 00714 20190101'.
               05  FILLER   PIC X(20)  VALUE     '47003 00633 20200101'.
               05  FILLER   PIC X(20)  VALUE     '47003 00633 20210101'.
               05  FILLER   PIC X(20)  VALUE     '47011 00217 20180101'.
               05  FILLER   PIC X(20)  VALUE     '47011 00217 20190101'.
               05  FILLER   PIC X(20)  VALUE     '47011 00379 20200101'.
               05  FILLER   PIC X(20)  VALUE     '47011 00379 20210101'.
               05  FILLER   PIC X(20)  VALUE     '47017 00073 20190101'.
               05  FILLER   PIC X(20)  VALUE     '47017 00073 20200101'.
               05  FILLER   PIC X(20)  VALUE     '47017 00073 20210101'.
               05  FILLER   PIC X(20)  VALUE     '47025 00086 20180101'.
               05  FILLER   PIC X(20)  VALUE     '47031 00204 20180101'.
               05  FILLER   PIC X(20)  VALUE     '47031 00204 20190101'.
               05  FILLER   PIC X(20)  VALUE     '47031 00181 20200101'.
               05  FILLER   PIC X(20)  VALUE     '47031 00181 20210101'.
               05  FILLER   PIC X(20)  VALUE     '47053 00174 20180101'.
               05  FILLER   PIC X(20)  VALUE     '47053 00174 20190101'.
               05  FILLER   PIC X(20)  VALUE     '47053 00174 20200101'.
               05  FILLER   PIC X(20)  VALUE     '47055 00639 20180101'.
               05  FILLER   PIC X(20)  VALUE     '47055 00639 20190101'.
               05  FILLER   PIC X(20)  VALUE     '47055 00639 20200101'.
               05  FILLER   PIC X(20)  VALUE     '47055 00697 20210101'.
               05  FILLER   PIC X(20)  VALUE     '47069 00475 20180101'.
               05  FILLER   PIC X(20)  VALUE     '47069 00475 20190101'.
               05  FILLER   PIC X(20)  VALUE     '47069 00620 20200101'.
               05  FILLER   PIC X(20)  VALUE     '47069 00620 20210101'.
               05  FILLER   PIC X(20)  VALUE     '47075 00684 20180101'.
               05  FILLER   PIC X(20)  VALUE     '47075 00684 20190101'.
               05  FILLER   PIC X(20)  VALUE     '47075 00684 20200101'.
               05  FILLER   PIC X(20)  VALUE     '47077 00164 20180101'.
               05  FILLER   PIC X(20)  VALUE     '47077 00164 20190101'.
               05  FILLER   PIC X(20)  VALUE     '47077 00164 20200101'.
               05  FILLER   PIC X(20)  VALUE     '47077 00182 20210101'.
               05  FILLER   PIC X(20)  VALUE     '47089 00041 20180101'.
               05  FILLER   PIC X(20)  VALUE     '47089 00041 20190101'.
               05  FILLER   PIC X(20)  VALUE     '47089 00041 20200101'.
               05  FILLER   PIC X(20)  VALUE     '47089 00014 20210101'.
               05  FILLER   PIC X(20)  VALUE     '47099 01064 20180101'.
               05  FILLER   PIC X(20)  VALUE     '47099 01064 20190101'.
               05  FILLER   PIC X(20)  VALUE     '47099 01064 20200101'.
               05  FILLER   PIC X(20)  VALUE     '47099 01099 20210101'.
               05  FILLER   PIC X(20)  VALUE     '47103 00205 20180101'.
               05  FILLER   PIC X(20)  VALUE     '47107 00240 20180101'.
               05  FILLER   PIC X(20)  VALUE     '47107 00054 20190101'.
               05  FILLER   PIC X(20)  VALUE     '47107 00054 20200101'.
               05  FILLER   PIC X(20)  VALUE     '47107 00054 20210101'.
               05  FILLER   PIC X(20)  VALUE     '47109 00024 20180101'.
               05  FILLER   PIC X(20)  VALUE     '47109 00024 20190101'.
               05  FILLER   PIC X(20)  VALUE     '47123 00093 20180101'.
               05  FILLER   PIC X(20)  VALUE     '47125 00634 20180101'.
               05  FILLER   PIC X(20)  VALUE     '47125 00634 20190101'.
               05  FILLER   PIC X(20)  VALUE     '47125 00399 20200101'.
               05  FILLER   PIC X(20)  VALUE     '47125 00399 20210101'.
               05  FILLER   PIC X(20)  VALUE     '47163 00015 20180101'.
               05  FILLER   PIC X(20)  VALUE     '47163 00015 20190101'.
               05  FILLER   PIC X(20)  VALUE     '47163 00015 20200101'.
               05  FILLER   PIC X(20)  VALUE     '47177 00202 20180101'.
               05  FILLER   PIC X(20)  VALUE     '47177 00240 20190101'.
               05  FILLER   PIC X(20)  VALUE     '47177 00240 20200101'.
               05  FILLER   PIC X(20)  VALUE     '47177 00240 20210101'.
               05  FILLER   PIC X(20)  VALUE     '47183 00031 20180101'.
               05  FILLER   PIC X(20)  VALUE     '47183 00066 20190101'.
               05  FILLER   PIC X(20)  VALUE     '47183 00066 20200101'.
               05  FILLER   PIC X(20)  VALUE     '47183 00066 20210101'.
               05  FILLER   PIC X(20)  VALUE     '48001 00058 20180101'.
               05  FILLER   PIC X(20)  VALUE     '48001 00058 20190101'.
               05  FILLER   PIC X(20)  VALUE     '48025 00104 20180101'.
               05  FILLER   PIC X(20)  VALUE     '48025 00190 20190101'.
               05  FILLER   PIC X(20)  VALUE     '48025 00190 20200101'.
               05  FILLER   PIC X(20)  VALUE     '48025 00190 20210101'.
               05  FILLER   PIC X(20)  VALUE     '48035 00188 20180101'.
               05  FILLER   PIC X(20)  VALUE     '48035 00188 20190101'.
               05  FILLER   PIC X(20)  VALUE     '48053 00183 20190101'.
               05  FILLER   PIC X(20)  VALUE     '48053 00183 20200101'.
               05  FILLER   PIC X(20)  VALUE     '48053 00183 20210101'.
               05  FILLER   PIC X(20)  VALUE     '48091 00134 20190101'.
               05  FILLER   PIC X(20)  VALUE     '48091 00134 20200101'.
               05  FILLER   PIC X(20)  VALUE     '48091 00134 20210101'.
               05  FILLER   PIC X(20)  VALUE     '48097 00704 20180101'.
               05  FILLER   PIC X(20)  VALUE     '48097 00704 20190101'.
               05  FILLER   PIC X(20)  VALUE     '48097 00543 20200101'.
               05  FILLER   PIC X(20)  VALUE     '48097 00543 20210101'.
               05  FILLER   PIC X(20)  VALUE     '48117 00049 20180101'.
               05  FILLER   PIC X(20)  VALUE     '48123 00134 20180101'.
               05  FILLER   PIC X(20)  VALUE     '48123 00134 20190101'.
               05  FILLER   PIC X(20)  VALUE     '48135 00095 20200101'.
               05  FILLER   PIC X(20)  VALUE     '48135 00095 20210101'.
               05  FILLER   PIC X(20)  VALUE     '48181 00222 20180101'.
               05  FILLER   PIC X(20)  VALUE     '48181 00315 20190101'.
               05  FILLER   PIC X(20)  VALUE     '48181 00315 20200101'.
               05  FILLER   PIC X(20)  VALUE     '48181 00315 20210101'.
               05  FILLER   PIC X(20)  VALUE     '48189 00099 20180101'.
               05  FILLER   PIC X(20)  VALUE     '48189 00099 20190101'.
               05  FILLER   PIC X(20)  VALUE     '48189 00040 20200101'.
               05  FILLER   PIC X(20)  VALUE     '48189 00040 20210101'.
               05  FILLER   PIC X(20)  VALUE     '48203 00164 20180101'.
               05  FILLER   PIC X(20)  VALUE     '48203 00164 20190101'.
               05  FILLER   PIC X(20)  VALUE     '48213 00376 20180101'.
               05  FILLER   PIC X(20)  VALUE     '48213 00376 20190101'.
               05  FILLER   PIC X(20)  VALUE     '48217 00415 20180101'.
               05  FILLER   PIC X(20)  VALUE     '48217 00415 20190101'.
               05  FILLER   PIC X(20)  VALUE     '48217 00530 20200101'.
               05  FILLER   PIC X(20)  VALUE     '48217 00530 20210101'.
               05  FILLER   PIC X(20)  VALUE     '48221 00699 20210101'.
               05  FILLER   PIC X(20)  VALUE     '48223 00308 20180101'.
               05  FILLER   PIC X(20)  VALUE     '48223 00308 20190101'.
               05  FILLER   PIC X(20)  VALUE     '48241 00094 20180101'.
               05  FILLER   PIC X(20)  VALUE     '48241 00094 20190101'.
               05  FILLER   PIC X(20)  VALUE     '48241 00129 20200101'.
               05  FILLER   PIC X(20)  VALUE     '48241 00129 20210101'.
               05  FILLER   PIC X(20)  VALUE     '48273 00161 20180101'.
               05  FILLER   PIC X(20)  VALUE     '48273 00161 20190101'.
               05  FILLER   PIC X(20)  VALUE     '48273 00291 20200101'.
               05  FILLER   PIC X(20)  VALUE     '48273 00291 20210101'.
               05  FILLER   PIC X(20)  VALUE     '48293 00028 20180101'.
               05  FILLER   PIC X(20)  VALUE     '48293 00097 20190101'.
               05  FILLER   PIC X(20)  VALUE     '48293 00097 20200101'.
               05  FILLER   PIC X(20)  VALUE     '48293 00097 20210101'.
               05  FILLER   PIC X(20)  VALUE     '48329 00053 20180101'.
               05  FILLER   PIC X(20)  VALUE     '48329 00009 20190101'.
               05  FILLER   PIC X(20)  VALUE     '48329 00009 20200101'.
               05  FILLER   PIC X(20)  VALUE     '48329 00009 20210101'.
               05  FILLER   PIC X(20)  VALUE     '48331 00445 20180101'.
               05  FILLER   PIC X(20)  VALUE     '48331 00445 20190101'.
               05  FILLER   PIC X(20)  VALUE     '48337 00574 20180101'.
               05  FILLER   PIC X(20)  VALUE     '48337 00574 20190101'.
               05  FILLER   PIC X(20)  VALUE     '48349 00566 20180101'.
               05  FILLER   PIC X(20)  VALUE     '48349 00442 20200101'.
               05  FILLER   PIC X(20)  VALUE     '48349 00442 20210101'.
               05  FILLER   PIC X(20)  VALUE     '48353 00119 20180101'.
               05  FILLER   PIC X(20)  VALUE     '48353 00032 20190101'.
               05  FILLER   PIC X(20)  VALUE     '48353 00032 20200101'.
               05  FILLER   PIC X(20)  VALUE     '48353 00032 20210101'.
               05  FILLER   PIC X(20)  VALUE     '48363 00550 20180101'.
               05  FILLER   PIC X(20)  VALUE     '48363 00550 20190101'.
               05  FILLER   PIC X(20)  VALUE     '48363 00550 20200101'.
               05  FILLER   PIC X(20)  VALUE     '48365 00185 20180101'.
               05  FILLER   PIC X(20)  VALUE     '48365 00185 20190101'.
               05  FILLER   PIC X(20)  VALUE     '48419 00056 20180101'.
               05  FILLER   PIC X(20)  VALUE     '48439 00089 20180101'.
               05  FILLER   PIC X(20)  VALUE     '48439 00089 20190101'.
               05  FILLER   PIC X(20)  VALUE     '48439 00007 20210101'.
               05  FILLER   PIC X(20)  VALUE     '48457 00104 20180101'.
               05  FILLER   PIC X(20)  VALUE     '48457 00104 20190101'.
               05  FILLER   PIC X(20)  VALUE     '48467 00562 20180101'.
               05  FILLER   PIC X(20)  VALUE     '48467 00562 20190101'.
               05  FILLER   PIC X(20)  VALUE     '48471 00407 20180101'.
               05  FILLER   PIC X(20)  VALUE     '48471 00407 20190101'.
               05  FILLER   PIC X(20)  VALUE     '48471 00416 20200101'.
               05  FILLER   PIC X(20)  VALUE     '48471 00416 20210101'.
               05  FILLER   PIC X(20)  VALUE     '48481 00636 20180101'.
               05  FILLER   PIC X(20)  VALUE     '49043 00525 20180101'.
               05  FILLER   PIC X(20)  VALUE     '49043 00525 20190101'.
               05  FILLER   PIC X(20)  VALUE     '49043 00525 20200101'.
               05  FILLER   PIC X(20)  VALUE     '49049 00022 20180101'.
               05  FILLER   PIC X(20)  VALUE     '49049 00071 20190101'.
               05  FILLER   PIC X(20)  VALUE     '49049 00071 20200101'.
               05  FILLER   PIC X(20)  VALUE     '49049 00071 20210101'.
               05  FILLER   PIC X(20)  VALUE     '49057 00037 20180101'.
               05  FILLER   PIC X(20)  VALUE     '49057 00062 20190101'.
               05  FILLER   PIC X(20)  VALUE     '49057 00062 20200101'.
               05  FILLER   PIC X(20)  VALUE     '49057 00062 20210101'.
               05  FILLER   PIC X(20)  VALUE     '50003 00503 20180101'.
               05  FILLER   PIC X(20)  VALUE     '50003 00545 20190101'.
               05  FILLER   PIC X(20)  VALUE     '50003 00545 20200101'.
               05  FILLER   PIC X(20)  VALUE     '50003 00545 20210101'.
               05  FILLER   PIC X(20)  VALUE     '50023 00156 20180101'.
               05  FILLER   PIC X(20)  VALUE     '50025 00373 20180101'.
               05  FILLER   PIC X(20)  VALUE     '50025 00394 20190101'.
               05  FILLER   PIC X(20)  VALUE     '50025 00394 20200101'.
               05  FILLER   PIC X(20)  VALUE     '50025 00394 20210101'.
               05  FILLER   PIC X(20)  VALUE     '51015 00162 20180101'.
               05  FILLER   PIC X(20)  VALUE     '51015 00162 20190101'.
               05  FILLER   PIC X(20)  VALUE     '51015 00127 20200101'.
               05  FILLER   PIC X(20)  VALUE     '51015 00127 20210101'.
               05  FILLER   PIC X(20)  VALUE     '51105 00021 20180101'.
               05  FILLER   PIC X(20)  VALUE     '51105 00021 20190101'.
               05  FILLER   PIC X(20)  VALUE     '51121 00203 20180101'.
               05  FILLER   PIC X(20)  VALUE     '51121 00203 20190101'.
               05  FILLER   PIC X(20)  VALUE     '51121 00108 20200101'.
               05  FILLER   PIC X(20)  VALUE     '51121 00108 20210101'.
               05  FILLER   PIC X(20)  VALUE     '53027 00160 20180101'.
               05  FILLER   PIC X(20)  VALUE     '53027 00219 20190101'.
               05  FILLER   PIC X(20)  VALUE     '53027 00219 20200101'.
               05  FILLER   PIC X(20)  VALUE     '53027 00219 20210101'.
               05  FILLER   PIC X(20)  VALUE     '53035 00083 20180101'.
               05  FILLER   PIC X(20)  VALUE     '53035 00083 20190101'.
               05  FILLER   PIC X(20)  VALUE     '53035 00128 20200101'.
               05  FILLER   PIC X(20)  VALUE     '53035 00128 20210101'.
               05  FILLER   PIC X(20)  VALUE     '53041 00111 20180101'.
               05  FILLER   PIC X(20)  VALUE     '53041 00111 20190101'.
               05  FILLER   PIC X(20)  VALUE     '53041 00163 20200101'.
               05  FILLER   PIC X(20)  VALUE     '53041 00163 20210101'.
               05  FILLER   PIC X(20)  VALUE     '53053 00015 20210101'.
               05  FILLER   PIC X(20)  VALUE     '53057 00148 20180101'.
               05  FILLER   PIC X(20)  VALUE     '53057 00148 20190101'.
               05  FILLER   PIC X(20)  VALUE     '53057 00206 20200101'.
               05  FILLER   PIC X(20)  VALUE     '53057 00206 20210101'.
               05  FILLER   PIC X(20)  VALUE     '53067 00176 20180101'.
               05  FILLER   PIC X(20)  VALUE     '53067 00176 20190101'.
               05  FILLER   PIC X(20)  VALUE     '53067 00116 20200101'.
               05  FILLER   PIC X(20)  VALUE     '53067 00116 20210101'.
               05  FILLER   PIC X(20)  VALUE     '54045 00119 20180101'.
               05  FILLER   PIC X(20)  VALUE     '54049 00287 20180101'.
               05  FILLER   PIC X(20)  VALUE     '54049 00287 20190101'.
               05  FILLER   PIC X(20)  VALUE     '54049 00374 20200101'.
               05  FILLER   PIC X(20)  VALUE     '54049 00374 20210101'.
               05  FILLER   PIC X(20)  VALUE     '54053 00315 20180101'.
               05  FILLER   PIC X(20)  VALUE     '54053 00315 20190101'.
               05  FILLER   PIC X(20)  VALUE     '54059 00340 20190101'.
               05  FILLER   PIC X(20)  VALUE     '54059 00340 20200101'.
               05  FILLER   PIC X(20)  VALUE     '54059 00340 20210101'.
               05  FILLER   PIC X(20)  VALUE     '54067 00115 20180101'.
               05  FILLER   PIC X(20)  VALUE     '54103 00115 20180101'.
               05  FILLER   PIC X(20)  VALUE     '54107 00171 20180101'.
               05  FILLER   PIC X(20)  VALUE     '54107 00149 20190101'.
               05  FILLER   PIC X(20)  VALUE     '54107 00149 20200101'.
               05  FILLER   PIC X(20)  VALUE     '54107 00149 20210101'.
               05  FILLER   PIC X(20)  VALUE     '55027 00305 20180101'.
               05  FILLER   PIC X(20)  VALUE     '55027 00305 20190101'.
               05  FILLER   PIC X(20)  VALUE     '55039 00073 20180101'.
               05  FILLER   PIC X(20)  VALUE     '55039 00073 20190101'.
               05  FILLER   PIC X(20)  VALUE     '55039 00073 20200101'.
               05  FILLER   PIC X(20)  VALUE     '55055 00445 20180101'.
               05  FILLER   PIC X(20)  VALUE     '55055 00445 20190101'.
               05  FILLER   PIC X(20)  VALUE     '55071 00066 20180101'.
               05  FILLER   PIC X(20)  VALUE     '55075 00038 20180101'.
               05  FILLER   PIC X(20)  VALUE     '55075 00040 20200101'.
               05  FILLER   PIC X(20)  VALUE     '55075 00040 20210101'.
               05  FILLER   PIC X(20)  VALUE     '55087 00001 20180101'.
               05  FILLER   PIC X(20)  VALUE     '55101 00312 20180101'.
               05  FILLER   PIC X(20)  VALUE     '55101 00312 20190101'.
               05  FILLER   PIC X(20)  VALUE     '55101 00312 20200101'.
               05  FILLER   PIC X(20)  VALUE     '55101 00089 20210101'.
               05  FILLER   PIC X(20)  VALUE     '55105 00394 20180101'.
               05  FILLER   PIC X(20)  VALUE     '55105 00394 20190101'.
               05  FILLER   PIC X(20)  VALUE     '55105 00394 20200101'.
               05  FILLER   PIC X(20)  VALUE     '55105 00160 20210101'.
               05  FILLER   PIC X(20)  VALUE     '55111 00219 20180101'.
               05  FILLER   PIC X(20)  VALUE     '55111 00219 20190101'.
               05  FILLER   PIC X(20)  VALUE     '55111 00240 20200101'.
               05  FILLER   PIC X(20)  VALUE     '55111 00240 20210101'.
               05  FILLER   PIC X(20)  VALUE     '55117 00089 20180101'.
               05  FILLER   PIC X(20)  VALUE     '55117 00089 20190101'.
               05  FILLER   PIC X(20)  VALUE     '55117 00048 20200101'.
               05  FILLER   PIC X(20)  VALUE     '55117 00048 20210101'.
               05  FILLER   PIC X(20)  VALUE     '55127 00296 20180101'.
               05  FILLER   PIC X(20)  VALUE     '55127 00296 20190101'.
               05  FILLER   PIC X(20)  VALUE     '55127 00415 20200101'.
               05  FILLER   PIC X(20)  VALUE     '55127 00415 20210101'.
               05  FILLER   PIC X(20)  VALUE     '55139 00010 20180101'.
               05  FILLER   PIC X(20)  VALUE     '55139 00010 20190101'.
               05  FILLER   PIC X(20)  VALUE     '55139 00053 20200101'.
               05  FILLER   PIC X(20)  VALUE     '55139 00053 20210101'.
               05  FILLER   PIC X(20)  VALUE     '72013 00060 20180101'.
               05  FILLER   PIC X(20)  VALUE     '72013 00171 20190101'.
               05  FILLER   PIC X(20)  VALUE     '72013 00171 20200101'.
               05  FILLER   PIC X(20)  VALUE     '72013 00171 20210101'.
               05  FILLER   PIC X(20)  VALUE     '72057 00079 20180101'.
               05  FILLER   PIC X(20)  VALUE     '72057 00110 20190101'.
               05  FILLER   PIC X(20)  VALUE     '72057 00110 20200101'.
               05  FILLER   PIC X(20)  VALUE     '72057 00110 20210101'.
               05  FILLER   PIC X(20)  VALUE     '72081 00106 20180101'.
               05  FILLER   PIC X(20)  VALUE     '72081 00103 20200101'.
               05  FILLER   PIC X(20)  VALUE     '72081 00103 20210101'.
               05  FILLER   PIC X(20)  VALUE     '72141 00149 20180101'.
               05  FILLER   PIC X(20)  VALUE     '72141 00149 20190101'.
               05  FILLER   PIC X(20)  VALUE     '72141 00149 20200101'.
               05  FILLER   PIC X(20)  VALUE     '99999 00000 99999999'.
           02  OUTM-ADJ-DATA2 REDEFINES OUTM-ADJ-DATA.
               05  OUTM-TAB OCCURS 1294 TIMES
                            ASCENDING KEY IS OUTM-CNTY
                            INDEXED BY OUTM-IDX.
                   10  OUTM-DATA-TAB.
                       15  OUTM-CNTY        PIC X(05).
                       15  FILLER           PIC X(01).
                       15  OUTM-ADJ-FACT    PIC 9(01)V9(04).
                       15  FILLER           PIC X(01).
                       15  OUTM-EFF-DATE    PIC 9(08).
