      ****************************************************
      * PREVIOUS FISCAL YEAR (FR19) WAGE INDEX TABLE     *
      * FOR USE WITH THE OPPS FINAL RULE                 *
      * REVISED 01/21/2020 (CY 2020)                     *
      ****************************************************
       01  PREV-ADJ-TABLE.
           02  PREV-ADJ-DATA.
               05  FILLER   PIC X(13)  VALUE    '01B029 006880'.
               05  FILLER   PIC X(13)  VALUE    '01S007 006704'.
               05  FILLER   PIC X(13)  VALUE    '01S008 006704'.
               05  FILLER   PIC X(13)  VALUE    '01S009 006885'.
               05  FILLER   PIC X(13)  VALUE    '01S011 008036'.
               05  FILLER   PIC X(13)  VALUE    '01S012 007150'.
               05  FILLER   PIC X(13)  VALUE    '01S016 008036'.
               05  FILLER   PIC X(13)  VALUE    '01S021 006704'.
               05  FILLER   PIC X(13)  VALUE    '01S023 007459'.
               05  FILLER   PIC X(13)  VALUE    '01S033 008036'.
               05  FILLER   PIC X(13)  VALUE    '01S034 007459'.
               05  FILLER   PIC X(13)  VALUE    '01S039 008056'.
               05  FILLER   PIC X(13)  VALUE    '01S040 006704'.
               05  FILLER   PIC X(13)  VALUE    '01S046 006778'.
               05  FILLER   PIC X(13)  VALUE    '01S062 006849'.
               05  FILLER   PIC X(13)  VALUE    '01S069 006704'.
               05  FILLER   PIC X(13)  VALUE    '01S078 007542'.
               05  FILLER   PIC X(13)  VALUE    '01S085 006846'.
               05  FILLER   PIC X(13)  VALUE    '01S086 006704'.
               05  FILLER   PIC X(13)  VALUE    '01S089 008036'.
               05  FILLER   PIC X(13)  VALUE    '01S091 006704'.
               05  FILLER   PIC X(13)  VALUE    '01S092 008285'.
               05  FILLER   PIC X(13)  VALUE    '01S103 008036'.
               05  FILLER   PIC X(13)  VALUE    '01S104 008036'.
               05  FILLER   PIC X(13)  VALUE    '01S109 008285'.
               05  FILLER   PIC X(13)  VALUE    '01S110 006704'.
               05  FILLER   PIC X(13)  VALUE    '01S112 006704'.
               05  FILLER   PIC X(13)  VALUE    '01S113 007494'.
               05  FILLER   PIC X(13)  VALUE    '01S114 008036'.
               05  FILLER   PIC X(13)  VALUE    '01S125 006704'.
               05  FILLER   PIC X(13)  VALUE    '01S126 006786'.
               05  FILLER   PIC X(13)  VALUE    '01S129 007138'.
               05  FILLER   PIC X(13)  VALUE    '01S139 008036'.
               05  FILLER   PIC X(13)  VALUE    '01S143 006704'.
               05  FILLER   PIC X(13)  VALUE    '01S150 006880'.
               05  FILLER   PIC X(13)  VALUE    '01S157 006704'.
               05  FILLER   PIC X(13)  VALUE    '01S164 006704'.
               05  FILLER   PIC X(13)  VALUE    '01T011 008036'.
               05  FILLER   PIC X(13)  VALUE    '01T029 007435'.
               05  FILLER   PIC X(13)  VALUE    '01T033 008036'.
               05  FILLER   PIC X(13)  VALUE    '01T092 008285'.
               05  FILLER   PIC X(13)  VALUE    '01T100 007138'.
               05  FILLER   PIC X(13)  VALUE    '01T104 008036'.
               05  FILLER   PIC X(13)  VALUE    '01T113 007494'.
               05  FILLER   PIC X(13)  VALUE    '01T114 008036'.
               05  FILLER   PIC X(13)  VALUE    '01T139 008036'.
               05  FILLER   PIC X(13)  VALUE    '01T144 007494'.
               05  FILLER   PIC X(13)  VALUE    '01T157 006704'.
               05  FILLER   PIC X(13)  VALUE    '01U021 006704'.
               05  FILLER   PIC X(13)  VALUE    '01U059 006704'.
               05  FILLER   PIC X(13)  VALUE    '01U065 008703'.
               05  FILLER   PIC X(13)  VALUE    '01U095 008285'.
               05  FILLER   PIC X(13)  VALUE    '01U125 006704'.
               05  FILLER   PIC X(13)  VALUE    '01U130 008036'.
               05  FILLER   PIC X(13)  VALUE    '01U173 008036'.
               05  FILLER   PIC X(13)  VALUE    '010001 007848'.
               05  FILLER   PIC X(13)  VALUE    '010005 007845'.
               05  FILLER   PIC X(13)  VALUE    '010006 007197'.
               05  FILLER   PIC X(13)  VALUE    '010007 006704'.
               05  FILLER   PIC X(13)  VALUE    '010008 006823'.
               05  FILLER   PIC X(13)  VALUE    '010011 008036'.
               05  FILLER   PIC X(13)  VALUE    '010012 007150'.
               05  FILLER   PIC X(13)  VALUE    '010016 008036'.
               05  FILLER   PIC X(13)  VALUE    '010018 008036'.
               05  FILLER   PIC X(13)  VALUE    '010019 006704'.
               05  FILLER   PIC X(13)  VALUE    '010021 006704'.
               05  FILLER   PIC X(13)  VALUE    '010022 009208'.
               05  FILLER   PIC X(13)  VALUE    '010023 007459'.
               05  FILLER   PIC X(13)  VALUE    '010024 007845'.
               05  FILLER   PIC X(13)  VALUE    '010025 007435'.
               05  FILLER   PIC X(13)  VALUE    '010029 007775'.
               05  FILLER   PIC X(13)  VALUE    '010033 008036'.
               05  FILLER   PIC X(13)  VALUE    '010034 007459'.
               05  FILLER   PIC X(13)  VALUE    '010035 007845'.
               05  FILLER   PIC X(13)  VALUE    '010036 006704'.
               05  FILLER   PIC X(13)  VALUE    '010038 007542'.
               05  FILLER   PIC X(13)  VALUE    '010039 008056'.
               05  FILLER   PIC X(13)  VALUE    '010040 007845'.
               05  FILLER   PIC X(13)  VALUE    '010044 007845'.
               05  FILLER   PIC X(13)  VALUE    '010045 007845'.
               05  FILLER   PIC X(13)  VALUE    '010046 006778'.
               05  FILLER   PIC X(13)  VALUE    '010047 006880'.
               05  FILLER   PIC X(13)  VALUE    '010049 006704'.
               05  FILLER   PIC X(13)  VALUE    '010051 006704'.
               05  FILLER   PIC X(13)  VALUE    '010052 007009'.
               05  FILLER   PIC X(13)  VALUE    '010055 007684'.
               05  FILLER   PIC X(13)  VALUE    '010056 008036'.
               05  FILLER   PIC X(13)  VALUE    '010058 008036'.
               05  FILLER   PIC X(13)  VALUE    '010059 006846'.
               05  FILLER   PIC X(13)  VALUE    '010061 008331'.
               05  FILLER   PIC X(13)  VALUE    '010062 006849'.
               05  FILLER   PIC X(13)  VALUE    '010065 007845'.
               05  FILLER   PIC X(13)  VALUE    '010069 006704'.
               05  FILLER   PIC X(13)  VALUE    '010073 006704'.
               05  FILLER   PIC X(13)  VALUE    '010078 007845'.
               05  FILLER   PIC X(13)  VALUE    '010079 008056'.
               05  FILLER   PIC X(13)  VALUE    '010083 008030'.
               05  FILLER   PIC X(13)  VALUE    '010085 007902'.
               05  FILLER   PIC X(13)  VALUE    '010086 007845'.
               05  FILLER   PIC X(13)  VALUE    '010087 007494'.
               05  FILLER   PIC X(13)  VALUE    '010089 008036'.
               05  FILLER   PIC X(13)  VALUE    '010090 007494'.
               05  FILLER   PIC X(13)  VALUE    '010091 006869'.
               05  FILLER   PIC X(13)  VALUE    '010092 007845'.
               05  FILLER   PIC X(13)  VALUE    '010095 008285'.
               05  FILLER   PIC X(13)  VALUE    '010097 007459'.
               05  FILLER   PIC X(13)  VALUE    '010099 006704'.
               05  FILLER   PIC X(13)  VALUE    '010100 007287'.
               05  FILLER   PIC X(13)  VALUE    '010101 007845'.
               05  FILLER   PIC X(13)  VALUE    '010102 006704'.
               05  FILLER   PIC X(13)  VALUE    '010103 008036'.
               05  FILLER   PIC X(13)  VALUE    '010104 008036'.
               05  FILLER   PIC X(13)  VALUE    '010108 007459'.
               05  FILLER   PIC X(13)  VALUE    '010109 008285'.
               05  FILLER   PIC X(13)  VALUE    '010110 006704'.
               05  FILLER   PIC X(13)  VALUE    '010112 006704'.
               05  FILLER   PIC X(13)  VALUE    '010113 007494'.
               05  FILLER   PIC X(13)  VALUE    '010114 008036'.
               05  FILLER   PIC X(13)  VALUE    '010118 007845'.
               05  FILLER   PIC X(13)  VALUE    '010120 006704'.
               05  FILLER   PIC X(13)  VALUE    '010125 007845'.
               05  FILLER   PIC X(13)  VALUE    '010126 006786'.
               05  FILLER   PIC X(13)  VALUE    '010128 006869'.
               05  FILLER   PIC X(13)  VALUE    '010129 007287'.
               05  FILLER   PIC X(13)  VALUE    '010130 008036'.
               05  FILLER   PIC X(13)  VALUE    '010131 008056'.
               05  FILLER   PIC X(13)  VALUE    '010138 006841'.
               05  FILLER   PIC X(13)  VALUE    '010139 008036'.
               05  FILLER   PIC X(13)  VALUE    '010144 007494'.
               05  FILLER   PIC X(13)  VALUE    '010146 007542'.
               05  FILLER   PIC X(13)  VALUE    '010148 008030'.
               05  FILLER   PIC X(13)  VALUE    '010149 007459'.
               05  FILLER   PIC X(13)  VALUE    '010150 007459'.
               05  FILLER   PIC X(13)  VALUE    '010157 006846'.
               05  FILLER   PIC X(13)  VALUE    '010158 007197'.
               05  FILLER   PIC X(13)  VALUE    '010164 007025'.
               05  FILLER   PIC X(13)  VALUE    '010168 007932'.
               05  FILLER   PIC X(13)  VALUE    '010169 006704'.
               05  FILLER   PIC X(13)  VALUE    '010172 008056'.
               05  FILLER   PIC X(13)  VALUE    '010173 008036'.
               05  FILLER   PIC X(13)  VALUE    '011506 008036'.
               05  FILLER   PIC X(13)  VALUE    '011508 007542'.
               05  FILLER   PIC X(13)  VALUE    '011558 007494'.
               05  FILLER   PIC X(13)  VALUE    '011566 006846'.
               05  FILLER   PIC X(13)  VALUE    '011673 007459'.
               05  FILLER   PIC X(13)  VALUE    '011674 008056'.
               05  FILLER   PIC X(13)  VALUE    '011675 008036'.
               05  FILLER   PIC X(13)  VALUE    '011676 008056'.
               05  FILLER   PIC X(13)  VALUE    '011677 008285'.
               05  FILLER   PIC X(13)  VALUE    '011678 006704'.
               05  FILLER   PIC X(13)  VALUE    '011680 006704'.
               05  FILLER   PIC X(13)  VALUE    '011681 006704'.
               05  FILLER   PIC X(13)  VALUE    '011682 006846'.
               05  FILLER   PIC X(13)  VALUE    '012006 007494'.
               05  FILLER   PIC X(13)  VALUE    '012008 008036'.
               05  FILLER   PIC X(13)  VALUE    '012010 006849'.
               05  FILLER   PIC X(13)  VALUE    '013025 008036'.
               05  FILLER   PIC X(13)  VALUE    '013028 007459'.
               05  FILLER   PIC X(13)  VALUE    '013029 008056'.
               05  FILLER   PIC X(13)  VALUE    '013030 006849'.
               05  FILLER   PIC X(13)  VALUE    '013031 008036'.
               05  FILLER   PIC X(13)  VALUE    '013032 006778'.
               05  FILLER   PIC X(13)  VALUE    '013033 007932'.
               05  FILLER   PIC X(13)  VALUE    '013300 008036'.
               05  FILLER   PIC X(13)  VALUE    '013301 008285'.
               05  FILLER   PIC X(13)  VALUE    '014012 008285'.
               05  FILLER   PIC X(13)  VALUE    '014501 009178'.
               05  FILLER   PIC X(13)  VALUE    '014505 007459'.
               05  FILLER   PIC X(13)  VALUE    '014506 007651'.
               05  FILLER   PIC X(13)  VALUE    '014507 006704'.
               05  FILLER   PIC X(13)  VALUE    '014508 006846'.
               05  FILLER   PIC X(13)  VALUE    '014509 006704'.
               05  FILLER   PIC X(13)  VALUE    '014511 009178'.
               05  FILLER   PIC X(13)  VALUE    '014514 009178'.
               05  FILLER   PIC X(13)  VALUE    '014515 009178'.
               05  FILLER   PIC X(13)  VALUE    '014516 009178'.
               05  FILLER   PIC X(13)  VALUE    '014518 009178'.
               05  FILLER   PIC X(13)  VALUE    '014519 008011'.
               05  FILLER   PIC X(13)  VALUE    '014520 006704'.
               05  FILLER   PIC X(13)  VALUE    '014521 006704'.
               05  FILLER   PIC X(13)  VALUE    '014522 008056'.
               05  FILLER   PIC X(13)  VALUE    '014523 009178'.
               05  FILLER   PIC X(13)  VALUE    '014524 008390'.
               05  FILLER   PIC X(13)  VALUE    '014525 007651'.
               05  FILLER   PIC X(13)  VALUE    '014534 006704'.
               05  FILLER   PIC X(13)  VALUE    '014541 006704'.
               05  FILLER   PIC X(13)  VALUE    '014600 006704'.
               05  FILLER   PIC X(13)  VALUE    '014601 007459'.
               05  FILLER   PIC X(13)  VALUE    '014603 006704'.
               05  FILLER   PIC X(13)  VALUE    '014604 006704'.
               05  FILLER   PIC X(13)  VALUE    '014606 006704'.
               05  FILLER   PIC X(13)  VALUE    '014607 008036'.
               05  FILLER   PIC X(13)  VALUE    '014609 006849'.
               05  FILLER   PIC X(13)  VALUE    '014611 006704'.
               05  FILLER   PIC X(13)  VALUE    '014613 008056'.
               05  FILLER   PIC X(13)  VALUE    '014614 008036'.
               05  FILLER   PIC X(13)  VALUE    '014615 006846'.
               05  FILLER   PIC X(13)  VALUE    '014617 007494'.
               05  FILLER   PIC X(13)  VALUE    '014622 008036'.
               05  FILLER   PIC X(13)  VALUE    '014625 006704'.
               05  FILLER   PIC X(13)  VALUE    '014630 006704'.
               05  FILLER   PIC X(13)  VALUE    '014631 006704'.
               05  FILLER   PIC X(13)  VALUE    '014635 006849'.
               05  FILLER   PIC X(13)  VALUE    '014636 006849'.
               05  FILLER   PIC X(13)  VALUE    '014637 008285'.
               05  FILLER   PIC X(13)  VALUE    '014645 006704'.
               05  FILLER   PIC X(13)  VALUE    '014646 006704'.
               05  FILLER   PIC X(13)  VALUE    '014648 006704'.
               05  FILLER   PIC X(13)  VALUE    '014653 006704'.
               05  FILLER   PIC X(13)  VALUE    '014655 008285'.
               05  FILLER   PIC X(13)  VALUE    '014656 006704'.
               05  FILLER   PIC X(13)  VALUE    '014657 006704'.
               05  FILLER   PIC X(13)  VALUE    '014658 006704'.
               05  FILLER   PIC X(13)  VALUE    '014663 006704'.
               05  FILLER   PIC X(13)  VALUE    '014664 006704'.
               05  FILLER   PIC X(13)  VALUE    '014665 008036'.
               05  FILLER   PIC X(13)  VALUE    '014668 008036'.
               05  FILLER   PIC X(13)  VALUE    '014670 006704'.
               05  FILLER   PIC X(13)  VALUE    '014671 008036'.
               05  FILLER   PIC X(13)  VALUE    '014673 006704'.
               05  FILLER   PIC X(13)  VALUE    '014677 006704'.
               05  FILLER   PIC X(13)  VALUE    '014680 006704'.
               05  FILLER   PIC X(13)  VALUE    '014681 006704'.
               05  FILLER   PIC X(13)  VALUE    '014691 008056'.
               05  FILLER   PIC X(13)  VALUE    '014692 007138'.
               05  FILLER   PIC X(13)  VALUE    '014693 007138'.
               05  FILLER   PIC X(13)  VALUE    '014694 007459'.
               05  FILLER   PIC X(13)  VALUE    '014696 006849'.
               05  FILLER   PIC X(13)  VALUE    '014697 008036'.
               05  FILLER   PIC X(13)  VALUE    '014698 008036'.
               05  FILLER   PIC X(13)  VALUE    '014714 006704'.
               05  FILLER   PIC X(13)  VALUE    '014719 008285'.
               05  FILLER   PIC X(13)  VALUE    '014722 008285'.
               05  FILLER   PIC X(13)  VALUE    '014724 007494'.
               05  FILLER   PIC X(13)  VALUE    '014727 006704'.
               05  FILLER   PIC X(13)  VALUE    '014728 008285'.
               05  FILLER   PIC X(13)  VALUE    '014729 006704'.
               05  FILLER   PIC X(13)  VALUE    '017013 006704'.
               05  FILLER   PIC X(13)  VALUE    '017106 006704'.
               05  FILLER   PIC X(13)  VALUE    '017305 007542'.
               05  FILLER   PIC X(13)  VALUE    '017872 006704'.
               05  FILLER   PIC X(13)  VALUE    '02S008 012130'.
               05  FILLER   PIC X(13)  VALUE    '02T001 012130'.
               05  FILLER   PIC X(13)  VALUE    '02T017 012130'.
               05  FILLER   PIC X(13)  VALUE    '02U024 012130'.
               05  FILLER   PIC X(13)  VALUE    '020001 012130'.
               05  FILLER   PIC X(13)  VALUE    '020006 012130'.
               05  FILLER   PIC X(13)  VALUE    '020008 012130'.
               05  FILLER   PIC X(13)  VALUE    '020012 012130'.
               05  FILLER   PIC X(13)  VALUE    '020017 012130'.
               05  FILLER   PIC X(13)  VALUE    '020018 019343'.
               05  FILLER   PIC X(13)  VALUE    '020024 012130'.
               05  FILLER   PIC X(13)  VALUE    '020026 019343'.
               05  FILLER   PIC X(13)  VALUE    '021500 012130'.
               05  FILLER   PIC X(13)  VALUE    '021505 012130'.
               05  FILLER   PIC X(13)  VALUE    '021506 012130'.
               05  FILLER   PIC X(13)  VALUE    '021507 012130'.
               05  FILLER   PIC X(13)  VALUE    '024002 012130'.
               05  FILLER   PIC X(13)  VALUE    '03S002 010528'.
               05  FILLER   PIC X(13)  VALUE    '03S006 010528'.
               05  FILLER   PIC X(13)  VALUE    '03S007 010528'.
               05  FILLER   PIC X(13)  VALUE    '03S010 010528'.
               05  FILLER   PIC X(13)  VALUE    '03S011 010528'.
               05  FILLER   PIC X(13)  VALUE    '03S018 010528'.
               05  FILLER   PIC X(13)  VALUE    '03S022 010528'.
               05  FILLER   PIC X(13)  VALUE    '03S023 011117'.
               05  FILLER   PIC X(13)  VALUE    '03S037 010528'.
               05  FILLER   PIC X(13)  VALUE    '03S043 010528'.
               05  FILLER   PIC X(13)  VALUE    '03S065 010528'.
               05  FILLER   PIC X(13)  VALUE    '03S089 010528'.
               05  FILLER   PIC X(13)  VALUE    '03S093 010528'.
               05  FILLER   PIC X(13)  VALUE    '03S111 010528'.
               05  FILLER   PIC X(13)  VALUE    '03S114 010528'.
               05  FILLER   PIC X(13)  VALUE    '03S121 010528'.
               05  FILLER   PIC X(13)  VALUE    '03T002 010528'.
               05  FILLER   PIC X(13)  VALUE    '03T010 010528'.
               05  FILLER   PIC X(13)  VALUE    '03T011 010528'.
               05  FILLER   PIC X(13)  VALUE    '03T018 010528'.
               05  FILLER   PIC X(13)  VALUE    '03T024 010528'.
               05  FILLER   PIC X(13)  VALUE    '03T030 010528'.
               05  FILLER   PIC X(13)  VALUE    '03T037 010528'.
               05  FILLER   PIC X(13)  VALUE    '03T038 010528'.
               05  FILLER   PIC X(13)  VALUE    '03T055 010528'.
               05  FILLER   PIC X(13)  VALUE    '03T061 010528'.
               05  FILLER   PIC X(13)  VALUE    '03T069 010528'.
               05  FILLER   PIC X(13)  VALUE    '03T085 010528'.
               05  FILLER   PIC X(13)  VALUE    '03T088 010528'.
               05  FILLER   PIC X(13)  VALUE    '03T093 010528'.
               05  FILLER   PIC X(13)  VALUE    '03T103 010528'.
               05  FILLER   PIC X(13)  VALUE    '03T114 010528'.
               05  FILLER   PIC X(13)  VALUE    '03T117 010528'.
               05  FILLER   PIC X(13)  VALUE    '03U068 010528'.
               05  FILLER   PIC X(13)  VALUE    '03U137 010528'.
               05  FILLER   PIC X(13)  VALUE    '03Z307 010528'.
               05  FILLER   PIC X(13)  VALUE    '030001 010528'.
               05  FILLER   PIC X(13)  VALUE    '030002 010528'.
               05  FILLER   PIC X(13)  VALUE    '030006 010528'.
               05  FILLER   PIC X(13)  VALUE    '030007 010528'.
               05  FILLER   PIC X(13)  VALUE    '030010 010528'.
               05  FILLER   PIC X(13)  VALUE    '030011 010528'.
               05  FILLER   PIC X(13)  VALUE    '030012 010528'.
               05  FILLER   PIC X(13)  VALUE    '030013 010528'.
               05  FILLER   PIC X(13)  VALUE    '030014 010528'.
               05  FILLER   PIC X(13)  VALUE    '030016 010528'.
               05  FILLER   PIC X(13)  VALUE    '030022 010528'.
               05  FILLER   PIC X(13)  VALUE    '030023 011117'.
               05  FILLER   PIC X(13)  VALUE    '030024 010528'.
               05  FILLER   PIC X(13)  VALUE    '030030 010528'.
               05  FILLER   PIC X(13)  VALUE    '030033 010528'.
               05  FILLER   PIC X(13)  VALUE    '030036 010528'.
               05  FILLER   PIC X(13)  VALUE    '030037 010528'.
               05  FILLER   PIC X(13)  VALUE    '030038 010528'.
               05  FILLER   PIC X(13)  VALUE    '030043 010528'.
               05  FILLER   PIC X(13)  VALUE    '030055 010528'.
               05  FILLER   PIC X(13)  VALUE    '030061 010528'.
               05  FILLER   PIC X(13)  VALUE    '030062 010528'.
               05  FILLER   PIC X(13)  VALUE    '030064 010528'.
               05  FILLER   PIC X(13)  VALUE    '030065 010528'.
               05  FILLER   PIC X(13)  VALUE    '030068 010528'.
               05  FILLER   PIC X(13)  VALUE    '030069 011765'.
               05  FILLER   PIC X(13)  VALUE    '030071 014448'.
               05  FILLER   PIC X(13)  VALUE    '030073 014448'.
               05  FILLER   PIC X(13)  VALUE    '030074 014448'.
               05  FILLER   PIC X(13)  VALUE    '030077 014448'.
               05  FILLER   PIC X(13)  VALUE    '030078 014448'.
               05  FILLER   PIC X(13)  VALUE    '030083 010528'.
               05  FILLER   PIC X(13)  VALUE    '030084 014448'.
               05  FILLER   PIC X(13)  VALUE    '030085 010528'.
               05  FILLER   PIC X(13)  VALUE    '030087 010528'.
               05  FILLER   PIC X(13)  VALUE    '030088 010528'.
               05  FILLER   PIC X(13)  VALUE    '030089 010528'.
               05  FILLER   PIC X(13)  VALUE    '030092 010528'.
               05  FILLER   PIC X(13)  VALUE    '030093 010528'.
               05  FILLER   PIC X(13)  VALUE    '030094 010528'.
               05  FILLER   PIC X(13)  VALUE    '030101 010528'.
               05  FILLER   PIC X(13)  VALUE    '030103 010528'.
               05  FILLER   PIC X(13)  VALUE    '030105 010528'.
               05  FILLER   PIC X(13)  VALUE    '030107 010528'.
               05  FILLER   PIC X(13)  VALUE    '030108 010528'.
               05  FILLER   PIC X(13)  VALUE    '030110 010528'.
               05  FILLER   PIC X(13)  VALUE    '030111 010528'.
               05  FILLER   PIC X(13)  VALUE    '030112 010528'.
               05  FILLER   PIC X(13)  VALUE    '030113 014448'.
               05  FILLER   PIC X(13)  VALUE    '030114 010528'.
               05  FILLER   PIC X(13)  VALUE    '030115 010528'.
               05  FILLER   PIC X(13)  VALUE    '030117 010528'.
               05  FILLER   PIC X(13)  VALUE    '030118 010528'.
               05  FILLER   PIC X(13)  VALUE    '030119 010528'.
               05  FILLER   PIC X(13)  VALUE    '030120 010528'.
               05  FILLER   PIC X(13)  VALUE    '030121 010528'.
               05  FILLER   PIC X(13)  VALUE    '030122 010528'.
               05  FILLER   PIC X(13)  VALUE    '030123 010528'.
               05  FILLER   PIC X(13)  VALUE    '030130 010528'.
               05  FILLER   PIC X(13)  VALUE    '030131 010528'.
               05  FILLER   PIC X(13)  VALUE    '030132 010528'.
               05  FILLER   PIC X(13)  VALUE    '030134 010528'.
               05  FILLER   PIC X(13)  VALUE    '030135 010528'.
               05  FILLER   PIC X(13)  VALUE    '030136 010528'.
               05  FILLER   PIC X(13)  VALUE    '030137 010528'.
               05  FILLER   PIC X(13)  VALUE    '030138 010528'.
               05  FILLER   PIC X(13)  VALUE    '030139 010528'.
               05  FILLER   PIC X(13)  VALUE    '031500 010528'.
               05  FILLER   PIC X(13)  VALUE    '031501 010528'.
               05  FILLER   PIC X(13)  VALUE    '031502 010528'.
               05  FILLER   PIC X(13)  VALUE    '031505 010528'.
               05  FILLER   PIC X(13)  VALUE    '031508 010528'.
               05  FILLER   PIC X(13)  VALUE    '031512 011117'.
               05  FILLER   PIC X(13)  VALUE    '031514 010528'.
               05  FILLER   PIC X(13)  VALUE    '031515 010528'.
               05  FILLER   PIC X(13)  VALUE    '031517 010528'.
               05  FILLER   PIC X(13)  VALUE    '031519 010528'.
               05  FILLER   PIC X(13)  VALUE    '031520 010528'.
               05  FILLER   PIC X(13)  VALUE    '031521 010528'.
               05  FILLER   PIC X(13)  VALUE    '031522 010528'.
               05  FILLER   PIC X(13)  VALUE    '031523 010528'.
               05  FILLER   PIC X(13)  VALUE    '031529 010528'.
               05  FILLER   PIC X(13)  VALUE    '031530 010528'.
               05  FILLER   PIC X(13)  VALUE    '031536 010528'.
               05  FILLER   PIC X(13)  VALUE    '031537 010528'.
               05  FILLER   PIC X(13)  VALUE    '031538 010528'.
               05  FILLER   PIC X(13)  VALUE    '031540 010528'.
               05  FILLER   PIC X(13)  VALUE    '031543 010528'.
               05  FILLER   PIC X(13)  VALUE    '031547 010528'.
               05  FILLER   PIC X(13)  VALUE    '031548 010528'.
               05  FILLER   PIC X(13)  VALUE    '031550 010528'.
               05  FILLER   PIC X(13)  VALUE    '031551 010528'.
               05  FILLER   PIC X(13)  VALUE    '031552 010528'.
               05  FILLER   PIC X(13)  VALUE    '031554 010528'.
               05  FILLER   PIC X(13)  VALUE    '031555 010528'.
               05  FILLER   PIC X(13)  VALUE    '031556 010528'.
               05  FILLER   PIC X(13)  VALUE    '031557 010528'.
               05  FILLER   PIC X(13)  VALUE    '031559 010528'.
               05  FILLER   PIC X(13)  VALUE    '031560 010528'.
               05  FILLER   PIC X(13)  VALUE    '031561 010528'.
               05  FILLER   PIC X(13)  VALUE    '031562 010528'.
               05  FILLER   PIC X(13)  VALUE    '031563 010528'.
               05  FILLER   PIC X(13)  VALUE    '031564 010528'.
               05  FILLER   PIC X(13)  VALUE    '031565 010528'.
               05  FILLER   PIC X(13)  VALUE    '031566 010528'.
               05  FILLER   PIC X(13)  VALUE    '031568 010528'.
               05  FILLER   PIC X(13)  VALUE    '031569 010528'.
               05  FILLER   PIC X(13)  VALUE    '031570 010528'.
               05  FILLER   PIC X(13)  VALUE    '031571 010528'.
               05  FILLER   PIC X(13)  VALUE    '031572 010528'.
               05  FILLER   PIC X(13)  VALUE    '031573 010528'.
               05  FILLER   PIC X(13)  VALUE    '031574 010528'.
               05  FILLER   PIC X(13)  VALUE    '031575 010528'.
               05  FILLER   PIC X(13)  VALUE    '031576 010528'.
               05  FILLER   PIC X(13)  VALUE    '031577 010528'.
               05  FILLER   PIC X(13)  VALUE    '031578 010528'.
               05  FILLER   PIC X(13)  VALUE    '031579 016900'.
               05  FILLER   PIC X(13)  VALUE    '031580 010528'.
               05  FILLER   PIC X(13)  VALUE    '031581 010528'.
               05  FILLER   PIC X(13)  VALUE    '031582 010528'.
               05  FILLER   PIC X(13)  VALUE    '031583 010528'.
               05  FILLER   PIC X(13)  VALUE    '031584 010528'.
               05  FILLER   PIC X(13)  VALUE    '031585 010528'.
               05  FILLER   PIC X(13)  VALUE    '031586 010528'.
               05  FILLER   PIC X(13)  VALUE    '031587 010528'.
               05  FILLER   PIC X(13)  VALUE    '031588 010528'.
               05  FILLER   PIC X(13)  VALUE    '031589 010528'.
               05  FILLER   PIC X(13)  VALUE    '031590 010528'.
               05  FILLER   PIC X(13)  VALUE    '031591 010528'.
               05  FILLER   PIC X(13)  VALUE    '031592 010528'.
               05  FILLER   PIC X(13)  VALUE    '031593 010528'.
               05  FILLER   PIC X(13)  VALUE    '031594 011117'.
               05  FILLER   PIC X(13)  VALUE    '031595 010528'.
               05  FILLER   PIC X(13)  VALUE    '031596 010528'.
               05  FILLER   PIC X(13)  VALUE    '031597 010528'.
               05  FILLER   PIC X(13)  VALUE    '031598 010528'.
               05  FILLER   PIC X(13)  VALUE    '031599 010528'.
               05  FILLER   PIC X(13)  VALUE    '031600 010528'.
               05  FILLER   PIC X(13)  VALUE    '031601 010528'.
               05  FILLER   PIC X(13)  VALUE    '031602 010528'.
               05  FILLER   PIC X(13)  VALUE    '031603 010528'.
               05  FILLER   PIC X(13)  VALUE    '031604 010528'.
               05  FILLER   PIC X(13)  VALUE    '031605 010528'.
               05  FILLER   PIC X(13)  VALUE    '031606 010528'.
               05  FILLER   PIC X(13)  VALUE    '031607 010528'.
               05  FILLER   PIC X(13)  VALUE    '031608 010528'.
               05  FILLER   PIC X(13)  VALUE    '031609 010528'.
               05  FILLER   PIC X(13)  VALUE    '031610 010528'.
               05  FILLER   PIC X(13)  VALUE    '031611 010528'.
               05  FILLER   PIC X(13)  VALUE    '031612 010528'.
               05  FILLER   PIC X(13)  VALUE    '031613 010528'.
               05  FILLER   PIC X(13)  VALUE    '031614 010528'.
               05  FILLER   PIC X(13)  VALUE    '031615 010528'.
               05  FILLER   PIC X(13)  VALUE    '031616 010528'.
               05  FILLER   PIC X(13)  VALUE    '032000 010528'.
               05  FILLER   PIC X(13)  VALUE    '032001 010528'.
               05  FILLER   PIC X(13)  VALUE    '032004 010528'.
               05  FILLER   PIC X(13)  VALUE    '032005 010528'.
               05  FILLER   PIC X(13)  VALUE    '032006 010528'.
               05  FILLER   PIC X(13)  VALUE    '033025 010528'.
               05  FILLER   PIC X(13)  VALUE    '033028 010528'.
               05  FILLER   PIC X(13)  VALUE    '033029 010528'.
               05  FILLER   PIC X(13)  VALUE    '033032 010528'.
               05  FILLER   PIC X(13)  VALUE    '033036 010528'.
               05  FILLER   PIC X(13)  VALUE    '033037 010528'.
               05  FILLER   PIC X(13)  VALUE    '033038 010528'.
               05  FILLER   PIC X(13)  VALUE    '033039 010528'.
               05  FILLER   PIC X(13)  VALUE    '033040 010528'.
               05  FILLER   PIC X(13)  VALUE    '033041 011117'.
               05  FILLER   PIC X(13)  VALUE    '033302 010528'.
               05  FILLER   PIC X(13)  VALUE    '034004 010528'.
               05  FILLER   PIC X(13)  VALUE    '034013 010528'.
               05  FILLER   PIC X(13)  VALUE    '034021 010528'.
               05  FILLER   PIC X(13)  VALUE    '034022 010528'.
               05  FILLER   PIC X(13)  VALUE    '034024 010528'.
               05  FILLER   PIC X(13)  VALUE    '034026 010528'.
               05  FILLER   PIC X(13)  VALUE    '034028 010528'.
               05  FILLER   PIC X(13)  VALUE    '034030 010528'.
               05  FILLER   PIC X(13)  VALUE    '034031 010528'.
               05  FILLER   PIC X(13)  VALUE    '034032 010528'.
               05  FILLER   PIC X(13)  VALUE    '034509 010528'.
               05  FILLER   PIC X(13)  VALUE    '034512 010528'.
               05  FILLER   PIC X(13)  VALUE    '034515 010528'.
               05  FILLER   PIC X(13)  VALUE    '034518 010528'.
               05  FILLER   PIC X(13)  VALUE    '034520 010528'.
               05  FILLER   PIC X(13)  VALUE    '034521 010528'.
               05  FILLER   PIC X(13)  VALUE    '034523 010528'.
               05  FILLER   PIC X(13)  VALUE    '034524 010528'.
               05  FILLER   PIC X(13)  VALUE    '034682 010528'.
               05  FILLER   PIC X(13)  VALUE    '034684 010528'.
               05  FILLER   PIC X(13)  VALUE    '037030 010528'.
               05  FILLER   PIC X(13)  VALUE    '037255 010528'.
               05  FILLER   PIC X(13)  VALUE    '037256 010528'.
               05  FILLER   PIC X(13)  VALUE    '037257 010528'.
               05  FILLER   PIC X(13)  VALUE    '037258 010528'.
               05  FILLER   PIC X(13)  VALUE    '037259 010528'.
               05  FILLER   PIC X(13)  VALUE    '037260 010528'.
               05  FILLER   PIC X(13)  VALUE    '037261 010528'.
               05  FILLER   PIC X(13)  VALUE    '037262 010528'.
               05  FILLER   PIC X(13)  VALUE    '037263 010528'.
               05  FILLER   PIC X(13)  VALUE    '037264 010528'.
               05  FILLER   PIC X(13)  VALUE    '037265 010528'.
               05  FILLER   PIC X(13)  VALUE    '037266 011117'.
               05  FILLER   PIC X(13)  VALUE    '037267 010528'.
               05  FILLER   PIC X(13)  VALUE    '037268 010528'.
               05  FILLER   PIC X(13)  VALUE    '037269 010528'.
               05  FILLER   PIC X(13)  VALUE    '037270 010528'.
               05  FILLER   PIC X(13)  VALUE    '037271 010528'.
               05  FILLER   PIC X(13)  VALUE    '037272 010528'.
               05  FILLER   PIC X(13)  VALUE    '037273 010528'.
               05  FILLER   PIC X(13)  VALUE    '037274 010528'.
               05  FILLER   PIC X(13)  VALUE    '037275 010528'.
               05  FILLER   PIC X(13)  VALUE    '037276 010528'.
               05  FILLER   PIC X(13)  VALUE    '037277 010528'.
               05  FILLER   PIC X(13)  VALUE    '037278 010528'.
               05  FILLER   PIC X(13)  VALUE    '037279 010528'.
               05  FILLER   PIC X(13)  VALUE    '037280 010528'.
               05  FILLER   PIC X(13)  VALUE    '037281 010528'.
               05  FILLER   PIC X(13)  VALUE    '037282 010528'.
               05  FILLER   PIC X(13)  VALUE    '037283 010528'.
               05  FILLER   PIC X(13)  VALUE    '037284 010528'.
               05  FILLER   PIC X(13)  VALUE    '037285 010528'.
               05  FILLER   PIC X(13)  VALUE    '037286 010528'.
               05  FILLER   PIC X(13)  VALUE    '037287 010528'.
               05  FILLER   PIC X(13)  VALUE    '037288 010528'.
               05  FILLER   PIC X(13)  VALUE    '037289 010528'.
               05  FILLER   PIC X(13)  VALUE    '037290 011117'.
               05  FILLER   PIC X(13)  VALUE    '037291 010528'.
               05  FILLER   PIC X(13)  VALUE    '037292 010528'.
               05  FILLER   PIC X(13)  VALUE    '037293 010528'.
               05  FILLER   PIC X(13)  VALUE    '037294 010528'.
               05  FILLER   PIC X(13)  VALUE    '037295 010528'.
               05  FILLER   PIC X(13)  VALUE    '037296 010528'.
               05  FILLER   PIC X(13)  VALUE    '037297 010528'.
               05  FILLER   PIC X(13)  VALUE    '037298 010528'.
               05  FILLER   PIC X(13)  VALUE    '037299 010528'.
               05  FILLER   PIC X(13)  VALUE    '037324 010528'.
               05  FILLER   PIC X(13)  VALUE    '037400 010528'.
               05  FILLER   PIC X(13)  VALUE    '037401 010528'.
               05  FILLER   PIC X(13)  VALUE    '037402 010528'.
               05  FILLER   PIC X(13)  VALUE    '037403 010528'.
               05  FILLER   PIC X(13)  VALUE    '037404 012827'.
               05  FILLER   PIC X(13)  VALUE    '037405 010528'.
               05  FILLER   PIC X(13)  VALUE    '037406 010528'.
               05  FILLER   PIC X(13)  VALUE    '037407 010528'.
               05  FILLER   PIC X(13)  VALUE    '037409 010528'.
               05  FILLER   PIC X(13)  VALUE    '037410 010528'.
               05  FILLER   PIC X(13)  VALUE    '037411 010528'.
               05  FILLER   PIC X(13)  VALUE    '037413 010528'.
               05  FILLER   PIC X(13)  VALUE    '04S002 007098'.
               05  FILLER   PIC X(13)  VALUE    '04S011 007098'.
               05  FILLER   PIC X(13)  VALUE    '04S014 007224'.
               05  FILLER   PIC X(13)  VALUE    '04S015 007098'.
               05  FILLER   PIC X(13)  VALUE    '04S017 007098'.
               05  FILLER   PIC X(13)  VALUE    '04S019 007098'.
               05  FILLER   PIC X(13)  VALUE    '04S020 007797'.
               05  FILLER   PIC X(13)  VALUE    '04S021 008114'.
               05  FILLER   PIC X(13)  VALUE    '04S027 007098'.
               05  FILLER   PIC X(13)  VALUE    '04S029 008114'.
               05  FILLER   PIC X(13)  VALUE    '04S047 007245'.
               05  FILLER   PIC X(13)  VALUE    '04S055 007648'.
               05  FILLER   PIC X(13)  VALUE    '04S071 008038'.
               05  FILLER   PIC X(13)  VALUE    '04S074 008114'.
               05  FILLER   PIC X(13)  VALUE    '04S078 008908'.
               05  FILLER   PIC X(13)  VALUE    '04S080 007098'.
               05  FILLER   PIC X(13)  VALUE    '04S084 008114'.
               05  FILLER   PIC X(13)  VALUE    '04S114 008114'.
               05  FILLER   PIC X(13)  VALUE    '04S119 007098'.
               05  FILLER   PIC X(13)  VALUE    '04S132 008908'.
               05  FILLER   PIC X(13)  VALUE    '04S153 007098'.
               05  FILLER   PIC X(13)  VALUE    '04T002 007098'.
               05  FILLER   PIC X(13)  VALUE    '04T014 007224'.
               05  FILLER   PIC X(13)  VALUE    '04T015 007098'.
               05  FILLER   PIC X(13)  VALUE    '04T022 008108'.
               05  FILLER   PIC X(13)  VALUE    '04T027 007098'.
               05  FILLER   PIC X(13)  VALUE    '04T036 008114'.
               05  FILLER   PIC X(13)  VALUE    '04T039 007209'.
               05  FILLER   PIC X(13)  VALUE    '04T041 007098'.
               05  FILLER   PIC X(13)  VALUE    '04T062 007648'.
               05  FILLER   PIC X(13)  VALUE    '04T071 008038'.
               05  FILLER   PIC X(13)  VALUE    '04T078 008908'.
               05  FILLER   PIC X(13)  VALUE    '04T084 008114'.
               05  FILLER   PIC X(13)  VALUE    '04T085 007098'.
               05  FILLER   PIC X(13)  VALUE    '04T088 007098'.
               05  FILLER   PIC X(13)  VALUE    '04T118 007797'.
               05  FILLER   PIC X(13)  VALUE    '04T119 007098'.
               05  FILLER   PIC X(13)  VALUE    '04U001 008108'.
               05  FILLER   PIC X(13)  VALUE    '04U002 007098'.
               05  FILLER   PIC X(13)  VALUE    '04U011 007098'.
               05  FILLER   PIC X(13)  VALUE    '04U015 007098'.
               05  FILLER   PIC X(13)  VALUE    '04U039 007098'.
               05  FILLER   PIC X(13)  VALUE    '04U050 007098'.
               05  FILLER   PIC X(13)  VALUE    '04U051 007098'.
               05  FILLER   PIC X(13)  VALUE    '04U067 007098'.
               05  FILLER   PIC X(13)  VALUE    '04U072 007098'.
               05  FILLER   PIC X(13)  VALUE    '04U076 007098'.
               05  FILLER   PIC X(13)  VALUE    '04U081 007098'.
               05  FILLER   PIC X(13)  VALUE    '04U091 007098'.
               05  FILLER   PIC X(13)  VALUE    '04Z309 007098'.
               05  FILLER   PIC X(13)  VALUE    '04Z324 007098'.
               05  FILLER   PIC X(13)  VALUE    '040001 008108'.
               05  FILLER   PIC X(13)  VALUE    '040002 007098'.
               05  FILLER   PIC X(13)  VALUE    '040004 008108'.
               05  FILLER   PIC X(13)  VALUE    '040007 008114'.
               05  FILLER   PIC X(13)  VALUE    '040010 008108'.
               05  FILLER   PIC X(13)  VALUE    '040011 007098'.
               05  FILLER   PIC X(13)  VALUE    '040014 008114'.
               05  FILLER   PIC X(13)  VALUE    '040015 007098'.
               05  FILLER   PIC X(13)  VALUE    '040016 008114'.
               05  FILLER   PIC X(13)  VALUE    '040017 008000'.
               05  FILLER   PIC X(13)  VALUE    '040018 007648'.
               05  FILLER   PIC X(13)  VALUE    '040019 007098'.
               05  FILLER   PIC X(13)  VALUE    '040020 008421'.
               05  FILLER   PIC X(13)  VALUE    '040022 008108'.
               05  FILLER   PIC X(13)  VALUE    '040026 008908'.
               05  FILLER   PIC X(13)  VALUE    '040027 007943'.
               05  FILLER   PIC X(13)  VALUE    '040029 008114'.
               05  FILLER   PIC X(13)  VALUE    '040036 008114'.
               05  FILLER   PIC X(13)  VALUE    '040039 007209'.
               05  FILLER   PIC X(13)  VALUE    '040041 008114'.
               05  FILLER   PIC X(13)  VALUE    '040047 007579'.
               05  FILLER   PIC X(13)  VALUE    '040050 007098'.
               05  FILLER   PIC X(13)  VALUE    '040051 007098'.
               05  FILLER   PIC X(13)  VALUE    '040055 007648'.
               05  FILLER   PIC X(13)  VALUE    '040062 008000'.
               05  FILLER   PIC X(13)  VALUE    '040067 007446'.
               05  FILLER   PIC X(13)  VALUE    '040069 007579'.
               05  FILLER   PIC X(13)  VALUE    '040071 008114'.
               05  FILLER   PIC X(13)  VALUE    '040072 007098'.
               05  FILLER   PIC X(13)  VALUE    '040074 008114'.
               05  FILLER   PIC X(13)  VALUE    '040076 008716'.
               05  FILLER   PIC X(13)  VALUE    '040078 008908'.
               05  FILLER   PIC X(13)  VALUE    '040080 007098'.
               05  FILLER   PIC X(13)  VALUE    '040084 008114'.
               05  FILLER   PIC X(13)  VALUE    '040085 008421'.
               05  FILLER   PIC X(13)  VALUE    '040088 007842'.
               05  FILLER   PIC X(13)  VALUE    '040114 008114'.
               05  FILLER   PIC X(13)  VALUE    '040118 007797'.
               05  FILLER   PIC X(13)  VALUE    '040119 007579'.
               05  FILLER   PIC X(13)  VALUE    '040132 008908'.
               05  FILLER   PIC X(13)  VALUE    '040134 008114'.
               05  FILLER   PIC X(13)  VALUE    '040137 008114'.
               05  FILLER   PIC X(13)  VALUE    '040147 008114'.
               05  FILLER   PIC X(13)  VALUE    '040152 008108'.
               05  FILLER   PIC X(13)  VALUE    '040153 007098'.
               05  FILLER   PIC X(13)  VALUE    '040154 008114'.
               05  FILLER   PIC X(13)  VALUE    '040155 007797'.
               05  FILLER   PIC X(13)  VALUE    '040156 008713'.
               05  FILLER   PIC X(13)  VALUE    '041502 007648'.
               05  FILLER   PIC X(13)  VALUE    '041505 007098'.
               05  FILLER   PIC X(13)  VALUE    '041509 007098'.
               05  FILLER   PIC X(13)  VALUE    '041510 008713'.
               05  FILLER   PIC X(13)  VALUE    '041515 007648'.
               05  FILLER   PIC X(13)  VALUE    '041528 008114'.
               05  FILLER   PIC X(13)  VALUE    '041531 007098'.
               05  FILLER   PIC X(13)  VALUE    '041532 008803'.
               05  FILLER   PIC X(13)  VALUE    '041537 008114'.
               05  FILLER   PIC X(13)  VALUE    '041539 007098'.
               05  FILLER   PIC X(13)  VALUE    '041568 007098'.
               05  FILLER   PIC X(13)  VALUE    '041571 007098'.
               05  FILLER   PIC X(13)  VALUE    '041574 007098'.
               05  FILLER   PIC X(13)  VALUE    '041580 007098'.
               05  FILLER   PIC X(13)  VALUE    '042006 007648'.
               05  FILLER   PIC X(13)  VALUE    '042009 008108'.
               05  FILLER   PIC X(13)  VALUE    '042010 008114'.
               05  FILLER   PIC X(13)  VALUE    '042012 008114'.
               05  FILLER   PIC X(13)  VALUE    '043026 008114'.
               05  FILLER   PIC X(13)  VALUE    '043028 007648'.
               05  FILLER   PIC X(13)  VALUE    '043029 007797'.
               05  FILLER   PIC X(13)  VALUE    '043031 008114'.
               05  FILLER   PIC X(13)  VALUE    '043032 008108'.
               05  FILLER   PIC X(13)  VALUE    '043034 007098'.
               05  FILLER   PIC X(13)  VALUE    '043035 008908'.
               05  FILLER   PIC X(13)  VALUE    '043300 008114'.
               05  FILLER   PIC X(13)  VALUE    '043301 008239'.
               05  FILLER   PIC X(13)  VALUE    '044004 008108'.
               05  FILLER   PIC X(13)  VALUE    '044005 008114'.
               05  FILLER   PIC X(13)  VALUE    '044006 007648'.
               05  FILLER   PIC X(13)  VALUE    '044007 008114'.
               05  FILLER   PIC X(13)  VALUE    '044011 008114'.
               05  FILLER   PIC X(13)  VALUE    '044019 008108'.
               05  FILLER   PIC X(13)  VALUE    '044022 008114'.
               05  FILLER   PIC X(13)  VALUE    '044503 007098'.
               05  FILLER   PIC X(13)  VALUE    '044504 008114'.
               05  FILLER   PIC X(13)  VALUE    '044505 008908'.
               05  FILLER   PIC X(13)  VALUE    '044511 008114'.
               05  FILLER   PIC X(13)  VALUE    '044603 008114'.
               05  FILLER   PIC X(13)  VALUE    '044604 008114'.
               05  FILLER   PIC X(13)  VALUE    '044605 008108'.
               05  FILLER   PIC X(13)  VALUE    '044608 007098'.
               05  FILLER   PIC X(13)  VALUE    '044614 007098'.
               05  FILLER   PIC X(13)  VALUE    '05B121 012500'.
               05  FILLER   PIC X(13)  VALUE    '05S007 017251'.
               05  FILLER   PIC X(13)  VALUE    '05S013 015177'.
               05  FILLER   PIC X(13)  VALUE    '05S024 012500'.
               05  FILLER   PIC X(13)  VALUE    '05S025 012500'.
               05  FILLER   PIC X(13)  VALUE    '05S026 012500'.
               05  FILLER   PIC X(13)  VALUE    '05S038 017827'.
               05  FILLER   PIC X(13)  VALUE    '05S040 012827'.
               05  FILLER   PIC X(13)  VALUE    '05S047 017251'.
               05  FILLER   PIC X(13)  VALUE    '05S057 012500'.
               05  FILLER   PIC X(13)  VALUE    '05S058 012827'.
               05  FILLER   PIC X(13)  VALUE    '05S069 012500'.
               05  FILLER   PIC X(13)  VALUE    '05S077 012500'.
               05  FILLER   PIC X(13)  VALUE    '05S078 012827'.
               05  FILLER   PIC X(13)  VALUE    '05S082 011769'.
               05  FILLER   PIC X(13)  VALUE    '05S089 012500'.
               05  FILLER   PIC X(13)  VALUE    '05S113 017251'.
               05  FILLER   PIC X(13)  VALUE    '05S114 012827'.
               05  FILLER   PIC X(13)  VALUE    '05S115 012500'.
               05  FILLER   PIC X(13)  VALUE    '05S116 012827'.
               05  FILLER   PIC X(13)  VALUE    '05S124 012827'.
               05  FILLER   PIC X(13)  VALUE    '05S127 015862'.
               05  FILLER   PIC X(13)  VALUE    '05S128 012500'.
               05  FILLER   PIC X(13)  VALUE    '05S132 012827'.
               05  FILLER   PIC X(13)  VALUE    '05S138 012827'.
               05  FILLER   PIC X(13)  VALUE    '05S144 012827'.
               05  FILLER   PIC X(13)  VALUE    '05S145 017986'.
               05  FILLER   PIC X(13)  VALUE    '05S152 017251'.
               05  FILLER   PIC X(13)  VALUE    '05S158 012827'.
               05  FILLER   PIC X(13)  VALUE    '05S197 017251'.
               05  FILLER   PIC X(13)  VALUE    '05S205 012827'.
               05  FILLER   PIC X(13)  VALUE    '05S228 017251'.
               05  FILLER   PIC X(13)  VALUE    '05S239 012827'.
               05  FILLER   PIC X(13)  VALUE    '05S243 012500'.
               05  FILLER   PIC X(13)  VALUE    '05S245 012500'.
               05  FILLER   PIC X(13)  VALUE    '05S257 012500'.
               05  FILLER   PIC X(13)  VALUE    '05S272 012500'.
               05  FILLER   PIC X(13)  VALUE    '05S276 016900'.
               05  FILLER   PIC X(13)  VALUE    '05S283 016900'.
               05  FILLER   PIC X(13)  VALUE    '05S289 017251'.
               05  FILLER   PIC X(13)  VALUE    '05S305 016900'.
               05  FILLER   PIC X(13)  VALUE    '05S308 017827'.
               05  FILLER   PIC X(13)  VALUE    '05S320 016900'.
               05  FILLER   PIC X(13)  VALUE    '05S329 012500'.
               05  FILLER   PIC X(13)  VALUE    '05S348 012500'.
               05  FILLER   PIC X(13)  VALUE    '05S360 017538'.
               05  FILLER   PIC X(13)  VALUE    '05S373 012827'.
               05  FILLER   PIC X(13)  VALUE    '05S376 012827'.
               05  FILLER   PIC X(13)  VALUE    '05S380 017827'.
               05  FILLER   PIC X(13)  VALUE    '05S426 012500'.
               05  FILLER   PIC X(13)  VALUE    '05S438 012827'.
               05  FILLER   PIC X(13)  VALUE    '05S441 017827'.
               05  FILLER   PIC X(13)  VALUE    '05S457 017251'.
               05  FILLER   PIC X(13)  VALUE    '05S464 012891'.
               05  FILLER   PIC X(13)  VALUE    '05S526 012500'.
               05  FILLER   PIC X(13)  VALUE    '05S567 012500'.
               05  FILLER   PIC X(13)  VALUE    '05S580 012500'.
               05  FILLER   PIC X(13)  VALUE    '05S581 012827'.
               05  FILLER   PIC X(13)  VALUE    '05S624 012827'.
               05  FILLER   PIC X(13)  VALUE    '05S636 012500'.
               05  FILLER   PIC X(13)  VALUE    '05S739 012827'.
               05  FILLER   PIC X(13)  VALUE    '05S744 012500'.
               05  FILLER   PIC X(13)  VALUE    '05S745 012500'.
               05  FILLER   PIC X(13)  VALUE    '05S747 012500'.
               05  FILLER   PIC X(13)  VALUE    '05S755 012827'.
               05  FILLER   PIC X(13)  VALUE    '05S757 012500'.
               05  FILLER   PIC X(13)  VALUE    '05S764 013950'.
               05  FILLER   PIC X(13)  VALUE    '05S765 012827'.
               05  FILLER   PIC X(13)  VALUE    '05T006 012500'.
               05  FILLER   PIC X(13)  VALUE    '05T007 015659'.
               05  FILLER   PIC X(13)  VALUE    '05T008 017251'.
               05  FILLER   PIC X(13)  VALUE    '05T009 015177'.
               05  FILLER   PIC X(13)  VALUE    '05T016 012805'.
               05  FILLER   PIC X(13)  VALUE    '05T017 015862'.
               05  FILLER   PIC X(13)  VALUE    '05T018 012827'.
               05  FILLER   PIC X(13)  VALUE    '05T024 012500'.
               05  FILLER   PIC X(13)  VALUE    '05T026 012500'.
               05  FILLER   PIC X(13)  VALUE    '05T038 017827'.
               05  FILLER   PIC X(13)  VALUE    '05T039 012500'.
               05  FILLER   PIC X(13)  VALUE    '05T043 016900'.
               05  FILLER   PIC X(13)  VALUE    '05T057 012500'.
               05  FILLER   PIC X(13)  VALUE    '05T058 012827'.
               05  FILLER   PIC X(13)  VALUE    '05T060 012500'.
               05  FILLER   PIC X(13)  VALUE    '05T063 012827'.
               05  FILLER   PIC X(13)  VALUE    '05T073 016960'.
               05  FILLER   PIC X(13)  VALUE    '05T078 012827'.
               05  FILLER   PIC X(13)  VALUE    '05T082 014349'.
               05  FILLER   PIC X(13)  VALUE    '05T100 012500'.
               05  FILLER   PIC X(13)  VALUE    '05T103 012827'.
               05  FILLER   PIC X(13)  VALUE    '05T107 012805'.
               05  FILLER   PIC X(13)  VALUE    '05T115 012500'.
               05  FILLER   PIC X(13)  VALUE    '05T116 012827'.
               05  FILLER   PIC X(13)  VALUE    '05T126 012827'.
               05  FILLER   PIC X(13)  VALUE    '05T128 012500'.
               05  FILLER   PIC X(13)  VALUE    '05T135 012827'.
               05  FILLER   PIC X(13)  VALUE    '05T140 011756'.
               05  FILLER   PIC X(13)  VALUE    '05T144 012827'.
               05  FILLER   PIC X(13)  VALUE    '05T145 017986'.
               05  FILLER   PIC X(13)  VALUE    '05T152 017251'.
               05  FILLER   PIC X(13)  VALUE    '05T158 012827'.
               05  FILLER   PIC X(13)  VALUE    '05T167 014015'.
               05  FILLER   PIC X(13)  VALUE    '05T168 012500'.
               05  FILLER   PIC X(13)  VALUE    '05T169 012827'.
               05  FILLER   PIC X(13)  VALUE    '05T174 016085'.
               05  FILLER   PIC X(13)  VALUE    '05T180 016900'.
               05  FILLER   PIC X(13)  VALUE    '05T188 017827'.
               05  FILLER   PIC X(13)  VALUE    '05T191 012827'.
               05  FILLER   PIC X(13)  VALUE    '05T204 012827'.
               05  FILLER   PIC X(13)  VALUE    '05T224 012500'.
               05  FILLER   PIC X(13)  VALUE    '05T235 012827'.
               05  FILLER   PIC X(13)  VALUE    '05T236 014349'.
               05  FILLER   PIC X(13)  VALUE    '05T238 012827'.
               05  FILLER   PIC X(13)  VALUE    '05T239 012827'.
               05  FILLER   PIC X(13)  VALUE    '05T242 019025'.
               05  FILLER   PIC X(13)  VALUE    '05T243 012500'.
               05  FILLER   PIC X(13)  VALUE    '05T248 017986'.
               05  FILLER   PIC X(13)  VALUE    '05T278 012827'.
               05  FILLER   PIC X(13)  VALUE    '05T281 012827'.
               05  FILLER   PIC X(13)  VALUE    '05T305 016900'.
               05  FILLER   PIC X(13)  VALUE    '05T308 017827'.
               05  FILLER   PIC X(13)  VALUE    '05T309 015862'.
               05  FILLER   PIC X(13)  VALUE    '05T320 016900'.
               05  FILLER   PIC X(13)  VALUE    '05T327 012500'.
               05  FILLER   PIC X(13)  VALUE    '05T336 014015'.
               05  FILLER   PIC X(13)  VALUE    '05T348 012500'.
               05  FILLER   PIC X(13)  VALUE    '05T380 017827'.
               05  FILLER   PIC X(13)  VALUE    '05T382 012827'.
               05  FILLER   PIC X(13)  VALUE    '05T396 013666'.
               05  FILLER   PIC X(13)  VALUE    '05T417 012500'.
               05  FILLER   PIC X(13)  VALUE    '05T438 012827'.
               05  FILLER   PIC X(13)  VALUE    '05T441 017827'.
               05  FILLER   PIC X(13)  VALUE    '05T457 017251'.
               05  FILLER   PIC X(13)  VALUE    '05T469 012500'.
               05  FILLER   PIC X(13)  VALUE    '05T471 012827'.
               05  FILLER   PIC X(13)  VALUE    '05T485 012827'.
               05  FILLER   PIC X(13)  VALUE    '05T502 012827'.
               05  FILLER   PIC X(13)  VALUE    '05T503 012500'.
               05  FILLER   PIC X(13)  VALUE    '05T549 014349'.
               05  FILLER   PIC X(13)  VALUE    '05T567 012500'.
               05  FILLER   PIC X(13)  VALUE    '05T573 012500'.
               05  FILLER   PIC X(13)  VALUE    '05T580 012500'.
               05  FILLER   PIC X(13)  VALUE    '05T581 012827'.
               05  FILLER   PIC X(13)  VALUE    '05T583 012500'.
               05  FILLER   PIC X(13)  VALUE    '05T599 015862'.
               05  FILLER   PIC X(13)  VALUE    '05T624 012827'.
               05  FILLER   PIC X(13)  VALUE    '05T625 012827'.
               05  FILLER   PIC X(13)  VALUE    '05T668 017251'.
               05  FILLER   PIC X(13)  VALUE    '05T696 012827'.
               05  FILLER   PIC X(13)  VALUE    '05T699 013950'.
               05  FILLER   PIC X(13)  VALUE    '05T717 012827'.
               05  FILLER   PIC X(13)  VALUE    '05T737 012827'.
               05  FILLER   PIC X(13)  VALUE    '05T739 012827'.
               05  FILLER   PIC X(13)  VALUE    '05T741 012827'.
               05  FILLER   PIC X(13)  VALUE    '05T757 012500'.
               05  FILLER   PIC X(13)  VALUE    '05T782 012827'.
               05  FILLER   PIC X(13)  VALUE    '05U046 014349'.
               05  FILLER   PIC X(13)  VALUE    '05U783 012500'.
               05  FILLER   PIC X(13)  VALUE    '050002 016923'.
               05  FILLER   PIC X(13)  VALUE    '050006 013647'.
               05  FILLER   PIC X(13)  VALUE    '050007 017301'.
               05  FILLER   PIC X(13)  VALUE    '050008 017282'.
               05  FILLER   PIC X(13)  VALUE    '050009 017282'.
               05  FILLER   PIC X(13)  VALUE    '050013 015649'.
               05  FILLER   PIC X(13)  VALUE    '050014 015862'.
               05  FILLER   PIC X(13)  VALUE    '050017 015862'.
               05  FILLER   PIC X(13)  VALUE    '050018 012827'.
               05  FILLER   PIC X(13)  VALUE    '050022 012500'.
               05  FILLER   PIC X(13)  VALUE    '050024 012500'.
               05  FILLER   PIC X(13)  VALUE    '050025 012500'.
               05  FILLER   PIC X(13)  VALUE    '050026 012500'.
               05  FILLER   PIC X(13)  VALUE    '050028 012500'.
               05  FILLER   PIC X(13)  VALUE    '050030 012500'.
               05  FILLER   PIC X(13)  VALUE    '050036 012500'.
               05  FILLER   PIC X(13)  VALUE    '050038 017827'.
               05  FILLER   PIC X(13)  VALUE    '050039 012500'.
               05  FILLER   PIC X(13)  VALUE    '050040 012827'.
               05  FILLER   PIC X(13)  VALUE    '050042 013647'.
               05  FILLER   PIC X(13)  VALUE    '050043 016923'.
               05  FILLER   PIC X(13)  VALUE    '050045 012500'.
               05  FILLER   PIC X(13)  VALUE    '050047 017282'.
               05  FILLER   PIC X(13)  VALUE    '050054 012500'.
               05  FILLER   PIC X(13)  VALUE    '050055 017282'.
               05  FILLER   PIC X(13)  VALUE    '050056 012827'.
               05  FILLER   PIC X(13)  VALUE    '050057 012500'.
               05  FILLER   PIC X(13)  VALUE    '050058 014349'.
               05  FILLER   PIC X(13)  VALUE    '050060 012500'.
               05  FILLER   PIC X(13)  VALUE    '050063 012827'.
               05  FILLER   PIC X(13)  VALUE    '050067 012891'.
               05  FILLER   PIC X(13)  VALUE    '050069 012603'.
               05  FILLER   PIC X(13)  VALUE    '050070 017301'.
               05  FILLER   PIC X(13)  VALUE    '050071 017827'.
               05  FILLER   PIC X(13)  VALUE    '050072 016900'.
               05  FILLER   PIC X(13)  VALUE    '050073 017030'.
               05  FILLER   PIC X(13)  VALUE    '050075 016923'.
               05  FILLER   PIC X(13)  VALUE    '050076 017282'.
               05  FILLER   PIC X(13)  VALUE    '050077 012500'.
               05  FILLER   PIC X(13)  VALUE    '050078 012827'.
               05  FILLER   PIC X(13)  VALUE    '050082 014349'.
               05  FILLER   PIC X(13)  VALUE    '050084 016738'.
               05  FILLER   PIC X(13)  VALUE    '050089 012603'.
               05  FILLER   PIC X(13)  VALUE    '050090 016738'.
               05  FILLER   PIC X(13)  VALUE    '050091 012827'.
               05  FILLER   PIC X(13)  VALUE    '050093 012500'.
               05  FILLER   PIC X(13)  VALUE    '050096 012827'.
               05  FILLER   PIC X(13)  VALUE    '050099 012603'.
               05  FILLER   PIC X(13)  VALUE    '050100 012500'.
               05  FILLER   PIC X(13)  VALUE    '050101 017030'.
               05  FILLER   PIC X(13)  VALUE    '050102 012500'.
               05  FILLER   PIC X(13)  VALUE    '050103 012827'.
               05  FILLER   PIC X(13)  VALUE    '050104 012827'.
               05  FILLER   PIC X(13)  VALUE    '050107 013666'.
               05  FILLER   PIC X(13)  VALUE    '050108 015862'.
               05  FILLER   PIC X(13)  VALUE    '050110 013666'.
               05  FILLER   PIC X(13)  VALUE    '050111 012827'.
               05  FILLER   PIC X(13)  VALUE    '050112 014349'.
               05  FILLER   PIC X(13)  VALUE    '050113 017301'.
               05  FILLER   PIC X(13)  VALUE    '050115 012500'.
               05  FILLER   PIC X(13)  VALUE    '050116 014349'.
               05  FILLER   PIC X(13)  VALUE    '050118 014493'.
               05  FILLER   PIC X(13)  VALUE    '050121 012500'.
               05  FILLER   PIC X(13)  VALUE    '050122 014493'.
               05  FILLER   PIC X(13)  VALUE    '050124 012827'.
               05  FILLER   PIC X(13)  VALUE    '050125 017827'.
               05  FILLER   PIC X(13)  VALUE    '050126 012827'.
               05  FILLER   PIC X(13)  VALUE    '050127 015862'.
               05  FILLER   PIC X(13)  VALUE    '050128 012500'.
               05  FILLER   PIC X(13)  VALUE    '050129 012603'.
               05  FILLER   PIC X(13)  VALUE    '050131 017538'.
               05  FILLER   PIC X(13)  VALUE    '050132 012827'.
               05  FILLER   PIC X(13)  VALUE    '050133 012500'.
               05  FILLER   PIC X(13)  VALUE    '050135 012827'.
               05  FILLER   PIC X(13)  VALUE    '050136 016738'.
               05  FILLER   PIC X(13)  VALUE    '050137 014349'.
               05  FILLER   PIC X(13)  VALUE    '050138 012827'.
               05  FILLER   PIC X(13)  VALUE    '050139 012827'.
               05  FILLER   PIC X(13)  VALUE    '050140 012603'.
               05  FILLER   PIC X(13)  VALUE    '050145 017986'.
               05  FILLER   PIC X(13)  VALUE    '050146 012827'.
               05  FILLER   PIC X(13)  VALUE    '050149 014349'.
               05  FILLER   PIC X(13)  VALUE    '050150 015862'.
               05  FILLER   PIC X(13)  VALUE    '050152 017282'.
               05  FILLER   PIC X(13)  VALUE    '050153 017827'.
               05  FILLER   PIC X(13)  VALUE    '050158 012827'.
               05  FILLER   PIC X(13)  VALUE    '050159 014349'.
               05  FILLER   PIC X(13)  VALUE    '050167 014493'.
               05  FILLER   PIC X(13)  VALUE    '050168 012603'.
               05  FILLER   PIC X(13)  VALUE    '050169 012827'.
               05  FILLER   PIC X(13)  VALUE    '050174 017282'.
               05  FILLER   PIC X(13)  VALUE    '050179 012891'.
               05  FILLER   PIC X(13)  VALUE    '050180 016900'.
               05  FILLER   PIC X(13)  VALUE    '050189 017986'.
               05  FILLER   PIC X(13)  VALUE    '050191 012827'.
               05  FILLER   PIC X(13)  VALUE    '050192 012500'.
               05  FILLER   PIC X(13)  VALUE    '050194 019025'.
               05  FILLER   PIC X(13)  VALUE    '050195 019025'.
               05  FILLER   PIC X(13)  VALUE    '050196 012500'.
               05  FILLER   PIC X(13)  VALUE    '050197 017827'.
               05  FILLER   PIC X(13)  VALUE    '050204 012827'.
               05  FILLER   PIC X(13)  VALUE    '050205 012827'.
               05  FILLER   PIC X(13)  VALUE    '050211 016923'.
               05  FILLER   PIC X(13)  VALUE    '050222 012500'.
               05  FILLER   PIC X(13)  VALUE    '050224 012603'.
               05  FILLER   PIC X(13)  VALUE    '050225 012500'.
               05  FILLER   PIC X(13)  VALUE    '050226 012603'.
               05  FILLER   PIC X(13)  VALUE    '050228 017282'.
               05  FILLER   PIC X(13)  VALUE    '050230 012603'.
               05  FILLER   PIC X(13)  VALUE    '050231 012827'.
               05  FILLER   PIC X(13)  VALUE    '050232 012805'.
               05  FILLER   PIC X(13)  VALUE    '050234 012500'.
               05  FILLER   PIC X(13)  VALUE    '050235 014349'.
               05  FILLER   PIC X(13)  VALUE    '050236 014349'.
               05  FILLER   PIC X(13)  VALUE    '050238 012827'.
               05  FILLER   PIC X(13)  VALUE    '050239 012827'.
               05  FILLER   PIC X(13)  VALUE    '050242 019025'.
               05  FILLER   PIC X(13)  VALUE    '050243 012500'.
               05  FILLER   PIC X(13)  VALUE    '050245 012603'.
               05  FILLER   PIC X(13)  VALUE    '050248 017986'.
               05  FILLER   PIC X(13)  VALUE    '050254 015862'.
               05  FILLER   PIC X(13)  VALUE    '050257 012500'.
               05  FILLER   PIC X(13)  VALUE    '050261 012500'.
               05  FILLER   PIC X(13)  VALUE    '050262 014349'.
               05  FILLER   PIC X(13)  VALUE    '050272 012603'.
               05  FILLER   PIC X(13)  VALUE    '050276 016900'.
               05  FILLER   PIC X(13)  VALUE    '050278 014349'.
               05  FILLER   PIC X(13)  VALUE    '050279 012603'.
               05  FILLER   PIC X(13)  VALUE    '050280 013950'.
               05  FILLER   PIC X(13)  VALUE    '050281 012827'.
               05  FILLER   PIC X(13)  VALUE    '050283 016923'.
               05  FILLER   PIC X(13)  VALUE    '050289 017301'.
               05  FILLER   PIC X(13)  VALUE    '050290 014349'.
               05  FILLER   PIC X(13)  VALUE    '050291 016738'.
               05  FILLER   PIC X(13)  VALUE    '050292 012500'.
               05  FILLER   PIC X(13)  VALUE    '050295 012500'.
               05  FILLER   PIC X(13)  VALUE    '050296 017827'.
               05  FILLER   PIC X(13)  VALUE    '050298 012603'.
               05  FILLER   PIC X(13)  VALUE    '050300 012603'.
               05  FILLER   PIC X(13)  VALUE    '050301 012500'.
               05  FILLER   PIC X(13)  VALUE    '050305 016923'.
               05  FILLER   PIC X(13)  VALUE    '050308 019025'.
               05  FILLER   PIC X(13)  VALUE    '050309 015862'.
               05  FILLER   PIC X(13)  VALUE    '050313 014493'.
               05  FILLER   PIC X(13)  VALUE    '050315 012500'.
               05  FILLER   PIC X(13)  VALUE    '050320 016923'.
               05  FILLER   PIC X(13)  VALUE    '050324 012500'.
               05  FILLER   PIC X(13)  VALUE    '050327 012603'.
               05  FILLER   PIC X(13)  VALUE    '050329 012500'.
               05  FILLER   PIC X(13)  VALUE    '050334 019025'.
               05  FILLER   PIC X(13)  VALUE    '050335 012500'.
               05  FILLER   PIC X(13)  VALUE    '050336 014493'.
               05  FILLER   PIC X(13)  VALUE    '050342 012500'.
               05  FILLER   PIC X(13)  VALUE    '050348 012603'.
               05  FILLER   PIC X(13)  VALUE    '050350 012827'.
               05  FILLER   PIC X(13)  VALUE    '050351 012827'.
               05  FILLER   PIC X(13)  VALUE    '050352 015862'.
               05  FILLER   PIC X(13)  VALUE    '050353 012827'.
               05  FILLER   PIC X(13)  VALUE    '050357 013666'.
               05  FILLER   PIC X(13)  VALUE    '050359 012500'.
               05  FILLER   PIC X(13)  VALUE    '050360 017538'.
               05  FILLER   PIC X(13)  VALUE    '050367 017030'.
               05  FILLER   PIC X(13)  VALUE    '050373 012827'.
               05  FILLER   PIC X(13)  VALUE    '050376 012827'.
               05  FILLER   PIC X(13)  VALUE    '050378 012827'.
               05  FILLER   PIC X(13)  VALUE    '050380 017827'.
               05  FILLER   PIC X(13)  VALUE    '050382 012827'.
               05  FILLER   PIC X(13)  VALUE    '050390 012500'.
               05  FILLER   PIC X(13)  VALUE    '050393 012827'.
               05  FILLER   PIC X(13)  VALUE    '050394 014349'.
               05  FILLER   PIC X(13)  VALUE    '050396 013666'.
               05  FILLER   PIC X(13)  VALUE    '050397 012500'.
               05  FILLER   PIC X(13)  VALUE    '050407 017282'.
               05  FILLER   PIC X(13)  VALUE    '050411 012827'.
               05  FILLER   PIC X(13)  VALUE    '050414 015862'.
               05  FILLER   PIC X(13)  VALUE    '050417 012500'.
               05  FILLER   PIC X(13)  VALUE    '050423 012500'.
               05  FILLER   PIC X(13)  VALUE    '050424 012500'.
               05  FILLER   PIC X(13)  VALUE    '050425 015862'.
               05  FILLER   PIC X(13)  VALUE    '050426 012603'.
               05  FILLER   PIC X(13)  VALUE    '050434 012500'.
               05  FILLER   PIC X(13)  VALUE    '050435 012500'.
               05  FILLER   PIC X(13)  VALUE    '050438 014349'.
               05  FILLER   PIC X(13)  VALUE    '050441 017827'.
               05  FILLER   PIC X(13)  VALUE    '050444 013285'.
               05  FILLER   PIC X(13)  VALUE    '050454 017282'.
               05  FILLER   PIC X(13)  VALUE    '050455 012500'.
               05  FILLER   PIC X(13)  VALUE    '050457 017282'.
               05  FILLER   PIC X(13)  VALUE    '050464 012891'.
               05  FILLER   PIC X(13)  VALUE    '050468 012827'.
               05  FILLER   PIC X(13)  VALUE    '050471 012827'.
               05  FILLER   PIC X(13)  VALUE    '050481 014349'.
               05  FILLER   PIC X(13)  VALUE    '050485 012827'.
               05  FILLER   PIC X(13)  VALUE    '050488 016923'.
               05  FILLER   PIC X(13)  VALUE    '050492 012500'.
               05  FILLER   PIC X(13)  VALUE    '050496 016900'.
               05  FILLER   PIC X(13)  VALUE    '050498 015862'.
               05  FILLER   PIC X(13)  VALUE    '050502 012827'.
               05  FILLER   PIC X(13)  VALUE    '050503 012500'.
               05  FILLER   PIC X(13)  VALUE    '050506 013555'.
               05  FILLER   PIC X(13)  VALUE    '050510 017538'.
               05  FILLER   PIC X(13)  VALUE    '050512 016923'.
               05  FILLER   PIC X(13)  VALUE    '050515 012500'.
               05  FILLER   PIC X(13)  VALUE    '050516 015862'.
               05  FILLER   PIC X(13)  VALUE    '050517 012603'.
               05  FILLER   PIC X(13)  VALUE    '050523 016900'.
               05  FILLER   PIC X(13)  VALUE    '050526 012603'.
               05  FILLER   PIC X(13)  VALUE    '050528 012500'.
               05  FILLER   PIC X(13)  VALUE    '050534 012500'.
               05  FILLER   PIC X(13)  VALUE    '050537 015862'.
               05  FILLER   PIC X(13)  VALUE    '050541 017301'.
               05  FILLER   PIC X(13)  VALUE    '050543 012603'.
               05  FILLER   PIC X(13)  VALUE    '050546 012500'.
               05  FILLER   PIC X(13)  VALUE    '050547 016738'.
               05  FILLER   PIC X(13)  VALUE    '050548 012603'.
               05  FILLER   PIC X(13)  VALUE    '050549 014349'.
               05  FILLER   PIC X(13)  VALUE    '050551 012603'.
               05  FILLER   PIC X(13)  VALUE    '050552 012827'.
               05  FILLER   PIC X(13)  VALUE    '050557 012891'.
               05  FILLER   PIC X(13)  VALUE    '050561 012827'.
               05  FILLER   PIC X(13)  VALUE    '050567 012603'.
               05  FILLER   PIC X(13)  VALUE    '050568 012500'.
               05  FILLER   PIC X(13)  VALUE    '050570 012603'.
               05  FILLER   PIC X(13)  VALUE    '050573 012500'.
               05  FILLER   PIC X(13)  VALUE    '050575 012827'.
               05  FILLER   PIC X(13)  VALUE    '050580 012603'.
               05  FILLER   PIC X(13)  VALUE    '050581 012827'.
               05  FILLER   PIC X(13)  VALUE    '050586 012603'.
               05  FILLER   PIC X(13)  VALUE    '050588 012827'.
               05  FILLER   PIC X(13)  VALUE    '050589 012603'.
               05  FILLER   PIC X(13)  VALUE    '050590 015862'.
               05  FILLER   PIC X(13)  VALUE    '050597 012827'.
               05  FILLER   PIC X(13)  VALUE    '050599 015862'.
               05  FILLER   PIC X(13)  VALUE    '050603 012603'.
               05  FILLER   PIC X(13)  VALUE    '050604 017827'.
               05  FILLER   PIC X(13)  VALUE    '050608 012500'.
               05  FILLER   PIC X(13)  VALUE    '050609 012603'.
               05  FILLER   PIC X(13)  VALUE    '050616 014349'.
               05  FILLER   PIC X(13)  VALUE    '050624 012827'.
               05  FILLER   PIC X(13)  VALUE    '050625 014349'.
               05  FILLER   PIC X(13)  VALUE    '050630 012500'.
               05  FILLER   PIC X(13)  VALUE    '050633 012805'.
               05  FILLER   PIC X(13)  VALUE    '050636 012500'.
               05  FILLER   PIC X(13)  VALUE    '050641 012827'.
               05  FILLER   PIC X(13)  VALUE    '050660 012827'.
               05  FILLER   PIC X(13)  VALUE    '050663 012827'.
               05  FILLER   PIC X(13)  VALUE    '050668 017282'.
               05  FILLER   PIC X(13)  VALUE    '050674 015862'.
               05  FILLER   PIC X(13)  VALUE    '050677 014349'.
               05  FILLER   PIC X(13)  VALUE    '050678 012603'.
               05  FILLER   PIC X(13)  VALUE    '050684 012500'.
               05  FILLER   PIC X(13)  VALUE    '050686 012500'.
               05  FILLER   PIC X(13)  VALUE    '050688 017827'.
               05  FILLER   PIC X(13)  VALUE    '050689 016900'.
               05  FILLER   PIC X(13)  VALUE    '050690 016738'.
               05  FILLER   PIC X(13)  VALUE    '050696 014349'.
               05  FILLER   PIC X(13)  VALUE    '050697 013950'.
               05  FILLER   PIC X(13)  VALUE    '050701 012500'.
               05  FILLER   PIC X(13)  VALUE    '050704 012827'.
               05  FILLER   PIC X(13)  VALUE    '050708 012500'.
               05  FILLER   PIC X(13)  VALUE    '050709 012603'.
               05  FILLER   PIC X(13)  VALUE    '050710 012500'.
               05  FILLER   PIC X(13)  VALUE    '050714 019025'.
               05  FILLER   PIC X(13)  VALUE    '050717 012827'.
               05  FILLER   PIC X(13)  VALUE    '050723 012827'.
               05  FILLER   PIC X(13)  VALUE    '050724 012500'.
               05  FILLER   PIC X(13)  VALUE    '050726 012891'.
               05  FILLER   PIC X(13)  VALUE    '050727 012827'.
               05  FILLER   PIC X(13)  VALUE    '050732 012500'.
               05  FILLER   PIC X(13)  VALUE    '050735 012827'.
               05  FILLER   PIC X(13)  VALUE    '050736 012827'.
               05  FILLER   PIC X(13)  VALUE    '050737 012827'.
               05  FILLER   PIC X(13)  VALUE    '050738 012827'.
               05  FILLER   PIC X(13)  VALUE    '050739 012827'.
               05  FILLER   PIC X(13)  VALUE    '050740 012827'.
               05  FILLER   PIC X(13)  VALUE    '050742 012827'.
               05  FILLER   PIC X(13)  VALUE    '050744 012603'.
               05  FILLER   PIC X(13)  VALUE    '050745 012603'.
               05  FILLER   PIC X(13)  VALUE    '050746 012603'.
               05  FILLER   PIC X(13)  VALUE    '050747 012603'.
               05  FILLER   PIC X(13)  VALUE    '050748 014493'.
               05  FILLER   PIC X(13)  VALUE    '050751 012827'.
               05  FILLER   PIC X(13)  VALUE    '050754 017301'.
               05  FILLER   PIC X(13)  VALUE    '050755 012827'.
               05  FILLER   PIC X(13)  VALUE    '050757 012500'.
               05  FILLER   PIC X(13)  VALUE    '050758 012603'.
               05  FILLER   PIC X(13)  VALUE    '050760 016900'.
               05  FILLER   PIC X(13)  VALUE    '050761 012827'.
               05  FILLER   PIC X(13)  VALUE    '050763 012827'.
               05  FILLER   PIC X(13)  VALUE    '050764 013950'.
               05  FILLER   PIC X(13)  VALUE    '050765 012500'.
               05  FILLER   PIC X(13)  VALUE    '050766 012500'.
               05  FILLER   PIC X(13)  VALUE    '050767 017030'.
               05  FILLER   PIC X(13)  VALUE    '050769 012603'.
               05  FILLER   PIC X(13)  VALUE    '050770 012500'.
               05  FILLER   PIC X(13)  VALUE    '050771 012827'.
               05  FILLER   PIC X(13)  VALUE    '050772 015862'.
               05  FILLER   PIC X(13)  VALUE    '050773 016923'.
               05  FILLER   PIC X(13)  VALUE    '050775 012500'.
               05  FILLER   PIC X(13)  VALUE    '050776 012827'.
               05  FILLER   PIC X(13)  VALUE    '050777 016923'.
               05  FILLER   PIC X(13)  VALUE    '050778 012603'.
               05  FILLER   PIC X(13)  VALUE    '050779 012827'.
               05  FILLER   PIC X(13)  VALUE    '050780 012603'.
               05  FILLER   PIC X(13)  VALUE    '050781 016280'.
               05  FILLER   PIC X(13)  VALUE    '050782 012827'.
               05  FILLER   PIC X(13)  VALUE    '050783 012500'.
               05  FILLER   PIC X(13)  VALUE    '050784 012500'.
               05  FILLER   PIC X(13)  VALUE    '051501 017986'.
               05  FILLER   PIC X(13)  VALUE    '051503 017251'.
               05  FILLER   PIC X(13)  VALUE    '051504 012827'.
               05  FILLER   PIC X(13)  VALUE    '051505 012500'.
               05  FILLER   PIC X(13)  VALUE    '051506 016900'.
               05  FILLER   PIC X(13)  VALUE    '051507 017827'.
               05  FILLER   PIC X(13)  VALUE    '051508 017251'.
               05  FILLER   PIC X(13)  VALUE    '051511 012500'.
               05  FILLER   PIC X(13)  VALUE    '051512 012827'.
               05  FILLER   PIC X(13)  VALUE    '051515 012500'.
               05  FILLER   PIC X(13)  VALUE    '051517 014349'.
               05  FILLER   PIC X(13)  VALUE    '051521 012827'.
               05  FILLER   PIC X(13)  VALUE    '051522 012500'.
               05  FILLER   PIC X(13)  VALUE    '051523 017251'.
               05  FILLER   PIC X(13)  VALUE    '051524 012500'.
               05  FILLER   PIC X(13)  VALUE    '051525 012827'.
               05  FILLER   PIC X(13)  VALUE    '051526 019025'.
               05  FILLER   PIC X(13)  VALUE    '051528 012500'.
               05  FILLER   PIC X(13)  VALUE    '051529 012827'.
               05  FILLER   PIC X(13)  VALUE    '051531 012500'.
               05  FILLER   PIC X(13)  VALUE    '051534 012500'.
               05  FILLER   PIC X(13)  VALUE    '051535 012827'.
               05  FILLER   PIC X(13)  VALUE    '051536 012500'.
               05  FILLER   PIC X(13)  VALUE    '051537 016960'.
               05  FILLER   PIC X(13)  VALUE    '051538 012500'.
               05  FILLER   PIC X(13)  VALUE    '051540 013666'.
               05  FILLER   PIC X(13)  VALUE    '051542 012827'.
               05  FILLER   PIC X(13)  VALUE    '051543 012500'.
               05  FILLER   PIC X(13)  VALUE    '051546 015862'.
               05  FILLER   PIC X(13)  VALUE    '051547 016900'.
               05  FILLER   PIC X(13)  VALUE    '051548 012827'.
               05  FILLER   PIC X(13)  VALUE    '051551 016900'.
               05  FILLER   PIC X(13)  VALUE    '051552 016900'.
               05  FILLER   PIC X(13)  VALUE    '051555 016900'.
               05  FILLER   PIC X(13)  VALUE    '051556 016900'.
               05  FILLER   PIC X(13)  VALUE    '051557 016085'.
               05  FILLER   PIC X(13)  VALUE    '051558 012805'.
               05  FILLER   PIC X(13)  VALUE    '051560 015862'.
               05  FILLER   PIC X(13)  VALUE    '051561 012500'.
               05  FILLER   PIC X(13)  VALUE    '051563 012827'.
               05  FILLER   PIC X(13)  VALUE    '051565 016960'.
               05  FILLER   PIC X(13)  VALUE    '051567 015862'.
               05  FILLER   PIC X(13)  VALUE    '051571 012500'.
               05  FILLER   PIC X(13)  VALUE    '051572 012500'.
               05  FILLER   PIC X(13)  VALUE    '051573 014015'.
               05  FILLER   PIC X(13)  VALUE    '051574 012500'.
               05  FILLER   PIC X(13)  VALUE    '051575 012500'.
               05  FILLER   PIC X(13)  VALUE    '051580 017827'.
               05  FILLER   PIC X(13)  VALUE    '051581 012500'.
               05  FILLER   PIC X(13)  VALUE    '051582 017251'.
               05  FILLER   PIC X(13)  VALUE    '051585 012500'.
               05  FILLER   PIC X(13)  VALUE    '051589 017827'.
               05  FILLER   PIC X(13)  VALUE    '051592 013666'.
               05  FILLER   PIC X(13)  VALUE    '051593 012500'.
               05  FILLER   PIC X(13)  VALUE    '051595 012500'.
               05  FILLER   PIC X(13)  VALUE    '051598 012500'.
               05  FILLER   PIC X(13)  VALUE    '051600 015862'.
               05  FILLER   PIC X(13)  VALUE    '051601 016900'.
               05  FILLER   PIC X(13)  VALUE    '051602 012500'.
               05  FILLER   PIC X(13)  VALUE    '051609 012500'.
               05  FILLER   PIC X(13)  VALUE    '051611 012500'.
               05  FILLER   PIC X(13)  VALUE    '051614 012500'.
               05  FILLER   PIC X(13)  VALUE    '051615 012827'.
               05  FILLER   PIC X(13)  VALUE    '051617 012500'.
               05  FILLER   PIC X(13)  VALUE    '051619 015862'.
               05  FILLER   PIC X(13)  VALUE    '051624 012500'.
               05  FILLER   PIC X(13)  VALUE    '051629 012500'.
               05  FILLER   PIC X(13)  VALUE    '051632 015862'.
               05  FILLER   PIC X(13)  VALUE    '051634 012827'.
               05  FILLER   PIC X(13)  VALUE    '051637 012500'.
               05  FILLER   PIC X(13)  VALUE    '051643 012500'.
               05  FILLER   PIC X(13)  VALUE    '051645 013950'.
               05  FILLER   PIC X(13)  VALUE    '051646 012500'.
               05  FILLER   PIC X(13)  VALUE    '051647 012500'.
               05  FILLER   PIC X(13)  VALUE    '051649 012805'.
               05  FILLER   PIC X(13)  VALUE    '051650 012500'.
               05  FILLER   PIC X(13)  VALUE    '051651 016960'.
               05  FILLER   PIC X(13)  VALUE    '051652 015862'.
               05  FILLER   PIC X(13)  VALUE    '051657 012500'.
               05  FILLER   PIC X(13)  VALUE    '051659 012500'.
               05  FILLER   PIC X(13)  VALUE    '051661 012827'.
               05  FILLER   PIC X(13)  VALUE    '051663 014349'.
               05  FILLER   PIC X(13)  VALUE    '051664 012827'.
               05  FILLER   PIC X(13)  VALUE    '051665 017251'.
               05  FILLER   PIC X(13)  VALUE    '051666 012500'.
               05  FILLER   PIC X(13)  VALUE    '051667 017251'.
               05  FILLER   PIC X(13)  VALUE    '051668 012827'.
               05  FILLER   PIC X(13)  VALUE    '051669 012500'.
               05  FILLER   PIC X(13)  VALUE    '051670 012500'.
               05  FILLER   PIC X(13)  VALUE    '051681 014015'.
               05  FILLER   PIC X(13)  VALUE    '051687 012827'.
               05  FILLER   PIC X(13)  VALUE    '051689 017251'.
               05  FILLER   PIC X(13)  VALUE    '051690 017827'.
               05  FILLER   PIC X(13)  VALUE    '051692 017986'.
               05  FILLER   PIC X(13)  VALUE    '051693 017827'.
               05  FILLER   PIC X(13)  VALUE    '051695 012500'.
               05  FILLER   PIC X(13)  VALUE    '051696 016085'.
               05  FILLER   PIC X(13)  VALUE    '051705 012500'.
               05  FILLER   PIC X(13)  VALUE    '051708 012500'.
               05  FILLER   PIC X(13)  VALUE    '051710 014349'.
               05  FILLER   PIC X(13)  VALUE    '051711 015862'.
               05  FILLER   PIC X(13)  VALUE    '051713 017986'.
               05  FILLER   PIC X(13)  VALUE    '051714 012500'.
               05  FILLER   PIC X(13)  VALUE    '051715 012827'.
               05  FILLER   PIC X(13)  VALUE    '051716 012500'.
               05  FILLER   PIC X(13)  VALUE    '051717 012500'.
               05  FILLER   PIC X(13)  VALUE    '051718 012827'.
               05  FILLER   PIC X(13)  VALUE    '051719 012827'.
               05  FILLER   PIC X(13)  VALUE    '051721 015862'.
               05  FILLER   PIC X(13)  VALUE    '051725 012500'.
               05  FILLER   PIC X(13)  VALUE    '051728 012500'.
               05  FILLER   PIC X(13)  VALUE    '051731 012827'.
               05  FILLER   PIC X(13)  VALUE    '051732 012500'.
               05  FILLER   PIC X(13)  VALUE    '051733 012500'.
               05  FILLER   PIC X(13)  VALUE    '051736 012500'.
               05  FILLER   PIC X(13)  VALUE    '051737 012827'.
               05  FILLER   PIC X(13)  VALUE    '051738 013950'.
               05  FILLER   PIC X(13)  VALUE    '051740 012500'.
               05  FILLER   PIC X(13)  VALUE    '051741 012500'.
               05  FILLER   PIC X(13)  VALUE    '051742 012827'.
               05  FILLER   PIC X(13)  VALUE    '051743 014349'.
               05  FILLER   PIC X(13)  VALUE    '051744 012827'.
               05  FILLER   PIC X(13)  VALUE    '051747 012827'.
               05  FILLER   PIC X(13)  VALUE    '051748 012500'.
               05  FILLER   PIC X(13)  VALUE    '051749 016900'.
               05  FILLER   PIC X(13)  VALUE    '051750 012827'.
               05  FILLER   PIC X(13)  VALUE    '051751 012500'.
               05  FILLER   PIC X(13)  VALUE    '051752 017251'.
               05  FILLER   PIC X(13)  VALUE    '051753 012827'.
               05  FILLER   PIC X(13)  VALUE    '051754 012827'.
               05  FILLER   PIC X(13)  VALUE    '051755 012827'.
               05  FILLER   PIC X(13)  VALUE    '051757 012500'.
               05  FILLER   PIC X(13)  VALUE    '051758 012827'.
               05  FILLER   PIC X(13)  VALUE    '051759 012827'.
               05  FILLER   PIC X(13)  VALUE    '051760 012827'.
               05  FILLER   PIC X(13)  VALUE    '051761 016085'.
               05  FILLER   PIC X(13)  VALUE    '051762 012827'.
               05  FILLER   PIC X(13)  VALUE    '051763 012500'.
               05  FILLER   PIC X(13)  VALUE    '051765 012827'.
               05  FILLER   PIC X(13)  VALUE    '051766 012827'.
               05  FILLER   PIC X(13)  VALUE    '051767 012500'.
               05  FILLER   PIC X(13)  VALUE    '051768 012827'.
               05  FILLER   PIC X(13)  VALUE    '051769 012500'.
               05  FILLER   PIC X(13)  VALUE    '051771 012500'.
               05  FILLER   PIC X(13)  VALUE    '051772 012827'.
               05  FILLER   PIC X(13)  VALUE    '051774 012827'.
               05  FILLER   PIC X(13)  VALUE    '051775 012500'.
               05  FILLER   PIC X(13)  VALUE    '051777 012500'.
               05  FILLER   PIC X(13)  VALUE    '051778 012827'.
               05  FILLER   PIC X(13)  VALUE    '051780 012500'.
               05  FILLER   PIC X(13)  VALUE    '051782 012827'.
               05  FILLER   PIC X(13)  VALUE    '051783 012827'.
               05  FILLER   PIC X(13)  VALUE    '051784 012827'.
               05  FILLER   PIC X(13)  VALUE    '051786 014349'.
               05  FILLER   PIC X(13)  VALUE    '051787 014349'.
               05  FILLER   PIC X(13)  VALUE    '051788 012500'.
               05  FILLER   PIC X(13)  VALUE    '051790 012827'.
               05  FILLER   PIC X(13)  VALUE    '051791 012500'.
               05  FILLER   PIC X(13)  VALUE    '051792 012500'.
               05  FILLER   PIC X(13)  VALUE    '051793 012500'.
               05  FILLER   PIC X(13)  VALUE    '051794 012827'.
               05  FILLER   PIC X(13)  VALUE    '051795 014349'.
               05  FILLER   PIC X(13)  VALUE    '051796 013950'.
               05  FILLER   PIC X(13)  VALUE    '051797 012500'.
               05  FILLER   PIC X(13)  VALUE    '051798 012500'.
               05  FILLER   PIC X(13)  VALUE    '051799 012500'.
               05  FILLER   PIC X(13)  VALUE    '052031 012827'.
               05  FILLER   PIC X(13)  VALUE    '052032 012827'.
               05  FILLER   PIC X(13)  VALUE    '052033 015862'.
               05  FILLER   PIC X(13)  VALUE    '052034 016923'.
               05  FILLER   PIC X(13)  VALUE    '052035 012500'.
               05  FILLER   PIC X(13)  VALUE    '052036 012500'.
               05  FILLER   PIC X(13)  VALUE    '052037 012500'.
               05  FILLER   PIC X(13)  VALUE    '052038 012827'.
               05  FILLER   PIC X(13)  VALUE    '052039 012500'.
               05  FILLER   PIC X(13)  VALUE    '052043 017251'.
               05  FILLER   PIC X(13)  VALUE    '052044 012500'.
               05  FILLER   PIC X(13)  VALUE    '052045 012827'.
               05  FILLER   PIC X(13)  VALUE    '052046 012827'.
               05  FILLER   PIC X(13)  VALUE    '052047 013950'.
               05  FILLER   PIC X(13)  VALUE    '052049 012500'.
               05  FILLER   PIC X(13)  VALUE    '052050 012827'.
               05  FILLER   PIC X(13)  VALUE    '052052 012500'.
               05  FILLER   PIC X(13)  VALUE    '052054 012827'.
               05  FILLER   PIC X(13)  VALUE    '052055 012891'.
               05  FILLER   PIC X(13)  VALUE    '053031 012500'.
               05  FILLER   PIC X(13)  VALUE    '053032 012500'.
               05  FILLER   PIC X(13)  VALUE    '053037 012500'.
               05  FILLER   PIC X(13)  VALUE    '053039 012827'.
               05  FILLER   PIC X(13)  VALUE    '053040 012891'.
               05  FILLER   PIC X(13)  VALUE    '053041 012500'.
               05  FILLER   PIC X(13)  VALUE    '053300 012500'.
               05  FILLER   PIC X(13)  VALUE    '053301 016923'.
               05  FILLER   PIC X(13)  VALUE    '053302 012827'.
               05  FILLER   PIC X(13)  VALUE    '053303 012500'.
               05  FILLER   PIC X(13)  VALUE    '053304 012500'.
               05  FILLER   PIC X(13)  VALUE    '053305 017827'.
               05  FILLER   PIC X(13)  VALUE    '053309 012827'.
               05  FILLER   PIC X(13)  VALUE    '054009 012827'.
               05  FILLER   PIC X(13)  VALUE    '054032 012827'.
               05  FILLER   PIC X(13)  VALUE    '054053 012827'.
               05  FILLER   PIC X(13)  VALUE    '054055 012827'.
               05  FILLER   PIC X(13)  VALUE    '054069 012827'.
               05  FILLER   PIC X(13)  VALUE    '054074 017030'.
               05  FILLER   PIC X(13)  VALUE    '054075 012500'.
               05  FILLER   PIC X(13)  VALUE    '054077 014349'.
               05  FILLER   PIC X(13)  VALUE    '054078 012827'.
               05  FILLER   PIC X(13)  VALUE    '054087 015862'.
               05  FILLER   PIC X(13)  VALUE    '054093 012500'.
               05  FILLER   PIC X(13)  VALUE    '054095 012500'.
               05  FILLER   PIC X(13)  VALUE    '054096 015862'.
               05  FILLER   PIC X(13)  VALUE    '054104 015862'.
               05  FILLER   PIC X(13)  VALUE    '054110 016923'.
               05  FILLER   PIC X(13)  VALUE    '054111 012500'.
               05  FILLER   PIC X(13)  VALUE    '054122 015649'.
               05  FILLER   PIC X(13)  VALUE    '054123 014493'.
               05  FILLER   PIC X(13)  VALUE    '054130 012500'.
               05  FILLER   PIC X(13)  VALUE    '054131 016900'.
               05  FILLER   PIC X(13)  VALUE    '054133 012827'.
               05  FILLER   PIC X(13)  VALUE    '054144 017251'.
               05  FILLER   PIC X(13)  VALUE    '054145 012500'.
               05  FILLER   PIC X(13)  VALUE    '054148 012827'.
               05  FILLER   PIC X(13)  VALUE    '054151 016280'.
               05  FILLER   PIC X(13)  VALUE    '054155 012500'.
               05  FILLER   PIC X(13)  VALUE    '054527 012500'.
               05  FILLER   PIC X(13)  VALUE    '054601 016900'.
               05  FILLER   PIC X(13)  VALUE    '054611 012500'.
               05  FILLER   PIC X(13)  VALUE    '054614 012500'.
               05  FILLER   PIC X(13)  VALUE    '054620 017538'.
               05  FILLER   PIC X(13)  VALUE    '054625 012500'.
               05  FILLER   PIC X(13)  VALUE    '054629 012500'.
               05  FILLER   PIC X(13)  VALUE    '054654 016900'.
               05  FILLER   PIC X(13)  VALUE    '054655 016900'.
               05  FILLER   PIC X(13)  VALUE    '054656 016900'.
               05  FILLER   PIC X(13)  VALUE    '054659 012827'.
               05  FILLER   PIC X(13)  VALUE    '054662 016900'.
               05  FILLER   PIC X(13)  VALUE    '054665 012827'.
               05  FILLER   PIC X(13)  VALUE    '054667 017251'.
               05  FILLER   PIC X(13)  VALUE    '054672 012500'.
               05  FILLER   PIC X(13)  VALUE    '057374 015862'.
               05  FILLER   PIC X(13)  VALUE    '058474 012827'.
               05  FILLER   PIC X(13)  VALUE    '058476 012827'.
               05  FILLER   PIC X(13)  VALUE    '058477 014349'.
               05  FILLER   PIC X(13)  VALUE    '058486 012827'.
               05  FILLER   PIC X(13)  VALUE    '058487 012827'.
               05  FILLER   PIC X(13)  VALUE    '058488 012827'.
               05  FILLER   PIC X(13)  VALUE    '058489 012500'.
               05  FILLER   PIC X(13)  VALUE    '058490 012500'.
               05  FILLER   PIC X(13)  VALUE    '058491 014349'.
               05  FILLER   PIC X(13)  VALUE    '058492 016900'.
               05  FILLER   PIC X(13)  VALUE    '058493 012500'.
               05  FILLER   PIC X(13)  VALUE    '058494 012827'.
               05  FILLER   PIC X(13)  VALUE    '058495 012827'.
               05  FILLER   PIC X(13)  VALUE    '058496 016900'.
               05  FILLER   PIC X(13)  VALUE    '058497 012827'.
               05  FILLER   PIC X(13)  VALUE    '058498 012827'.
               05  FILLER   PIC X(13)  VALUE    '058499 012827'.
               05  FILLER   PIC X(13)  VALUE    '059000 012827'.
               05  FILLER   PIC X(13)  VALUE    '059001 012827'.
               05  FILLER   PIC X(13)  VALUE    '059002 012827'.
               05  FILLER   PIC X(13)  VALUE    '059003 012827'.
               05  FILLER   PIC X(13)  VALUE    '059004 012827'.
               05  FILLER   PIC X(13)  VALUE    '059005 012827'.
               05  FILLER   PIC X(13)  VALUE    '059006 012827'.
               05  FILLER   PIC X(13)  VALUE    '059007 012827'.
               05  FILLER   PIC X(13)  VALUE    '059008 012827'.
               05  FILLER   PIC X(13)  VALUE    '059009 017827'.
               05  FILLER   PIC X(13)  VALUE    '059010 012805'.
               05  FILLER   PIC X(13)  VALUE    '059011 012827'.
               05  FILLER   PIC X(13)  VALUE    '059012 012827'.
               05  FILLER   PIC X(13)  VALUE    '059013 012500'.
               05  FILLER   PIC X(13)  VALUE    '059014 012500'.
               05  FILLER   PIC X(13)  VALUE    '059015 012500'.
               05  FILLER   PIC X(13)  VALUE    '059016 017251'.
               05  FILLER   PIC X(13)  VALUE    '059017 012827'.
               05  FILLER   PIC X(13)  VALUE    '059018 012827'.
               05  FILLER   PIC X(13)  VALUE    '059019 012827'.
               05  FILLER   PIC X(13)  VALUE    '059020 012500'.
               05  FILLER   PIC X(13)  VALUE    '059021 012500'.
               05  FILLER   PIC X(13)  VALUE    '059022 012500'.
               05  FILLER   PIC X(13)  VALUE    '059023 012500'.
               05  FILLER   PIC X(13)  VALUE    '059024 014349'.
               05  FILLER   PIC X(13)  VALUE    '059025 012500'.
               05  FILLER   PIC X(13)  VALUE    '059026 012500'.
               05  FILLER   PIC X(13)  VALUE    '059027 014349'.
               05  FILLER   PIC X(13)  VALUE    '059028 016900'.
               05  FILLER   PIC X(13)  VALUE    '059029 012500'.
               05  FILLER   PIC X(13)  VALUE    '059030 012827'.
               05  FILLER   PIC X(13)  VALUE    '059031 012827'.
               05  FILLER   PIC X(13)  VALUE    '059032 012500'.
               05  FILLER   PIC X(13)  VALUE    '059033 012500'.
               05  FILLER   PIC X(13)  VALUE    '059034 012500'.
               05  FILLER   PIC X(13)  VALUE    '059035 012827'.
               05  FILLER   PIC X(13)  VALUE    '059036 012827'.
               05  FILLER   PIC X(13)  VALUE    '059037 012827'.
               05  FILLER   PIC X(13)  VALUE    '059039 012827'.
               05  FILLER   PIC X(13)  VALUE    '059040 012827'.
               05  FILLER   PIC X(13)  VALUE    '059041 012827'.
               05  FILLER   PIC X(13)  VALUE    '059042 012827'.
               05  FILLER   PIC X(13)  VALUE    '059043 012827'.
               05  FILLER   PIC X(13)  VALUE    '059044 012827'.
               05  FILLER   PIC X(13)  VALUE    '059045 012827'.
               05  FILLER   PIC X(13)  VALUE    '059046 012500'.
               05  FILLER   PIC X(13)  VALUE    '059047 012827'.
               05  FILLER   PIC X(13)  VALUE    '059048 012827'.
               05  FILLER   PIC X(13)  VALUE    '059049 012827'.
               05  FILLER   PIC X(13)  VALUE    '059050 012827'.
               05  FILLER   PIC X(13)  VALUE    '059051 017827'.
               05  FILLER   PIC X(13)  VALUE    '059052 012827'.
               05  FILLER   PIC X(13)  VALUE    '059053 012827'.
               05  FILLER   PIC X(13)  VALUE    '059054 014349'.
               05  FILLER   PIC X(13)  VALUE    '059055 016900'.
               05  FILLER   PIC X(13)  VALUE    '059056 012827'.
               05  FILLER   PIC X(13)  VALUE    '059057 012500'.
               05  FILLER   PIC X(13)  VALUE    '059058 012827'.
               05  FILLER   PIC X(13)  VALUE    '059059 012827'.
               05  FILLER   PIC X(13)  VALUE    '059060 012827'.
               05  FILLER   PIC X(13)  VALUE    '059061 012827'.
               05  FILLER   PIC X(13)  VALUE    '059062 017827'.
               05  FILLER   PIC X(13)  VALUE    '059063 012500'.
               05  FILLER   PIC X(13)  VALUE    '059064 012827'.
               05  FILLER   PIC X(13)  VALUE    '059065 012827'.
               05  FILLER   PIC X(13)  VALUE    '059066 012500'.
               05  FILLER   PIC X(13)  VALUE    '059067 012827'.
               05  FILLER   PIC X(13)  VALUE    '059068 012827'.
               05  FILLER   PIC X(13)  VALUE    '059069 012827'.
               05  FILLER   PIC X(13)  VALUE    '059070 012827'.
               05  FILLER   PIC X(13)  VALUE    '059071 017251'.
               05  FILLER   PIC X(13)  VALUE    '059072 013666'.
               05  FILLER   PIC X(13)  VALUE    '059073 014349'.
               05  FILLER   PIC X(13)  VALUE    '059074 012827'.
               05  FILLER   PIC X(13)  VALUE    '059075 012827'.
               05  FILLER   PIC X(13)  VALUE    '059076 012827'.
               05  FILLER   PIC X(13)  VALUE    '059078 012500'.
               05  FILLER   PIC X(13)  VALUE    '059079 012827'.
               05  FILLER   PIC X(13)  VALUE    '059080 012827'.
               05  FILLER   PIC X(13)  VALUE    '059083 014349'.
               05  FILLER   PIC X(13)  VALUE    '059084 012827'.
               05  FILLER   PIC X(13)  VALUE    '059085 012827'.
               05  FILLER   PIC X(13)  VALUE    '059086 012827'.
               05  FILLER   PIC X(13)  VALUE    '059087 012827'.
               05  FILLER   PIC X(13)  VALUE    '059088 014349'.
               05  FILLER   PIC X(13)  VALUE    '059089 012500'.
               05  FILLER   PIC X(13)  VALUE    '059090 012500'.
               05  FILLER   PIC X(13)  VALUE    '059091 012827'.
               05  FILLER   PIC X(13)  VALUE    '059092 012827'.
               05  FILLER   PIC X(13)  VALUE    '059093 012827'.
               05  FILLER   PIC X(13)  VALUE    '059094 012827'.
               05  FILLER   PIC X(13)  VALUE    '059095 012827'.
               05  FILLER   PIC X(13)  VALUE    '059096 012827'.
               05  FILLER   PIC X(13)  VALUE    '059098 017251'.
               05  FILLER   PIC X(13)  VALUE    '059099 012500'.
               05  FILLER   PIC X(13)  VALUE    '059100 012827'.
               05  FILLER   PIC X(13)  VALUE    '059101 012827'.
               05  FILLER   PIC X(13)  VALUE    '059102 012827'.
               05  FILLER   PIC X(13)  VALUE    '059103 012500'.
               05  FILLER   PIC X(13)  VALUE    '059104 012827'.
               05  FILLER   PIC X(13)  VALUE    '059105 012827'.
               05  FILLER   PIC X(13)  VALUE    '059106 012827'.
               05  FILLER   PIC X(13)  VALUE    '059107 012500'.
               05  FILLER   PIC X(13)  VALUE    '059108 012827'.
               05  FILLER   PIC X(13)  VALUE    '059109 012827'.
               05  FILLER   PIC X(13)  VALUE    '059110 012500'.
               05  FILLER   PIC X(13)  VALUE    '059111 012500'.
               05  FILLER   PIC X(13)  VALUE    '059112 012500'.
               05  FILLER   PIC X(13)  VALUE    '059113 012827'.
               05  FILLER   PIC X(13)  VALUE    '059114 012827'.
               05  FILLER   PIC X(13)  VALUE    '059115 012827'.
               05  FILLER   PIC X(13)  VALUE    '059116 012827'.
               05  FILLER   PIC X(13)  VALUE    '059117 015862'.
               05  FILLER   PIC X(13)  VALUE    '059118 012827'.
               05  FILLER   PIC X(13)  VALUE    '059119 012827'.
               05  FILLER   PIC X(13)  VALUE    '059120 012827'.
               05  FILLER   PIC X(13)  VALUE    '059121 012500'.
               05  FILLER   PIC X(13)  VALUE    '059122 017827'.
               05  FILLER   PIC X(13)  VALUE    '059123 012500'.
               05  FILLER   PIC X(13)  VALUE    '059125 012827'.
               05  FILLER   PIC X(13)  VALUE    '059126 012827'.
               05  FILLER   PIC X(13)  VALUE    '059127 012827'.
               05  FILLER   PIC X(13)  VALUE    '059128 012827'.
               05  FILLER   PIC X(13)  VALUE    '059129 012805'.
               05  FILLER   PIC X(13)  VALUE    '059130 014349'.
               05  FILLER   PIC X(13)  VALUE    '059131 012827'.
               05  FILLER   PIC X(13)  VALUE    '059132 012500'.
               05  FILLER   PIC X(13)  VALUE    '059133 014349'.
               05  FILLER   PIC X(13)  VALUE    '059134 012827'.
               05  FILLER   PIC X(13)  VALUE    '059135 012827'.
               05  FILLER   PIC X(13)  VALUE    '059136 012827'.
               05  FILLER   PIC X(13)  VALUE    '059137 012827'.
               05  FILLER   PIC X(13)  VALUE    '059138 012827'.
               05  FILLER   PIC X(13)  VALUE    '059139 012827'.
               05  FILLER   PIC X(13)  VALUE    '059140 012827'.
               05  FILLER   PIC X(13)  VALUE    '059141 012827'.
               05  FILLER   PIC X(13)  VALUE    '059142 012827'.
               05  FILLER   PIC X(13)  VALUE    '059143 016960'.
               05  FILLER   PIC X(13)  VALUE    '059144 017986'.
               05  FILLER   PIC X(13)  VALUE    '059145 016900'.
               05  FILLER   PIC X(13)  VALUE    '059146 012827'.
               05  FILLER   PIC X(13)  VALUE    '059147 012827'.
               05  FILLER   PIC X(13)  VALUE    '059148 012827'.
               05  FILLER   PIC X(13)  VALUE    '059149 012827'.
               05  FILLER   PIC X(13)  VALUE    '059150 012827'.
               05  FILLER   PIC X(13)  VALUE    '059151 012827'.
               05  FILLER   PIC X(13)  VALUE    '059152 012827'.
               05  FILLER   PIC X(13)  VALUE    '059153 012827'.
               05  FILLER   PIC X(13)  VALUE    '059154 012500'.
               05  FILLER   PIC X(13)  VALUE    '059155 014349'.
               05  FILLER   PIC X(13)  VALUE    '059156 012827'.
               05  FILLER   PIC X(13)  VALUE    '059157 017827'.
               05  FILLER   PIC X(13)  VALUE    '059158 012827'.
               05  FILLER   PIC X(13)  VALUE    '059159 016960'.
               05  FILLER   PIC X(13)  VALUE    '059160 012827'.
               05  FILLER   PIC X(13)  VALUE    '059161 012827'.
               05  FILLER   PIC X(13)  VALUE    '059162 012827'.
               05  FILLER   PIC X(13)  VALUE    '059163 012827'.
               05  FILLER   PIC X(13)  VALUE    '059164 012827'.
               05  FILLER   PIC X(13)  VALUE    '059165 012827'.
               05  FILLER   PIC X(13)  VALUE    '059166 012827'.
               05  FILLER   PIC X(13)  VALUE    '059167 012827'.
               05  FILLER   PIC X(13)  VALUE    '059168 012827'.
               05  FILLER   PIC X(13)  VALUE    '059169 012827'.
               05  FILLER   PIC X(13)  VALUE    '059170 012827'.
               05  FILLER   PIC X(13)  VALUE    '059171 012827'.
               05  FILLER   PIC X(13)  VALUE    '059172 012827'.
               05  FILLER   PIC X(13)  VALUE    '059173 012827'.
               05  FILLER   PIC X(13)  VALUE    '059174 012827'.
               05  FILLER   PIC X(13)  VALUE    '059175 017986'.
               05  FILLER   PIC X(13)  VALUE    '059176 012827'.
               05  FILLER   PIC X(13)  VALUE    '059177 012827'.
               05  FILLER   PIC X(13)  VALUE    '059178 012827'.
               05  FILLER   PIC X(13)  VALUE    '059179 017827'.
               05  FILLER   PIC X(13)  VALUE    '059180 017827'.
               05  FILLER   PIC X(13)  VALUE    '059181 012827'.
               05  FILLER   PIC X(13)  VALUE    '059182 012500'.
               05  FILLER   PIC X(13)  VALUE    '059183 012827'.
               05  FILLER   PIC X(13)  VALUE    '059184 012827'.
               05  FILLER   PIC X(13)  VALUE    '059185 012827'.
               05  FILLER   PIC X(13)  VALUE    '059186 012827'.
               05  FILLER   PIC X(13)  VALUE    '059187 012827'.
               05  FILLER   PIC X(13)  VALUE    '059188 012827'.
               05  FILLER   PIC X(13)  VALUE    '059189 012827'.
               05  FILLER   PIC X(13)  VALUE    '059190 012827'.
               05  FILLER   PIC X(13)  VALUE    '059191 012827'.
               05  FILLER   PIC X(13)  VALUE    '059192 012500'.
               05  FILLER   PIC X(13)  VALUE    '059193 012827'.
               05  FILLER   PIC X(13)  VALUE    '059194 012827'.
               05  FILLER   PIC X(13)  VALUE    '059195 012827'.
               05  FILLER   PIC X(13)  VALUE    '059196 012827'.
               05  FILLER   PIC X(13)  VALUE    '059197 012827'.
               05  FILLER   PIC X(13)  VALUE    '059198 012827'.
               05  FILLER   PIC X(13)  VALUE    '059199 012827'.
               05  FILLER   PIC X(13)  VALUE    '059200 012500'.
               05  FILLER   PIC X(13)  VALUE    '059201 012827'.
               05  FILLER   PIC X(13)  VALUE    '059202 012827'.
               05  FILLER   PIC X(13)  VALUE    '059203 012827'.
               05  FILLER   PIC X(13)  VALUE    '059204 012827'.
               05  FILLER   PIC X(13)  VALUE    '059205 012827'.
               05  FILLER   PIC X(13)  VALUE    '059206 012827'.
               05  FILLER   PIC X(13)  VALUE    '059207 012500'.
               05  FILLER   PIC X(13)  VALUE    '059208 012500'.
               05  FILLER   PIC X(13)  VALUE    '059209 012827'.
               05  FILLER   PIC X(13)  VALUE    '059210 012500'.
               05  FILLER   PIC X(13)  VALUE    '059211 014349'.
               05  FILLER   PIC X(13)  VALUE    '059212 012827'.
               05  FILLER   PIC X(13)  VALUE    '059213 012827'.
               05  FILLER   PIC X(13)  VALUE    '059214 012827'.
               05  FILLER   PIC X(13)  VALUE    '059215 012500'.
               05  FILLER   PIC X(13)  VALUE    '059216 012500'.
               05  FILLER   PIC X(13)  VALUE    '059217 014015'.
               05  FILLER   PIC X(13)  VALUE    '059218 012827'.
               05  FILLER   PIC X(13)  VALUE    '059219 012500'.
               05  FILLER   PIC X(13)  VALUE    '059220 012500'.
               05  FILLER   PIC X(13)  VALUE    '059221 012500'.
               05  FILLER   PIC X(13)  VALUE    '059222 012500'.
               05  FILLER   PIC X(13)  VALUE    '059223 012500'.
               05  FILLER   PIC X(13)  VALUE    '059224 012500'.
               05  FILLER   PIC X(13)  VALUE    '059225 012500'.
               05  FILLER   PIC X(13)  VALUE    '059226 012500'.
               05  FILLER   PIC X(13)  VALUE    '059227 012500'.
               05  FILLER   PIC X(13)  VALUE    '059229 012827'.
               05  FILLER   PIC X(13)  VALUE    '059230 012827'.
               05  FILLER   PIC X(13)  VALUE    '059231 012827'.
               05  FILLER   PIC X(13)  VALUE    '059232 012827'.
               05  FILLER   PIC X(13)  VALUE    '059233 012827'.
               05  FILLER   PIC X(13)  VALUE    '059234 012827'.
               05  FILLER   PIC X(13)  VALUE    '059235 012500'.
               05  FILLER   PIC X(13)  VALUE    '059237 016900'.
               05  FILLER   PIC X(13)  VALUE    '059238 012827'.
               05  FILLER   PIC X(13)  VALUE    '059239 012827'.
               05  FILLER   PIC X(13)  VALUE    '059240 012827'.
               05  FILLER   PIC X(13)  VALUE    '059241 012827'.
               05  FILLER   PIC X(13)  VALUE    '059242 012827'.
               05  FILLER   PIC X(13)  VALUE    '059243 014349'.
               05  FILLER   PIC X(13)  VALUE    '059244 014349'.
               05  FILLER   PIC X(13)  VALUE    '059245 012827'.
               05  FILLER   PIC X(13)  VALUE    '059246 014349'.
               05  FILLER   PIC X(13)  VALUE    '059247 012500'.
               05  FILLER   PIC X(13)  VALUE    '059248 012500'.
               05  FILLER   PIC X(13)  VALUE    '059249 017827'.
               05  FILLER   PIC X(13)  VALUE    '059250 012500'.
               05  FILLER   PIC X(13)  VALUE    '059251 016960'.
               05  FILLER   PIC X(13)  VALUE    '059252 014349'.
               05  FILLER   PIC X(13)  VALUE    '059253 012827'.
               05  FILLER   PIC X(13)  VALUE    '059254 012827'.
               05  FILLER   PIC X(13)  VALUE    '059255 012827'.
               05  FILLER   PIC X(13)  VALUE    '059256 012827'.
               05  FILLER   PIC X(13)  VALUE    '059257 012827'.
               05  FILLER   PIC X(13)  VALUE    '059258 016900'.
               05  FILLER   PIC X(13)  VALUE    '059259 012500'.
               05  FILLER   PIC X(13)  VALUE    '059260 012500'.
               05  FILLER   PIC X(13)  VALUE    '059261 012827'.
               05  FILLER   PIC X(13)  VALUE    '059262 012827'.
               05  FILLER   PIC X(13)  VALUE    '059263 012827'.
               05  FILLER   PIC X(13)  VALUE    '059264 012827'.
               05  FILLER   PIC X(13)  VALUE    '059265 012827'.
               05  FILLER   PIC X(13)  VALUE    '059266 012827'.
               05  FILLER   PIC X(13)  VALUE    '059267 012827'.
               05  FILLER   PIC X(13)  VALUE    '059268 012827'.
               05  FILLER   PIC X(13)  VALUE    '059269 015862'.
               05  FILLER   PIC X(13)  VALUE    '059271 012827'.
               05  FILLER   PIC X(13)  VALUE    '059272 012827'.
               05  FILLER   PIC X(13)  VALUE    '059273 016900'.
               05  FILLER   PIC X(13)  VALUE    '059274 012500'.
               05  FILLER   PIC X(13)  VALUE    '059275 012827'.
               05  FILLER   PIC X(13)  VALUE    '059276 012500'.
               05  FILLER   PIC X(13)  VALUE    '059277 012500'.
               05  FILLER   PIC X(13)  VALUE    '059278 012827'.
               05  FILLER   PIC X(13)  VALUE    '059279 012827'.
               05  FILLER   PIC X(13)  VALUE    '059280 012827'.
               05  FILLER   PIC X(13)  VALUE    '059281 012827'.
               05  FILLER   PIC X(13)  VALUE    '059282 016085'.
               05  FILLER   PIC X(13)  VALUE    '059283 012827'.
               05  FILLER   PIC X(13)  VALUE    '059284 012827'.
               05  FILLER   PIC X(13)  VALUE    '059285 012827'.
               05  FILLER   PIC X(13)  VALUE    '059286 012827'.
               05  FILLER   PIC X(13)  VALUE    '059287 012827'.
               05  FILLER   PIC X(13)  VALUE    '059288 012827'.
               05  FILLER   PIC X(13)  VALUE    '059289 012827'.
               05  FILLER   PIC X(13)  VALUE    '059290 012827'.
               05  FILLER   PIC X(13)  VALUE    '059291 012827'.
               05  FILLER   PIC X(13)  VALUE    '059292 012827'.
               05  FILLER   PIC X(13)  VALUE    '059293 012805'.
               05  FILLER   PIC X(13)  VALUE    '059294 012500'.
               05  FILLER   PIC X(13)  VALUE    '059295 014349'.
               05  FILLER   PIC X(13)  VALUE    '059296 012500'.
               05  FILLER   PIC X(13)  VALUE    '059297 012827'.
               05  FILLER   PIC X(13)  VALUE    '059298 012827'.
               05  FILLER   PIC X(13)  VALUE    '059299 012827'.
               05  FILLER   PIC X(13)  VALUE    '059300 012827'.
               05  FILLER   PIC X(13)  VALUE    '059301 012500'.
               05  FILLER   PIC X(13)  VALUE    '059302 017827'.
               05  FILLER   PIC X(13)  VALUE    '059303 012500'.
               05  FILLER   PIC X(13)  VALUE    '059304 012827'.
               05  FILLER   PIC X(13)  VALUE    '059305 012827'.
               05  FILLER   PIC X(13)  VALUE    '059306 012827'.
               05  FILLER   PIC X(13)  VALUE    '059307 016900'.
               05  FILLER   PIC X(13)  VALUE    '059308 016900'.
               05  FILLER   PIC X(13)  VALUE    '059309 016900'.
               05  FILLER   PIC X(13)  VALUE    '059310 012500'.
               05  FILLER   PIC X(13)  VALUE    '059312 012500'.
               05  FILLER   PIC X(13)  VALUE    '059313 012827'.
               05  FILLER   PIC X(13)  VALUE    '059314 012500'.
               05  FILLER   PIC X(13)  VALUE    '059315 012500'.
               05  FILLER   PIC X(13)  VALUE    '059316 012500'.
               05  FILLER   PIC X(13)  VALUE    '059317 012827'.
               05  FILLER   PIC X(13)  VALUE    '059318 012827'.
               05  FILLER   PIC X(13)  VALUE    '059319 012500'.
               05  FILLER   PIC X(13)  VALUE    '059320 017251'.
               05  FILLER   PIC X(13)  VALUE    '059321 014349'.
               05  FILLER   PIC X(13)  VALUE    '059322 014015'.
               05  FILLER   PIC X(13)  VALUE    '059324 012827'.
               05  FILLER   PIC X(13)  VALUE    '059325 012827'.
               05  FILLER   PIC X(13)  VALUE    '059326 017827'.
               05  FILLER   PIC X(13)  VALUE    '059327 012827'.
               05  FILLER   PIC X(13)  VALUE    '059328 012500'.
               05  FILLER   PIC X(13)  VALUE    '059329 012827'.
               05  FILLER   PIC X(13)  VALUE    '059330 012827'.
               05  FILLER   PIC X(13)  VALUE    '059331 014349'.
               05  FILLER   PIC X(13)  VALUE    '059332 012500'.
               05  FILLER   PIC X(13)  VALUE    '059333 012500'.
               05  FILLER   PIC X(13)  VALUE    '059334 012500'.
               05  FILLER   PIC X(13)  VALUE    '059335 012827'.
               05  FILLER   PIC X(13)  VALUE    '059336 012827'.
               05  FILLER   PIC X(13)  VALUE    '059337 012500'.
               05  FILLER   PIC X(13)  VALUE    '059338 012827'.
               05  FILLER   PIC X(13)  VALUE    '059339 012827'.
               05  FILLER   PIC X(13)  VALUE    '059340 017251'.
               05  FILLER   PIC X(13)  VALUE    '059341 014349'.
               05  FILLER   PIC X(13)  VALUE    '059342 012827'.
               05  FILLER   PIC X(13)  VALUE    '059343 012827'.
               05  FILLER   PIC X(13)  VALUE    '059344 012500'.
               05  FILLER   PIC X(13)  VALUE    '059345 012827'.
               05  FILLER   PIC X(13)  VALUE    '059346 012827'.
               05  FILLER   PIC X(13)  VALUE    '059347 017827'.
               05  FILLER   PIC X(13)  VALUE    '059348 016900'.
               05  FILLER   PIC X(13)  VALUE    '059349 017251'.
               05  FILLER   PIC X(13)  VALUE    '059350 012827'.
               05  FILLER   PIC X(13)  VALUE    '059351 012827'.
               05  FILLER   PIC X(13)  VALUE    '059352 012827'.
               05  FILLER   PIC X(13)  VALUE    '059353 012827'.
               05  FILLER   PIC X(13)  VALUE    '059354 016900'.
               05  FILLER   PIC X(13)  VALUE    '059355 016900'.
               05  FILLER   PIC X(13)  VALUE    '059356 012500'.
               05  FILLER   PIC X(13)  VALUE    '059357 017827'.
               05  FILLER   PIC X(13)  VALUE    '059358 012827'.
               05  FILLER   PIC X(13)  VALUE    '059359 012827'.
               05  FILLER   PIC X(13)  VALUE    '059360 017827'.
               05  FILLER   PIC X(13)  VALUE    '059361 012827'.
               05  FILLER   PIC X(13)  VALUE    '059362 014015'.
               05  FILLER   PIC X(13)  VALUE    '059363 012827'.
               05  FILLER   PIC X(13)  VALUE    '059364 017251'.
               05  FILLER   PIC X(13)  VALUE    '059365 014349'.
               05  FILLER   PIC X(13)  VALUE    '059366 012827'.
               05  FILLER   PIC X(13)  VALUE    '059367 012827'.
               05  FILLER   PIC X(13)  VALUE    '059368 012827'.
               05  FILLER   PIC X(13)  VALUE    '059369 017251'.
               05  FILLER   PIC X(13)  VALUE    '059370 012827'.
               05  FILLER   PIC X(13)  VALUE    '059371 012827'.
               05  FILLER   PIC X(13)  VALUE    '059373 012500'.
               05  FILLER   PIC X(13)  VALUE    '059374 012500'.
               05  FILLER   PIC X(13)  VALUE    '059375 017251'.
               05  FILLER   PIC X(13)  VALUE    '059378 012827'.
               05  FILLER   PIC X(13)  VALUE    '059379 012827'.
               05  FILLER   PIC X(13)  VALUE    '059383 012827'.
               05  FILLER   PIC X(13)  VALUE    '059386 012500'.
               05  FILLER   PIC X(13)  VALUE    '059387 012500'.
               05  FILLER   PIC X(13)  VALUE    '059388 012500'.
               05  FILLER   PIC X(13)  VALUE    '059389 012500'.
               05  FILLER   PIC X(13)  VALUE    '059390 012500'.
               05  FILLER   PIC X(13)  VALUE    '059395 012827'.
               05  FILLER   PIC X(13)  VALUE    '059397 012500'.
               05  FILLER   PIC X(13)  VALUE    '059398 012500'.
               05  FILLER   PIC X(13)  VALUE    '059399 012827'.
               05  FILLER   PIC X(13)  VALUE    '059402 012827'.
               05  FILLER   PIC X(13)  VALUE    '059404 012827'.
               05  FILLER   PIC X(13)  VALUE    '059405 012827'.
               05  FILLER   PIC X(13)  VALUE    '059406 012827'.
               05  FILLER   PIC X(13)  VALUE    '059407 012827'.
               05  FILLER   PIC X(13)  VALUE    '059409 012827'.
               05  FILLER   PIC X(13)  VALUE    '059410 012827'.
               05  FILLER   PIC X(13)  VALUE    '059411 012827'.
               05  FILLER   PIC X(13)  VALUE    '059412 012827'.
               05  FILLER   PIC X(13)  VALUE    '059413 016900'.
               05  FILLER   PIC X(13)  VALUE    '059414 012500'.
               05  FILLER   PIC X(13)  VALUE    '059418 012500'.
               05  FILLER   PIC X(13)  VALUE    '059421 012500'.
               05  FILLER   PIC X(13)  VALUE    '06S001 010071'.
               05  FILLER   PIC X(13)  VALUE    '06S009 010050'.
               05  FILLER   PIC X(13)  VALUE    '06S010 009937'.
               05  FILLER   PIC X(13)  VALUE    '06S011 010050'.
               05  FILLER   PIC X(13)  VALUE    '06S020 009937'.
               05  FILLER   PIC X(13)  VALUE    '06S027 010206'.
               05  FILLER   PIC X(13)  VALUE    '06S044 009937'.
               05  FILLER   PIC X(13)  VALUE    '06S064 010050'.
               05  FILLER   PIC X(13)  VALUE    '06S100 010050'.
               05  FILLER   PIC X(13)  VALUE    '06T001 009885'.
               05  FILLER   PIC X(13)  VALUE    '06T006 009937'.
               05  FILLER   PIC X(13)  VALUE    '06T010 009937'.
               05  FILLER   PIC X(13)  VALUE    '06T011 010050'.
               05  FILLER   PIC X(13)  VALUE    '06T015 010050'.
               05  FILLER   PIC X(13)  VALUE    '06T020 009937'.
               05  FILLER   PIC X(13)  VALUE    '06T022 009937'.
               05  FILLER   PIC X(13)  VALUE    '06T023 009937'.
               05  FILLER   PIC X(13)  VALUE    '06T024 010050'.
               05  FILLER   PIC X(13)  VALUE    '06T027 010206'.
               05  FILLER   PIC X(13)  VALUE    '06T030 009937'.
               05  FILLER   PIC X(13)  VALUE    '06T031 009937'.
               05  FILLER   PIC X(13)  VALUE    '06T034 010050'.
               05  FILLER   PIC X(13)  VALUE    '06T064 010050'.
               05  FILLER   PIC X(13)  VALUE    '06T065 010050'.
               05  FILLER   PIC X(13)  VALUE    '06T075 009937'.
               05  FILLER   PIC X(13)  VALUE    '06T113 010050'.
               05  FILLER   PIC X(13)  VALUE    '06T119 009937'.
               05  FILLER   PIC X(13)  VALUE    '06T129 010050'.
               05  FILLER   PIC X(13)  VALUE    '06U008 009937'.
               05  FILLER   PIC X(13)  VALUE    '06U049 009937'.
               05  FILLER   PIC X(13)  VALUE    '060001 010050'.
               05  FILLER   PIC X(13)  VALUE    '060003 010206'.
               05  FILLER   PIC X(13)  VALUE    '060004 010050'.
               05  FILLER   PIC X(13)  VALUE    '060006 009937'.
               05  FILLER   PIC X(13)  VALUE    '060008 009937'.
               05  FILLER   PIC X(13)  VALUE    '060009 010050'.
               05  FILLER   PIC X(13)  VALUE    '060010 009937'.
               05  FILLER   PIC X(13)  VALUE    '060011 010050'.
               05  FILLER   PIC X(13)  VALUE    '060012 009937'.
               05  FILLER   PIC X(13)  VALUE    '060013 009937'.
               05  FILLER   PIC X(13)  VALUE    '060014 010050'.
               05  FILLER   PIC X(13)  VALUE    '060015 010050'.
               05  FILLER   PIC X(13)  VALUE    '060020 009937'.
               05  FILLER   PIC X(13)  VALUE    '060022 009937'.
               05  FILLER   PIC X(13)  VALUE    '060023 009937'.
               05  FILLER   PIC X(13)  VALUE    '060024 010050'.
               05  FILLER   PIC X(13)  VALUE    '060027 010206'.
               05  FILLER   PIC X(13)  VALUE    '060028 010050'.
               05  FILLER   PIC X(13)  VALUE    '060030 009937'.
               05  FILLER   PIC X(13)  VALUE    '060031 010050'.
               05  FILLER   PIC X(13)  VALUE    '060032 010050'.
               05  FILLER   PIC X(13)  VALUE    '060034 010050'.
               05  FILLER   PIC X(13)  VALUE    '060044 009937'.
               05  FILLER   PIC X(13)  VALUE    '060049 009937'.
               05  FILLER   PIC X(13)  VALUE    '060054 009937'.
               05  FILLER   PIC X(13)  VALUE    '060064 010050'.
               05  FILLER   PIC X(13)  VALUE    '060065 010050'.
               05  FILLER   PIC X(13)  VALUE    '060071 009937'.
               05  FILLER   PIC X(13)  VALUE    '060075 009937'.
               05  FILLER   PIC X(13)  VALUE    '060076 009937'.
               05  FILLER   PIC X(13)  VALUE    '060096 010050'.
               05  FILLER   PIC X(13)  VALUE    '060100 010050'.
               05  FILLER   PIC X(13)  VALUE    '060103 010050'.
               05  FILLER   PIC X(13)  VALUE    '060104 010050'.
               05  FILLER   PIC X(13)  VALUE    '060107 010050'.
               05  FILLER   PIC X(13)  VALUE    '060112 010050'.
               05  FILLER   PIC X(13)  VALUE    '060113 010050'.
               05  FILLER   PIC X(13)  VALUE    '060114 010050'.
               05  FILLER   PIC X(13)  VALUE    '060116 010206'.
               05  FILLER   PIC X(13)  VALUE    '060117 009937'.
               05  FILLER   PIC X(13)  VALUE    '060118 010050'.
               05  FILLER   PIC X(13)  VALUE    '060119 009937'.
               05  FILLER   PIC X(13)  VALUE    '060124 010050'.
               05  FILLER   PIC X(13)  VALUE    '060125 010050'.
               05  FILLER   PIC X(13)  VALUE    '060126 009937'.
               05  FILLER   PIC X(13)  VALUE    '060127 010050'.
               05  FILLER   PIC X(13)  VALUE    '060128 010174'.
               05  FILLER   PIC X(13)  VALUE    '060129 010050'.
               05  FILLER   PIC X(13)  VALUE    '060130 009937'.
               05  FILLER   PIC X(13)  VALUE    '061500 009937'.
               05  FILLER   PIC X(13)  VALUE    '061501 010174'.
               05  FILLER   PIC X(13)  VALUE    '061503 009937'.
               05  FILLER   PIC X(13)  VALUE    '061504 010050'.
               05  FILLER   PIC X(13)  VALUE    '061505 009937'.
               05  FILLER   PIC X(13)  VALUE    '061506 010050'.
               05  FILLER   PIC X(13)  VALUE    '061507 009937'.
               05  FILLER   PIC X(13)  VALUE    '061508 010050'.
               05  FILLER   PIC X(13)  VALUE    '061509 010050'.
               05  FILLER   PIC X(13)  VALUE    '061510 009937'.
               05  FILLER   PIC X(13)  VALUE    '061511 009937'.
               05  FILLER   PIC X(13)  VALUE    '061512 009937'.
               05  FILLER   PIC X(13)  VALUE    '061515 009937'.
               05  FILLER   PIC X(13)  VALUE    '061516 009937'.
               05  FILLER   PIC X(13)  VALUE    '061517 010050'.
               05  FILLER   PIC X(13)  VALUE    '061520 010050'.
               05  FILLER   PIC X(13)  VALUE    '061522 009937'.
               05  FILLER   PIC X(13)  VALUE    '061523 009937'.
               05  FILLER   PIC X(13)  VALUE    '061525 009937'.
               05  FILLER   PIC X(13)  VALUE    '061526 010050'.
               05  FILLER   PIC X(13)  VALUE    '061527 009937'.
               05  FILLER   PIC X(13)  VALUE    '061530 009937'.
               05  FILLER   PIC X(13)  VALUE    '061531 009937'.
               05  FILLER   PIC X(13)  VALUE    '061532 009937'.
               05  FILLER   PIC X(13)  VALUE    '061537 009937'.
               05  FILLER   PIC X(13)  VALUE    '061538 009937'.
               05  FILLER   PIC X(13)  VALUE    '061540 010050'.
               05  FILLER   PIC X(13)  VALUE    '061543 009937'.
               05  FILLER   PIC X(13)  VALUE    '061545 010050'.
               05  FILLER   PIC X(13)  VALUE    '061547 010174'.
               05  FILLER   PIC X(13)  VALUE    '061548 009937'.
               05  FILLER   PIC X(13)  VALUE    '061549 009937'.
               05  FILLER   PIC X(13)  VALUE    '061551 010050'.
               05  FILLER   PIC X(13)  VALUE    '061552 009937'.
               05  FILLER   PIC X(13)  VALUE    '061553 009937'.
               05  FILLER   PIC X(13)  VALUE    '061554 009937'.
               05  FILLER   PIC X(13)  VALUE    '061556 010050'.
               05  FILLER   PIC X(13)  VALUE    '061557 010174'.
               05  FILLER   PIC X(13)  VALUE    '061558 010050'.
               05  FILLER   PIC X(13)  VALUE    '061559 010050'.
               05  FILLER   PIC X(13)  VALUE    '061560 009937'.
               05  FILLER   PIC X(13)  VALUE    '061561 009937'.
               05  FILLER   PIC X(13)  VALUE    '061562 009937'.
               05  FILLER   PIC X(13)  VALUE    '061563 009937'.
               05  FILLER   PIC X(13)  VALUE    '061564 009937'.
               05  FILLER   PIC X(13)  VALUE    '061566 010050'.
               05  FILLER   PIC X(13)  VALUE    '061567 009937'.
               05  FILLER   PIC X(13)  VALUE    '061568 010050'.
               05  FILLER   PIC X(13)  VALUE    '061569 010050'.
               05  FILLER   PIC X(13)  VALUE    '061570 010050'.
               05  FILLER   PIC X(13)  VALUE    '061571 010050'.
               05  FILLER   PIC X(13)  VALUE    '061572 010050'.
               05  FILLER   PIC X(13)  VALUE    '061573 010050'.
               05  FILLER   PIC X(13)  VALUE    '061575 010050'.
               05  FILLER   PIC X(13)  VALUE    '061576 010050'.
               05  FILLER   PIC X(13)  VALUE    '061577 009937'.
               05  FILLER   PIC X(13)  VALUE    '061578 010050'.
               05  FILLER   PIC X(13)  VALUE    '061579 009937'.
               05  FILLER   PIC X(13)  VALUE    '062009 010050'.
               05  FILLER   PIC X(13)  VALUE    '062011 010050'.
               05  FILLER   PIC X(13)  VALUE    '062012 010050'.
               05  FILLER   PIC X(13)  VALUE    '062013 010050'.
               05  FILLER   PIC X(13)  VALUE    '062014 010050'.
               05  FILLER   PIC X(13)  VALUE    '062015 010050'.
               05  FILLER   PIC X(13)  VALUE    '062017 009937'.
               05  FILLER   PIC X(13)  VALUE    '063027 010050'.
               05  FILLER   PIC X(13)  VALUE    '063030 009937'.
               05  FILLER   PIC X(13)  VALUE    '063033 009987'.
               05  FILLER   PIC X(13)  VALUE    '063034 010050'.
               05  FILLER   PIC X(13)  VALUE    '063035 010050'.
               05  FILLER   PIC X(13)  VALUE    '063301 010050'.
               05  FILLER   PIC X(13)  VALUE    '064001 009937'.
               05  FILLER   PIC X(13)  VALUE    '064003 010050'.
               05  FILLER   PIC X(13)  VALUE    '064007 010206'.
               05  FILLER   PIC X(13)  VALUE    '064009 009937'.
               05  FILLER   PIC X(13)  VALUE    '064023 009937'.
               05  FILLER   PIC X(13)  VALUE    '064024 010050'.
               05  FILLER   PIC X(13)  VALUE    '064026 009937'.
               05  FILLER   PIC X(13)  VALUE    '064027 009937'.
               05  FILLER   PIC X(13)  VALUE    '064028 010050'.
               05  FILLER   PIC X(13)  VALUE    '064618 010050'.
               05  FILLER   PIC X(13)  VALUE    '067467 010050'.
               05  FILLER   PIC X(13)  VALUE    '067468 009937'.
               05  FILLER   PIC X(13)  VALUE    '067469 010050'.
               05  FILLER   PIC X(13)  VALUE    '067470 009937'.
               05  FILLER   PIC X(13)  VALUE    '067471 010050'.
               05  FILLER   PIC X(13)  VALUE    '067474 010050'.
               05  FILLER   PIC X(13)  VALUE    '067475 010050'.
               05  FILLER   PIC X(13)  VALUE    '067476 009937'.
               05  FILLER   PIC X(13)  VALUE    '067477 009937'.
               05  FILLER   PIC X(13)  VALUE    '067478 009937'.
               05  FILLER   PIC X(13)  VALUE    '067481 010174'.
               05  FILLER   PIC X(13)  VALUE    '067484 009937'.
               05  FILLER   PIC X(13)  VALUE    '067485 010050'.
               05  FILLER   PIC X(13)  VALUE    '067486 010050'.
               05  FILLER   PIC X(13)  VALUE    '067487 009937'.
               05  FILLER   PIC X(13)  VALUE    '067488 010050'.
               05  FILLER   PIC X(13)  VALUE    '067489 010050'.
               05  FILLER   PIC X(13)  VALUE    '067490 009937'.
               05  FILLER   PIC X(13)  VALUE    '067491 010050'.
               05  FILLER   PIC X(13)  VALUE    '067492 010050'.
               05  FILLER   PIC X(13)  VALUE    '067493 010050'.
               05  FILLER   PIC X(13)  VALUE    '067494 009937'.
               05  FILLER   PIC X(13)  VALUE    '067495 010050'.
               05  FILLER   PIC X(13)  VALUE    '067496 010050'.
               05  FILLER   PIC X(13)  VALUE    '067497 010050'.
               05  FILLER   PIC X(13)  VALUE    '067498 010050'.
               05  FILLER   PIC X(13)  VALUE    '067499 009937'.
               05  FILLER   PIC X(13)  VALUE    '067500 009937'.
               05  FILLER   PIC X(13)  VALUE    '067501 009937'.
               05  FILLER   PIC X(13)  VALUE    '067502 009937'.
               05  FILLER   PIC X(13)  VALUE    '067503 010050'.
               05  FILLER   PIC X(13)  VALUE    '067504 010050'.
               05  FILLER   PIC X(13)  VALUE    '067505 010050'.
               05  FILLER   PIC X(13)  VALUE    '067507 010050'.
               05  FILLER   PIC X(13)  VALUE    '067508 009937'.
               05  FILLER   PIC X(13)  VALUE    '067511 009937'.
               05  FILLER   PIC X(13)  VALUE    '07B022 012599'.
               05  FILLER   PIC X(13)  VALUE    '07B033 012660'.
               05  FILLER   PIC X(13)  VALUE    '07S002 012575'.
               05  FILLER   PIC X(13)  VALUE    '07S004 012592'.
               05  FILLER   PIC X(13)  VALUE    '07S005 012588'.
               05  FILLER   PIC X(13)  VALUE    '07S008 012575'.
               05  FILLER   PIC X(13)  VALUE    '07S010 012684'.
               05  FILLER   PIC X(13)  VALUE    '07S011 012592'.
               05  FILLER   PIC X(13)  VALUE    '07S016 012588'.
               05  FILLER   PIC X(13)  VALUE    '07S020 012575'.
               05  FILLER   PIC X(13)  VALUE    '07S022 012588'.
               05  FILLER   PIC X(13)  VALUE    '07S024 012575'.
               05  FILLER   PIC X(13)  VALUE    '07S025 012575'.
               05  FILLER   PIC X(13)  VALUE    '07S027 012575'.
               05  FILLER   PIC X(13)  VALUE    '07S028 012684'.
               05  FILLER   PIC X(13)  VALUE    '07S029 012575'.
               05  FILLER   PIC X(13)  VALUE    '07S031 012588'.
               05  FILLER   PIC X(13)  VALUE    '07S033 012684'.
               05  FILLER   PIC X(13)  VALUE    '07S034 012684'.
               05  FILLER   PIC X(13)  VALUE    '07S035 012575'.
               05  FILLER   PIC X(13)  VALUE    '07S036 012575'.
               05  FILLER   PIC X(13)  VALUE    '07S039 012588'.
               05  FILLER   PIC X(13)  VALUE    '07S040 012575'.
               05  FILLER   PIC X(13)  VALUE    '07T006 012684'.
               05  FILLER   PIC X(13)  VALUE    '07T007 012575'.
               05  FILLER   PIC X(13)  VALUE    '07T022 012588'.
               05  FILLER   PIC X(13)  VALUE    '07T025 012575'.
               05  FILLER   PIC X(13)  VALUE    '07T028 012684'.
               05  FILLER   PIC X(13)  VALUE    '07T033 012684'.
               05  FILLER   PIC X(13)  VALUE    '070002 012575'.
               05  FILLER   PIC X(13)  VALUE    '070003 012575'.
               05  FILLER   PIC X(13)  VALUE    '070004 012592'.
               05  FILLER   PIC X(13)  VALUE    '070005 013348'.
               05  FILLER   PIC X(13)  VALUE    '070006 012684'.
               05  FILLER   PIC X(13)  VALUE    '070007 013348'.
               05  FILLER   PIC X(13)  VALUE    '070008 012575'.
               05  FILLER   PIC X(13)  VALUE    '070010 012684'.
               05  FILLER   PIC X(13)  VALUE    '070011 012592'.
               05  FILLER   PIC X(13)  VALUE    '070012 012575'.
               05  FILLER   PIC X(13)  VALUE    '070015 012660'.
               05  FILLER   PIC X(13)  VALUE    '070016 013348'.
               05  FILLER   PIC X(13)  VALUE    '070017 013348'.
               05  FILLER   PIC X(13)  VALUE    '070018 012684'.
               05  FILLER   PIC X(13)  VALUE    '070019 013348'.
               05  FILLER   PIC X(13)  VALUE    '070020 012575'.
               05  FILLER   PIC X(13)  VALUE    '070021 012575'.
               05  FILLER   PIC X(13)  VALUE    '070022 013348'.
               05  FILLER   PIC X(13)  VALUE    '070024 013348'.
               05  FILLER   PIC X(13)  VALUE    '070025 012575'.
               05  FILLER   PIC X(13)  VALUE    '070027 012575'.
               05  FILLER   PIC X(13)  VALUE    '070028 012684'.
               05  FILLER   PIC X(13)  VALUE    '070029 012575'.
               05  FILLER   PIC X(13)  VALUE    '070031 013348'.
               05  FILLER   PIC X(13)  VALUE    '070033 012684'.
               05  FILLER   PIC X(13)  VALUE    '070034 012684'.
               05  FILLER   PIC X(13)  VALUE    '070035 012575'.
               05  FILLER   PIC X(13)  VALUE    '070036 012575'.
               05  FILLER   PIC X(13)  VALUE    '070038 013348'.
               05  FILLER   PIC X(13)  VALUE    '070039 013348'.
               05  FILLER   PIC X(13)  VALUE    '070040 012575'.
               05  FILLER   PIC X(13)  VALUE    '071500 012575'.
               05  FILLER   PIC X(13)  VALUE    '071501 012660'.
               05  FILLER   PIC X(13)  VALUE    '071502 012575'.
               05  FILLER   PIC X(13)  VALUE    '071504 012575'.
               05  FILLER   PIC X(13)  VALUE    '071505 012660'.
               05  FILLER   PIC X(13)  VALUE    '071506 012575'.
               05  FILLER   PIC X(13)  VALUE    '071507 012575'.
               05  FILLER   PIC X(13)  VALUE    '071510 012575'.
               05  FILLER   PIC X(13)  VALUE    '071512 012660'.
               05  FILLER   PIC X(13)  VALUE    '071515 012575'.
               05  FILLER   PIC X(13)  VALUE    '071516 012575'.
               05  FILLER   PIC X(13)  VALUE    '071517 012575'.
               05  FILLER   PIC X(13)  VALUE    '071518 012660'.
               05  FILLER   PIC X(13)  VALUE    '071520 012575'.
               05  FILLER   PIC X(13)  VALUE    '071522 012575'.
               05  FILLER   PIC X(13)  VALUE    '071523 012575'.
               05  FILLER   PIC X(13)  VALUE    '071524 012575'.
               05  FILLER   PIC X(13)  VALUE    '071527 012575'.
               05  FILLER   PIC X(13)  VALUE    '071528 012660'.
               05  FILLER   PIC X(13)  VALUE    '071530 012575'.
               05  FILLER   PIC X(13)  VALUE    '071532 012575'.
               05  FILLER   PIC X(13)  VALUE    '071535 012575'.
               05  FILLER   PIC X(13)  VALUE    '071536 012575'.
               05  FILLER   PIC X(13)  VALUE    '071537 012575'.
               05  FILLER   PIC X(13)  VALUE    '071538 012575'.
               05  FILLER   PIC X(13)  VALUE    '071539 012575'.
               05  FILLER   PIC X(13)  VALUE    '071540 012575'.
               05  FILLER   PIC X(13)  VALUE    '071541 012660'.
               05  FILLER   PIC X(13)  VALUE    '071542 012575'.
               05  FILLER   PIC X(13)  VALUE    '072003 012588'.
               05  FILLER   PIC X(13)  VALUE    '072004 012575'.
               05  FILLER   PIC X(13)  VALUE    '073025 012575'.
               05  FILLER   PIC X(13)  VALUE    '073300 012575'.
               05  FILLER   PIC X(13)  VALUE    '074003 012575'.
               05  FILLER   PIC X(13)  VALUE    '074008 012575'.
               05  FILLER   PIC X(13)  VALUE    '074011 012588'.
               05  FILLER   PIC X(13)  VALUE    '074012 012684'.
               05  FILLER   PIC X(13)  VALUE    '074014 012684'.
               05  FILLER   PIC X(13)  VALUE    '074502 012575'.
               05  FILLER   PIC X(13)  VALUE    '074504 012660'.
               05  FILLER   PIC X(13)  VALUE    '074505 012660'.
               05  FILLER   PIC X(13)  VALUE    '074508 012660'.
               05  FILLER   PIC X(13)  VALUE    '074609 012575'.
               05  FILLER   PIC X(13)  VALUE    '077001 012660'.
               05  FILLER   PIC X(13)  VALUE    '077028 012660'.
               05  FILLER   PIC X(13)  VALUE    '077038 012575'.
               05  FILLER   PIC X(13)  VALUE    '077063 012575'.
               05  FILLER   PIC X(13)  VALUE    '077066 012660'.
               05  FILLER   PIC X(13)  VALUE    '077074 012660'.
               05  FILLER   PIC X(13)  VALUE    '077085 012575'.
               05  FILLER   PIC X(13)  VALUE    '077088 012660'.
               05  FILLER   PIC X(13)  VALUE    '077089 012575'.
               05  FILLER   PIC X(13)  VALUE    '077090 012575'.
               05  FILLER   PIC X(13)  VALUE    '077112 012575'.
               05  FILLER   PIC X(13)  VALUE    '077113 012660'.
               05  FILLER   PIC X(13)  VALUE    '077133 012575'.
               05  FILLER   PIC X(13)  VALUE    '077144 012637'.
               05  FILLER   PIC X(13)  VALUE    '077172 012660'.
               05  FILLER   PIC X(13)  VALUE    '077175 012660'.
               05  FILLER   PIC X(13)  VALUE    '077181 012660'.
               05  FILLER   PIC X(13)  VALUE    '077198 012575'.
               05  FILLER   PIC X(13)  VALUE    '077200 012660'.
               05  FILLER   PIC X(13)  VALUE    '077205 012660'.
               05  FILLER   PIC X(13)  VALUE    '077221 012660'.
               05  FILLER   PIC X(13)  VALUE    '077228 012575'.
               05  FILLER   PIC X(13)  VALUE    '077229 012575'.
               05  FILLER   PIC X(13)  VALUE    '077230 012575'.
               05  FILLER   PIC X(13)  VALUE    '077231 012575'.
               05  FILLER   PIC X(13)  VALUE    '077232 012660'.
               05  FILLER   PIC X(13)  VALUE    '077233 012660'.
               05  FILLER   PIC X(13)  VALUE    '077235 012575'.
               05  FILLER   PIC X(13)  VALUE    '077244 012575'.
               05  FILLER   PIC X(13)  VALUE    '077245 012575'.
               05  FILLER   PIC X(13)  VALUE    '08S001 011303'.
               05  FILLER   PIC X(13)  VALUE    '08T001 011303'.
               05  FILLER   PIC X(13)  VALUE    '08T003 010962'.
               05  FILLER   PIC X(13)  VALUE    '08T004 010815'.
               05  FILLER   PIC X(13)  VALUE    '08T009 009142'.
               05  FILLER   PIC X(13)  VALUE    '080001 011303'.
               05  FILLER   PIC X(13)  VALUE    '080003 011303'.
               05  FILLER   PIC X(13)  VALUE    '080004 011111'.
               05  FILLER   PIC X(13)  VALUE    '080006 009911'.
               05  FILLER   PIC X(13)  VALUE    '080007 010590'.
               05  FILLER   PIC X(13)  VALUE    '080009 009911'.
               05  FILLER   PIC X(13)  VALUE    '081500 011303'.
               05  FILLER   PIC X(13)  VALUE    '081502 010088'.
               05  FILLER   PIC X(13)  VALUE    '081504 011303'.
               05  FILLER   PIC X(13)  VALUE    '081506 011303'.
               05  FILLER   PIC X(13)  VALUE    '081508 011303'.
               05  FILLER   PIC X(13)  VALUE    '082000 011303'.
               05  FILLER   PIC X(13)  VALUE    '083026 011303'.
               05  FILLER   PIC X(13)  VALUE    '083027 010313'.
               05  FILLER   PIC X(13)  VALUE    '083300 011303'.
               05  FILLER   PIC X(13)  VALUE    '084001 011303'.
               05  FILLER   PIC X(13)  VALUE    '084002 011303'.
               05  FILLER   PIC X(13)  VALUE    '084003 011303'.
               05  FILLER   PIC X(13)  VALUE    '084004 010313'.
               05  FILLER   PIC X(13)  VALUE    '084005 009142'.
               05  FILLER   PIC X(13)  VALUE    '084500 011303'.
               05  FILLER   PIC X(13)  VALUE    '087033 010088'.
               05  FILLER   PIC X(13)  VALUE    '087040 011303'.
               05  FILLER   PIC X(13)  VALUE    '087041 011303'.
               05  FILLER   PIC X(13)  VALUE    '087042 010088'.
               05  FILLER   PIC X(13)  VALUE    '09S001 009998'.
               05  FILLER   PIC X(13)  VALUE    '09S004 009998'.
               05  FILLER   PIC X(13)  VALUE    '09S005 009998'.
               05  FILLER   PIC X(13)  VALUE    '09S011 009998'.
               05  FILLER   PIC X(13)  VALUE    '09T001 009998'.
               05  FILLER   PIC X(13)  VALUE    '09T008 009998'.
               05  FILLER   PIC X(13)  VALUE    '090001 009998'.
               05  FILLER   PIC X(13)  VALUE    '090003 009998'.
               05  FILLER   PIC X(13)  VALUE    '090004 009998'.
               05  FILLER   PIC X(13)  VALUE    '090005 009998'.
               05  FILLER   PIC X(13)  VALUE    '090006 009998'.
               05  FILLER   PIC X(13)  VALUE    '090008 009998'.
               05  FILLER   PIC X(13)  VALUE    '090011 009998'.
               05  FILLER   PIC X(13)  VALUE    '091500 009998'.
               05  FILLER   PIC X(13)  VALUE    '091501 009998'.
               05  FILLER   PIC X(13)  VALUE    '091506 009998'.
               05  FILLER   PIC X(13)  VALUE    '091507 009998'.
               05  FILLER   PIC X(13)  VALUE    '092002 009998'.
               05  FILLER   PIC X(13)  VALUE    '092003 009998'.
               05  FILLER   PIC X(13)  VALUE    '093025 009998'.
               05  FILLER   PIC X(13)  VALUE    '093300 009998'.
               05  FILLER   PIC X(13)  VALUE    '094001 009998'.
               05  FILLER   PIC X(13)  VALUE    '094004 009998'.
               05  FILLER   PIC X(13)  VALUE    '097068 009998'.
               05  FILLER   PIC X(13)  VALUE    '10B029 009565'.
               05  FILLER   PIC X(13)  VALUE    '10B167 009198'.
               05  FILLER   PIC X(13)  VALUE    '10S002 008924'.
               05  FILLER   PIC X(13)  VALUE    '10S006 008942'.
               05  FILLER   PIC X(13)  VALUE    '10S007 008942'.
               05  FILLER   PIC X(13)  VALUE    '10S009 009198'.
               05  FILLER   PIC X(13)  VALUE    '10S017 008128'.
               05  FILLER   PIC X(13)  VALUE    '10S018 008446'.
               05  FILLER   PIC X(13)  VALUE    '10S022 009198'.
               05  FILLER   PIC X(13)  VALUE    '10S034 009198'.
               05  FILLER   PIC X(13)  VALUE    '10S038 009565'.
               05  FILLER   PIC X(13)  VALUE    '10S039 009565'.
               05  FILLER   PIC X(13)  VALUE    '10S040 009044'.
               05  FILLER   PIC X(13)  VALUE    '10S045 008128'.
               05  FILLER   PIC X(13)  VALUE    '10S047 008568'.
               05  FILLER   PIC X(13)  VALUE    '10S061 009198'.
               05  FILLER   PIC X(13)  VALUE    '10S067 008896'.
               05  FILLER   PIC X(13)  VALUE    '10S070 008128'.
               05  FILLER   PIC X(13)  VALUE    '10S080 008924'.
               05  FILLER   PIC X(13)  VALUE    '10S084 008942'.
               05  FILLER   PIC X(13)  VALUE    '10S087 009550'.
               05  FILLER   PIC X(13)  VALUE    '10S088 009044'.
               05  FILLER   PIC X(13)  VALUE    '10S092 009151'.
               05  FILLER   PIC X(13)  VALUE    '10S093 008169'.
               05  FILLER   PIC X(13)  VALUE    '10S099 008233'.
               05  FILLER   PIC X(13)  VALUE    '10S105 008634'.
               05  FILLER   PIC X(13)  VALUE    '10S110 008942'.
               05  FILLER   PIC X(13)  VALUE    '10S113 009180'.
               05  FILLER   PIC X(13)  VALUE    '10S131 009198'.
               05  FILLER   PIC X(13)  VALUE    '10S135 008437'.
               05  FILLER   PIC X(13)  VALUE    '10S137 008128'.
               05  FILLER   PIC X(13)  VALUE    '10S150 008128'.
               05  FILLER   PIC X(13)  VALUE    '10S157 008233'.
               05  FILLER   PIC X(13)  VALUE    '10S166 009550'.
               05  FILLER   PIC X(13)  VALUE    '10S167 009565'.
               05  FILLER   PIC X(13)  VALUE    '10S179 009044'.
               05  FILLER   PIC X(13)  VALUE    '10S187 009198'.
               05  FILLER   PIC X(13)  VALUE    '10S191 008896'.
               05  FILLER   PIC X(13)  VALUE    '10S200 009565'.
               05  FILLER   PIC X(13)  VALUE    '10S204 009180'.
               05  FILLER   PIC X(13)  VALUE    '10S206 008896'.
               05  FILLER   PIC X(13)  VALUE    '10S209 009198'.
               05  FILLER   PIC X(13)  VALUE    '10S217 008573'.
               05  FILLER   PIC X(13)  VALUE    '10S223 008539'.
               05  FILLER   PIC X(13)  VALUE    '10S224 009565'.
               05  FILLER   PIC X(13)  VALUE    '10S226 009044'.
               05  FILLER   PIC X(13)  VALUE    '10S231 008169'.
               05  FILLER   PIC X(13)  VALUE    '10S234 008924'.
               05  FILLER   PIC X(13)  VALUE    '10S243 008896'.
               05  FILLER   PIC X(13)  VALUE    '10S246 008968'.
               05  FILLER   PIC X(13)  VALUE    '10S248 008896'.
               05  FILLER   PIC X(13)  VALUE    '10S249 008460'.
               05  FILLER   PIC X(13)  VALUE    '10S255 008896'.
               05  FILLER   PIC X(13)  VALUE    '10S258 008924'.
               05  FILLER   PIC X(13)  VALUE    '10S260 008968'.
               05  FILLER   PIC X(13)  VALUE    '10S284 009198'.
               05  FILLER   PIC X(13)  VALUE    '10S288 008924'.
               05  FILLER   PIC X(13)  VALUE    '10T002 008924'.
               05  FILLER   PIC X(13)  VALUE    '10T006 008942'.
               05  FILLER   PIC X(13)  VALUE    '10T007 008942'.
               05  FILLER   PIC X(13)  VALUE    '10T008 009198'.
               05  FILLER   PIC X(13)  VALUE    '10T012 009341'.
               05  FILLER   PIC X(13)  VALUE    '10T017 008128'.
               05  FILLER   PIC X(13)  VALUE    '10T018 008446'.
               05  FILLER   PIC X(13)  VALUE    '10T022 009198'.
               05  FILLER   PIC X(13)  VALUE    '10T032 008896'.
               05  FILLER   PIC X(13)  VALUE    '10T034 009198'.
               05  FILLER   PIC X(13)  VALUE    '10T038 009565'.
               05  FILLER   PIC X(13)  VALUE    '10T052 008233'.
               05  FILLER   PIC X(13)  VALUE    '10T061 009198'.
               05  FILLER   PIC X(13)  VALUE    '10T063 008896'.
               05  FILLER   PIC X(13)  VALUE    '10T068 008128'.
               05  FILLER   PIC X(13)  VALUE    '10T073 009565'.
               05  FILLER   PIC X(13)  VALUE    '10T086 009565'.
               05  FILLER   PIC X(13)  VALUE    '10T087 009550'.
               05  FILLER   PIC X(13)  VALUE    '10T110 008942'.
               05  FILLER   PIC X(13)  VALUE    '10T113 009180'.
               05  FILLER   PIC X(13)  VALUE    '10T114 009198'.
               05  FILLER   PIC X(13)  VALUE    '10T126 008896'.
               05  FILLER   PIC X(13)  VALUE    '10T128 008896'.
               05  FILLER   PIC X(13)  VALUE    '10T157 008233'.
               05  FILLER   PIC X(13)  VALUE    '10T161 008942'.
               05  FILLER   PIC X(13)  VALUE    '10T167 009565'.
               05  FILLER   PIC X(13)  VALUE    '10T173 008896'.
               05  FILLER   PIC X(13)  VALUE    '10T213 009550'.
               05  FILLER   PIC X(13)  VALUE    '10T223 008539'.
               05  FILLER   PIC X(13)  VALUE    '10T225 009565'.
               05  FILLER   PIC X(13)  VALUE    '10T226 009044'.
               05  FILLER   PIC X(13)  VALUE    '10T231 008169'.
               05  FILLER   PIC X(13)  VALUE    '10T236 008568'.
               05  FILLER   PIC X(13)  VALUE    '10T246 008968'.
               05  FILLER   PIC X(13)  VALUE    '10T248 008896'.
               05  FILLER   PIC X(13)  VALUE    '10T249 008271'.
               05  FILLER   PIC X(13)  VALUE    '10T258 008924'.
               05  FILLER   PIC X(13)  VALUE    '10T288 008924'.
               05  FILLER   PIC X(13)  VALUE    '10T290 008421'.
               05  FILLER   PIC X(13)  VALUE    '100001 009044'.
               05  FILLER   PIC X(13)  VALUE    '100002 009431'.
               05  FILLER   PIC X(13)  VALUE    '100006 008942'.
               05  FILLER   PIC X(13)  VALUE    '100007 008942'.
               05  FILLER   PIC X(13)  VALUE    '100008 009198'.
               05  FILLER   PIC X(13)  VALUE    '100009 009198'.
               05  FILLER   PIC X(13)  VALUE    '100012 009341'.
               05  FILLER   PIC X(13)  VALUE    '100014 008734'.
               05  FILLER   PIC X(13)  VALUE    '100017 008734'.
               05  FILLER   PIC X(13)  VALUE    '100018 009064'.
               05  FILLER   PIC X(13)  VALUE    '100019 009151'.
               05  FILLER   PIC X(13)  VALUE    '100022 009431'.
               05  FILLER   PIC X(13)  VALUE    '100023 008469'.
               05  FILLER   PIC X(13)  VALUE    '100025 008169'.
               05  FILLER   PIC X(13)  VALUE    '100026 008128'.
               05  FILLER   PIC X(13)  VALUE    '100028 009151'.
               05  FILLER   PIC X(13)  VALUE    '100029 009198'.
               05  FILLER   PIC X(13)  VALUE    '100030 008942'.
               05  FILLER   PIC X(13)  VALUE    '100032 008896'.
               05  FILLER   PIC X(13)  VALUE    '100034 009198'.
               05  FILLER   PIC X(13)  VALUE    '100035 009550'.
               05  FILLER   PIC X(13)  VALUE    '100038 009565'.
               05  FILLER   PIC X(13)  VALUE    '100039 009565'.
               05  FILLER   PIC X(13)  VALUE    '100040 009044'.
               05  FILLER   PIC X(13)  VALUE    '100043 008896'.
               05  FILLER   PIC X(13)  VALUE    '100044 008968'.
               05  FILLER   PIC X(13)  VALUE    '100045 008734'.
               05  FILLER   PIC X(13)  VALUE    '100046 008896'.
               05  FILLER   PIC X(13)  VALUE    '100047 008968'.
               05  FILLER   PIC X(13)  VALUE    '100048 008128'.
               05  FILLER   PIC X(13)  VALUE    '100049 008128'.
               05  FILLER   PIC X(13)  VALUE    '100050 009198'.
               05  FILLER   PIC X(13)  VALUE    '100051 008942'.
               05  FILLER   PIC X(13)  VALUE    '100052 008787'.
               05  FILLER   PIC X(13)  VALUE    '100053 009198'.
               05  FILLER   PIC X(13)  VALUE    '100054 008539'.
               05  FILLER   PIC X(13)  VALUE    '100055 008896'.
               05  FILLER   PIC X(13)  VALUE    '100057 008942'.
               05  FILLER   PIC X(13)  VALUE    '100062 008943'.
               05  FILLER   PIC X(13)  VALUE    '100063 008896'.
               05  FILLER   PIC X(13)  VALUE    '100067 008896'.
               05  FILLER   PIC X(13)  VALUE    '100068 008734'.
               05  FILLER   PIC X(13)  VALUE    '100069 008896'.
               05  FILLER   PIC X(13)  VALUE    '100070 009550'.
               05  FILLER   PIC X(13)  VALUE    '100071 008896'.
               05  FILLER   PIC X(13)  VALUE    '100072 008734'.
               05  FILLER   PIC X(13)  VALUE    '100073 009565'.
               05  FILLER   PIC X(13)  VALUE    '100075 008896'.
               05  FILLER   PIC X(13)  VALUE    '100076 009198'.
               05  FILLER   PIC X(13)  VALUE    '100077 008968'.
               05  FILLER   PIC X(13)  VALUE    '100079 009198'.
               05  FILLER   PIC X(13)  VALUE    '100080 009431'.
               05  FILLER   PIC X(13)  VALUE    '100081 008539'.
               05  FILLER   PIC X(13)  VALUE    '100084 008942'.
               05  FILLER   PIC X(13)  VALUE    '100086 009565'.
               05  FILLER   PIC X(13)  VALUE    '100087 009550'.
               05  FILLER   PIC X(13)  VALUE    '100088 009044'.
               05  FILLER   PIC X(13)  VALUE    '100090 008128'.
               05  FILLER   PIC X(13)  VALUE    '100092 009151'.
               05  FILLER   PIC X(13)  VALUE    '100093 008169'.
               05  FILLER   PIC X(13)  VALUE    '100099 008233'.
               05  FILLER   PIC X(13)  VALUE    '100102 008371'.
               05  FILLER   PIC X(13)  VALUE    '100105 008968'.
               05  FILLER   PIC X(13)  VALUE    '100106 008128'.
               05  FILLER   PIC X(13)  VALUE    '100107 009341'.
               05  FILLER   PIC X(13)  VALUE    '100109 008128'.
               05  FILLER   PIC X(13)  VALUE    '100110 008942'.
               05  FILLER   PIC X(13)  VALUE    '100113 009180'.
               05  FILLER   PIC X(13)  VALUE    '100117 009044'.
               05  FILLER   PIC X(13)  VALUE    '100118 008128'.
               05  FILLER   PIC X(13)  VALUE    '100121 008233'.
               05  FILLER   PIC X(13)  VALUE    '100122 008539'.
               05  FILLER   PIC X(13)  VALUE    '100124 008169'.
               05  FILLER   PIC X(13)  VALUE    '100125 009198'.
               05  FILLER   PIC X(13)  VALUE    '100126 008896'.
               05  FILLER   PIC X(13)  VALUE    '100127 008896'.
               05  FILLER   PIC X(13)  VALUE    '100128 008896'.
               05  FILLER   PIC X(13)  VALUE    '100130 009431'.
               05  FILLER   PIC X(13)  VALUE    '100131 009198'.
               05  FILLER   PIC X(13)  VALUE    '100132 008896'.
               05  FILLER   PIC X(13)  VALUE    '100134 008128'.
               05  FILLER   PIC X(13)  VALUE    '100135 008437'.
               05  FILLER   PIC X(13)  VALUE    '100137 008787'.
               05  FILLER   PIC X(13)  VALUE    '100140 009044'.
               05  FILLER   PIC X(13)  VALUE    '100142 008128'.
               05  FILLER   PIC X(13)  VALUE    '100150 009198'.
               05  FILLER   PIC X(13)  VALUE    '100151 009044'.
               05  FILLER   PIC X(13)  VALUE    '100154 009198'.
               05  FILLER   PIC X(13)  VALUE    '100156 008371'.
               05  FILLER   PIC X(13)  VALUE    '100157 008968'.
               05  FILLER   PIC X(13)  VALUE    '100161 008942'.
               05  FILLER   PIC X(13)  VALUE    '100166 009550'.
               05  FILLER   PIC X(13)  VALUE    '100167 009565'.
               05  FILLER   PIC X(13)  VALUE    '100168 009431'.
               05  FILLER   PIC X(13)  VALUE    '100173 008896'.
               05  FILLER   PIC X(13)  VALUE    '100175 008128'.
               05  FILLER   PIC X(13)  VALUE    '100176 009431'.
               05  FILLER   PIC X(13)  VALUE    '100177 009151'.
               05  FILLER   PIC X(13)  VALUE    '100179 009044'.
               05  FILLER   PIC X(13)  VALUE    '100180 008896'.
               05  FILLER   PIC X(13)  VALUE    '100181 009198'.
               05  FILLER   PIC X(13)  VALUE    '100183 009198'.
               05  FILLER   PIC X(13)  VALUE    '100187 009198'.
               05  FILLER   PIC X(13)  VALUE    '100189 009565'.
               05  FILLER   PIC X(13)  VALUE    '100191 008896'.
               05  FILLER   PIC X(13)  VALUE    '100200 009565'.
               05  FILLER   PIC X(13)  VALUE    '100204 009180'.
               05  FILLER   PIC X(13)  VALUE    '100206 008896'.
               05  FILLER   PIC X(13)  VALUE    '100209 009198'.
               05  FILLER   PIC X(13)  VALUE    '100211 008896'.
               05  FILLER   PIC X(13)  VALUE    '100212 008943'.
               05  FILLER   PIC X(13)  VALUE    '100213 009550'.
               05  FILLER   PIC X(13)  VALUE    '100217 008968'.
               05  FILLER   PIC X(13)  VALUE    '100220 009341'.
               05  FILLER   PIC X(13)  VALUE    '100223 008539'.
               05  FILLER   PIC X(13)  VALUE    '100224 009565'.
               05  FILLER   PIC X(13)  VALUE    '100226 009044'.
               05  FILLER   PIC X(13)  VALUE    '100228 009565'.
               05  FILLER   PIC X(13)  VALUE    '100230 009565'.
               05  FILLER   PIC X(13)  VALUE    '100231 008169'.
               05  FILLER   PIC X(13)  VALUE    '100232 008943'.
               05  FILLER   PIC X(13)  VALUE    '100234 009431'.
               05  FILLER   PIC X(13)  VALUE    '100236 008968'.
               05  FILLER   PIC X(13)  VALUE    '100238 008896'.
               05  FILLER   PIC X(13)  VALUE    '100239 008896'.
               05  FILLER   PIC X(13)  VALUE    '100240 009198'.
               05  FILLER   PIC X(13)  VALUE    '100242 008128'.
               05  FILLER   PIC X(13)  VALUE    '100243 008896'.
               05  FILLER   PIC X(13)  VALUE    '100244 009341'.
               05  FILLER   PIC X(13)  VALUE    '100246 008968'.
               05  FILLER   PIC X(13)  VALUE    '100248 008896'.
               05  FILLER   PIC X(13)  VALUE    '100249 008787'.
               05  FILLER   PIC X(13)  VALUE    '100252 008968'.
               05  FILLER   PIC X(13)  VALUE    '100253 009431'.
               05  FILLER   PIC X(13)  VALUE    '100254 008437'.
               05  FILLER   PIC X(13)  VALUE    '100255 008896'.
               05  FILLER   PIC X(13)  VALUE    '100256 008896'.
               05  FILLER   PIC X(13)  VALUE    '100258 009431'.
               05  FILLER   PIC X(13)  VALUE    '100259 008896'.
               05  FILLER   PIC X(13)  VALUE    '100260 008968'.
               05  FILLER   PIC X(13)  VALUE    '100264 008896'.
               05  FILLER   PIC X(13)  VALUE    '100265 008896'.
               05  FILLER   PIC X(13)  VALUE    '100266 008169'.
               05  FILLER   PIC X(13)  VALUE    '100267 009550'.
               05  FILLER   PIC X(13)  VALUE    '100268 009431'.
               05  FILLER   PIC X(13)  VALUE    '100269 009431'.
               05  FILLER   PIC X(13)  VALUE    '100271 008896'.
               05  FILLER   PIC X(13)  VALUE    '100275 009431'.
               05  FILLER   PIC X(13)  VALUE    '100276 009565'.
               05  FILLER   PIC X(13)  VALUE    '100277 009198'.
               05  FILLER   PIC X(13)  VALUE    '100281 009565'.
               05  FILLER   PIC X(13)  VALUE    '100284 009198'.
               05  FILLER   PIC X(13)  VALUE    '100285 009565'.
               05  FILLER   PIC X(13)  VALUE    '100286 009064'.
               05  FILLER   PIC X(13)  VALUE    '100287 009431'.
               05  FILLER   PIC X(13)  VALUE    '100288 009431'.
               05  FILLER   PIC X(13)  VALUE    '100289 009565'.
               05  FILLER   PIC X(13)  VALUE    '100290 008734'.
               05  FILLER   PIC X(13)  VALUE    '100291 009151'.
               05  FILLER   PIC X(13)  VALUE    '100292 008539'.
               05  FILLER   PIC X(13)  VALUE    '100296 009198'.
               05  FILLER   PIC X(13)  VALUE    '100298 008437'.
               05  FILLER   PIC X(13)  VALUE    '100299 009550'.
               05  FILLER   PIC X(13)  VALUE    '100302 008942'.
               05  FILLER   PIC X(13)  VALUE    '100307 009044'.
               05  FILLER   PIC X(13)  VALUE    '100313 008128'.
               05  FILLER   PIC X(13)  VALUE    '100314 009198'.
               05  FILLER   PIC X(13)  VALUE    '100315 009151'.
               05  FILLER   PIC X(13)  VALUE    '100316 009151'.
               05  FILLER   PIC X(13)  VALUE    '100319 008896'.
               05  FILLER   PIC X(13)  VALUE    '100320 008942'.
               05  FILLER   PIC X(13)  VALUE    '100321 009044'.
               05  FILLER   PIC X(13)  VALUE    '100322 008943'.
               05  FILLER   PIC X(13)  VALUE    '100324 009341'.
               05  FILLER   PIC X(13)  VALUE    '100325 008128'.
               05  FILLER   PIC X(13)  VALUE    '100326 009198'.
               05  FILLER   PIC X(13)  VALUE    '100327 008446'.
               05  FILLER   PIC X(13)  VALUE    '100329 008942'.
               05  FILLER   PIC X(13)  VALUE    '101400 009198'.
               05  FILLER   PIC X(13)  VALUE    '101401 009565'.
               05  FILLER   PIC X(13)  VALUE    '101402 008896'.
               05  FILLER   PIC X(13)  VALUE    '101403 009198'.
               05  FILLER   PIC X(13)  VALUE    '101406 009198'.
               05  FILLER   PIC X(13)  VALUE    '101407 008942'.
               05  FILLER   PIC X(13)  VALUE    '101408 009198'.
               05  FILLER   PIC X(13)  VALUE    '101409 009044'.
               05  FILLER   PIC X(13)  VALUE    '101416 009198'.
               05  FILLER   PIC X(13)  VALUE    '101418 008128'.
               05  FILLER   PIC X(13)  VALUE    '101419 009198'.
               05  FILLER   PIC X(13)  VALUE    '101421 009565'.
               05  FILLER   PIC X(13)  VALUE    '101422 009198'.
               05  FILLER   PIC X(13)  VALUE    '101424 009198'.
               05  FILLER   PIC X(13)  VALUE    '101425 008968'.
               05  FILLER   PIC X(13)  VALUE    '101431 009198'.
               05  FILLER   PIC X(13)  VALUE    '101433 009198'.
               05  FILLER   PIC X(13)  VALUE    '101434 009198'.
               05  FILLER   PIC X(13)  VALUE    '101436 008924'.
               05  FILLER   PIC X(13)  VALUE    '101437 009198'.
               05  FILLER   PIC X(13)  VALUE    '101438 008128'.
               05  FILLER   PIC X(13)  VALUE    '101439 009198'.
               05  FILLER   PIC X(13)  VALUE    '101440 009198'.
               05  FILLER   PIC X(13)  VALUE    '101441 009198'.
               05  FILLER   PIC X(13)  VALUE    '101442 009565'.
               05  FILLER   PIC X(13)  VALUE    '101443 009198'.
               05  FILLER   PIC X(13)  VALUE    '101447 008896'.
               05  FILLER   PIC X(13)  VALUE    '101448 009198'.
               05  FILLER   PIC X(13)  VALUE    '101449 008896'.
               05  FILLER   PIC X(13)  VALUE    '101450 008896'.
               05  FILLER   PIC X(13)  VALUE    '101451 008896'.
               05  FILLER   PIC X(13)  VALUE    '101452 009198'.
               05  FILLER   PIC X(13)  VALUE    '101454 009198'.
               05  FILLER   PIC X(13)  VALUE    '101455 009198'.
               05  FILLER   PIC X(13)  VALUE    '101456 009198'.
               05  FILLER   PIC X(13)  VALUE    '101462 009198'.
               05  FILLER   PIC X(13)  VALUE    '101464 009198'.
               05  FILLER   PIC X(13)  VALUE    '101466 009198'.
               05  FILLER   PIC X(13)  VALUE    '101467 009198'.
               05  FILLER   PIC X(13)  VALUE    '101468 009198'.
               05  FILLER   PIC X(13)  VALUE    '101469 009198'.
               05  FILLER   PIC X(13)  VALUE    '101470 009198'.
               05  FILLER   PIC X(13)  VALUE    '101472 009198'.
               05  FILLER   PIC X(13)  VALUE    '101473 009198'.
               05  FILLER   PIC X(13)  VALUE    '101474 009198'.
               05  FILLER   PIC X(13)  VALUE    '101475 009198'.
               05  FILLER   PIC X(13)  VALUE    '101476 009198'.
               05  FILLER   PIC X(13)  VALUE    '101477 009198'.
               05  FILLER   PIC X(13)  VALUE    '101478 009198'.
               05  FILLER   PIC X(13)  VALUE    '101479 008924'.
               05  FILLER   PIC X(13)  VALUE    '101480 009198'.
               05  FILLER   PIC X(13)  VALUE    '101483 009198'.
               05  FILLER   PIC X(13)  VALUE    '101484 009198'.
               05  FILLER   PIC X(13)  VALUE    '101485 008942'.
               05  FILLER   PIC X(13)  VALUE    '101486 008924'.
               05  FILLER   PIC X(13)  VALUE    '101488 009565'.
               05  FILLER   PIC X(13)  VALUE    '101489 009198'.
               05  FILLER   PIC X(13)  VALUE    '101492 009198'.
               05  FILLER   PIC X(13)  VALUE    '101493 009198'.
               05  FILLER   PIC X(13)  VALUE    '101496 009044'.
               05  FILLER   PIC X(13)  VALUE    '101498 008896'.
               05  FILLER   PIC X(13)  VALUE    '101499 009198'.
               05  FILLER   PIC X(13)  VALUE    '101549 009044'.
               05  FILLER   PIC X(13)  VALUE    '101551 008169'.
               05  FILLER   PIC X(13)  VALUE    '102001 009198'.
               05  FILLER   PIC X(13)  VALUE    '102003 008942'.
               05  FILLER   PIC X(13)  VALUE    '102009 008896'.
               05  FILLER   PIC X(13)  VALUE    '102010 009565'.
               05  FILLER   PIC X(13)  VALUE    '102012 009044'.
               05  FILLER   PIC X(13)  VALUE    '102013 008896'.
               05  FILLER   PIC X(13)  VALUE    '102015 009044'.
               05  FILLER   PIC X(13)  VALUE    '102018 009550'.
               05  FILLER   PIC X(13)  VALUE    '102019 008580'.
               05  FILLER   PIC X(13)  VALUE    '102020 008437'.
               05  FILLER   PIC X(13)  VALUE    '102021 008896'.
               05  FILLER   PIC X(13)  VALUE    '102022 009180'.
               05  FILLER   PIC X(13)  VALUE    '102023 008924'.
               05  FILLER   PIC X(13)  VALUE    '102024 008169'.
               05  FILLER   PIC X(13)  VALUE    '102025 008924'.
               05  FILLER   PIC X(13)  VALUE    '102026 008896'.
               05  FILLER   PIC X(13)  VALUE    '102027 009151'.
               05  FILLER   PIC X(13)  VALUE    '102028 008421'.
               05  FILLER   PIC X(13)  VALUE    '102029 009341'.
               05  FILLER   PIC X(13)  VALUE    '102030 008128'.
               05  FILLER   PIC X(13)  VALUE    '102031 009198'.
               05  FILLER   PIC X(13)  VALUE    '102032 008446'.
               05  FILLER   PIC X(13)  VALUE    '103026 009198'.
               05  FILLER   PIC X(13)  VALUE    '103027 009565'.
               05  FILLER   PIC X(13)  VALUE    '103028 009565'.
               05  FILLER   PIC X(13)  VALUE    '103031 009550'.
               05  FILLER   PIC X(13)  VALUE    '103034 009151'.
               05  FILLER   PIC X(13)  VALUE    '103036 009198'.
               05  FILLER   PIC X(13)  VALUE    '103037 008896'.
               05  FILLER   PIC X(13)  VALUE    '103038 009198'.
               05  FILLER   PIC X(13)  VALUE    '103039 009044'.
               05  FILLER   PIC X(13)  VALUE    '103042 008896'.
               05  FILLER   PIC X(13)  VALUE    '103043 008580'.
               05  FILLER   PIC X(13)  VALUE    '103044 008968'.
               05  FILLER   PIC X(13)  VALUE    '103045 008942'.
               05  FILLER   PIC X(13)  VALUE    '103046 009180'.
               05  FILLER   PIC X(13)  VALUE    '103300 008896'.
               05  FILLER   PIC X(13)  VALUE    '103301 009198'.
               05  FILLER   PIC X(13)  VALUE    '103304 008942'.
               05  FILLER   PIC X(13)  VALUE    '104000 008437'.
               05  FILLER   PIC X(13)  VALUE    '104007 009044'.
               05  FILLER   PIC X(13)  VALUE    '104008 008924'.
               05  FILLER   PIC X(13)  VALUE    '104016 009044'.
               05  FILLER   PIC X(13)  VALUE    '104017 008896'.
               05  FILLER   PIC X(13)  VALUE    '104026 009565'.
               05  FILLER   PIC X(13)  VALUE    '104049 009198'.
               05  FILLER   PIC X(13)  VALUE    '104057 008896'.
               05  FILLER   PIC X(13)  VALUE    '104063 008446'.
               05  FILLER   PIC X(13)  VALUE    '104069 009044'.
               05  FILLER   PIC X(13)  VALUE    '104070 008968'.
               05  FILLER   PIC X(13)  VALUE    '104071 008469'.
               05  FILLER   PIC X(13)  VALUE    '104072 008942'.
               05  FILLER   PIC X(13)  VALUE    '104073 008128'.
               05  FILLER   PIC X(13)  VALUE    '104074 009341'.
               05  FILLER   PIC X(13)  VALUE    '104075 008896'.
               05  FILLER   PIC X(13)  VALUE    '104078 009550'.
               05  FILLER   PIC X(13)  VALUE    '104079 009565'.
               05  FILLER   PIC X(13)  VALUE    '104080 008968'.
               05  FILLER   PIC X(13)  VALUE    '104081 008942'.
               05  FILLER   PIC X(13)  VALUE    '104521 008128'.
               05  FILLER   PIC X(13)  VALUE    '104600 008896'.
               05  FILLER   PIC X(13)  VALUE    '104604 009198'.
               05  FILLER   PIC X(13)  VALUE    '104605 008539'.
               05  FILLER   PIC X(13)  VALUE    '104610 009198'.
               05  FILLER   PIC X(13)  VALUE    '104650 008896'.
               05  FILLER   PIC X(13)  VALUE    '104651 009198'.
               05  FILLER   PIC X(13)  VALUE    '104654 009044'.
               05  FILLER   PIC X(13)  VALUE    '104655 008896'.
               05  FILLER   PIC X(13)  VALUE    '104662 008942'.
               05  FILLER   PIC X(13)  VALUE    '104666 009198'.
               05  FILLER   PIC X(13)  VALUE    '104676 009198'.
               05  FILLER   PIC X(13)  VALUE    '104691 009198'.
               05  FILLER   PIC X(13)  VALUE    '104699 009198'.
               05  FILLER   PIC X(13)  VALUE    '104700 009198'.
               05  FILLER   PIC X(13)  VALUE    '104702 009198'.
               05  FILLER   PIC X(13)  VALUE    '104704 008924'.
               05  FILLER   PIC X(13)  VALUE    '104709 009565'.
               05  FILLER   PIC X(13)  VALUE    '104714 008896'.
               05  FILLER   PIC X(13)  VALUE    '104723 008896'.
               05  FILLER   PIC X(13)  VALUE    '104726 008896'.
               05  FILLER   PIC X(13)  VALUE    '104732 009198'.
               05  FILLER   PIC X(13)  VALUE    '104748 008942'.
               05  FILLER   PIC X(13)  VALUE    '104750 008896'.
               05  FILLER   PIC X(13)  VALUE    '104751 009550'.
               05  FILLER   PIC X(13)  VALUE    '104752 008896'.
               05  FILLER   PIC X(13)  VALUE    '104754 008924'.
               05  FILLER   PIC X(13)  VALUE    '104755 009198'.
               05  FILLER   PIC X(13)  VALUE    '104761 009198'.
               05  FILLER   PIC X(13)  VALUE    '104768 009198'.
               05  FILLER   PIC X(13)  VALUE    '104772 008896'.
               05  FILLER   PIC X(13)  VALUE    '104788 009198'.
               05  FILLER   PIC X(13)  VALUE    '104803 008128'.
               05  FILLER   PIC X(13)  VALUE    '104828 008128'.
               05  FILLER   PIC X(13)  VALUE    '104901 009198'.
               05  FILLER   PIC X(13)  VALUE    '104902 009198'.
               05  FILLER   PIC X(13)  VALUE    '104904 009198'.
               05  FILLER   PIC X(13)  VALUE    '104907 008128'.
               05  FILLER   PIC X(13)  VALUE    '104909 009198'.
               05  FILLER   PIC X(13)  VALUE    '104915 009198'.
               05  FILLER   PIC X(13)  VALUE    '104920 008896'.
               05  FILLER   PIC X(13)  VALUE    '104927 009198'.
               05  FILLER   PIC X(13)  VALUE    '104942 009198'.
               05  FILLER   PIC X(13)  VALUE    '104945 009565'.
               05  FILLER   PIC X(13)  VALUE    '104957 009198'.
               05  FILLER   PIC X(13)  VALUE    '104959 009198'.
               05  FILLER   PIC X(13)  VALUE    '104960 009198'.
               05  FILLER   PIC X(13)  VALUE    '104966 009198'.
               05  FILLER   PIC X(13)  VALUE    '104978 008924'.
               05  FILLER   PIC X(13)  VALUE    '104988 008896'.
               05  FILLER   PIC X(13)  VALUE    '104989 009565'.
               05  FILLER   PIC X(13)  VALUE    '104991 009565'.
               05  FILLER   PIC X(13)  VALUE    '104993 009198'.
               05  FILLER   PIC X(13)  VALUE    '104996 009198'.
               05  FILLER   PIC X(13)  VALUE    '104998 009550'.
               05  FILLER   PIC X(13)  VALUE    '107534 008896'.
               05  FILLER   PIC X(13)  VALUE    '108211 009044'.
               05  FILLER   PIC X(13)  VALUE    '108224 008128'.
               05  FILLER   PIC X(13)  VALUE    '109022 009565'.
               05  FILLER   PIC X(13)  VALUE    '109023 009198'.
               05  FILLER   PIC X(13)  VALUE    '109029 009198'.
               05  FILLER   PIC X(13)  VALUE    '109030 009565'.
               05  FILLER   PIC X(13)  VALUE    '109031 009198'.
               05  FILLER   PIC X(13)  VALUE    '109032 008942'.
               05  FILLER   PIC X(13)  VALUE    '109033 008446'.
               05  FILLER   PIC X(13)  VALUE    '109034 009198'.
               05  FILLER   PIC X(13)  VALUE    '109041 009198'.
               05  FILLER   PIC X(13)  VALUE    '109043 009198'.
               05  FILLER   PIC X(13)  VALUE    '109044 009198'.
               05  FILLER   PIC X(13)  VALUE    '109049 008942'.
               05  FILLER   PIC X(13)  VALUE    '109050 009198'.
               05  FILLER   PIC X(13)  VALUE    '109052 009198'.
               05  FILLER   PIC X(13)  VALUE    '109053 009198'.
               05  FILLER   PIC X(13)  VALUE    '109054 009198'.
               05  FILLER   PIC X(13)  VALUE    '109056 009565'.
               05  FILLER   PIC X(13)  VALUE    '109057 009565'.
               05  FILLER   PIC X(13)  VALUE    '109058 008924'.
               05  FILLER   PIC X(13)  VALUE    '109060 008896'.
               05  FILLER   PIC X(13)  VALUE    '109061 008896'.
               05  FILLER   PIC X(13)  VALUE    '109064 009198'.
               05  FILLER   PIC X(13)  VALUE    '109065 009198'.
               05  FILLER   PIC X(13)  VALUE    '109068 009198'.
               05  FILLER   PIC X(13)  VALUE    '109070 009198'.
               05  FILLER   PIC X(13)  VALUE    '109071 008942'.
               05  FILLER   PIC X(13)  VALUE    '109072 009198'.
               05  FILLER   PIC X(13)  VALUE    '109076 009565'.
               05  FILLER   PIC X(13)  VALUE    '109077 009198'.
               05  FILLER   PIC X(13)  VALUE    '109078 009198'.
               05  FILLER   PIC X(13)  VALUE    '109079 009198'.
               05  FILLER   PIC X(13)  VALUE    '109080 008924'.
               05  FILLER   PIC X(13)  VALUE    '109082 009198'.
               05  FILLER   PIC X(13)  VALUE    '109088 008896'.
               05  FILLER   PIC X(13)  VALUE    '109091 009198'.
               05  FILLER   PIC X(13)  VALUE    '109096 009198'.
               05  FILLER   PIC X(13)  VALUE    '109098 009198'.
               05  FILLER   PIC X(13)  VALUE    '109100 009198'.
               05  FILLER   PIC X(13)  VALUE    '109102 008128'.
               05  FILLER   PIC X(13)  VALUE    '109105 009198'.
               05  FILLER   PIC X(13)  VALUE    '109106 009198'.
               05  FILLER   PIC X(13)  VALUE    '109107 009198'.
               05  FILLER   PIC X(13)  VALUE    '109112 009198'.
               05  FILLER   PIC X(13)  VALUE    '109113 009198'.
               05  FILLER   PIC X(13)  VALUE    '109120 009198'.
               05  FILLER   PIC X(13)  VALUE    '109122 009198'.
               05  FILLER   PIC X(13)  VALUE    '109124 009198'.
               05  FILLER   PIC X(13)  VALUE    '109127 009198'.
               05  FILLER   PIC X(13)  VALUE    '109130 009198'.
               05  FILLER   PIC X(13)  VALUE    '109136 009198'.
               05  FILLER   PIC X(13)  VALUE    '109137 009198'.
               05  FILLER   PIC X(13)  VALUE    '109138 009565'.
               05  FILLER   PIC X(13)  VALUE    '109139 008896'.
               05  FILLER   PIC X(13)  VALUE    '109140 009198'.
               05  FILLER   PIC X(13)  VALUE    '109141 008896'.
               05  FILLER   PIC X(13)  VALUE    '109142 009198'.
               05  FILLER   PIC X(13)  VALUE    '109143 008924'.
               05  FILLER   PIC X(13)  VALUE    '109144 009198'.
               05  FILLER   PIC X(13)  VALUE    '109145 009198'.
               05  FILLER   PIC X(13)  VALUE    '109148 009198'.
               05  FILLER   PIC X(13)  VALUE    '109151 008942'.
               05  FILLER   PIC X(13)  VALUE    '109153 008128'.
               05  FILLER   PIC X(13)  VALUE    '109154 008469'.
               05  FILLER   PIC X(13)  VALUE    '109156 009198'.
               05  FILLER   PIC X(13)  VALUE    '109167 009198'.
               05  FILLER   PIC X(13)  VALUE    '109169 009198'.
               05  FILLER   PIC X(13)  VALUE    '109172 009198'.
               05  FILLER   PIC X(13)  VALUE    '109173 009198'.
               05  FILLER   PIC X(13)  VALUE    '109177 008924'.
               05  FILLER   PIC X(13)  VALUE    '109180 009198'.
               05  FILLER   PIC X(13)  VALUE    '109181 009198'.
               05  FILLER   PIC X(13)  VALUE    '109193 008896'.
               05  FILLER   PIC X(13)  VALUE    '109196 009198'.
               05  FILLER   PIC X(13)  VALUE    '109197 009198'.
               05  FILLER   PIC X(13)  VALUE    '11S001 008262'.
               05  FILLER   PIC X(13)  VALUE    '11S002 007313'.
               05  FILLER   PIC X(13)  VALUE    '11S003 007313'.
               05  FILLER   PIC X(13)  VALUE    '11S007 008521'.
               05  FILLER   PIC X(13)  VALUE    '11S010 009350'.
               05  FILLER   PIC X(13)  VALUE    '11S015 009350'.
               05  FILLER   PIC X(13)  VALUE    '11S029 008738'.
               05  FILLER   PIC X(13)  VALUE    '11S036 007920'.
               05  FILLER   PIC X(13)  VALUE    '11S038 007313'.
               05  FILLER   PIC X(13)  VALUE    '11S040 007313'.
               05  FILLER   PIC X(13)  VALUE    '11S054 008781'.
               05  FILLER   PIC X(13)  VALUE    '11S071 007313'.
               05  FILLER   PIC X(13)  VALUE    '11S073 007313'.
               05  FILLER   PIC X(13)  VALUE    '11S079 009350'.
               05  FILLER   PIC X(13)  VALUE    '11S092 007313'.
               05  FILLER   PIC X(13)  VALUE    '11S101 007313'.
               05  FILLER   PIC X(13)  VALUE    '11S107 008929'.
               05  FILLER   PIC X(13)  VALUE    '11S109 007313'.
               05  FILLER   PIC X(13)  VALUE    '11S112 007313'.
               05  FILLER   PIC X(13)  VALUE    '11S115 009350'.
               05  FILLER   PIC X(13)  VALUE    '11S129 007932'.
               05  FILLER   PIC X(13)  VALUE    '11S142 007313'.
               05  FILLER   PIC X(13)  VALUE    '11S164 008929'.
               05  FILLER   PIC X(13)  VALUE    '11S165 009350'.
               05  FILLER   PIC X(13)  VALUE    '11S186 007932'.
               05  FILLER   PIC X(13)  VALUE    '11S187 007313'.
               05  FILLER   PIC X(13)  VALUE    '11S190 007313'.
               05  FILLER   PIC X(13)  VALUE    '11S192 009350'.
               05  FILLER   PIC X(13)  VALUE    '11S194 007313'.
               05  FILLER   PIC X(13)  VALUE    '11S209 007313'.
               05  FILLER   PIC X(13)  VALUE    '11S234 007313'.
               05  FILLER   PIC X(13)  VALUE    '11T003 007432'.
               05  FILLER   PIC X(13)  VALUE    '11T006 008571'.
               05  FILLER   PIC X(13)  VALUE    '11T007 008521'.
               05  FILLER   PIC X(13)  VALUE    '11T010 009350'.
               05  FILLER   PIC X(13)  VALUE    '11T024 007920'.
               05  FILLER   PIC X(13)  VALUE    '11T029 008738'.
               05  FILLER   PIC X(13)  VALUE    '11T033 009350'.
               05  FILLER   PIC X(13)  VALUE    '11T035 009350'.
               05  FILLER   PIC X(13)  VALUE    '11T038 007313'.
               05  FILLER   PIC X(13)  VALUE    '11T043 007920'.
               05  FILLER   PIC X(13)  VALUE    '11T054 008781'.
               05  FILLER   PIC X(13)  VALUE    '11T076 009350'.
               05  FILLER   PIC X(13)  VALUE    '11T087 009350'.
               05  FILLER   PIC X(13)  VALUE    '11T115 009350'.
               05  FILLER   PIC X(13)  VALUE    '11T122 007382'.
               05  FILLER   PIC X(13)  VALUE    '11T125 007313'.
               05  FILLER   PIC X(13)  VALUE    '11T143 009350'.
               05  FILLER   PIC X(13)  VALUE    '11T163 008521'.
               05  FILLER   PIC X(13)  VALUE    '11T164 008929'.
               05  FILLER   PIC X(13)  VALUE    '11T165 009350'.
               05  FILLER   PIC X(13)  VALUE    '11T168 008781'.
               05  FILLER   PIC X(13)  VALUE    '11T192 009350'.
               05  FILLER   PIC X(13)  VALUE    '11T198 009350'.
               05  FILLER   PIC X(13)  VALUE    '11T200 007932'.
               05  FILLER   PIC X(13)  VALUE    '11T203 009350'.
               05  FILLER   PIC X(13)  VALUE    '11U105 007313'.
               05  FILLER   PIC X(13)  VALUE    '11Z333 007313'.
               05  FILLER   PIC X(13)  VALUE    '110001 009208'.
               05  FILLER   PIC X(13)  VALUE    '110002 009208'.
               05  FILLER   PIC X(13)  VALUE    '110003 007994'.
               05  FILLER   PIC X(13)  VALUE    '110004 008519'.
               05  FILLER   PIC X(13)  VALUE    '110005 009350'.
               05  FILLER   PIC X(13)  VALUE    '110006 009208'.
               05  FILLER   PIC X(13)  VALUE    '110007 008521'.
               05  FILLER   PIC X(13)  VALUE    '110008 009350'.
               05  FILLER   PIC X(13)  VALUE    '110010 009350'.
               05  FILLER   PIC X(13)  VALUE    '110011 009350'.
               05  FILLER   PIC X(13)  VALUE    '110015 009350'.
               05  FILLER   PIC X(13)  VALUE    '110016 009208'.
               05  FILLER   PIC X(13)  VALUE    '110018 009350'.
               05  FILLER   PIC X(13)  VALUE    '110023 009208'.
               05  FILLER   PIC X(13)  VALUE    '110024 007920'.
               05  FILLER   PIC X(13)  VALUE    '110025 008311'.
               05  FILLER   PIC X(13)  VALUE    '110026 007313'.
               05  FILLER   PIC X(13)  VALUE    '110027 007490'.
               05  FILLER   PIC X(13)  VALUE    '110028 008690'.
               05  FILLER   PIC X(13)  VALUE    '110029 008744'.
               05  FILLER   PIC X(13)  VALUE    '110030 009350'.
               05  FILLER   PIC X(13)  VALUE    '110031 009350'.
               05  FILLER   PIC X(13)  VALUE    '110032 007313'.
               05  FILLER   PIC X(13)  VALUE    '110034 008690'.
               05  FILLER   PIC X(13)  VALUE    '110035 009350'.
               05  FILLER   PIC X(13)  VALUE    '110036 007920'.
               05  FILLER   PIC X(13)  VALUE    '110038 007764'.
               05  FILLER   PIC X(13)  VALUE    '110039 008690'.
               05  FILLER   PIC X(13)  VALUE    '110040 009208'.
               05  FILLER   PIC X(13)  VALUE    '110041 007648'.
               05  FILLER   PIC X(13)  VALUE    '110042 009350'.
               05  FILLER   PIC X(13)  VALUE    '110043 007920'.
               05  FILLER   PIC X(13)  VALUE    '110044 007525'.
               05  FILLER   PIC X(13)  VALUE    '110045 009350'.
               05  FILLER   PIC X(13)  VALUE    '110046 009350'.
               05  FILLER   PIC X(13)  VALUE    '110050 008262'.
               05  FILLER   PIC X(13)  VALUE    '110051 007313'.
               05  FILLER   PIC X(13)  VALUE    '110054 009208'.
               05  FILLER   PIC X(13)  VALUE    '110064 007932'.
               05  FILLER   PIC X(13)  VALUE    '110069 008612'.
               05  FILLER   PIC X(13)  VALUE    '110071 007313'.
               05  FILLER   PIC X(13)  VALUE    '110073 007313'.
               05  FILLER   PIC X(13)  VALUE    '110074 009208'.
               05  FILLER   PIC X(13)  VALUE    '110075 007920'.
               05  FILLER   PIC X(13)  VALUE    '110076 009350'.
               05  FILLER   PIC X(13)  VALUE    '110078 009350'.
               05  FILLER   PIC X(13)  VALUE    '110079 009350'.
               05  FILLER   PIC X(13)  VALUE    '110082 009350'.
               05  FILLER   PIC X(13)  VALUE    '110083 009350'.
               05  FILLER   PIC X(13)  VALUE    '110086 007313'.
               05  FILLER   PIC X(13)  VALUE    '110087 009350'.
               05  FILLER   PIC X(13)  VALUE    '110089 007313'.
               05  FILLER   PIC X(13)  VALUE    '110091 009350'.
               05  FILLER   PIC X(13)  VALUE    '110092 007313'.
               05  FILLER   PIC X(13)  VALUE    '110095 008362'.
               05  FILLER   PIC X(13)  VALUE    '110100 007892'.
               05  FILLER   PIC X(13)  VALUE    '110101 007313'.
               05  FILLER   PIC X(13)  VALUE    '110104 007313'.
               05  FILLER   PIC X(13)  VALUE    '110105 007764'.
               05  FILLER   PIC X(13)  VALUE    '110107 008929'.
               05  FILLER   PIC X(13)  VALUE    '110109 007313'.
               05  FILLER   PIC X(13)  VALUE    '110111 008690'.
               05  FILLER   PIC X(13)  VALUE    '110113 008690'.
               05  FILLER   PIC X(13)  VALUE    '110115 009350'.
               05  FILLER   PIC X(13)  VALUE    '110121 008362'.
               05  FILLER   PIC X(13)  VALUE    '110122 007764'.
               05  FILLER   PIC X(13)  VALUE    '110124 007313'.
               05  FILLER   PIC X(13)  VALUE    '110125 008612'.
               05  FILLER   PIC X(13)  VALUE    '110128 007920'.
               05  FILLER   PIC X(13)  VALUE    '110129 007932'.
               05  FILLER   PIC X(13)  VALUE    '110130 007313'.
               05  FILLER   PIC X(13)  VALUE    '110132 007313'.
               05  FILLER   PIC X(13)  VALUE    '110135 007601'.
               05  FILLER   PIC X(13)  VALUE    '110142 007539'.
               05  FILLER   PIC X(13)  VALUE    '110143 009350'.
               05  FILLER   PIC X(13)  VALUE    '110146 009044'.
               05  FILLER   PIC X(13)  VALUE    '110150 009208'.
               05  FILLER   PIC X(13)  VALUE    '110153 008612'.
               05  FILLER   PIC X(13)  VALUE    '110161 009350'.
               05  FILLER   PIC X(13)  VALUE    '110164 008929'.
               05  FILLER   PIC X(13)  VALUE    '110165 009350'.
               05  FILLER   PIC X(13)  VALUE    '110168 009208'.
               05  FILLER   PIC X(13)  VALUE    '110177 008690'.
               05  FILLER   PIC X(13)  VALUE    '110183 009350'.
               05  FILLER   PIC X(13)  VALUE    '110184 009350'.
               05  FILLER   PIC X(13)  VALUE    '110186 007932'.
               05  FILLER   PIC X(13)  VALUE    '110187 009208'.
               05  FILLER   PIC X(13)  VALUE    '110189 009208'.
               05  FILLER   PIC X(13)  VALUE    '110190 007313'.
               05  FILLER   PIC X(13)  VALUE    '110191 009350'.
               05  FILLER   PIC X(13)  VALUE    '110192 009350'.
               05  FILLER   PIC X(13)  VALUE    '110194 007313'.
               05  FILLER   PIC X(13)  VALUE    '110198 009350'.
               05  FILLER   PIC X(13)  VALUE    '110200 007932'.
               05  FILLER   PIC X(13)  VALUE    '110201 008929'.
               05  FILLER   PIC X(13)  VALUE    '110203 009350'.
               05  FILLER   PIC X(13)  VALUE    '110205 007550'.
               05  FILLER   PIC X(13)  VALUE    '110209 007313'.
               05  FILLER   PIC X(13)  VALUE    '110215 009350'.
               05  FILLER   PIC X(13)  VALUE    '110225 009350'.
               05  FILLER   PIC X(13)  VALUE    '110226 009350'.
               05  FILLER   PIC X(13)  VALUE    '110229 009350'.
               05  FILLER   PIC X(13)  VALUE    '110230 009350'.
               05  FILLER   PIC X(13)  VALUE    '110233 009350'.
               05  FILLER   PIC X(13)  VALUE    '110234 007313'.
               05  FILLER   PIC X(13)  VALUE    '110235 007920'.
               05  FILLER   PIC X(13)  VALUE    '110236 008519'.
               05  FILLER   PIC X(13)  VALUE    '111506 008519'.
               05  FILLER   PIC X(13)  VALUE    '111568 009350'.
               05  FILLER   PIC X(13)  VALUE    '111590 009350'.
               05  FILLER   PIC X(13)  VALUE    '111603 008929'.
               05  FILLER   PIC X(13)  VALUE    '111610 008690'.
               05  FILLER   PIC X(13)  VALUE    '111620 009350'.
               05  FILLER   PIC X(13)  VALUE    '111628 009350'.
               05  FILLER   PIC X(13)  VALUE    '111629 008571'.
               05  FILLER   PIC X(13)  VALUE    '111644 008311'.
               05  FILLER   PIC X(13)  VALUE    '111672 007313'.
               05  FILLER   PIC X(13)  VALUE    '111673 009350'.
               05  FILLER   PIC X(13)  VALUE    '111675 009350'.
               05  FILLER   PIC X(13)  VALUE    '111676 008571'.
               05  FILLER   PIC X(13)  VALUE    '111677 009350'.
               05  FILLER   PIC X(13)  VALUE    '111680 009350'.
               05  FILLER   PIC X(13)  VALUE    '111681 009350'.
               05  FILLER   PIC X(13)  VALUE    '111683 008929'.
               05  FILLER   PIC X(13)  VALUE    '111684 007601'.
               05  FILLER   PIC X(13)  VALUE    '111685 009350'.
               05  FILLER   PIC X(13)  VALUE    '111686 009350'.
               05  FILLER   PIC X(13)  VALUE    '111687 009350'.
               05  FILLER   PIC X(13)  VALUE    '111689 007313'.
               05  FILLER   PIC X(13)  VALUE    '111690 008521'.
               05  FILLER   PIC X(13)  VALUE    '111691 009350'.
               05  FILLER   PIC X(13)  VALUE    '111692 009350'.
               05  FILLER   PIC X(13)  VALUE    '111693 009350'.
               05  FILLER   PIC X(13)  VALUE    '111694 007313'.
               05  FILLER   PIC X(13)  VALUE    '111695 009350'.
               05  FILLER   PIC X(13)  VALUE    '111697 009350'.
               05  FILLER   PIC X(13)  VALUE    '111698 007920'.
               05  FILLER   PIC X(13)  VALUE    '111700 009350'.
               05  FILLER   PIC X(13)  VALUE    '111702 007920'.
               05  FILLER   PIC X(13)  VALUE    '111703 007313'.
               05  FILLER   PIC X(13)  VALUE    '111704 009350'.
               05  FILLER   PIC X(13)  VALUE    '111705 008929'.
               05  FILLER   PIC X(13)  VALUE    '111707 009350'.
               05  FILLER   PIC X(13)  VALUE    '111708 008571'.
               05  FILLER   PIC X(13)  VALUE    '111711 009350'.
               05  FILLER   PIC X(13)  VALUE    '111713 009350'.
               05  FILLER   PIC X(13)  VALUE    '111715 007932'.
               05  FILLER   PIC X(13)  VALUE    '111716 008571'.
               05  FILLER   PIC X(13)  VALUE    '111717 007313'.
               05  FILLER   PIC X(13)  VALUE    '111718 007313'.
               05  FILLER   PIC X(13)  VALUE    '111719 008738'.
               05  FILLER   PIC X(13)  VALUE    '111720 007313'.
               05  FILLER   PIC X(13)  VALUE    '111722 008690'.
               05  FILLER   PIC X(13)  VALUE    '111723 009350'.
               05  FILLER   PIC X(13)  VALUE    '111724 009350'.
               05  FILLER   PIC X(13)  VALUE    '111725 009350'.
               05  FILLER   PIC X(13)  VALUE    '111726 007313'.
               05  FILLER   PIC X(13)  VALUE    '111727 009350'.
               05  FILLER   PIC X(13)  VALUE    '111728 009350'.
               05  FILLER   PIC X(13)  VALUE    '111731 009350'.
               05  FILLER   PIC X(13)  VALUE    '111732 008690'.
               05  FILLER   PIC X(13)  VALUE    '111733 009350'.
               05  FILLER   PIC X(13)  VALUE    '111734 009350'.
               05  FILLER   PIC X(13)  VALUE    '111735 009350'.
               05  FILLER   PIC X(13)  VALUE    '111736 007313'.
               05  FILLER   PIC X(13)  VALUE    '111737 009350'.
               05  FILLER   PIC X(13)  VALUE    '112003 009350'.
               05  FILLER   PIC X(13)  VALUE    '112004 009350'.
               05  FILLER   PIC X(13)  VALUE    '112006 009350'.
               05  FILLER   PIC X(13)  VALUE    '112007 009350'.
               05  FILLER   PIC X(13)  VALUE    '112010 008781'.
               05  FILLER   PIC X(13)  VALUE    '112011 007920'.
               05  FILLER   PIC X(13)  VALUE    '112013 008690'.
               05  FILLER   PIC X(13)  VALUE    '112016 008929'.
               05  FILLER   PIC X(13)  VALUE    '112018 007920'.
               05  FILLER   PIC X(13)  VALUE    '113028 009350'.
               05  FILLER   PIC X(13)  VALUE    '113029 008929'.
               05  FILLER   PIC X(13)  VALUE    '113031 009350'.
               05  FILLER   PIC X(13)  VALUE    '113033 007920'.
               05  FILLER   PIC X(13)  VALUE    '113300 009350'.
               05  FILLER   PIC X(13)  VALUE    '113301 009350'.
               05  FILLER   PIC X(13)  VALUE    '114004 009350'.
               05  FILLER   PIC X(13)  VALUE    '114008 007920'.
               05  FILLER   PIC X(13)  VALUE    '114010 009350'.
               05  FILLER   PIC X(13)  VALUE    '114012 009350'.
               05  FILLER   PIC X(13)  VALUE    '114032 009350'.
               05  FILLER   PIC X(13)  VALUE    '114035 009350'.
               05  FILLER   PIC X(13)  VALUE    '114036 007382'.
               05  FILLER   PIC X(13)  VALUE    '114037 009350'.
               05  FILLER   PIC X(13)  VALUE    '114503 007932'.
               05  FILLER   PIC X(13)  VALUE    '114523 007313'.
               05  FILLER   PIC X(13)  VALUE    '114528 009350'.
               05  FILLER   PIC X(13)  VALUE    '114529 007313'.
               05  FILLER   PIC X(13)  VALUE    '114535 009350'.
               05  FILLER   PIC X(13)  VALUE    '114536 007313'.
               05  FILLER   PIC X(13)  VALUE    '114537 007313'.
               05  FILLER   PIC X(13)  VALUE    '114538 007313'.
               05  FILLER   PIC X(13)  VALUE    '114539 007313'.
               05  FILLER   PIC X(13)  VALUE    '114600 008690'.
               05  FILLER   PIC X(13)  VALUE    '114602 009350'.
               05  FILLER   PIC X(13)  VALUE    '114613 007382'.
               05  FILLER   PIC X(13)  VALUE    '114614 009350'.
               05  FILLER   PIC X(13)  VALUE    '114615 009350'.
               05  FILLER   PIC X(13)  VALUE    '114620 009350'.
               05  FILLER   PIC X(13)  VALUE    '114621 009350'.
               05  FILLER   PIC X(13)  VALUE    '114622 007601'.
               05  FILLER   PIC X(13)  VALUE    '114623 009350'.
               05  FILLER   PIC X(13)  VALUE    '114624 009350'.
               05  FILLER   PIC X(13)  VALUE    '114625 009350'.
               05  FILLER   PIC X(13)  VALUE    '114626 009350'.
               05  FILLER   PIC X(13)  VALUE    '114627 009350'.
               05  FILLER   PIC X(13)  VALUE    '114628 009350'.
               05  FILLER   PIC X(13)  VALUE    '117143 007313'.
               05  FILLER   PIC X(13)  VALUE    '12S004 012595'.
               05  FILLER   PIC X(13)  VALUE    '12S019 012595'.
               05  FILLER   PIC X(13)  VALUE    '120001 012595'.
               05  FILLER   PIC X(13)  VALUE    '120002 012595'.
               05  FILLER   PIC X(13)  VALUE    '120004 012595'.
               05  FILLER   PIC X(13)  VALUE    '120005 012595'.
               05  FILLER   PIC X(13)  VALUE    '120006 012595'.
               05  FILLER   PIC X(13)  VALUE    '120007 012595'.
               05  FILLER   PIC X(13)  VALUE    '120011 012595'.
               05  FILLER   PIC X(13)  VALUE    '120014 012595'.
               05  FILLER   PIC X(13)  VALUE    '120019 012595'.
               05  FILLER   PIC X(13)  VALUE    '120022 012595'.
               05  FILLER   PIC X(13)  VALUE    '120026 012595'.
               05  FILLER   PIC X(13)  VALUE    '120028 012595'.
               05  FILLER   PIC X(13)  VALUE    '121500 012595'.
               05  FILLER   PIC X(13)  VALUE    '121501 012595'.
               05  FILLER   PIC X(13)  VALUE    '121503 012595'.
               05  FILLER   PIC X(13)  VALUE    '121504 012595'.
               05  FILLER   PIC X(13)  VALUE    '121505 012595'.
               05  FILLER   PIC X(13)  VALUE    '121506 012595'.
               05  FILLER   PIC X(13)  VALUE    '121507 012595'.
               05  FILLER   PIC X(13)  VALUE    '121508 012595'.
               05  FILLER   PIC X(13)  VALUE    '121509 012595'.
               05  FILLER   PIC X(13)  VALUE    '123025 012595'.
               05  FILLER   PIC X(13)  VALUE    '123300 012595'.
               05  FILLER   PIC X(13)  VALUE    '13S002 007812'.
               05  FILLER   PIC X(13)  VALUE    '13S003 008257'.
               05  FILLER   PIC X(13)  VALUE    '13S018 008713'.
               05  FILLER   PIC X(13)  VALUE    '13S028 008791'.
               05  FILLER   PIC X(13)  VALUE    '13T002 007812'.
               05  FILLER   PIC X(13)  VALUE    '13T006 009657'.
               05  FILLER   PIC X(13)  VALUE    '13T007 009657'.
               05  FILLER   PIC X(13)  VALUE    '13T018 008713'.
               05  FILLER   PIC X(13)  VALUE    '13T028 008791'.
               05  FILLER   PIC X(13)  VALUE    '130002 008820'.
               05  FILLER   PIC X(13)  VALUE    '130003 010292'.
               05  FILLER   PIC X(13)  VALUE    '130006 009657'.
               05  FILLER   PIC X(13)  VALUE    '130007 009657'.
               05  FILLER   PIC X(13)  VALUE    '130013 010634'.
               05  FILLER   PIC X(13)  VALUE    '130014 009657'.
               05  FILLER   PIC X(13)  VALUE    '130018 008791'.
               05  FILLER   PIC X(13)  VALUE    '130025 008019'.
               05  FILLER   PIC X(13)  VALUE    '130028 008791'.
               05  FILLER   PIC X(13)  VALUE    '130049 009726'.
               05  FILLER   PIC X(13)  VALUE    '130063 009657'.
               05  FILLER   PIC X(13)  VALUE    '130065 008713'.
               05  FILLER   PIC X(13)  VALUE    '130066 009726'.
               05  FILLER   PIC X(13)  VALUE    '130067 007812'.
               05  FILLER   PIC X(13)  VALUE    '130071 009657'.
               05  FILLER   PIC X(13)  VALUE    '130072 009657'.
               05  FILLER   PIC X(13)  VALUE    '130073 007812'.
               05  FILLER   PIC X(13)  VALUE    '131501 007812'.
               05  FILLER   PIC X(13)  VALUE    '131503 009657'.
               05  FILLER   PIC X(13)  VALUE    '131504 009372'.
               05  FILLER   PIC X(13)  VALUE    '131506 007812'.
               05  FILLER   PIC X(13)  VALUE    '131507 009657'.
               05  FILLER   PIC X(13)  VALUE    '131510 007812'.
               05  FILLER   PIC X(13)  VALUE    '131516 009657'.
               05  FILLER   PIC X(13)  VALUE    '131520 009657'.
               05  FILLER   PIC X(13)  VALUE    '131524 007812'.
               05  FILLER   PIC X(13)  VALUE    '131528 008257'.
               05  FILLER   PIC X(13)  VALUE    '131534 007812'.
               05  FILLER   PIC X(13)  VALUE    '131538 008713'.
               05  FILLER   PIC X(13)  VALUE    '131539 007812'.
               05  FILLER   PIC X(13)  VALUE    '131540 009657'.
               05  FILLER   PIC X(13)  VALUE    '131541 008713'.
               05  FILLER   PIC X(13)  VALUE    '131542 007812'.
               05  FILLER   PIC X(13)  VALUE    '131543 008791'.
               05  FILLER   PIC X(13)  VALUE    '131544 007812'.
               05  FILLER   PIC X(13)  VALUE    '131545 007812'.
               05  FILLER   PIC X(13)  VALUE    '131546 009657'.
               05  FILLER   PIC X(13)  VALUE    '131547 008713'.
               05  FILLER   PIC X(13)  VALUE    '131548 007812'.
               05  FILLER   PIC X(13)  VALUE    '131549 009657'.
               05  FILLER   PIC X(13)  VALUE    '131550 008791'.
               05  FILLER   PIC X(13)  VALUE    '131552 008791'.
               05  FILLER   PIC X(13)  VALUE    '131553 009657'.
               05  FILLER   PIC X(13)  VALUE    '131554 009657'.
               05  FILLER   PIC X(13)  VALUE    '131555 009657'.
               05  FILLER   PIC X(13)  VALUE    '131556 009657'.
               05  FILLER   PIC X(13)  VALUE    '131557 007812'.
               05  FILLER   PIC X(13)  VALUE    '131558 009657'.
               05  FILLER   PIC X(13)  VALUE    '131559 009372'.
               05  FILLER   PIC X(13)  VALUE    '131560 009657'.
               05  FILLER   PIC X(13)  VALUE    '131561 009372'.
               05  FILLER   PIC X(13)  VALUE    '131562 009657'.
               05  FILLER   PIC X(13)  VALUE    '131563 009657'.
               05  FILLER   PIC X(13)  VALUE    '131564 009657'.
               05  FILLER   PIC X(13)  VALUE    '131565 008713'.
               05  FILLER   PIC X(13)  VALUE    '131566 008713'.
               05  FILLER   PIC X(13)  VALUE    '131567 008713'.
               05  FILLER   PIC X(13)  VALUE    '131568 008791'.
               05  FILLER   PIC X(13)  VALUE    '132001 009726'.
               05  FILLER   PIC X(13)  VALUE    '132002 009657'.
               05  FILLER   PIC X(13)  VALUE    '134002 009657'.
               05  FILLER   PIC X(13)  VALUE    '134017 009657'.
               05  FILLER   PIC X(13)  VALUE    '134609 008713'.
               05  FILLER   PIC X(13)  VALUE    '137016 007812'.
               05  FILLER   PIC X(13)  VALUE    '137057 007812'.
               05  FILLER   PIC X(13)  VALUE    '137114 009657'.
               05  FILLER   PIC X(13)  VALUE    '137115 008791'.
               05  FILLER   PIC X(13)  VALUE    '137116 008713'.
               05  FILLER   PIC X(13)  VALUE    '137117 008791'.
               05  FILLER   PIC X(13)  VALUE    '137118 009657'.
               05  FILLER   PIC X(13)  VALUE    '137119 008713'.
               05  FILLER   PIC X(13)  VALUE    '137120 008713'.
               05  FILLER   PIC X(13)  VALUE    '137121 009657'.
               05  FILLER   PIC X(13)  VALUE    '137122 007812'.
               05  FILLER   PIC X(13)  VALUE    '14B010 010427'.
               05  FILLER   PIC X(13)  VALUE    '14S002 009107'.
               05  FILLER   PIC X(13)  VALUE    '14S008 010413'.
               05  FILLER   PIC X(13)  VALUE    '14S010 010413'.
               05  FILLER   PIC X(13)  VALUE    '14S012 008486'.
               05  FILLER   PIC X(13)  VALUE    '14S013 009037'.
               05  FILLER   PIC X(13)  VALUE    '14S015 008486'.
               05  FILLER   PIC X(13)  VALUE    '14S018 010413'.
               05  FILLER   PIC X(13)  VALUE    '14S033 010427'.
               05  FILLER   PIC X(13)  VALUE    '14S034 008486'.
               05  FILLER   PIC X(13)  VALUE    '14S040 008584'.
               05  FILLER   PIC X(13)  VALUE    '14S054 010413'.
               05  FILLER   PIC X(13)  VALUE    '14S058 008669'.
               05  FILLER   PIC X(13)  VALUE    '14S062 010413'.
               05  FILLER   PIC X(13)  VALUE    '14S075 010413'.
               05  FILLER   PIC X(13)  VALUE    '14S082 010413'.
               05  FILLER   PIC X(13)  VALUE    '14S089 008486'.
               05  FILLER   PIC X(13)  VALUE    '14S095 010413'.
               05  FILLER   PIC X(13)  VALUE    '14S103 010413'.
               05  FILLER   PIC X(13)  VALUE    '14S110 008819'.
               05  FILLER   PIC X(13)  VALUE    '14S114 010413'.
               05  FILLER   PIC X(13)  VALUE    '14S118 010413'.
               05  FILLER   PIC X(13)  VALUE    '14S119 010413'.
               05  FILLER   PIC X(13)  VALUE    '14S122 010413'.
               05  FILLER   PIC X(13)  VALUE    '14S125 009107'.
               05  FILLER   PIC X(13)  VALUE    '14S135 008486'.
               05  FILLER   PIC X(13)  VALUE    '14S137 009107'.
               05  FILLER   PIC X(13)  VALUE    '14S148 009016'.
               05  FILLER   PIC X(13)  VALUE    '14S150 010413'.
               05  FILLER   PIC X(13)  VALUE    '14S152 010413'.
               05  FILLER   PIC X(13)  VALUE    '14S158 010413'.
               05  FILLER   PIC X(13)  VALUE    '14S166 008486'.
               05  FILLER   PIC X(13)  VALUE    '14S174 010604'.
               05  FILLER   PIC X(13)  VALUE    '14S177 010413'.
               05  FILLER   PIC X(13)  VALUE    '14S179 010413'.
               05  FILLER   PIC X(13)  VALUE    '14S180 010413'.
               05  FILLER   PIC X(13)  VALUE    '14S181 010413'.
               05  FILLER   PIC X(13)  VALUE    '14S182 010413'.
               05  FILLER   PIC X(13)  VALUE    '14S186 009002'.
               05  FILLER   PIC X(13)  VALUE    '14S189 008486'.
               05  FILLER   PIC X(13)  VALUE    '14S191 010413'.
               05  FILLER   PIC X(13)  VALUE    '14S206 010413'.
               05  FILLER   PIC X(13)  VALUE    '14S207 010413'.
               05  FILLER   PIC X(13)  VALUE    '14S208 010413'.
               05  FILLER   PIC X(13)  VALUE    '14S209 009037'.
               05  FILLER   PIC X(13)  VALUE    '14S210 008486'.
               05  FILLER   PIC X(13)  VALUE    '14S223 010413'.
               05  FILLER   PIC X(13)  VALUE    '14S228 009839'.
               05  FILLER   PIC X(13)  VALUE    '14S239 009839'.
               05  FILLER   PIC X(13)  VALUE    '14S240 010413'.
               05  FILLER   PIC X(13)  VALUE    '14S242 010413'.
               05  FILLER   PIC X(13)  VALUE    '14S252 010413'.
               05  FILLER   PIC X(13)  VALUE    '14S258 010413'.
               05  FILLER   PIC X(13)  VALUE    '14S281 010413'.
               05  FILLER   PIC X(13)  VALUE    '14S292 010413'.
               05  FILLER   PIC X(13)  VALUE    '14S304 010413'.
               05  FILLER   PIC X(13)  VALUE    '14T007 010413'.
               05  FILLER   PIC X(13)  VALUE    '14T008 010413'.
               05  FILLER   PIC X(13)  VALUE    '14T010 010413'.
               05  FILLER   PIC X(13)  VALUE    '14T011 008486'.
               05  FILLER   PIC X(13)  VALUE    '14T015 008486'.
               05  FILLER   PIC X(13)  VALUE    '14T029 010604'.
               05  FILLER   PIC X(13)  VALUE    '14T033 010427'.
               05  FILLER   PIC X(13)  VALUE    '14T046 008486'.
               05  FILLER   PIC X(13)  VALUE    '14T052 009107'.
               05  FILLER   PIC X(13)  VALUE    '14T054 010413'.
               05  FILLER   PIC X(13)  VALUE    '14T065 010413'.
               05  FILLER   PIC X(13)  VALUE    '14T067 009037'.
               05  FILLER   PIC X(13)  VALUE    '14T075 010413'.
               05  FILLER   PIC X(13)  VALUE    '14T082 010413'.
               05  FILLER   PIC X(13)  VALUE    '14T091 008708'.
               05  FILLER   PIC X(13)  VALUE    '14T113 008708'.
               05  FILLER   PIC X(13)  VALUE    '14T114 010413'.
               05  FILLER   PIC X(13)  VALUE    '14T116 010413'.
               05  FILLER   PIC X(13)  VALUE    '14T117 010413'.
               05  FILLER   PIC X(13)  VALUE    '14T119 010413'.
               05  FILLER   PIC X(13)  VALUE    '14T125 009107'.
               05  FILLER   PIC X(13)  VALUE    '14T127 009292'.
               05  FILLER   PIC X(13)  VALUE    '14T148 009016'.
               05  FILLER   PIC X(13)  VALUE    '14T158 010413'.
               05  FILLER   PIC X(13)  VALUE    '14T166 008486'.
               05  FILLER   PIC X(13)  VALUE    '14T172 010413'.
               05  FILLER   PIC X(13)  VALUE    '14T180 010413'.
               05  FILLER   PIC X(13)  VALUE    '14T182 010413'.
               05  FILLER   PIC X(13)  VALUE    '14T186 009002'.
               05  FILLER   PIC X(13)  VALUE    '14T187 009107'.
               05  FILLER   PIC X(13)  VALUE    '14T191 010413'.
               05  FILLER   PIC X(13)  VALUE    '14T207 010413'.
               05  FILLER   PIC X(13)  VALUE    '14T208 010413'.
               05  FILLER   PIC X(13)  VALUE    '14T209 009037'.
               05  FILLER   PIC X(13)  VALUE    '14T213 010413'.
               05  FILLER   PIC X(13)  VALUE    '14T217 010604'.
               05  FILLER   PIC X(13)  VALUE    '14T223 010413'.
               05  FILLER   PIC X(13)  VALUE    '14T224 010413'.
               05  FILLER   PIC X(13)  VALUE    '14T240 010413'.
               05  FILLER   PIC X(13)  VALUE    '14T252 010413'.
               05  FILLER   PIC X(13)  VALUE    '14T258 010413'.
               05  FILLER   PIC X(13)  VALUE    '14T280 009497'.
               05  FILLER   PIC X(13)  VALUE    '14T289 009107'.
               05  FILLER   PIC X(13)  VALUE    '14U019 008486'.
               05  FILLER   PIC X(13)  VALUE    '14U043 008486'.
               05  FILLER   PIC X(13)  VALUE    '14U089 008486'.
               05  FILLER   PIC X(13)  VALUE    '14U101 010413'.
               05  FILLER   PIC X(13)  VALUE    '14U143 008486'.
               05  FILLER   PIC X(13)  VALUE    '14U147 008486'.
               05  FILLER   PIC X(13)  VALUE    '14U234 008486'.
               05  FILLER   PIC X(13)  VALUE    '140001 008636'.
               05  FILLER   PIC X(13)  VALUE    '140002 009107'.
               05  FILLER   PIC X(13)  VALUE    '140007 010413'.
               05  FILLER   PIC X(13)  VALUE    '140008 010427'.
               05  FILLER   PIC X(13)  VALUE    '140010 010427'.
               05  FILLER   PIC X(13)  VALUE    '140011 008486'.
               05  FILLER   PIC X(13)  VALUE    '140012 010425'.
               05  FILLER   PIC X(13)  VALUE    '140013 009037'.
               05  FILLER   PIC X(13)  VALUE    '140015 009107'.
               05  FILLER   PIC X(13)  VALUE    '140018 010427'.
               05  FILLER   PIC X(13)  VALUE    '140019 008486'.
               05  FILLER   PIC X(13)  VALUE    '140026 008819'.
               05  FILLER   PIC X(13)  VALUE    '140029 010604'.
               05  FILLER   PIC X(13)  VALUE    '140030 010604'.
               05  FILLER   PIC X(13)  VALUE    '140032 009107'.
               05  FILLER   PIC X(13)  VALUE    '140033 010427'.
               05  FILLER   PIC X(13)  VALUE    '140034 009107'.
               05  FILLER   PIC X(13)  VALUE    '140040 009194'.
               05  FILLER   PIC X(13)  VALUE    '140043 009194'.
               05  FILLER   PIC X(13)  VALUE    '140046 009107'.
               05  FILLER   PIC X(13)  VALUE    '140048 010427'.
               05  FILLER   PIC X(13)  VALUE    '140049 010427'.
               05  FILLER   PIC X(13)  VALUE    '140052 009107'.
               05  FILLER   PIC X(13)  VALUE    '140053 009016'.
               05  FILLER   PIC X(13)  VALUE    '140054 010427'.
               05  FILLER   PIC X(13)  VALUE    '140058 009107'.
               05  FILLER   PIC X(13)  VALUE    '140059 008486'.
               05  FILLER   PIC X(13)  VALUE    '140062 010427'.
               05  FILLER   PIC X(13)  VALUE    '140063 010427'.
               05  FILLER   PIC X(13)  VALUE    '140064 009194'.
               05  FILLER   PIC X(13)  VALUE    '140065 010427'.
               05  FILLER   PIC X(13)  VALUE    '140067 009292'.
               05  FILLER   PIC X(13)  VALUE    '140068 010427'.
               05  FILLER   PIC X(13)  VALUE    '140077 009107'.
               05  FILLER   PIC X(13)  VALUE    '140080 010427'.
               05  FILLER   PIC X(13)  VALUE    '140082 010427'.
               05  FILLER   PIC X(13)  VALUE    '140083 010427'.
               05  FILLER   PIC X(13)  VALUE    '140084 010427'.
               05  FILLER   PIC X(13)  VALUE    '140088 010427'.
               05  FILLER   PIC X(13)  VALUE    '140089 008486'.
               05  FILLER   PIC X(13)  VALUE    '140091 008708'.
               05  FILLER   PIC X(13)  VALUE    '140093 009431'.
               05  FILLER   PIC X(13)  VALUE    '140095 010427'.
               05  FILLER   PIC X(13)  VALUE    '140100 010427'.
               05  FILLER   PIC X(13)  VALUE    '140101 010413'.
               05  FILLER   PIC X(13)  VALUE    '140103 010427'.
               05  FILLER   PIC X(13)  VALUE    '140110 010263'.
               05  FILLER   PIC X(13)  VALUE    '140113 008708'.
               05  FILLER   PIC X(13)  VALUE    '140114 010427'.
               05  FILLER   PIC X(13)  VALUE    '140115 010427'.
               05  FILLER   PIC X(13)  VALUE    '140116 010427'.
               05  FILLER   PIC X(13)  VALUE    '140117 010427'.
               05  FILLER   PIC X(13)  VALUE    '140118 010427'.
               05  FILLER   PIC X(13)  VALUE    '140119 010427'.
               05  FILLER   PIC X(13)  VALUE    '140120 009037'.
               05  FILLER   PIC X(13)  VALUE    '140122 010413'.
               05  FILLER   PIC X(13)  VALUE    '140124 010427'.
               05  FILLER   PIC X(13)  VALUE    '140125 009107'.
               05  FILLER   PIC X(13)  VALUE    '140127 009292'.
               05  FILLER   PIC X(13)  VALUE    '140130 010427'.
               05  FILLER   PIC X(13)  VALUE    '140133 010427'.
               05  FILLER   PIC X(13)  VALUE    '140135 009016'.
               05  FILLER   PIC X(13)  VALUE    '140137 009107'.
               05  FILLER   PIC X(13)  VALUE    '140143 008486'.
               05  FILLER   PIC X(13)  VALUE    '140145 009107'.
               05  FILLER   PIC X(13)  VALUE    '140147 008486'.
               05  FILLER   PIC X(13)  VALUE    '140148 009016'.
               05  FILLER   PIC X(13)  VALUE    '140150 010427'.
               05  FILLER   PIC X(13)  VALUE    '140155 010263'.
               05  FILLER   PIC X(13)  VALUE    '140158 010427'.
               05  FILLER   PIC X(13)  VALUE    '140160 009636'.
               05  FILLER   PIC X(13)  VALUE    '140161 010263'.
               05  FILLER   PIC X(13)  VALUE    '140162 009292'.
               05  FILLER   PIC X(13)  VALUE    '140164 008486'.
               05  FILLER   PIC X(13)  VALUE    '140166 008486'.
               05  FILLER   PIC X(13)  VALUE    '140167 008864'.
               05  FILLER   PIC X(13)  VALUE    '140172 010427'.
               05  FILLER   PIC X(13)  VALUE    '140174 010604'.
               05  FILLER   PIC X(13)  VALUE    '140176 010427'.
               05  FILLER   PIC X(13)  VALUE    '140177 010427'.
               05  FILLER   PIC X(13)  VALUE    '140179 010427'.
               05  FILLER   PIC X(13)  VALUE    '140180 010427'.
               05  FILLER   PIC X(13)  VALUE    '140181 010427'.
               05  FILLER   PIC X(13)  VALUE    '140182 010427'.
               05  FILLER   PIC X(13)  VALUE    '140184 008486'.
               05  FILLER   PIC X(13)  VALUE    '140185 009107'.
               05  FILLER   PIC X(13)  VALUE    '140186 010263'.
               05  FILLER   PIC X(13)  VALUE    '140187 009107'.
               05  FILLER   PIC X(13)  VALUE    '140189 008486'.
               05  FILLER   PIC X(13)  VALUE    '140191 010427'.
               05  FILLER   PIC X(13)  VALUE    '140197 010427'.
               05  FILLER   PIC X(13)  VALUE    '140200 010413'.
               05  FILLER   PIC X(13)  VALUE    '140202 010427'.
               05  FILLER   PIC X(13)  VALUE    '140206 010427'.
               05  FILLER   PIC X(13)  VALUE    '140208 010427'.
               05  FILLER   PIC X(13)  VALUE    '140209 009037'.
               05  FILLER   PIC X(13)  VALUE    '140210 008486'.
               05  FILLER   PIC X(13)  VALUE    '140211 010604'.
               05  FILLER   PIC X(13)  VALUE    '140213 010413'.
               05  FILLER   PIC X(13)  VALUE    '140217 010604'.
               05  FILLER   PIC X(13)  VALUE    '140223 010427'.
               05  FILLER   PIC X(13)  VALUE    '140224 010427'.
               05  FILLER   PIC X(13)  VALUE    '140228 009839'.
               05  FILLER   PIC X(13)  VALUE    '140231 010413'.
               05  FILLER   PIC X(13)  VALUE    '140233 009839'.
               05  FILLER   PIC X(13)  VALUE    '140234 008819'.
               05  FILLER   PIC X(13)  VALUE    '140239 009839'.
               05  FILLER   PIC X(13)  VALUE    '140240 010427'.
               05  FILLER   PIC X(13)  VALUE    '140242 010413'.
               05  FILLER   PIC X(13)  VALUE    '140250 010427'.
               05  FILLER   PIC X(13)  VALUE    '140251 010427'.
               05  FILLER   PIC X(13)  VALUE    '140252 010427'.
               05  FILLER   PIC X(13)  VALUE    '140258 010427'.
               05  FILLER   PIC X(13)  VALUE    '140275 009497'.
               05  FILLER   PIC X(13)  VALUE    '140276 010427'.
               05  FILLER   PIC X(13)  VALUE    '140280 009497'.
               05  FILLER   PIC X(13)  VALUE    '140281 010427'.
               05  FILLER   PIC X(13)  VALUE    '140286 010425'.
               05  FILLER   PIC X(13)  VALUE    '140288 010413'.
               05  FILLER   PIC X(13)  VALUE    '140289 009107'.
               05  FILLER   PIC X(13)  VALUE    '140290 010427'.
               05  FILLER   PIC X(13)  VALUE    '140291 010427'.
               05  FILLER   PIC X(13)  VALUE    '140292 010413'.
               05  FILLER   PIC X(13)  VALUE    '140294 008486'.
               05  FILLER   PIC X(13)  VALUE    '140300 010427'.
               05  FILLER   PIC X(13)  VALUE    '140304 010413'.
               05  FILLER   PIC X(13)  VALUE    '140307 009107'.
               05  FILLER   PIC X(13)  VALUE    '141506 010413'.
               05  FILLER   PIC X(13)  VALUE    '141568 010413'.
               05  FILLER   PIC X(13)  VALUE    '141583 009497'.
               05  FILLER   PIC X(13)  VALUE    '141586 010413'.
               05  FILLER   PIC X(13)  VALUE    '141617 009839'.
               05  FILLER   PIC X(13)  VALUE    '141619 010413'.
               05  FILLER   PIC X(13)  VALUE    '141630 010413'.
               05  FILLER   PIC X(13)  VALUE    '141631 008486'.
               05  FILLER   PIC X(13)  VALUE    '141632 010413'.
               05  FILLER   PIC X(13)  VALUE    '141634 009107'.
               05  FILLER   PIC X(13)  VALUE    '141635 010413'.
               05  FILLER   PIC X(13)  VALUE    '141636 009107'.
               05  FILLER   PIC X(13)  VALUE    '141637 009549'.
               05  FILLER   PIC X(13)  VALUE    '141638 008486'.
               05  FILLER   PIC X(13)  VALUE    '141639 010413'.
               05  FILLER   PIC X(13)  VALUE    '141640 008486'.
               05  FILLER   PIC X(13)  VALUE    '141641 009037'.
               05  FILLER   PIC X(13)  VALUE    '141643 010413'.
               05  FILLER   PIC X(13)  VALUE    '141644 010413'.
               05  FILLER   PIC X(13)  VALUE    '141645 010413'.
               05  FILLER   PIC X(13)  VALUE    '141647 010413'.
               05  FILLER   PIC X(13)  VALUE    '141648 010413'.
               05  FILLER   PIC X(13)  VALUE    '141649 010413'.
               05  FILLER   PIC X(13)  VALUE    '141650 010427'.
               05  FILLER   PIC X(13)  VALUE    '141651 010413'.
               05  FILLER   PIC X(13)  VALUE    '142006 010425'.
               05  FILLER   PIC X(13)  VALUE    '142008 010413'.
               05  FILLER   PIC X(13)  VALUE    '142009 010413'.
               05  FILLER   PIC X(13)  VALUE    '142010 010413'.
               05  FILLER   PIC X(13)  VALUE    '142011 010413'.
               05  FILLER   PIC X(13)  VALUE    '142013 009037'.
               05  FILLER   PIC X(13)  VALUE    '143025 010413'.
               05  FILLER   PIC X(13)  VALUE    '143026 010413'.
               05  FILLER   PIC X(13)  VALUE    '143027 010413'.
               05  FILLER   PIC X(13)  VALUE    '143028 009839'.
               05  FILLER   PIC X(13)  VALUE    '143300 010413'.
               05  FILLER   PIC X(13)  VALUE    '144005 010413'.
               05  FILLER   PIC X(13)  VALUE    '144009 010413'.
               05  FILLER   PIC X(13)  VALUE    '144010 010413'.
               05  FILLER   PIC X(13)  VALUE    '144016 009107'.
               05  FILLER   PIC X(13)  VALUE    '144021 009016'.
               05  FILLER   PIC X(13)  VALUE    '144026 010413'.
               05  FILLER   PIC X(13)  VALUE    '144028 010413'.
               05  FILLER   PIC X(13)  VALUE    '144029 008708'.
               05  FILLER   PIC X(13)  VALUE    '144031 010413'.
               05  FILLER   PIC X(13)  VALUE    '144035 010413'.
               05  FILLER   PIC X(13)  VALUE    '144037 010604'.
               05  FILLER   PIC X(13)  VALUE    '144038 008486'.
               05  FILLER   PIC X(13)  VALUE    '144040 010413'.
               05  FILLER   PIC X(13)  VALUE    '144041 010413'.
               05  FILLER   PIC X(13)  VALUE    '144527 010413'.
               05  FILLER   PIC X(13)  VALUE    '144600 010425'.
               05  FILLER   PIC X(13)  VALUE    '144605 010427'.
               05  FILLER   PIC X(13)  VALUE    '144614 009839'.
               05  FILLER   PIC X(13)  VALUE    '144643 010427'.
               05  FILLER   PIC X(13)  VALUE    '144646 010413'.
               05  FILLER   PIC X(13)  VALUE    '144649 009497'.
               05  FILLER   PIC X(13)  VALUE    '144650 012500'.
               05  FILLER   PIC X(13)  VALUE    '147292 010413'.
               05  FILLER   PIC X(13)  VALUE    '147622 008486'.
               05  FILLER   PIC X(13)  VALUE    '147772 010413'.
               05  FILLER   PIC X(13)  VALUE    '147865 010413'.
               05  FILLER   PIC X(13)  VALUE    '147866 010427'.
               05  FILLER   PIC X(13)  VALUE    '147990 010413'.
               05  FILLER   PIC X(13)  VALUE    '147991 010413'.
               05  FILLER   PIC X(13)  VALUE    '147992 010413'.
               05  FILLER   PIC X(13)  VALUE    '147993 010413'.
               05  FILLER   PIC X(13)  VALUE    '147994 010413'.
               05  FILLER   PIC X(13)  VALUE    '147997 010413'.
               05  FILLER   PIC X(13)  VALUE    '147998 010413'.
               05  FILLER   PIC X(13)  VALUE    '147999 010413'.
               05  FILLER   PIC X(13)  VALUE    '148000 010413'.
               05  FILLER   PIC X(13)  VALUE    '148001 010413'.
               05  FILLER   PIC X(13)  VALUE    '148002 010413'.
               05  FILLER   PIC X(13)  VALUE    '148003 010413'.
               05  FILLER   PIC X(13)  VALUE    '148004 009107'.
               05  FILLER   PIC X(13)  VALUE    '148005 010413'.
               05  FILLER   PIC X(13)  VALUE    '148006 010427'.
               05  FILLER   PIC X(13)  VALUE    '148007 010413'.
               05  FILLER   PIC X(13)  VALUE    '148008 010413'.
               05  FILLER   PIC X(13)  VALUE    '148009 010413'.
               05  FILLER   PIC X(13)  VALUE    '148010 010413'.
               05  FILLER   PIC X(13)  VALUE    '148011 010413'.
               05  FILLER   PIC X(13)  VALUE    '148012 010413'.
               05  FILLER   PIC X(13)  VALUE    '148015 010413'.
               05  FILLER   PIC X(13)  VALUE    '148016 010413'.
               05  FILLER   PIC X(13)  VALUE    '148018 010413'.
               05  FILLER   PIC X(13)  VALUE    '148019 010413'.
               05  FILLER   PIC X(13)  VALUE    '148020 010413'.
               05  FILLER   PIC X(13)  VALUE    '148021 010413'.
               05  FILLER   PIC X(13)  VALUE    '148022 010413'.
               05  FILLER   PIC X(13)  VALUE    '148023 010413'.
               05  FILLER   PIC X(13)  VALUE    '148025 010413'.
               05  FILLER   PIC X(13)  VALUE    '148027 010413'.
               05  FILLER   PIC X(13)  VALUE    '148029 010413'.
               05  FILLER   PIC X(13)  VALUE    '148030 010413'.
               05  FILLER   PIC X(13)  VALUE    '148031 010413'.
               05  FILLER   PIC X(13)  VALUE    '148032 010413'.
               05  FILLER   PIC X(13)  VALUE    '148034 010413'.
               05  FILLER   PIC X(13)  VALUE    '148035 010413'.
               05  FILLER   PIC X(13)  VALUE    '148036 010413'.
               05  FILLER   PIC X(13)  VALUE    '148038 010413'.
               05  FILLER   PIC X(13)  VALUE    '148039 010413'.
               05  FILLER   PIC X(13)  VALUE    '148040 010413'.
               05  FILLER   PIC X(13)  VALUE    '15S002 009518'.
               05  FILLER   PIC X(13)  VALUE    '15S004 009518'.
               05  FILLER   PIC X(13)  VALUE    '15S005 010266'.
               05  FILLER   PIC X(13)  VALUE    '15S006 009088'.
               05  FILLER   PIC X(13)  VALUE    '15S007 009213'.
               05  FILLER   PIC X(13)  VALUE    '15S008 009518'.
               05  FILLER   PIC X(13)  VALUE    '15S009 008770'.
               05  FILLER   PIC X(13)  VALUE    '15S015 009098'.
               05  FILLER   PIC X(13)  VALUE    '15S017 008566'.
               05  FILLER   PIC X(13)  VALUE    '15S018 008717'.
               05  FILLER   PIC X(13)  VALUE    '15S019 008189'.
               05  FILLER   PIC X(13)  VALUE    '15S021 008566'.
               05  FILLER   PIC X(13)  VALUE    '15S022 008648'.
               05  FILLER   PIC X(13)  VALUE    '15S024 010266'.
               05  FILLER   PIC X(13)  VALUE    '15S033 010266'.
               05  FILLER   PIC X(13)  VALUE    '15S037 010266'.
               05  FILLER   PIC X(13)  VALUE    '15S038 010266'.
               05  FILLER   PIC X(13)  VALUE    '15S042 008189'.
               05  FILLER   PIC X(13)  VALUE    '15S046 009063'.
               05  FILLER   PIC X(13)  VALUE    '15S047 008566'.
               05  FILLER   PIC X(13)  VALUE    '15S048 008189'.
               05  FILLER   PIC X(13)  VALUE    '15S051 009457'.
               05  FILLER   PIC X(13)  VALUE    '15S056 010266'.
               05  FILLER   PIC X(13)  VALUE    '15S058 008959'.
               05  FILLER   PIC X(13)  VALUE    '15S061 008189'.
               05  FILLER   PIC X(13)  VALUE    '15S064 008189'.
               05  FILLER   PIC X(13)  VALUE    '15S071 008189'.
               05  FILLER   PIC X(13)  VALUE    '15S074 010266'.
               05  FILLER   PIC X(13)  VALUE    '15S075 008566'.
               05  FILLER   PIC X(13)  VALUE    '15S082 009089'.
               05  FILLER   PIC X(13)  VALUE    '15S084 010266'.
               05  FILLER   PIC X(13)  VALUE    '15S089 010098'.
               05  FILLER   PIC X(13)  VALUE    '15S090 009307'.
               05  FILLER   PIC X(13)  VALUE    '15S098 008189'.
               05  FILLER   PIC X(13)  VALUE    '15S100 009089'.
               05  FILLER   PIC X(13)  VALUE    '15S102 008189'.
               05  FILLER   PIC X(13)  VALUE    '15S104 010266'.
               05  FILLER   PIC X(13)  VALUE    '15S115 008189'.
               05  FILLER   PIC X(13)  VALUE    '15S129 010266'.
               05  FILLER   PIC X(13)  VALUE    '15S134 008770'.
               05  FILLER   PIC X(13)  VALUE    '15S163 008770'.
               05  FILLER   PIC X(13)  VALUE    '15S169 010266'.
               05  FILLER   PIC X(13)  VALUE    '15T001 010266'.
               05  FILLER   PIC X(13)  VALUE    '15T002 009518'.
               05  FILLER   PIC X(13)  VALUE    '15T004 009307'.
               05  FILLER   PIC X(13)  VALUE    '15T006 009044'.
               05  FILLER   PIC X(13)  VALUE    '15T008 009518'.
               05  FILLER   PIC X(13)  VALUE    '15T010 009317'.
               05  FILLER   PIC X(13)  VALUE    '15T011 008409'.
               05  FILLER   PIC X(13)  VALUE    '15T012 008959'.
               05  FILLER   PIC X(13)  VALUE    '15T014 010266'.
               05  FILLER   PIC X(13)  VALUE    '15T015 009098'.
               05  FILLER   PIC X(13)  VALUE    '15T018 008717'.
               05  FILLER   PIC X(13)  VALUE    '15T019 008189'.
               05  FILLER   PIC X(13)  VALUE    '15T021 008566'.
               05  FILLER   PIC X(13)  VALUE    '15T022 008189'.
               05  FILLER   PIC X(13)  VALUE    '15T023 009063'.
               05  FILLER   PIC X(13)  VALUE    '15T024 010266'.
               05  FILLER   PIC X(13)  VALUE    '15T034 009518'.
               05  FILLER   PIC X(13)  VALUE    '15T035 009307'.
               05  FILLER   PIC X(13)  VALUE    '15T037 010266'.
               05  FILLER   PIC X(13)  VALUE    '15T038 010266'.
               05  FILLER   PIC X(13)  VALUE    '15T042 008189'.
               05  FILLER   PIC X(13)  VALUE    '15T046 009063'.
               05  FILLER   PIC X(13)  VALUE    '15T047 008566'.
               05  FILLER   PIC X(13)  VALUE    '15T048 008189'.
               05  FILLER   PIC X(13)  VALUE    '15T051 009457'.
               05  FILLER   PIC X(13)  VALUE    '15T056 010266'.
               05  FILLER   PIC X(13)  VALUE    '15T058 008959'.
               05  FILLER   PIC X(13)  VALUE    '15T059 010266'.
               05  FILLER   PIC X(13)  VALUE    '15T061 008189'.
               05  FILLER   PIC X(13)  VALUE    '15T064 008189'.
               05  FILLER   PIC X(13)  VALUE    '15T074 010266'.
               05  FILLER   PIC X(13)  VALUE    '15T084 010266'.
               05  FILLER   PIC X(13)  VALUE    '15T088 010266'.
               05  FILLER   PIC X(13)  VALUE    '15T089 010119'.
               05  FILLER   PIC X(13)  VALUE    '15T090 009518'.
               05  FILLER   PIC X(13)  VALUE    '15T100 009089'.
               05  FILLER   PIC X(13)  VALUE    '15T102 008189'.
               05  FILLER   PIC X(13)  VALUE    '15T109 009608'.
               05  FILLER   PIC X(13)  VALUE    '15T112 010130'.
               05  FILLER   PIC X(13)  VALUE    '15T115 008189'.
               05  FILLER   PIC X(13)  VALUE    '15T125 009518'.
               05  FILLER   PIC X(13)  VALUE    '15T126 009662'.
               05  FILLER   PIC X(13)  VALUE    '15T129 010266'.
               05  FILLER   PIC X(13)  VALUE    '15T162 010266'.
               05  FILLER   PIC X(13)  VALUE    '15T169 010266'.
               05  FILLER   PIC X(13)  VALUE    '15U102 008189'.
               05  FILLER   PIC X(13)  VALUE    '150001 010266'.
               05  FILLER   PIC X(13)  VALUE    '150002 010263'.
               05  FILLER   PIC X(13)  VALUE    '150003 009608'.
               05  FILLER   PIC X(13)  VALUE    '150004 010263'.
               05  FILLER   PIC X(13)  VALUE    '150005 010266'.
               05  FILLER   PIC X(13)  VALUE    '150006 009307'.
               05  FILLER   PIC X(13)  VALUE    '150007 009317'.
               05  FILLER   PIC X(13)  VALUE    '150008 010263'.
               05  FILLER   PIC X(13)  VALUE    '150009 008770'.
               05  FILLER   PIC X(13)  VALUE    '150010 009317'.
               05  FILLER   PIC X(13)  VALUE    '150011 010125'.
               05  FILLER   PIC X(13)  VALUE    '150012 008959'.
               05  FILLER   PIC X(13)  VALUE    '150015 010263'.
               05  FILLER   PIC X(13)  VALUE    '150017 008566'.
               05  FILLER   PIC X(13)  VALUE    '150018 008959'.
               05  FILLER   PIC X(13)  VALUE    '150021 008566'.
               05  FILLER   PIC X(13)  VALUE    '150022 010125'.
               05  FILLER   PIC X(13)  VALUE    '150023 010125'.
               05  FILLER   PIC X(13)  VALUE    '150024 010266'.
               05  FILLER   PIC X(13)  VALUE    '150026 008959'.
               05  FILLER   PIC X(13)  VALUE    '150030 010125'.
               05  FILLER   PIC X(13)  VALUE    '150034 010263'.
               05  FILLER   PIC X(13)  VALUE    '150035 009307'.
               05  FILLER   PIC X(13)  VALUE    '150037 010266'.
               05  FILLER   PIC X(13)  VALUE    '150038 010266'.
               05  FILLER   PIC X(13)  VALUE    '150042 008690'.
               05  FILLER   PIC X(13)  VALUE    '150044 008770'.
               05  FILLER   PIC X(13)  VALUE    '150045 008494'.
               05  FILLER   PIC X(13)  VALUE    '150046 009063'.
               05  FILLER   PIC X(13)  VALUE    '150047 008566'.
               05  FILLER   PIC X(13)  VALUE    '150048 009071'.
               05  FILLER   PIC X(13)  VALUE    '150051 010125'.
               05  FILLER   PIC X(13)  VALUE    '150056 010266'.
               05  FILLER   PIC X(13)  VALUE    '150057 010266'.
               05  FILLER   PIC X(13)  VALUE    '150058 008959'.
               05  FILLER   PIC X(13)  VALUE    '150059 010266'.
               05  FILLER   PIC X(13)  VALUE    '150061 008189'.
               05  FILLER   PIC X(13)  VALUE    '150064 008189'.
               05  FILLER   PIC X(13)  VALUE    '150065 010125'.
               05  FILLER   PIC X(13)  VALUE    '150069 009203'.
               05  FILLER   PIC X(13)  VALUE    '150072 008335'.
               05  FILLER   PIC X(13)  VALUE    '150074 010266'.
               05  FILLER   PIC X(13)  VALUE    '150075 009071'.
               05  FILLER   PIC X(13)  VALUE    '150076 008959'.
               05  FILLER   PIC X(13)  VALUE    '150082 009089'.
               05  FILLER   PIC X(13)  VALUE    '150084 010266'.
               05  FILLER   PIC X(13)  VALUE    '150086 009203'.
               05  FILLER   PIC X(13)  VALUE    '150088 010266'.
               05  FILLER   PIC X(13)  VALUE    '150089 010125'.
               05  FILLER   PIC X(13)  VALUE    '150090 010263'.
               05  FILLER   PIC X(13)  VALUE    '150091 008566'.
               05  FILLER   PIC X(13)  VALUE    '150097 010266'.
               05  FILLER   PIC X(13)  VALUE    '150100 009089'.
               05  FILLER   PIC X(13)  VALUE    '150101 008566'.
               05  FILLER   PIC X(13)  VALUE    '150102 009307'.
               05  FILLER   PIC X(13)  VALUE    '150104 010266'.
               05  FILLER   PIC X(13)  VALUE    '150109 009608'.
               05  FILLER   PIC X(13)  VALUE    '150112 010130'.
               05  FILLER   PIC X(13)  VALUE    '150113 010266'.
               05  FILLER   PIC X(13)  VALUE    '150115 008821'.
               05  FILLER   PIC X(13)  VALUE    '150125 010263'.
               05  FILLER   PIC X(13)  VALUE    '150126 010263'.
               05  FILLER   PIC X(13)  VALUE    '150128 010266'.
               05  FILLER   PIC X(13)  VALUE    '150129 010266'.
               05  FILLER   PIC X(13)  VALUE    '150133 008535'.
               05  FILLER   PIC X(13)  VALUE    '150146 008535'.
               05  FILLER   PIC X(13)  VALUE    '150149 009089'.
               05  FILLER   PIC X(13)  VALUE    '150150 008566'.
               05  FILLER   PIC X(13)  VALUE    '150153 010266'.
               05  FILLER   PIC X(13)  VALUE    '150154 010266'.
               05  FILLER   PIC X(13)  VALUE    '150157 010266'.
               05  FILLER   PIC X(13)  VALUE    '150158 010266'.
               05  FILLER   PIC X(13)  VALUE    '150160 010266'.
               05  FILLER   PIC X(13)  VALUE    '150161 010266'.
               05  FILLER   PIC X(13)  VALUE    '150162 010266'.
               05  FILLER   PIC X(13)  VALUE    '150164 009457'.
               05  FILLER   PIC X(13)  VALUE    '150165 010263'.
               05  FILLER   PIC X(13)  VALUE    '150166 010263'.
               05  FILLER   PIC X(13)  VALUE    '150167 008566'.
               05  FILLER   PIC X(13)  VALUE    '150168 008566'.
               05  FILLER   PIC X(13)  VALUE    '150169 010266'.
               05  FILLER   PIC X(13)  VALUE    '150172 008770'.
               05  FILLER   PIC X(13)  VALUE    '150173 009608'.
               05  FILLER   PIC X(13)  VALUE    '150175 009089'.
               05  FILLER   PIC X(13)  VALUE    '150176 008770'.
               05  FILLER   PIC X(13)  VALUE    '150177 008959'.
               05  FILLER   PIC X(13)  VALUE    '150179 010266'.
               05  FILLER   PIC X(13)  VALUE    '150180 008959'.
               05  FILLER   PIC X(13)  VALUE    '150181 010266'.
               05  FILLER   PIC X(13)  VALUE    '150182 010266'.
               05  FILLER   PIC X(13)  VALUE    '150183 009457'.
               05  FILLER   PIC X(13)  VALUE    '150184 010266'.
               05  FILLER   PIC X(13)  VALUE    '151521 008566'.
               05  FILLER   PIC X(13)  VALUE    '151573 010266'.
               05  FILLER   PIC X(13)  VALUE    '151599 010266'.
               05  FILLER   PIC X(13)  VALUE    '151601 010266'.
               05  FILLER   PIC X(13)  VALUE    '151603 010266'.
               05  FILLER   PIC X(13)  VALUE    '151605 008770'.
               05  FILLER   PIC X(13)  VALUE    '151606 010266'.
               05  FILLER   PIC X(13)  VALUE    '151607 008959'.
               05  FILLER   PIC X(13)  VALUE    '151608 009307'.
               05  FILLER   PIC X(13)  VALUE    '152007 010266'.
               05  FILLER   PIC X(13)  VALUE    '152012 009518'.
               05  FILLER   PIC X(13)  VALUE    '152013 010266'.
               05  FILLER   PIC X(13)  VALUE    '152014 009089'.
               05  FILLER   PIC X(13)  VALUE    '152020 010266'.
               05  FILLER   PIC X(13)  VALUE    '152024 009518'.
               05  FILLER   PIC X(13)  VALUE    '152027 008566'.
               05  FILLER   PIC X(13)  VALUE    '152028 009518'.
               05  FILLER   PIC X(13)  VALUE    '153025 009089'.
               05  FILLER   PIC X(13)  VALUE    '153028 010266'.
               05  FILLER   PIC X(13)  VALUE    '153030 008566'.
               05  FILLER   PIC X(13)  VALUE    '153037 008770'.
               05  FILLER   PIC X(13)  VALUE    '153039 009317'.
               05  FILLER   PIC X(13)  VALUE    '153042 009608'.
               05  FILLER   PIC X(13)  VALUE    '153043 010266'.
               05  FILLER   PIC X(13)  VALUE    '153044 010266'.
               05  FILLER   PIC X(13)  VALUE    '154005 009608'.
               05  FILLER   PIC X(13)  VALUE    '154009 009063'.
               05  FILLER   PIC X(13)  VALUE    '154011 009203'.
               05  FILLER   PIC X(13)  VALUE    '154014 008442'.
               05  FILLER   PIC X(13)  VALUE    '154019 008189'.
               05  FILLER   PIC X(13)  VALUE    '154020 009518'.
               05  FILLER   PIC X(13)  VALUE    '154021 008409'.
               05  FILLER   PIC X(13)  VALUE    '154024 010266'.
               05  FILLER   PIC X(13)  VALUE    '154031 008717'.
               05  FILLER   PIC X(13)  VALUE    '154035 008335'.
               05  FILLER   PIC X(13)  VALUE    '154041 009457'.
               05  FILLER   PIC X(13)  VALUE    '154047 008702'.
               05  FILLER   PIC X(13)  VALUE    '154050 008494'.
               05  FILLER   PIC X(13)  VALUE    '154051 008770'.
               05  FILLER   PIC X(13)  VALUE    '154052 009307'.
               05  FILLER   PIC X(13)  VALUE    '154053 010119'.
               05  FILLER   PIC X(13)  VALUE    '154054 009063'.
               05  FILLER   PIC X(13)  VALUE    '154055 009089'.
               05  FILLER   PIC X(13)  VALUE    '154057 010266'.
               05  FILLER   PIC X(13)  VALUE    '154059 009608'.
               05  FILLER   PIC X(13)  VALUE    '154060 008566'.
               05  FILLER   PIC X(13)  VALUE    '154061 008959'.
               05  FILLER   PIC X(13)  VALUE    '154065 009518'.
               05  FILLER   PIC X(13)  VALUE    '154530 009089'.
               05  FILLER   PIC X(13)  VALUE    '154600 010266'.
               05  FILLER   PIC X(13)  VALUE    '154607 008770'.
               05  FILLER   PIC X(13)  VALUE    '154608 010266'.
               05  FILLER   PIC X(13)  VALUE    '154610 008189'.
               05  FILLER   PIC X(13)  VALUE    '154615 010266'.
               05  FILLER   PIC X(13)  VALUE    '157599 008189'.
               05  FILLER   PIC X(13)  VALUE    '157600 009307'.
               05  FILLER   PIC X(13)  VALUE    '157601 009307'.
               05  FILLER   PIC X(13)  VALUE    '157603 009203'.
               05  FILLER   PIC X(13)  VALUE    '157605 009307'.
               05  FILLER   PIC X(13)  VALUE    '16S005 008249'.
               05  FILLER   PIC X(13)  VALUE    '16S008 008249'.
               05  FILLER   PIC X(13)  VALUE    '16S024 009200'.
               05  FILLER   PIC X(13)  VALUE    '16S030 009366'.
               05  FILLER   PIC X(13)  VALUE    '16S033 009497'.
               05  FILLER   PIC X(13)  VALUE    '16S040 008440'.
               05  FILLER   PIC X(13)  VALUE    '16S045 008864'.
               05  FILLER   PIC X(13)  VALUE    '16S047 009281'.
               05  FILLER   PIC X(13)  VALUE    '16S058 009886'.
               05  FILLER   PIC X(13)  VALUE    '16S067 008440'.
               05  FILLER   PIC X(13)  VALUE    '16S069 008726'.
               05  FILLER   PIC X(13)  VALUE    '16S079 008864'.
               05  FILLER   PIC X(13)  VALUE    '16S080 008438'.
               05  FILLER   PIC X(13)  VALUE    '16S083 009200'.
               05  FILLER   PIC X(13)  VALUE    '16S089 008249'.
               05  FILLER   PIC X(13)  VALUE    '16S101 009200'.
               05  FILLER   PIC X(13)  VALUE    '16S110 008440'.
               05  FILLER   PIC X(13)  VALUE    '16S112 008249'.
               05  FILLER   PIC X(13)  VALUE    '16S117 008726'.
               05  FILLER   PIC X(13)  VALUE    '16S146 008430'.
               05  FILLER   PIC X(13)  VALUE    '16S153 008430'.
               05  FILLER   PIC X(13)  VALUE    '16T008 008249'.
               05  FILLER   PIC X(13)  VALUE    '16T030 009366'.
               05  FILLER   PIC X(13)  VALUE    '16T033 009497'.
               05  FILLER   PIC X(13)  VALUE    '16T045 008864'.
               05  FILLER   PIC X(13)  VALUE    '16T057 008249'.
               05  FILLER   PIC X(13)  VALUE    '16T064 008249'.
               05  FILLER   PIC X(13)  VALUE    '16T067 008440'.
               05  FILLER   PIC X(13)  VALUE    '16T069 008726'.
               05  FILLER   PIC X(13)  VALUE    '16T079 008864'.
               05  FILLER   PIC X(13)  VALUE    '16T080 008230'.
               05  FILLER   PIC X(13)  VALUE    '16T082 009200'.
               05  FILLER   PIC X(13)  VALUE    '16T083 009200'.
               05  FILLER   PIC X(13)  VALUE    '16T089 008249'.
               05  FILLER   PIC X(13)  VALUE    '16T110 008440'.
               05  FILLER   PIC X(13)  VALUE    '16T117 008726'.
               05  FILLER   PIC X(13)  VALUE    '16T146 008430'.
               05  FILLER   PIC X(13)  VALUE    '16T153 008430'.
               05  FILLER   PIC X(13)  VALUE    '160001 009200'.
               05  FILLER   PIC X(13)  VALUE    '160005 008249'.
               05  FILLER   PIC X(13)  VALUE    '160008 008249'.
               05  FILLER   PIC X(13)  VALUE    '160013 008895'.
               05  FILLER   PIC X(13)  VALUE    '160016 008731'.
               05  FILLER   PIC X(13)  VALUE    '160024 009200'.
               05  FILLER   PIC X(13)  VALUE    '160028 009281'.
               05  FILLER   PIC X(13)  VALUE    '160029 009886'.
               05  FILLER   PIC X(13)  VALUE    '160030 009366'.
               05  FILLER   PIC X(13)  VALUE    '160032 009200'.
               05  FILLER   PIC X(13)  VALUE    '160033 009497'.
               05  FILLER   PIC X(13)  VALUE    '160040 008440'.
               05  FILLER   PIC X(13)  VALUE    '160045 009304'.
               05  FILLER   PIC X(13)  VALUE    '160047 009281'.
               05  FILLER   PIC X(13)  VALUE    '160057 009304'.
               05  FILLER   PIC X(13)  VALUE    '160058 009886'.
               05  FILLER   PIC X(13)  VALUE    '160064 008628'.
               05  FILLER   PIC X(13)  VALUE    '160067 008440'.
               05  FILLER   PIC X(13)  VALUE    '160069 008726'.
               05  FILLER   PIC X(13)  VALUE    '160079 009304'.
               05  FILLER   PIC X(13)  VALUE    '160080 009194'.
               05  FILLER   PIC X(13)  VALUE    '160082 009200'.
               05  FILLER   PIC X(13)  VALUE    '160083 009200'.
               05  FILLER   PIC X(13)  VALUE    '160089 009304'.
               05  FILLER   PIC X(13)  VALUE    '160101 009200'.
               05  FILLER   PIC X(13)  VALUE    '160104 009497'.
               05  FILLER   PIC X(13)  VALUE    '160110 008440'.
               05  FILLER   PIC X(13)  VALUE    '160112 008249'.
               05  FILLER   PIC X(13)  VALUE    '160117 008726'.
               05  FILLER   PIC X(13)  VALUE    '160122 008249'.
               05  FILLER   PIC X(13)  VALUE    '160124 008249'.
               05  FILLER   PIC X(13)  VALUE    '160146 008430'.
               05  FILLER   PIC X(13)  VALUE    '160147 008249'.
               05  FILLER   PIC X(13)  VALUE    '160153 009281'.
               05  FILLER   PIC X(13)  VALUE    '160157 009200'.
               05  FILLER   PIC X(13)  VALUE    '161500 009200'.
               05  FILLER   PIC X(13)  VALUE    '161501 008249'.
               05  FILLER   PIC X(13)  VALUE    '161502 008430'.
               05  FILLER   PIC X(13)  VALUE    '161503 008249'.
               05  FILLER   PIC X(13)  VALUE    '161504 008440'.
               05  FILLER   PIC X(13)  VALUE    '161505 008249'.
               05  FILLER   PIC X(13)  VALUE    '161506 009200'.
               05  FILLER   PIC X(13)  VALUE    '161507 009886'.
               05  FILLER   PIC X(13)  VALUE    '161508 009366'.
               05  FILLER   PIC X(13)  VALUE    '161509 008249'.
               05  FILLER   PIC X(13)  VALUE    '161510 008249'.
               05  FILLER   PIC X(13)  VALUE    '161511 008249'.
               05  FILLER   PIC X(13)  VALUE    '161512 008553'.
               05  FILLER   PIC X(13)  VALUE    '161513 008249'.
               05  FILLER   PIC X(13)  VALUE    '161514 008726'.
               05  FILLER   PIC X(13)  VALUE    '161515 008249'.
               05  FILLER   PIC X(13)  VALUE    '161516 008553'.
               05  FILLER   PIC X(13)  VALUE    '161517 008249'.
               05  FILLER   PIC X(13)  VALUE    '161518 008249'.
               05  FILLER   PIC X(13)  VALUE    '161519 008249'.
               05  FILLER   PIC X(13)  VALUE    '161520 009497'.
               05  FILLER   PIC X(13)  VALUE    '161521 008249'.
               05  FILLER   PIC X(13)  VALUE    '161522 008249'.
               05  FILLER   PIC X(13)  VALUE    '161525 008249'.
               05  FILLER   PIC X(13)  VALUE    '161527 008249'.
               05  FILLER   PIC X(13)  VALUE    '161530 008249'.
               05  FILLER   PIC X(13)  VALUE    '161533 008249'.
               05  FILLER   PIC X(13)  VALUE    '161534 008249'.
               05  FILLER   PIC X(13)  VALUE    '161535 008249'.
               05  FILLER   PIC X(13)  VALUE    '161537 008249'.
               05  FILLER   PIC X(13)  VALUE    '161538 008249'.
               05  FILLER   PIC X(13)  VALUE    '161539 008249'.
               05  FILLER   PIC X(13)  VALUE    '161541 008249'.
               05  FILLER   PIC X(13)  VALUE    '161542 008249'.
               05  FILLER   PIC X(13)  VALUE    '161543 008249'.
               05  FILLER   PIC X(13)  VALUE    '161544 009886'.
               05  FILLER   PIC X(13)  VALUE    '161545 009200'.
               05  FILLER   PIC X(13)  VALUE    '161546 008249'.
               05  FILLER   PIC X(13)  VALUE    '161547 008249'.
               05  FILLER   PIC X(13)  VALUE    '161548 008249'.
               05  FILLER   PIC X(13)  VALUE    '161549 008249'.
               05  FILLER   PIC X(13)  VALUE    '161551 008249'.
               05  FILLER   PIC X(13)  VALUE    '161552 009497'.
               05  FILLER   PIC X(13)  VALUE    '161553 008249'.
               05  FILLER   PIC X(13)  VALUE    '161554 009200'.
               05  FILLER   PIC X(13)  VALUE    '161555 008249'.
               05  FILLER   PIC X(13)  VALUE    '161556 008249'.
               05  FILLER   PIC X(13)  VALUE    '161559 008249'.
               05  FILLER   PIC X(13)  VALUE    '161561 008249'.
               05  FILLER   PIC X(13)  VALUE    '161562 008249'.
               05  FILLER   PIC X(13)  VALUE    '161563 008249'.
               05  FILLER   PIC X(13)  VALUE    '161565 008249'.
               05  FILLER   PIC X(13)  VALUE    '161566 008553'.
               05  FILLER   PIC X(13)  VALUE    '161567 008249'.
               05  FILLER   PIC X(13)  VALUE    '161568 009497'.
               05  FILLER   PIC X(13)  VALUE    '161569 008249'.
               05  FILLER   PIC X(13)  VALUE    '161571 008249'.
               05  FILLER   PIC X(13)  VALUE    '161574 009281'.
               05  FILLER   PIC X(13)  VALUE    '161575 009200'.
               05  FILLER   PIC X(13)  VALUE    '161576 009281'.
               05  FILLER   PIC X(13)  VALUE    '161577 008249'.
               05  FILLER   PIC X(13)  VALUE    '161578 008440'.
               05  FILLER   PIC X(13)  VALUE    '161580 008249'.
               05  FILLER   PIC X(13)  VALUE    '161581 008553'.
               05  FILLER   PIC X(13)  VALUE    '161582 008249'.
               05  FILLER   PIC X(13)  VALUE    '161586 008249'.
               05  FILLER   PIC X(13)  VALUE    '161587 009200'.
               05  FILLER   PIC X(13)  VALUE    '161590 008249'.
               05  FILLER   PIC X(13)  VALUE    '161591 008249'.
               05  FILLER   PIC X(13)  VALUE    '161592 008430'.
               05  FILLER   PIC X(13)  VALUE    '161593 008440'.
               05  FILLER   PIC X(13)  VALUE    '161594 009200'.
               05  FILLER   PIC X(13)  VALUE    '161595 008249'.
               05  FILLER   PIC X(13)  VALUE    '161596 008249'.
               05  FILLER   PIC X(13)  VALUE    '161597 008553'.
               05  FILLER   PIC X(13)  VALUE    '161598 008440'.
               05  FILLER   PIC X(13)  VALUE    '161599 009281'.
               05  FILLER   PIC X(13)  VALUE    '161600 009281'.
               05  FILLER   PIC X(13)  VALUE    '161602 009281'.
               05  FILLER   PIC X(13)  VALUE    '162003 009200'.
               05  FILLER   PIC X(13)  VALUE    '163025 009200'.
               05  FILLER   PIC X(13)  VALUE    '164002 008249'.
               05  FILLER   PIC X(13)  VALUE    '164003 008249'.
               05  FILLER   PIC X(13)  VALUE    '164600 008249'.
               05  FILLER   PIC X(13)  VALUE    '164601 009497'.
               05  FILLER   PIC X(13)  VALUE    '164604 008726'.
               05  FILLER   PIC X(13)  VALUE    '164605 008249'.
               05  FILLER   PIC X(13)  VALUE    '164614 009200'.
               05  FILLER   PIC X(13)  VALUE    '167006 008249'.
               05  FILLER   PIC X(13)  VALUE    '167320 008249'.
               05  FILLER   PIC X(13)  VALUE    '167321 008249'.
               05  FILLER   PIC X(13)  VALUE    '167322 008249'.
               05  FILLER   PIC X(13)  VALUE    '167324 008726'.
               05  FILLER   PIC X(13)  VALUE    '167406 009200'.
               05  FILLER   PIC X(13)  VALUE    '167407 009497'.
               05  FILLER   PIC X(13)  VALUE    '167409 009497'.
               05  FILLER   PIC X(13)  VALUE    '167411 009497'.
               05  FILLER   PIC X(13)  VALUE    '167420 008249'.
               05  FILLER   PIC X(13)  VALUE    '17S006 007718'.
               05  FILLER   PIC X(13)  VALUE    '17S009 009165'.
               05  FILLER   PIC X(13)  VALUE    '17S012 007718'.
               05  FILLER   PIC X(13)  VALUE    '17S013 007718'.
               05  FILLER   PIC X(13)  VALUE    '17S017 008407'.
               05  FILLER   PIC X(13)  VALUE    '17S020 007718'.
               05  FILLER   PIC X(13)  VALUE    '17S023 007718'.
               05  FILLER   PIC X(13)  VALUE    '17S039 008407'.
               05  FILLER   PIC X(13)  VALUE    '17S040 009165'.
               05  FILLER   PIC X(13)  VALUE    '17S068 007718'.
               05  FILLER   PIC X(13)  VALUE    '17S074 008161'.
               05  FILLER   PIC X(13)  VALUE    '17S086 008972'.
               05  FILLER   PIC X(13)  VALUE    '17S103 008407'.
               05  FILLER   PIC X(13)  VALUE    '17S104 009165'.
               05  FILLER   PIC X(13)  VALUE    '17S122 008407'.
               05  FILLER   PIC X(13)  VALUE    '17S123 008407'.
               05  FILLER   PIC X(13)  VALUE    '17S133 009165'.
               05  FILLER   PIC X(13)  VALUE    '17S142 007718'.
               05  FILLER   PIC X(13)  VALUE    '17S145 007718'.
               05  FILLER   PIC X(13)  VALUE    '17S150 007832'.
               05  FILLER   PIC X(13)  VALUE    '17S166 007718'.
               05  FILLER   PIC X(13)  VALUE    '17T001 007718'.
               05  FILLER   PIC X(13)  VALUE    '17T006 007718'.
               05  FILLER   PIC X(13)  VALUE    '17T012 007718'.
               05  FILLER   PIC X(13)  VALUE    '17T013 007718'.
               05  FILLER   PIC X(13)  VALUE    '17T016 008972'.
               05  FILLER   PIC X(13)  VALUE    '17T020 007718'.
               05  FILLER   PIC X(13)  VALUE    '17T023 007718'.
               05  FILLER   PIC X(13)  VALUE    '17T033 007718'.
               05  FILLER   PIC X(13)  VALUE    '17T040 009165'.
               05  FILLER   PIC X(13)  VALUE    '17T058 007718'.
               05  FILLER   PIC X(13)  VALUE    '17T074 008649'.
               05  FILLER   PIC X(13)  VALUE    '17T103 008407'.
               05  FILLER   PIC X(13)  VALUE    '17T120 007718'.
               05  FILLER   PIC X(13)  VALUE    '17T137 008678'.
               05  FILLER   PIC X(13)  VALUE    '17T142 008649'.
               05  FILLER   PIC X(13)  VALUE    '17T175 007718'.
               05  FILLER   PIC X(13)  VALUE    '17T180 009165'.
               05  FILLER   PIC X(13)  VALUE    '17T182 009165'.
               05  FILLER   PIC X(13)  VALUE    '17T185 009165'.
               05  FILLER   PIC X(13)  VALUE    '17T200 008407'.
               05  FILLER   PIC X(13)  VALUE    '170006 007718'.
               05  FILLER   PIC X(13)  VALUE    '170009 009165'.
               05  FILLER   PIC X(13)  VALUE    '170010 007776'.
               05  FILLER   PIC X(13)  VALUE    '170012 007718'.
               05  FILLER   PIC X(13)  VALUE    '170013 008591'.
               05  FILLER   PIC X(13)  VALUE    '170014 009165'.
               05  FILLER   PIC X(13)  VALUE    '170016 008972'.
               05  FILLER   PIC X(13)  VALUE    '170017 008407'.
               05  FILLER   PIC X(13)  VALUE    '170020 008407'.
               05  FILLER   PIC X(13)  VALUE    '170023 007718'.
               05  FILLER   PIC X(13)  VALUE    '170027 007718'.
               05  FILLER   PIC X(13)  VALUE    '170039 007718'.
               05  FILLER   PIC X(13)  VALUE    '170040 009165'.
               05  FILLER   PIC X(13)  VALUE    '170049 009165'.
               05  FILLER   PIC X(13)  VALUE    '170058 009165'.
               05  FILLER   PIC X(13)  VALUE    '170068 008154'.
               05  FILLER   PIC X(13)  VALUE    '170074 007718'.
               05  FILLER   PIC X(13)  VALUE    '170075 007718'.
               05  FILLER   PIC X(13)  VALUE    '170086 008972'.
               05  FILLER   PIC X(13)  VALUE    '170103 008407'.
               05  FILLER   PIC X(13)  VALUE    '170104 009165'.
               05  FILLER   PIC X(13)  VALUE    '170105 007718'.
               05  FILLER   PIC X(13)  VALUE    '170109 009165'.
               05  FILLER   PIC X(13)  VALUE    '170110 007718'.
               05  FILLER   PIC X(13)  VALUE    '170120 007718'.
               05  FILLER   PIC X(13)  VALUE    '170122 008407'.
               05  FILLER   PIC X(13)  VALUE    '170123 008407'.
               05  FILLER   PIC X(13)  VALUE    '170133 009165'.
               05  FILLER   PIC X(13)  VALUE    '170137 009165'.
               05  FILLER   PIC X(13)  VALUE    '170142 008972'.
               05  FILLER   PIC X(13)  VALUE    '170145 007776'.
               05  FILLER   PIC X(13)  VALUE    '170146 009165'.
               05  FILLER   PIC X(13)  VALUE    '170150 007832'.
               05  FILLER   PIC X(13)  VALUE    '170166 007718'.
               05  FILLER   PIC X(13)  VALUE    '170175 008407'.
               05  FILLER   PIC X(13)  VALUE    '170176 009165'.
               05  FILLER   PIC X(13)  VALUE    '170180 009165'.
               05  FILLER   PIC X(13)  VALUE    '170182 009165'.
               05  FILLER   PIC X(13)  VALUE    '170183 008407'.
               05  FILLER   PIC X(13)  VALUE    '170185 009165'.
               05  FILLER   PIC X(13)  VALUE    '170186 008407'.
               05  FILLER   PIC X(13)  VALUE    '170187 007718'.
               05  FILLER   PIC X(13)  VALUE    '170188 009165'.
               05  FILLER   PIC X(13)  VALUE    '170190 008649'.
               05  FILLER   PIC X(13)  VALUE    '170191 007718'.
               05  FILLER   PIC X(13)  VALUE    '170194 009165'.
               05  FILLER   PIC X(13)  VALUE    '170196 008407'.
               05  FILLER   PIC X(13)  VALUE    '170197 008407'.
               05  FILLER   PIC X(13)  VALUE    '170198 007718'.
               05  FILLER   PIC X(13)  VALUE    '170199 009165'.
               05  FILLER   PIC X(13)  VALUE    '170200 008407'.
               05  FILLER   PIC X(13)  VALUE    '170201 009165'.
               05  FILLER   PIC X(13)  VALUE    '170202 008407'.
               05  FILLER   PIC X(13)  VALUE    '170203 008000'.
               05  FILLER   PIC X(13)  VALUE    '171500 008407'.
               05  FILLER   PIC X(13)  VALUE    '171503 007718'.
               05  FILLER   PIC X(13)  VALUE    '171505 009165'.
               05  FILLER   PIC X(13)  VALUE    '171506 008972'.
               05  FILLER   PIC X(13)  VALUE    '171508 007718'.
               05  FILLER   PIC X(13)  VALUE    '171509 009165'.
               05  FILLER   PIC X(13)  VALUE    '171511 008553'.
               05  FILLER   PIC X(13)  VALUE    '171512 007718'.
               05  FILLER   PIC X(13)  VALUE    '171513 007718'.
               05  FILLER   PIC X(13)  VALUE    '171515 007718'.
               05  FILLER   PIC X(13)  VALUE    '171516 007718'.
               05  FILLER   PIC X(13)  VALUE    '171518 007718'.
               05  FILLER   PIC X(13)  VALUE    '171520 008972'.
               05  FILLER   PIC X(13)  VALUE    '171521 007718'.
               05  FILLER   PIC X(13)  VALUE    '171522 007718'.
               05  FILLER   PIC X(13)  VALUE    '171523 007718'.
               05  FILLER   PIC X(13)  VALUE    '171525 007718'.
               05  FILLER   PIC X(13)  VALUE    '171528 008407'.
               05  FILLER   PIC X(13)  VALUE    '171529 008972'.
               05  FILLER   PIC X(13)  VALUE    '171530 007718'.
               05  FILLER   PIC X(13)  VALUE    '171531 007718'.
               05  FILLER   PIC X(13)  VALUE    '171532 007718'.
               05  FILLER   PIC X(13)  VALUE    '171533 007718'.
               05  FILLER   PIC X(13)  VALUE    '171534 008972'.
               05  FILLER   PIC X(13)  VALUE    '171536 008972'.
               05  FILLER   PIC X(13)  VALUE    '171539 007718'.
               05  FILLER   PIC X(13)  VALUE    '171540 009165'.
               05  FILLER   PIC X(13)  VALUE    '171541 007718'.
               05  FILLER   PIC X(13)  VALUE    '171542 008407'.
               05  FILLER   PIC X(13)  VALUE    '171544 008972'.
               05  FILLER   PIC X(13)  VALUE    '171548 008407'.
               05  FILLER   PIC X(13)  VALUE    '171551 007718'.
               05  FILLER   PIC X(13)  VALUE    '171553 009165'.
               05  FILLER   PIC X(13)  VALUE    '171554 008407'.
               05  FILLER   PIC X(13)  VALUE    '171555 007718'.
               05  FILLER   PIC X(13)  VALUE    '171556 007718'.
               05  FILLER   PIC X(13)  VALUE    '171557 007718'.
               05  FILLER   PIC X(13)  VALUE    '171558 008407'.
               05  FILLER   PIC X(13)  VALUE    '171559 008407'.
               05  FILLER   PIC X(13)  VALUE    '171561 008407'.
               05  FILLER   PIC X(13)  VALUE    '171562 007718'.
               05  FILLER   PIC X(13)  VALUE    '171563 009165'.
               05  FILLER   PIC X(13)  VALUE    '171565 009165'.
               05  FILLER   PIC X(13)  VALUE    '171566 009165'.
               05  FILLER   PIC X(13)  VALUE    '171568 008407'.
               05  FILLER   PIC X(13)  VALUE    '171569 009165'.
               05  FILLER   PIC X(13)  VALUE    '171570 009165'.
               05  FILLER   PIC X(13)  VALUE    '171573 009165'.
               05  FILLER   PIC X(13)  VALUE    '171574 009165'.
               05  FILLER   PIC X(13)  VALUE    '171575 008407'.
               05  FILLER   PIC X(13)  VALUE    '171576 008407'.
               05  FILLER   PIC X(13)  VALUE    '171577 007702'.
               05  FILLER   PIC X(13)  VALUE    '171578 009165'.
               05  FILLER   PIC X(13)  VALUE    '171579 009165'.
               05  FILLER   PIC X(13)  VALUE    '171580 009165'.
               05  FILLER   PIC X(13)  VALUE    '171581 008553'.
               05  FILLER   PIC X(13)  VALUE    '171582 009165'.
               05  FILLER   PIC X(13)  VALUE    '171583 008407'.
               05  FILLER   PIC X(13)  VALUE    '171584 009165'.
               05  FILLER   PIC X(13)  VALUE    '171585 008407'.
               05  FILLER   PIC X(13)  VALUE    '171586 007718'.
               05  FILLER   PIC X(13)  VALUE    '171587 007718'.
               05  FILLER   PIC X(13)  VALUE    '171588 009165'.
               05  FILLER   PIC X(13)  VALUE    '171589 008407'.
               05  FILLER   PIC X(13)  VALUE    '172005 009165'.
               05  FILLER   PIC X(13)  VALUE    '173025 008972'.
               05  FILLER   PIC X(13)  VALUE    '173026 009165'.
               05  FILLER   PIC X(13)  VALUE    '173027 008407'.
               05  FILLER   PIC X(13)  VALUE    '173028 008407'.
               05  FILLER   PIC X(13)  VALUE    '173032 009165'.
               05  FILLER   PIC X(13)  VALUE    '173300 009165'.
               05  FILLER   PIC X(13)  VALUE    '174006 007718'.
               05  FILLER   PIC X(13)  VALUE    '174016 008407'.
               05  FILLER   PIC X(13)  VALUE    '174020 009165'.
               05  FILLER   PIC X(13)  VALUE    '174022 009165'.
               05  FILLER   PIC X(13)  VALUE    '174506 008407'.
               05  FILLER   PIC X(13)  VALUE    '174602 009165'.
               05  FILLER   PIC X(13)  VALUE    '174606 007718'.
               05  FILLER   PIC X(13)  VALUE    '174607 007718'.
               05  FILLER   PIC X(13)  VALUE    '174609 007718'.
               05  FILLER   PIC X(13)  VALUE    '174610 008972'.
               05  FILLER   PIC X(13)  VALUE    '174613 007718'.
               05  FILLER   PIC X(13)  VALUE    '174614 008407'.
               05  FILLER   PIC X(13)  VALUE    '174617 007718'.
               05  FILLER   PIC X(13)  VALUE    '178048 007718'.
               05  FILLER   PIC X(13)  VALUE    '178076 007718'.
               05  FILLER   PIC X(13)  VALUE    '178077 009165'.
               05  FILLER   PIC X(13)  VALUE    '178078 008407'.
               05  FILLER   PIC X(13)  VALUE    '178079 009165'.
               05  FILLER   PIC X(13)  VALUE    '178080 007718'.
               05  FILLER   PIC X(13)  VALUE    '178082 009165'.
               05  FILLER   PIC X(13)  VALUE    '178088 008407'.
               05  FILLER   PIC X(13)  VALUE    '178089 008407'.
               05  FILLER   PIC X(13)  VALUE    '178090 008972'.
               05  FILLER   PIC X(13)  VALUE    '178092 008407'.
               05  FILLER   PIC X(13)  VALUE    '178093 008407'.
               05  FILLER   PIC X(13)  VALUE    '178094 009165'.
               05  FILLER   PIC X(13)  VALUE    '178095 008407'.
               05  FILLER   PIC X(13)  VALUE    '178097 009165'.
               05  FILLER   PIC X(13)  VALUE    '178098 008972'.
               05  FILLER   PIC X(13)  VALUE    '18S005 008250'.
               05  FILLER   PIC X(13)  VALUE    '18S007 009022'.
               05  FILLER   PIC X(13)  VALUE    '18S010 009022'.
               05  FILLER   PIC X(13)  VALUE    '18S012 008770'.
               05  FILLER   PIC X(13)  VALUE    '18S013 008577'.
               05  FILLER   PIC X(13)  VALUE    '18S018 007965'.
               05  FILLER   PIC X(13)  VALUE    '18S021 007965'.
               05  FILLER   PIC X(13)  VALUE    '18S024 007965'.
               05  FILLER   PIC X(13)  VALUE    '18S029 008887'.
               05  FILLER   PIC X(13)  VALUE    '18S036 008369'.
               05  FILLER   PIC X(13)  VALUE    '18S037 009146'.
               05  FILLER   PIC X(13)  VALUE    '18S040 008770'.
               05  FILLER   PIC X(13)  VALUE    '18S046 009022'.
               05  FILLER   PIC X(13)  VALUE    '18S047 007965'.
               05  FILLER   PIC X(13)  VALUE    '18S048 008887'.
               05  FILLER   PIC X(13)  VALUE    '18S050 007965'.
               05  FILLER   PIC X(13)  VALUE    '18S051 007965'.
               05  FILLER   PIC X(13)  VALUE    '18S067 009022'.
               05  FILLER   PIC X(13)  VALUE    '18S069 008250'.
               05  FILLER   PIC X(13)  VALUE    '18S093 008821'.
               05  FILLER   PIC X(13)  VALUE    '18S102 008486'.
               05  FILLER   PIC X(13)  VALUE    '18S116 008486'.
               05  FILLER   PIC X(13)  VALUE    '18S127 008528'.
               05  FILLER   PIC X(13)  VALUE    '18S128 007965'.
               05  FILLER   PIC X(13)  VALUE    '18S130 008770'.
               05  FILLER   PIC X(13)  VALUE    '18S132 008887'.
               05  FILLER   PIC X(13)  VALUE    '18S149 007965'.
               05  FILLER   PIC X(13)  VALUE    '18S151 009022'.
               05  FILLER   PIC X(13)  VALUE    '18T009 008369'.
               05  FILLER   PIC X(13)  VALUE    '18T018 007965'.
               05  FILLER   PIC X(13)  VALUE    '18T027 007965'.
               05  FILLER   PIC X(13)  VALUE    '18T029 008887'.
               05  FILLER   PIC X(13)  VALUE    '18T038 008821'.
               05  FILLER   PIC X(13)  VALUE    '18T040 008770'.
               05  FILLER   PIC X(13)  VALUE    '18T044 008250'.
               05  FILLER   PIC X(13)  VALUE    '18T080 007965'.
               05  FILLER   PIC X(13)  VALUE    '18T093 008821'.
               05  FILLER   PIC X(13)  VALUE    '18T102 008486'.
               05  FILLER   PIC X(13)  VALUE    '18T130 008770'.
               05  FILLER   PIC X(13)  VALUE    '18T132 008887'.
               05  FILLER   PIC X(13)  VALUE    '18U021 007965'.
               05  FILLER   PIC X(13)  VALUE    '18U024 007965'.
               05  FILLER   PIC X(13)  VALUE    '18U070 007965'.
               05  FILLER   PIC X(13)  VALUE    '18U101 009022'.
               05  FILLER   PIC X(13)  VALUE    '18U105 007965'.
               05  FILLER   PIC X(13)  VALUE    '18U116 007786'.
               05  FILLER   PIC X(13)  VALUE    '180001 009203'.
               05  FILLER   PIC X(13)  VALUE    '180002 007965'.
               05  FILLER   PIC X(13)  VALUE    '180004 007965'.
               05  FILLER   PIC X(13)  VALUE    '180005 008250'.
               05  FILLER   PIC X(13)  VALUE    '180009 008369'.
               05  FILLER   PIC X(13)  VALUE    '180010 009022'.
               05  FILLER   PIC X(13)  VALUE    '180011 007965'.
               05  FILLER   PIC X(13)  VALUE    '180012 008770'.
               05  FILLER   PIC X(13)  VALUE    '180013 008577'.
               05  FILLER   PIC X(13)  VALUE    '180016 007965'.
               05  FILLER   PIC X(13)  VALUE    '180017 008577'.
               05  FILLER   PIC X(13)  VALUE    '180018 007965'.
               05  FILLER   PIC X(13)  VALUE    '180019 007965'.
               05  FILLER   PIC X(13)  VALUE    '180020 007965'.
               05  FILLER   PIC X(13)  VALUE    '180021 007965'.
               05  FILLER   PIC X(13)  VALUE    '180024 007965'.
               05  FILLER   PIC X(13)  VALUE    '180025 008770'.
               05  FILLER   PIC X(13)  VALUE    '180027 007965'.
               05  FILLER   PIC X(13)  VALUE    '180029 008887'.
               05  FILLER   PIC X(13)  VALUE    '180035 009203'.
               05  FILLER   PIC X(13)  VALUE    '180036 008369'.
               05  FILLER   PIC X(13)  VALUE    '180038 008821'.
               05  FILLER   PIC X(13)  VALUE    '180040 008770'.
               05  FILLER   PIC X(13)  VALUE    '180043 007965'.
               05  FILLER   PIC X(13)  VALUE    '180044 008250'.
               05  FILLER   PIC X(13)  VALUE    '180045 009203'.
               05  FILLER   PIC X(13)  VALUE    '180046 009022'.
               05  FILLER   PIC X(13)  VALUE    '180048 008887'.
               05  FILLER   PIC X(13)  VALUE    '180049 008887'.
               05  FILLER   PIC X(13)  VALUE    '180050 007965'.
               05  FILLER   PIC X(13)  VALUE    '180051 008577'.
               05  FILLER   PIC X(13)  VALUE    '180053 007965'.
               05  FILLER   PIC X(13)  VALUE    '180056 009089'.
               05  FILLER   PIC X(13)  VALUE    '180064 008163'.
               05  FILLER   PIC X(13)  VALUE    '180066 008323'.
               05  FILLER   PIC X(13)  VALUE    '180067 009022'.
               05  FILLER   PIC X(13)  VALUE    '180069 008250'.
               05  FILLER   PIC X(13)  VALUE    '180070 007965'.
               05  FILLER   PIC X(13)  VALUE    '180078 008250'.
               05  FILLER   PIC X(13)  VALUE    '180079 008229'.
               05  FILLER   PIC X(13)  VALUE    '180080 007965'.
               05  FILLER   PIC X(13)  VALUE    '180087 007965'.
               05  FILLER   PIC X(13)  VALUE    '180088 008770'.
               05  FILLER   PIC X(13)  VALUE    '180092 009022'.
               05  FILLER   PIC X(13)  VALUE    '180093 008821'.
               05  FILLER   PIC X(13)  VALUE    '180095 007965'.
               05  FILLER   PIC X(13)  VALUE    '180101 009022'.
               05  FILLER   PIC X(13)  VALUE    '180102 008486'.
               05  FILLER   PIC X(13)  VALUE    '180103 009022'.
               05  FILLER   PIC X(13)  VALUE    '180104 008486'.
               05  FILLER   PIC X(13)  VALUE    '180105 007965'.
               05  FILLER   PIC X(13)  VALUE    '180106 007965'.
               05  FILLER   PIC X(13)  VALUE    '180115 007965'.
               05  FILLER   PIC X(13)  VALUE    '180116 008486'.
               05  FILLER   PIC X(13)  VALUE    '180117 007965'.
               05  FILLER   PIC X(13)  VALUE    '180124 008577'.
               05  FILLER   PIC X(13)  VALUE    '180127 009203'.
               05  FILLER   PIC X(13)  VALUE    '180128 007965'.
               05  FILLER   PIC X(13)  VALUE    '180130 008770'.
               05  FILLER   PIC X(13)  VALUE    '180132 008887'.
               05  FILLER   PIC X(13)  VALUE    '180138 008770'.
               05  FILLER   PIC X(13)  VALUE    '180139 007965'.
               05  FILLER   PIC X(13)  VALUE    '180141 008770'.
               05  FILLER   PIC X(13)  VALUE    '180143 009022'.
               05  FILLER   PIC X(13)  VALUE    '180149 007965'.
               05  FILLER   PIC X(13)  VALUE    '180152 007965'.
               05  FILLER   PIC X(13)  VALUE    '180153 007965'.
               05  FILLER   PIC X(13)  VALUE    '182001 008770'.
               05  FILLER   PIC X(13)  VALUE    '182002 009022'.
               05  FILLER   PIC X(13)  VALUE    '182003 009022'.
               05  FILLER   PIC X(13)  VALUE    '182004 009203'.
               05  FILLER   PIC X(13)  VALUE    '182005 008100'.
               05  FILLER   PIC X(13)  VALUE    '183026 009022'.
               05  FILLER   PIC X(13)  VALUE    '183027 009203'.
               05  FILLER   PIC X(13)  VALUE    '183028 008115'.
               05  FILLER   PIC X(13)  VALUE    '183029 008100'.
               05  FILLER   PIC X(13)  VALUE    '183030 009203'.
               05  FILLER   PIC X(13)  VALUE    '184002 007965'.
               05  FILLER   PIC X(13)  VALUE    '184004 009022'.
               05  FILLER   PIC X(13)  VALUE    '184006 009203'.
               05  FILLER   PIC X(13)  VALUE    '184007 008770'.
               05  FILLER   PIC X(13)  VALUE    '184008 008770'.
               05  FILLER   PIC X(13)  VALUE    '184009 009022'.
               05  FILLER   PIC X(13)  VALUE    '184012 008115'.
               05  FILLER   PIC X(13)  VALUE    '184015 008770'.
               05  FILLER   PIC X(13)  VALUE    '184017 008100'.
               05  FILLER   PIC X(13)  VALUE    '184600 007965'.
               05  FILLER   PIC X(13)  VALUE    '184602 008698'.
               05  FILLER   PIC X(13)  VALUE    '184604 008770'.
               05  FILLER   PIC X(13)  VALUE    '184607 009203'.
               05  FILLER   PIC X(13)  VALUE    '184608 007965'.
               05  FILLER   PIC X(13)  VALUE    '184610 007965'.
               05  FILLER   PIC X(13)  VALUE    '184612 007965'.
               05  FILLER   PIC X(13)  VALUE    '184613 007965'.
               05  FILLER   PIC X(13)  VALUE    '187101 008369'.
               05  FILLER   PIC X(13)  VALUE    '19S002 007818'.
               05  FILLER   PIC X(13)  VALUE    '19S004 007375'.
               05  FILLER   PIC X(13)  VALUE    '19S005 008332'.
               05  FILLER   PIC X(13)  VALUE    '19S007 007067'.
               05  FILLER   PIC X(13)  VALUE    '19S011 007968'.
               05  FILLER   PIC X(13)  VALUE    '19S013 007959'.
               05  FILLER   PIC X(13)  VALUE    '19S014 007183'.
               05  FILLER   PIC X(13)  VALUE    '19S017 007240'.
               05  FILLER   PIC X(13)  VALUE    '19S025 007299'.
               05  FILLER   PIC X(13)  VALUE    '19S027 007723'.
               05  FILLER   PIC X(13)  VALUE    '19S034 007818'.
               05  FILLER   PIC X(13)  VALUE    '19S036 008332'.
               05  FILLER   PIC X(13)  VALUE    '19S037 007723'.
               05  FILLER   PIC X(13)  VALUE    '19S046 008332'.
               05  FILLER   PIC X(13)  VALUE    '19S054 007818'.
               05  FILLER   PIC X(13)  VALUE    '19S060 007723'.
               05  FILLER   PIC X(13)  VALUE    '19S064 007971'.
               05  FILLER   PIC X(13)  VALUE    '19S065 007971'.
               05  FILLER   PIC X(13)  VALUE    '19S078 008655'.
               05  FILLER   PIC X(13)  VALUE    '19S079 008332'.
               05  FILLER   PIC X(13)  VALUE    '19S088 008441'.
               05  FILLER   PIC X(13)  VALUE    '19S098 008441'.
               05  FILLER   PIC X(13)  VALUE    '19S099 007067'.
               05  FILLER   PIC X(13)  VALUE    '19S111 008441'.
               05  FILLER   PIC X(13)  VALUE    '19S114 007326'.
               05  FILLER   PIC X(13)  VALUE    '19S116 007253'.
               05  FILLER   PIC X(13)  VALUE    '19S133 007067'.
               05  FILLER   PIC X(13)  VALUE    '19S144 008441'.
               05  FILLER   PIC X(13)  VALUE    '19S145 007284'.
               05  FILLER   PIC X(13)  VALUE    '19S146 008332'.
               05  FILLER   PIC X(13)  VALUE    '19S160 007968'.
               05  FILLER   PIC X(13)  VALUE    '19S176 008332'.
               05  FILLER   PIC X(13)  VALUE    '19S177 008332'.
               05  FILLER   PIC X(13)  VALUE    '19S183 007375'.
               05  FILLER   PIC X(13)  VALUE    '19S191 007067'.
               05  FILLER   PIC X(13)  VALUE    '19S202 007971'.
               05  FILLER   PIC X(13)  VALUE    '19S206 008332'.
               05  FILLER   PIC X(13)  VALUE    '19S208 007067'.
               05  FILLER   PIC X(13)  VALUE    '19S307 007723'.
               05  FILLER   PIC X(13)  VALUE    '19S312 007504'.
               05  FILLER   PIC X(13)  VALUE    '19T002 007818'.
               05  FILLER   PIC X(13)  VALUE    '19T004 007375'.
               05  FILLER   PIC X(13)  VALUE    '19T008 007375'.
               05  FILLER   PIC X(13)  VALUE    '19T014 007183'.
               05  FILLER   PIC X(13)  VALUE    '19T017 007240'.
               05  FILLER   PIC X(13)  VALUE    '19T019 008894'.
               05  FILLER   PIC X(13)  VALUE    '19T020 007971'.
               05  FILLER   PIC X(13)  VALUE    '19T025 007299'.
               05  FILLER   PIC X(13)  VALUE    '19T027 007723'.
               05  FILLER   PIC X(13)  VALUE    '19T036 008332'.
               05  FILLER   PIC X(13)  VALUE    '19T039 008332'.
               05  FILLER   PIC X(13)  VALUE    '19T041 008441'.
               05  FILLER   PIC X(13)  VALUE    '19T045 008332'.
               05  FILLER   PIC X(13)  VALUE    '19T046 008332'.
               05  FILLER   PIC X(13)  VALUE    '19T054 007818'.
               05  FILLER   PIC X(13)  VALUE    '19T060 007723'.
               05  FILLER   PIC X(13)  VALUE    '19T064 007971'.
               05  FILLER   PIC X(13)  VALUE    '19T065 007971'.
               05  FILLER   PIC X(13)  VALUE    '19T078 008534'.
               05  FILLER   PIC X(13)  VALUE    '19T102 007818'.
               05  FILLER   PIC X(13)  VALUE    '19T111 008441'.
               05  FILLER   PIC X(13)  VALUE    '19T124 008332'.
               05  FILLER   PIC X(13)  VALUE    '19T125 007968'.
               05  FILLER   PIC X(13)  VALUE    '19T131 007971'.
               05  FILLER   PIC X(13)  VALUE    '19T135 008332'.
               05  FILLER   PIC X(13)  VALUE    '19T140 007169'.
               05  FILLER   PIC X(13)  VALUE    '19T144 008441'.
               05  FILLER   PIC X(13)  VALUE    '19T146 008332'.
               05  FILLER   PIC X(13)  VALUE    '19T160 007968'.
               05  FILLER   PIC X(13)  VALUE    '19T167 007299'.
               05  FILLER   PIC X(13)  VALUE    '19T176 008332'.
               05  FILLER   PIC X(13)  VALUE    '19T185 008332'.
               05  FILLER   PIC X(13)  VALUE    '19T190 007416'.
               05  FILLER   PIC X(13)  VALUE    '19T191 007067'.
               05  FILLER   PIC X(13)  VALUE    '19T202 007971'.
               05  FILLER   PIC X(13)  VALUE    '19T204 008332'.
               05  FILLER   PIC X(13)  VALUE    '19T304 007809'.
               05  FILLER   PIC X(13)  VALUE    '19U007 007067'.
               05  FILLER   PIC X(13)  VALUE    '19U037 007723'.
               05  FILLER   PIC X(13)  VALUE    '19U053 007067'.
               05  FILLER   PIC X(13)  VALUE    '19U081 007067'.
               05  FILLER   PIC X(13)  VALUE    '19U114 007067'.
               05  FILLER   PIC X(13)  VALUE    '19U118 008441'.
               05  FILLER   PIC X(13)  VALUE    '19U133 007067'.
               05  FILLER   PIC X(13)  VALUE    '19U140 007067'.
               05  FILLER   PIC X(13)  VALUE    '19U145 007067'.
               05  FILLER   PIC X(13)  VALUE    '19U151 007067'.
               05  FILLER   PIC X(13)  VALUE    '19U184 007067'.
               05  FILLER   PIC X(13)  VALUE    '19Z306 007067'.
               05  FILLER   PIC X(13)  VALUE    '190002 007818'.
               05  FILLER   PIC X(13)  VALUE    '190003 007818'.
               05  FILLER   PIC X(13)  VALUE    '190004 008213'.
               05  FILLER   PIC X(13)  VALUE    '190005 008332'.
               05  FILLER   PIC X(13)  VALUE    '190006 007818'.
               05  FILLER   PIC X(13)  VALUE    '190007 008331'.
               05  FILLER   PIC X(13)  VALUE    '190008 008213'.
               05  FILLER   PIC X(13)  VALUE    '190011 007968'.
               05  FILLER   PIC X(13)  VALUE    '190013 007723'.
               05  FILLER   PIC X(13)  VALUE    '190014 007971'.
               05  FILLER   PIC X(13)  VALUE    '190015 008321'.
               05  FILLER   PIC X(13)  VALUE    '190017 007971'.
               05  FILLER   PIC X(13)  VALUE    '190019 008894'.
               05  FILLER   PIC X(13)  VALUE    '190020 007971'.
               05  FILLER   PIC X(13)  VALUE    '190025 007299'.
               05  FILLER   PIC X(13)  VALUE    '190026 008894'.
               05  FILLER   PIC X(13)  VALUE    '190027 008548'.
               05  FILLER   PIC X(13)  VALUE    '190034 007067'.
               05  FILLER   PIC X(13)  VALUE    '190036 008332'.
               05  FILLER   PIC X(13)  VALUE    '190039 008332'.
               05  FILLER   PIC X(13)  VALUE    '190040 008318'.
               05  FILLER   PIC X(13)  VALUE    '190041 008441'.
               05  FILLER   PIC X(13)  VALUE    '190044 007818'.
               05  FILLER   PIC X(13)  VALUE    '190045 008318'.
               05  FILLER   PIC X(13)  VALUE    '190046 008332'.
               05  FILLER   PIC X(13)  VALUE    '190050 007120'.
               05  FILLER   PIC X(13)  VALUE    '190053 007516'.
               05  FILLER   PIC X(13)  VALUE    '190054 007818'.
               05  FILLER   PIC X(13)  VALUE    '190060 008548'.
               05  FILLER   PIC X(13)  VALUE    '190064 007971'.
               05  FILLER   PIC X(13)  VALUE    '190065 008213'.
               05  FILLER   PIC X(13)  VALUE    '190079 008332'.
               05  FILLER   PIC X(13)  VALUE    '190081 007067'.
               05  FILLER   PIC X(13)  VALUE    '190086 008331'.
               05  FILLER   PIC X(13)  VALUE    '190088 007067'.
               05  FILLER   PIC X(13)  VALUE    '190090 007067'.
               05  FILLER   PIC X(13)  VALUE    '190098 008441'.
               05  FILLER   PIC X(13)  VALUE    '190099 007388'.
               05  FILLER   PIC X(13)  VALUE    '190102 007818'.
               05  FILLER   PIC X(13)  VALUE    '190106 007067'.
               05  FILLER   PIC X(13)  VALUE    '190111 008441'.
               05  FILLER   PIC X(13)  VALUE    '190114 007326'.
               05  FILLER   PIC X(13)  VALUE    '190116 007253'.
               05  FILLER   PIC X(13)  VALUE    '190118 008441'.
               05  FILLER   PIC X(13)  VALUE    '190125 007968'.
               05  FILLER   PIC X(13)  VALUE    '190128 007971'.
               05  FILLER   PIC X(13)  VALUE    '190133 007067'.
               05  FILLER   PIC X(13)  VALUE    '190140 007169'.
               05  FILLER   PIC X(13)  VALUE    '190144 008441'.
               05  FILLER   PIC X(13)  VALUE    '190145 007284'.
               05  FILLER   PIC X(13)  VALUE    '190146 008332'.
               05  FILLER   PIC X(13)  VALUE    '190151 007067'.
               05  FILLER   PIC X(13)  VALUE    '190160 007968'.
               05  FILLER   PIC X(13)  VALUE    '190164 008684'.
               05  FILLER   PIC X(13)  VALUE    '190167 008684'.
               05  FILLER   PIC X(13)  VALUE    '190175 008332'.
               05  FILLER   PIC X(13)  VALUE    '190176 008332'.
               05  FILLER   PIC X(13)  VALUE    '190177 008318'.
               05  FILLER   PIC X(13)  VALUE    '190183 007375'.
               05  FILLER   PIC X(13)  VALUE    '190184 008684'.
               05  FILLER   PIC X(13)  VALUE    '190190 008684'.
               05  FILLER   PIC X(13)  VALUE    '190191 007818'.
               05  FILLER   PIC X(13)  VALUE    '190199 007971'.
               05  FILLER   PIC X(13)  VALUE    '190201 007723'.
               05  FILLER   PIC X(13)  VALUE    '190202 007971'.
               05  FILLER   PIC X(13)  VALUE    '190204 008318'.
               05  FILLER   PIC X(13)  VALUE    '190205 007818'.
               05  FILLER   PIC X(13)  VALUE    '190208 007098'.
               05  FILLER   PIC X(13)  VALUE    '190218 007067'.
               05  FILLER   PIC X(13)  VALUE    '190236 008441'.
               05  FILLER   PIC X(13)  VALUE    '190241 007375'.
               05  FILLER   PIC X(13)  VALUE    '190242 008213'.
               05  FILLER   PIC X(13)  VALUE    '190245 007968'.
               05  FILLER   PIC X(13)  VALUE    '190246 007968'.
               05  FILLER   PIC X(13)  VALUE    '190250 008318'.
               05  FILLER   PIC X(13)  VALUE    '190251 007971'.
               05  FILLER   PIC X(13)  VALUE    '190255 007818'.
               05  FILLER   PIC X(13)  VALUE    '190256 008318'.
               05  FILLER   PIC X(13)  VALUE    '190257 007173'.
               05  FILLER   PIC X(13)  VALUE    '190259 007818'.
               05  FILLER   PIC X(13)  VALUE    '190261 007968'.
               05  FILLER   PIC X(13)  VALUE    '190263 007818'.
               05  FILLER   PIC X(13)  VALUE    '190266 007971'.
               05  FILLER   PIC X(13)  VALUE    '190267 008318'.
               05  FILLER   PIC X(13)  VALUE    '190268 007818'.
               05  FILLER   PIC X(13)  VALUE    '190270 008318'.
               05  FILLER   PIC X(13)  VALUE    '190274 008332'.
               05  FILLER   PIC X(13)  VALUE    '190278 008441'.
               05  FILLER   PIC X(13)  VALUE    '190297 007067'.
               05  FILLER   PIC X(13)  VALUE    '190298 008894'.
               05  FILLER   PIC X(13)  VALUE    '190300 008332'.
               05  FILLER   PIC X(13)  VALUE    '190302 008332'.
               05  FILLER   PIC X(13)  VALUE    '190303 008321'.
               05  FILLER   PIC X(13)  VALUE    '190307 007723'.
               05  FILLER   PIC X(13)  VALUE    '190308 008332'.
               05  FILLER   PIC X(13)  VALUE    '190312 007504'.
               05  FILLER   PIC X(13)  VALUE    '190313 008332'.
               05  FILLER   PIC X(13)  VALUE    '191500 007818'.
               05  FILLER   PIC X(13)  VALUE    '191504 008441'.
               05  FILLER   PIC X(13)  VALUE    '191533 008441'.
               05  FILLER   PIC X(13)  VALUE    '191597 008332'.
               05  FILLER   PIC X(13)  VALUE    '191620 007968'.
               05  FILLER   PIC X(13)  VALUE    '191654 007818'.
               05  FILLER   PIC X(13)  VALUE    '191664 008441'.
               05  FILLER   PIC X(13)  VALUE    '191665 007818'.
               05  FILLER   PIC X(13)  VALUE    '191666 007818'.
               05  FILLER   PIC X(13)  VALUE    '191669 007818'.
               05  FILLER   PIC X(13)  VALUE    '191672 008332'.
               05  FILLER   PIC X(13)  VALUE    '191673 008894'.
               05  FILLER   PIC X(13)  VALUE    '191674 007818'.
               05  FILLER   PIC X(13)  VALUE    '191675 007968'.
               05  FILLER   PIC X(13)  VALUE    '191676 008332'.
               05  FILLER   PIC X(13)  VALUE    '191677 007067'.
               05  FILLER   PIC X(13)  VALUE    '191678 008441'.
               05  FILLER   PIC X(13)  VALUE    '191680 008332'.
               05  FILLER   PIC X(13)  VALUE    '191681 008332'.
               05  FILLER   PIC X(13)  VALUE    '191682 007818'.
               05  FILLER   PIC X(13)  VALUE    '191683 008894'.
               05  FILLER   PIC X(13)  VALUE    '191684 007971'.
               05  FILLER   PIC X(13)  VALUE    '192004 007971'.
               05  FILLER   PIC X(13)  VALUE    '192006 008441'.
               05  FILLER   PIC X(13)  VALUE    '192007 008332'.
               05  FILLER   PIC X(13)  VALUE    '192009 008332'.
               05  FILLER   PIC X(13)  VALUE    '192010 008441'.
               05  FILLER   PIC X(13)  VALUE    '192011 008441'.
               05  FILLER   PIC X(13)  VALUE    '192019 007723'.
               05  FILLER   PIC X(13)  VALUE    '192022 007173'.
               05  FILLER   PIC X(13)  VALUE    '192023 008332'.
               05  FILLER   PIC X(13)  VALUE    '192028 007067'.
               05  FILLER   PIC X(13)  VALUE    '192030 008332'.
               05  FILLER   PIC X(13)  VALUE    '192031 007968'.
               05  FILLER   PIC X(13)  VALUE    '192032 007818'.
               05  FILLER   PIC X(13)  VALUE    '192036 008321'.
               05  FILLER   PIC X(13)  VALUE    '192043 008894'.
               05  FILLER   PIC X(13)  VALUE    '192048 008332'.
               05  FILLER   PIC X(13)  VALUE    '192049 007971'.
               05  FILLER   PIC X(13)  VALUE    '192052 007067'.
               05  FILLER   PIC X(13)  VALUE    '193028 007971'.
               05  FILLER   PIC X(13)  VALUE    '193031 008894'.
               05  FILLER   PIC X(13)  VALUE    '193044 008321'.
               05  FILLER   PIC X(13)  VALUE    '193050 007067'.
               05  FILLER   PIC X(13)  VALUE    '193058 007067'.
               05  FILLER   PIC X(13)  VALUE    '193069 007253'.
               05  FILLER   PIC X(13)  VALUE    '193070 007971'.
               05  FILLER   PIC X(13)  VALUE    '193078 007971'.
               05  FILLER   PIC X(13)  VALUE    '193080 007067'.
               05  FILLER   PIC X(13)  VALUE    '193090 007971'.
               05  FILLER   PIC X(13)  VALUE    '193092 007971'.
               05  FILLER   PIC X(13)  VALUE    '193098 008332'.
               05  FILLER   PIC X(13)  VALUE    '193099 008332'.
               05  FILLER   PIC X(13)  VALUE    '193300 008332'.
               05  FILLER   PIC X(13)  VALUE    '194007 008332'.
               05  FILLER   PIC X(13)  VALUE    '194008 007971'.
               05  FILLER   PIC X(13)  VALUE    '194020 008441'.
               05  FILLER   PIC X(13)  VALUE    '194022 008894'.
               05  FILLER   PIC X(13)  VALUE    '194025 008894'.
               05  FILLER   PIC X(13)  VALUE    '194031 008332'.
               05  FILLER   PIC X(13)  VALUE    '194044 007818'.
               05  FILLER   PIC X(13)  VALUE    '194056 008332'.
               05  FILLER   PIC X(13)  VALUE    '194069 008332'.
               05  FILLER   PIC X(13)  VALUE    '194073 007818'.
               05  FILLER   PIC X(13)  VALUE    '194074 007173'.
               05  FILLER   PIC X(13)  VALUE    '194080 008332'.
               05  FILLER   PIC X(13)  VALUE    '194081 007120'.
               05  FILLER   PIC X(13)  VALUE    '194082 007171'.
               05  FILLER   PIC X(13)  VALUE    '194083 007253'.
               05  FILLER   PIC X(13)  VALUE    '194084 008332'.
               05  FILLER   PIC X(13)  VALUE    '194085 007818'.
               05  FILLER   PIC X(13)  VALUE    '194086 007971'.
               05  FILLER   PIC X(13)  VALUE    '194087 007067'.
               05  FILLER   PIC X(13)  VALUE    '194088 007971'.
               05  FILLER   PIC X(13)  VALUE    '194089 007067'.
               05  FILLER   PIC X(13)  VALUE    '194090 007723'.
               05  FILLER   PIC X(13)  VALUE    '194091 008321'.
               05  FILLER   PIC X(13)  VALUE    '194094 008441'.
               05  FILLER   PIC X(13)  VALUE    '194095 007240'.
               05  FILLER   PIC X(13)  VALUE    '194096 008894'.
               05  FILLER   PIC X(13)  VALUE    '194098 008332'.
               05  FILLER   PIC X(13)  VALUE    '194100 008332'.
               05  FILLER   PIC X(13)  VALUE    '194102 008332'.
               05  FILLER   PIC X(13)  VALUE    '194103 007971'.
               05  FILLER   PIC X(13)  VALUE    '194105 007971'.
               05  FILLER   PIC X(13)  VALUE    '194106 008894'.
               05  FILLER   PIC X(13)  VALUE    '194109 007375'.
               05  FILLER   PIC X(13)  VALUE    '194114 008332'.
               05  FILLER   PIC X(13)  VALUE    '194512 007818'.
               05  FILLER   PIC X(13)  VALUE    '194519 007067'.
               05  FILLER   PIC X(13)  VALUE    '194523 007818'.
               05  FILLER   PIC X(13)  VALUE    '194525 008441'.
               05  FILLER   PIC X(13)  VALUE    '194526 007723'.
               05  FILLER   PIC X(13)  VALUE    '194527 008441'.
               05  FILLER   PIC X(13)  VALUE    '194528 007971'.
               05  FILLER   PIC X(13)  VALUE    '194529 007818'.
               05  FILLER   PIC X(13)  VALUE    '194530 008894'.
               05  FILLER   PIC X(13)  VALUE    '194531 007067'.
               05  FILLER   PIC X(13)  VALUE    '194533 007971'.
               05  FILLER   PIC X(13)  VALUE    '194534 007067'.
               05  FILLER   PIC X(13)  VALUE    '194536 007067'.
               05  FILLER   PIC X(13)  VALUE    '194537 007067'.
               05  FILLER   PIC X(13)  VALUE    '194538 007067'.
               05  FILLER   PIC X(13)  VALUE    '194541 007067'.
               05  FILLER   PIC X(13)  VALUE    '194605 007971'.
               05  FILLER   PIC X(13)  VALUE    '194614 007971'.
               05  FILLER   PIC X(13)  VALUE    '194616 007971'.
               05  FILLER   PIC X(13)  VALUE    '194633 007067'.
               05  FILLER   PIC X(13)  VALUE    '194644 008332'.
               05  FILLER   PIC X(13)  VALUE    '194650 007818'.
               05  FILLER   PIC X(13)  VALUE    '194666 007067'.
               05  FILLER   PIC X(13)  VALUE    '194668 008318'.
               05  FILLER   PIC X(13)  VALUE    '194672 008332'.
               05  FILLER   PIC X(13)  VALUE    '194675 007971'.
               05  FILLER   PIC X(13)  VALUE    '194685 007818'.
               05  FILLER   PIC X(13)  VALUE    '194687 007375'.
               05  FILLER   PIC X(13)  VALUE    '194688 007818'.
               05  FILLER   PIC X(13)  VALUE    '194689 007971'.
               05  FILLER   PIC X(13)  VALUE    '194696 008441'.
               05  FILLER   PIC X(13)  VALUE    '194698 007971'.
               05  FILLER   PIC X(13)  VALUE    '194703 008332'.
               05  FILLER   PIC X(13)  VALUE    '194705 007971'.
               05  FILLER   PIC X(13)  VALUE    '194710 007968'.
               05  FILLER   PIC X(13)  VALUE    '194715 007375'.
               05  FILLER   PIC X(13)  VALUE    '194724 007971'.
               05  FILLER   PIC X(13)  VALUE    '194725 007818'.
               05  FILLER   PIC X(13)  VALUE    '194730 007971'.
               05  FILLER   PIC X(13)  VALUE    '197315 008332'.
               05  FILLER   PIC X(13)  VALUE    '197607 007971'.
               05  FILLER   PIC X(13)  VALUE    '197679 008332'.
               05  FILLER   PIC X(13)  VALUE    '20S009 010364'.
               05  FILLER   PIC X(13)  VALUE    '20S019 010364'.
               05  FILLER   PIC X(13)  VALUE    '20S034 009038'.
               05  FILLER   PIC X(13)  VALUE    '20S052 008804'.
               05  FILLER   PIC X(13)  VALUE    '20T018 008804'.
               05  FILLER   PIC X(13)  VALUE    '20T024 009038'.
               05  FILLER   PIC X(13)  VALUE    '20T033 010045'.
               05  FILLER   PIC X(13)  VALUE    '20T039 008804'.
               05  FILLER   PIC X(13)  VALUE    '20U018 008804'.
               05  FILLER   PIC X(13)  VALUE    '20U052 008804'.
               05  FILLER   PIC X(13)  VALUE    '20Z314 008804'.
               05  FILLER   PIC X(13)  VALUE    '200001 010045'.
               05  FILLER   PIC X(13)  VALUE    '200008 010364'.
               05  FILLER   PIC X(13)  VALUE    '200009 010364'.
               05  FILLER   PIC X(13)  VALUE    '200018 008804'.
               05  FILLER   PIC X(13)  VALUE    '200019 010364'.
               05  FILLER   PIC X(13)  VALUE    '200020 010364'.
               05  FILLER   PIC X(13)  VALUE    '200021 010364'.
               05  FILLER   PIC X(13)  VALUE    '200024 009720'.
               05  FILLER   PIC X(13)  VALUE    '200025 010364'.
               05  FILLER   PIC X(13)  VALUE    '200031 008804'.
               05  FILLER   PIC X(13)  VALUE    '200033 010045'.
               05  FILLER   PIC X(13)  VALUE    '200034 009720'.
               05  FILLER   PIC X(13)  VALUE    '200037 008804'.
               05  FILLER   PIC X(13)  VALUE    '200039 009720'.
               05  FILLER   PIC X(13)  VALUE    '200040 010364'.
               05  FILLER   PIC X(13)  VALUE    '200041 008804'.
               05  FILLER   PIC X(13)  VALUE    '200050 010045'.
               05  FILLER   PIC X(13)  VALUE    '200052 008804'.
               05  FILLER   PIC X(13)  VALUE    '200063 009720'.
               05  FILLER   PIC X(13)  VALUE    '201500 008804'.
               05  FILLER   PIC X(13)  VALUE    '201501 010364'.
               05  FILLER   PIC X(13)  VALUE    '201503 008804'.
               05  FILLER   PIC X(13)  VALUE    '201504 010045'.
               05  FILLER   PIC X(13)  VALUE    '201505 008804'.
               05  FILLER   PIC X(13)  VALUE    '201507 010045'.
               05  FILLER   PIC X(13)  VALUE    '201508 008804'.
               05  FILLER   PIC X(13)  VALUE    '201509 008804'.
               05  FILLER   PIC X(13)  VALUE    '201511 010364'.
               05  FILLER   PIC X(13)  VALUE    '201512 010045'.
               05  FILLER   PIC X(13)  VALUE    '201513 008804'.
               05  FILLER   PIC X(13)  VALUE    '201514 010045'.
               05  FILLER   PIC X(13)  VALUE    '201515 008804'.
               05  FILLER   PIC X(13)  VALUE    '201516 010364'.
               05  FILLER   PIC X(13)  VALUE    '201517 008804'.
               05  FILLER   PIC X(13)  VALUE    '201519 010364'.
               05  FILLER   PIC X(13)  VALUE    '201520 010045'.
               05  FILLER   PIC X(13)  VALUE    '201521 010364'.
               05  FILLER   PIC X(13)  VALUE    '203025 010364'.
               05  FILLER   PIC X(13)  VALUE    '204004 010045'.
               05  FILLER   PIC X(13)  VALUE    '204006 010045'.
               05  FILLER   PIC X(13)  VALUE    '204008 008804'.
               05  FILLER   PIC X(13)  VALUE    '207015 008671'.
               05  FILLER   PIC X(13)  VALUE    '207019 009127'.
               05  FILLER   PIC X(13)  VALUE    '207055 008804'.
               05  FILLER   PIC X(13)  VALUE    '207062 008804'.
               05  FILLER   PIC X(13)  VALUE    '21U030 008763'.
               05  FILLER   PIC X(13)  VALUE    '21U045 009142'.
               05  FILLER   PIC X(13)  VALUE    '210001 009132'.
               05  FILLER   PIC X(13)  VALUE    '210002 009463'.
               05  FILLER   PIC X(13)  VALUE    '210003 009998'.
               05  FILLER   PIC X(13)  VALUE    '210004 009782'.
               05  FILLER   PIC X(13)  VALUE    '210005 009638'.
               05  FILLER   PIC X(13)  VALUE    '210006 009463'.
               05  FILLER   PIC X(13)  VALUE    '210008 009463'.
               05  FILLER   PIC X(13)  VALUE    '210009 009463'.
               05  FILLER   PIC X(13)  VALUE    '210011 009463'.
               05  FILLER   PIC X(13)  VALUE    '210012 009463'.
               05  FILLER   PIC X(13)  VALUE    '210013 009463'.
               05  FILLER   PIC X(13)  VALUE    '210015 009463'.
               05  FILLER   PIC X(13)  VALUE    '210016 009782'.
               05  FILLER   PIC X(13)  VALUE    '210017 008763'.
               05  FILLER   PIC X(13)  VALUE    '210018 009782'.
               05  FILLER   PIC X(13)  VALUE    '210019 009142'.
               05  FILLER   PIC X(13)  VALUE    '210022 009782'.
               05  FILLER   PIC X(13)  VALUE    '210023 009563'.
               05  FILLER   PIC X(13)  VALUE    '210024 009463'.
               05  FILLER   PIC X(13)  VALUE    '210027 008763'.
               05  FILLER   PIC X(13)  VALUE    '210028 008941'.
               05  FILLER   PIC X(13)  VALUE    '210029 009463'.
               05  FILLER   PIC X(13)  VALUE    '210030 009483'.
               05  FILLER   PIC X(13)  VALUE    '210032 011303'.
               05  FILLER   PIC X(13)  VALUE    '210033 009463'.
               05  FILLER   PIC X(13)  VALUE    '210034 009463'.
               05  FILLER   PIC X(13)  VALUE    '210035 009998'.
               05  FILLER   PIC X(13)  VALUE    '210037 008875'.
               05  FILLER   PIC X(13)  VALUE    '210038 009463'.
               05  FILLER   PIC X(13)  VALUE    '210039 009998'.
               05  FILLER   PIC X(13)  VALUE    '210040 009463'.
               05  FILLER   PIC X(13)  VALUE    '210043 009563'.
               05  FILLER   PIC X(13)  VALUE    '210044 009463'.
               05  FILLER   PIC X(13)  VALUE    '210045 009142'.
               05  FILLER   PIC X(13)  VALUE    '210048 009463'.
               05  FILLER   PIC X(13)  VALUE    '210049 009463'.
               05  FILLER   PIC X(13)  VALUE    '210051 009998'.
               05  FILLER   PIC X(13)  VALUE    '210055 009998'.
               05  FILLER   PIC X(13)  VALUE    '210056 009463'.
               05  FILLER   PIC X(13)  VALUE    '210057 009782'.
               05  FILLER   PIC X(13)  VALUE    '210058 009463'.
               05  FILLER   PIC X(13)  VALUE    '210060 009998'.
               05  FILLER   PIC X(13)  VALUE    '210061 009142'.
               05  FILLER   PIC X(13)  VALUE    '210062 009998'.
               05  FILLER   PIC X(13)  VALUE    '210063 009463'.
               05  FILLER   PIC X(13)  VALUE    '210064 009463'.
               05  FILLER   PIC X(13)  VALUE    '210065 009782'.
               05  FILLER   PIC X(13)  VALUE    '211500 009463'.
               05  FILLER   PIC X(13)  VALUE    '211502 009638'.
               05  FILLER   PIC X(13)  VALUE    '211503 009638'.
               05  FILLER   PIC X(13)  VALUE    '211505 009142'.
               05  FILLER   PIC X(13)  VALUE    '211507 009463'.
               05  FILLER   PIC X(13)  VALUE    '211508 009638'.
               05  FILLER   PIC X(13)  VALUE    '211509 009463'.
               05  FILLER   PIC X(13)  VALUE    '211511 008873'.
               05  FILLER   PIC X(13)  VALUE    '211512 009463'.
               05  FILLER   PIC X(13)  VALUE    '211513 009463'.
               05  FILLER   PIC X(13)  VALUE    '211514 009463'.
               05  FILLER   PIC X(13)  VALUE    '211516 009638'.
               05  FILLER   PIC X(13)  VALUE    '211519 009998'.
               05  FILLER   PIC X(13)  VALUE    '211522 009463'.
               05  FILLER   PIC X(13)  VALUE    '211523 008763'.
               05  FILLER   PIC X(13)  VALUE    '211526 009463'.
               05  FILLER   PIC X(13)  VALUE    '211529 009463'.
               05  FILLER   PIC X(13)  VALUE    '211534 008763'.
               05  FILLER   PIC X(13)  VALUE    '211535 008763'.
               05  FILLER   PIC X(13)  VALUE    '211536 009463'.
               05  FILLER   PIC X(13)  VALUE    '211538 009463'.
               05  FILLER   PIC X(13)  VALUE    '211539 008763'.
               05  FILLER   PIC X(13)  VALUE    '211541 009998'.
               05  FILLER   PIC X(13)  VALUE    '214530 009463'.
               05  FILLER   PIC X(13)  VALUE    '214532 008873'.
               05  FILLER   PIC X(13)  VALUE    '214609 009463'.
               05  FILLER   PIC X(13)  VALUE    '214611 009463'.
               05  FILLER   PIC X(13)  VALUE    '214617 009463'.
               05  FILLER   PIC X(13)  VALUE    '214618 009998'.
               05  FILLER   PIC X(13)  VALUE    '214619 009463'.
               05  FILLER   PIC X(13)  VALUE    '214620 009463'.
               05  FILLER   PIC X(13)  VALUE    '217158 009638'.
               05  FILLER   PIC X(13)  VALUE    '217161 009463'.
               05  FILLER   PIC X(13)  VALUE    '217162 009463'.
               05  FILLER   PIC X(13)  VALUE    '217163 009638'.
               05  FILLER   PIC X(13)  VALUE    '217164 009463'.
               05  FILLER   PIC X(13)  VALUE    '22B074 013545'.
               05  FILLER   PIC X(13)  VALUE    '22S001 012575'.
               05  FILLER   PIC X(13)  VALUE    '22S002 013545'.
               05  FILLER   PIC X(13)  VALUE    '22S011 013545'.
               05  FILLER   PIC X(13)  VALUE    '22S012 013629'.
               05  FILLER   PIC X(13)  VALUE    '22S015 013545'.
               05  FILLER   PIC X(13)  VALUE    '22S016 013545'.
               05  FILLER   PIC X(13)  VALUE    '22S017 013545'.
               05  FILLER   PIC X(13)  VALUE    '22S019 012575'.
               05  FILLER   PIC X(13)  VALUE    '22S020 010445'.
               05  FILLER   PIC X(13)  VALUE    '22S024 013545'.
               05  FILLER   PIC X(13)  VALUE    '22S029 013545'.
               05  FILLER   PIC X(13)  VALUE    '22S030 013545'.
               05  FILLER   PIC X(13)  VALUE    '22S033 013545'.
               05  FILLER   PIC X(13)  VALUE    '22S035 013545'.
               05  FILLER   PIC X(13)  VALUE    '22S036 013545'.
               05  FILLER   PIC X(13)  VALUE    '22S046 013545'.
               05  FILLER   PIC X(13)  VALUE    '22S052 013545'.
               05  FILLER   PIC X(13)  VALUE    '22S060 013545'.
               05  FILLER   PIC X(13)  VALUE    '22S065 013545'.
               05  FILLER   PIC X(13)  VALUE    '22S066 013545'.
               05  FILLER   PIC X(13)  VALUE    '22S070 013545'.
               05  FILLER   PIC X(13)  VALUE    '22S071 013545'.
               05  FILLER   PIC X(13)  VALUE    '22S073 010445'.
               05  FILLER   PIC X(13)  VALUE    '22S077 013545'.
               05  FILLER   PIC X(13)  VALUE    '22S080 013545'.
               05  FILLER   PIC X(13)  VALUE    '22S084 013545'.
               05  FILLER   PIC X(13)  VALUE    '22S086 013545'.
               05  FILLER   PIC X(13)  VALUE    '22S095 012575'.
               05  FILLER   PIC X(13)  VALUE    '22S098 013545'.
               05  FILLER   PIC X(13)  VALUE    '22S101 013545'.
               05  FILLER   PIC X(13)  VALUE    '22S111 013545'.
               05  FILLER   PIC X(13)  VALUE    '22S116 013545'.
               05  FILLER   PIC X(13)  VALUE    '22S119 013545'.
               05  FILLER   PIC X(13)  VALUE    '22S126 013545'.
               05  FILLER   PIC X(13)  VALUE    '22S163 012575'.
               05  FILLER   PIC X(13)  VALUE    '22S175 013545'.
               05  FILLER   PIC X(13)  VALUE    '22S176 012575'.
               05  FILLER   PIC X(13)  VALUE    '22T046 013545'.
               05  FILLER   PIC X(13)  VALUE    '22T065 013545'.
               05  FILLER   PIC X(13)  VALUE    '22T066 013545'.
               05  FILLER   PIC X(13)  VALUE    '22T074 010445'.
               05  FILLER   PIC X(13)  VALUE    '220001 013545'.
               05  FILLER   PIC X(13)  VALUE    '220002 013545'.
               05  FILLER   PIC X(13)  VALUE    '220008 013545'.
               05  FILLER   PIC X(13)  VALUE    '220010 013545'.
               05  FILLER   PIC X(13)  VALUE    '220011 013545'.
               05  FILLER   PIC X(13)  VALUE    '220012 013629'.
               05  FILLER   PIC X(13)  VALUE    '220015 013545'.
               05  FILLER   PIC X(13)  VALUE    '220016 013545'.
               05  FILLER   PIC X(13)  VALUE    '220017 013545'.
               05  FILLER   PIC X(13)  VALUE    '220019 013545'.
               05  FILLER   PIC X(13)  VALUE    '220020 013545'.
               05  FILLER   PIC X(13)  VALUE    '220024 013545'.
               05  FILLER   PIC X(13)  VALUE    '220029 013545'.
               05  FILLER   PIC X(13)  VALUE    '220030 013545'.
               05  FILLER   PIC X(13)  VALUE    '220031 013545'.
               05  FILLER   PIC X(13)  VALUE    '220033 013545'.
               05  FILLER   PIC X(13)  VALUE    '220035 013545'.
               05  FILLER   PIC X(13)  VALUE    '220036 013545'.
               05  FILLER   PIC X(13)  VALUE    '220046 013545'.
               05  FILLER   PIC X(13)  VALUE    '220049 013545'.
               05  FILLER   PIC X(13)  VALUE    '220050 013545'.
               05  FILLER   PIC X(13)  VALUE    '220052 013545'.
               05  FILLER   PIC X(13)  VALUE    '220058 013545'.
               05  FILLER   PIC X(13)  VALUE    '220060 013545'.
               05  FILLER   PIC X(13)  VALUE    '220062 013545'.
               05  FILLER   PIC X(13)  VALUE    '220063 013545'.
               05  FILLER   PIC X(13)  VALUE    '220065 013545'.
               05  FILLER   PIC X(13)  VALUE    '220066 013545'.
               05  FILLER   PIC X(13)  VALUE    '220067 013545'.
               05  FILLER   PIC X(13)  VALUE    '220070 013545'.
               05  FILLER   PIC X(13)  VALUE    '220071 013545'.
               05  FILLER   PIC X(13)  VALUE    '220073 013545'.
               05  FILLER   PIC X(13)  VALUE    '220074 013545'.
               05  FILLER   PIC X(13)  VALUE    '220075 013545'.
               05  FILLER   PIC X(13)  VALUE    '220077 013545'.
               05  FILLER   PIC X(13)  VALUE    '220080 013545'.
               05  FILLER   PIC X(13)  VALUE    '220082 013545'.
               05  FILLER   PIC X(13)  VALUE    '220083 013545'.
               05  FILLER   PIC X(13)  VALUE    '220084 013545'.
               05  FILLER   PIC X(13)  VALUE    '220086 013545'.
               05  FILLER   PIC X(13)  VALUE    '220088 013545'.
               05  FILLER   PIC X(13)  VALUE    '220090 013545'.
               05  FILLER   PIC X(13)  VALUE    '220095 013545'.
               05  FILLER   PIC X(13)  VALUE    '220098 013545'.
               05  FILLER   PIC X(13)  VALUE    '220100 013545'.
               05  FILLER   PIC X(13)  VALUE    '220101 013545'.
               05  FILLER   PIC X(13)  VALUE    '220105 013545'.
               05  FILLER   PIC X(13)  VALUE    '220108 013545'.
               05  FILLER   PIC X(13)  VALUE    '220110 013545'.
               05  FILLER   PIC X(13)  VALUE    '220111 013545'.
               05  FILLER   PIC X(13)  VALUE    '220116 013545'.
               05  FILLER   PIC X(13)  VALUE    '220119 013545'.
               05  FILLER   PIC X(13)  VALUE    '220126 013545'.
               05  FILLER   PIC X(13)  VALUE    '220135 013629'.
               05  FILLER   PIC X(13)  VALUE    '220162 013545'.
               05  FILLER   PIC X(13)  VALUE    '220163 013545'.
               05  FILLER   PIC X(13)  VALUE    '220171 013545'.
               05  FILLER   PIC X(13)  VALUE    '220174 013545'.
               05  FILLER   PIC X(13)  VALUE    '220175 013545'.
               05  FILLER   PIC X(13)  VALUE    '220176 013545'.
               05  FILLER   PIC X(13)  VALUE    '220177 013545'.
               05  FILLER   PIC X(13)  VALUE    '221500 013545'.
               05  FILLER   PIC X(13)  VALUE    '221504 013545'.
               05  FILLER   PIC X(13)  VALUE    '221506 013545'.
               05  FILLER   PIC X(13)  VALUE    '221507 013545'.
               05  FILLER   PIC X(13)  VALUE    '221508 013545'.
               05  FILLER   PIC X(13)  VALUE    '221512 013545'.
               05  FILLER   PIC X(13)  VALUE    '221514 013545'.
               05  FILLER   PIC X(13)  VALUE    '221515 013545'.
               05  FILLER   PIC X(13)  VALUE    '221516 013545'.
               05  FILLER   PIC X(13)  VALUE    '221517 013545'.
               05  FILLER   PIC X(13)  VALUE    '221518 013545'.
               05  FILLER   PIC X(13)  VALUE    '221520 013545'.
               05  FILLER   PIC X(13)  VALUE    '221521 013545'.
               05  FILLER   PIC X(13)  VALUE    '221522 013545'.
               05  FILLER   PIC X(13)  VALUE    '221524 012575'.
               05  FILLER   PIC X(13)  VALUE    '221525 013545'.
               05  FILLER   PIC X(13)  VALUE    '221526 013545'.
               05  FILLER   PIC X(13)  VALUE    '221527 013545'.
               05  FILLER   PIC X(13)  VALUE    '221529 012575'.
               05  FILLER   PIC X(13)  VALUE    '221531 013545'.
               05  FILLER   PIC X(13)  VALUE    '221532 013545'.
               05  FILLER   PIC X(13)  VALUE    '221535 013545'.
               05  FILLER   PIC X(13)  VALUE    '221536 013545'.
               05  FILLER   PIC X(13)  VALUE    '221537 013545'.
               05  FILLER   PIC X(13)  VALUE    '221542 013545'.
               05  FILLER   PIC X(13)  VALUE    '221544 013545'.
               05  FILLER   PIC X(13)  VALUE    '221545 013545'.
               05  FILLER   PIC X(13)  VALUE    '221548 013545'.
               05  FILLER   PIC X(13)  VALUE    '221549 013545'.
               05  FILLER   PIC X(13)  VALUE    '221553 013545'.
               05  FILLER   PIC X(13)  VALUE    '221554 013545'.
               05  FILLER   PIC X(13)  VALUE    '221555 013545'.
               05  FILLER   PIC X(13)  VALUE    '221556 013545'.
               05  FILLER   PIC X(13)  VALUE    '221557 012575'.
               05  FILLER   PIC X(13)  VALUE    '221559 013545'.
               05  FILLER   PIC X(13)  VALUE    '221560 012575'.
               05  FILLER   PIC X(13)  VALUE    '221561 013545'.
               05  FILLER   PIC X(13)  VALUE    '221562 013545'.
               05  FILLER   PIC X(13)  VALUE    '221563 013545'.
               05  FILLER   PIC X(13)  VALUE    '221564 013545'.
               05  FILLER   PIC X(13)  VALUE    '221565 012575'.
               05  FILLER   PIC X(13)  VALUE    '221566 013545'.
               05  FILLER   PIC X(13)  VALUE    '221567 013545'.
               05  FILLER   PIC X(13)  VALUE    '221568 013545'.
               05  FILLER   PIC X(13)  VALUE    '221569 012575'.
               05  FILLER   PIC X(13)  VALUE    '221570 013545'.
               05  FILLER   PIC X(13)  VALUE    '221571 013545'.
               05  FILLER   PIC X(13)  VALUE    '221572 013545'.
               05  FILLER   PIC X(13)  VALUE    '221573 013545'.
               05  FILLER   PIC X(13)  VALUE    '221574 013545'.
               05  FILLER   PIC X(13)  VALUE    '221575 012575'.
               05  FILLER   PIC X(13)  VALUE    '221576 013545'.
               05  FILLER   PIC X(13)  VALUE    '221577 012575'.
               05  FILLER   PIC X(13)  VALUE    '221578 013545'.
               05  FILLER   PIC X(13)  VALUE    '221579 013545'.
               05  FILLER   PIC X(13)  VALUE    '221580 012575'.
               05  FILLER   PIC X(13)  VALUE    '221581 013545'.
               05  FILLER   PIC X(13)  VALUE    '221582 013545'.
               05  FILLER   PIC X(13)  VALUE    '221583 013545'.
               05  FILLER   PIC X(13)  VALUE    '221584 013545'.
               05  FILLER   PIC X(13)  VALUE    '221586 013545'.
               05  FILLER   PIC X(13)  VALUE    '221587 013545'.
               05  FILLER   PIC X(13)  VALUE    '221588 013545'.
               05  FILLER   PIC X(13)  VALUE    '221589 012575'.
               05  FILLER   PIC X(13)  VALUE    '221590 012575'.
               05  FILLER   PIC X(13)  VALUE    '221591 013545'.
               05  FILLER   PIC X(13)  VALUE    '221592 013545'.
               05  FILLER   PIC X(13)  VALUE    '221593 013545'.
               05  FILLER   PIC X(13)  VALUE    '221594 013545'.
               05  FILLER   PIC X(13)  VALUE    '221595 012575'.
               05  FILLER   PIC X(13)  VALUE    '222000 013545'.
               05  FILLER   PIC X(13)  VALUE    '222002 013545'.
               05  FILLER   PIC X(13)  VALUE    '222003 013545'.
               05  FILLER   PIC X(13)  VALUE    '222006 013545'.
               05  FILLER   PIC X(13)  VALUE    '222007 013545'.
               05  FILLER   PIC X(13)  VALUE    '222023 013545'.
               05  FILLER   PIC X(13)  VALUE    '222027 013545'.
               05  FILLER   PIC X(13)  VALUE    '222043 013545'.
               05  FILLER   PIC X(13)  VALUE    '222046 013545'.
               05  FILLER   PIC X(13)  VALUE    '222047 013545'.
               05  FILLER   PIC X(13)  VALUE    '222048 013545'.
               05  FILLER   PIC X(13)  VALUE    '223026 013545'.
               05  FILLER   PIC X(13)  VALUE    '223027 013545'.
               05  FILLER   PIC X(13)  VALUE    '223029 013545'.
               05  FILLER   PIC X(13)  VALUE    '223030 013545'.
               05  FILLER   PIC X(13)  VALUE    '223032 013629'.
               05  FILLER   PIC X(13)  VALUE    '223034 013545'.
               05  FILLER   PIC X(13)  VALUE    '223300 013545'.
               05  FILLER   PIC X(13)  VALUE    '223302 013545'.
               05  FILLER   PIC X(13)  VALUE    '224001 013545'.
               05  FILLER   PIC X(13)  VALUE    '224007 013545'.
               05  FILLER   PIC X(13)  VALUE    '224013 013545'.
               05  FILLER   PIC X(13)  VALUE    '224018 013545'.
               05  FILLER   PIC X(13)  VALUE    '224021 013545'.
               05  FILLER   PIC X(13)  VALUE    '224022 013545'.
               05  FILLER   PIC X(13)  VALUE    '224023 013545'.
               05  FILLER   PIC X(13)  VALUE    '224028 013545'.
               05  FILLER   PIC X(13)  VALUE    '224031 013629'.
               05  FILLER   PIC X(13)  VALUE    '224032 013545'.
               05  FILLER   PIC X(13)  VALUE    '224039 013545'.
               05  FILLER   PIC X(13)  VALUE    '224040 013545'.
               05  FILLER   PIC X(13)  VALUE    '224044 013545'.
               05  FILLER   PIC X(13)  VALUE    '224505 013545'.
               05  FILLER   PIC X(13)  VALUE    '224506 013545'.
               05  FILLER   PIC X(13)  VALUE    '224507 013545'.
               05  FILLER   PIC X(13)  VALUE    '224508 013545'.
               05  FILLER   PIC X(13)  VALUE    '224606 013545'.
               05  FILLER   PIC X(13)  VALUE    '224615 013545'.
               05  FILLER   PIC X(13)  VALUE    '224616 013545'.
               05  FILLER   PIC X(13)  VALUE    '224617 013545'.
               05  FILLER   PIC X(13)  VALUE    '224625 013545'.
               05  FILLER   PIC X(13)  VALUE    '224626 013545'.
               05  FILLER   PIC X(13)  VALUE    '224627 013545'.
               05  FILLER   PIC X(13)  VALUE    '224629 013545'.
               05  FILLER   PIC X(13)  VALUE    '227001 013890'.
               05  FILLER   PIC X(13)  VALUE    '227002 013890'.
               05  FILLER   PIC X(13)  VALUE    '227003 012575'.
               05  FILLER   PIC X(13)  VALUE    '227005 013890'.
               05  FILLER   PIC X(13)  VALUE    '227009 012575'.
               05  FILLER   PIC X(13)  VALUE    '227023 013890'.
               05  FILLER   PIC X(13)  VALUE    '227053 013890'.
               05  FILLER   PIC X(13)  VALUE    '227057 013890'.
               05  FILLER   PIC X(13)  VALUE    '227061 013890'.
               05  FILLER   PIC X(13)  VALUE    '227063 010977'.
               05  FILLER   PIC X(13)  VALUE    '227064 013890'.
               05  FILLER   PIC X(13)  VALUE    '227072 013890'.
               05  FILLER   PIC X(13)  VALUE    '227076 013890'.
               05  FILLER   PIC X(13)  VALUE    '227132 012575'.
               05  FILLER   PIC X(13)  VALUE    '227162 012575'.
               05  FILLER   PIC X(13)  VALUE    '227179 012575'.
               05  FILLER   PIC X(13)  VALUE    '227206 013759'.
               05  FILLER   PIC X(13)  VALUE    '227263 013759'.
               05  FILLER   PIC X(13)  VALUE    '227280 013890'.
               05  FILLER   PIC X(13)  VALUE    '227281 013890'.
               05  FILLER   PIC X(13)  VALUE    '227283 013759'.
               05  FILLER   PIC X(13)  VALUE    '227301 011323'.
               05  FILLER   PIC X(13)  VALUE    '227407 013890'.
               05  FILLER   PIC X(13)  VALUE    '227420 013890'.
               05  FILLER   PIC X(13)  VALUE    '227442 013890'.
               05  FILLER   PIC X(13)  VALUE    '227443 013545'.
               05  FILLER   PIC X(13)  VALUE    '227446 013759'.
               05  FILLER   PIC X(13)  VALUE    '227452 013890'.
               05  FILLER   PIC X(13)  VALUE    '227456 012575'.
               05  FILLER   PIC X(13)  VALUE    '227465 012575'.
               05  FILLER   PIC X(13)  VALUE    '227467 013759'.
               05  FILLER   PIC X(13)  VALUE    '227470 012575'.
               05  FILLER   PIC X(13)  VALUE    '227471 013545'.
               05  FILLER   PIC X(13)  VALUE    '227473 013545'.
               05  FILLER   PIC X(13)  VALUE    '227474 013759'.
               05  FILLER   PIC X(13)  VALUE    '227475 013890'.
               05  FILLER   PIC X(13)  VALUE    '227476 013545'.
               05  FILLER   PIC X(13)  VALUE    '227479 013890'.
               05  FILLER   PIC X(13)  VALUE    '227483 013890'.
               05  FILLER   PIC X(13)  VALUE    '227485 013890'.
               05  FILLER   PIC X(13)  VALUE    '227489 013759'.
               05  FILLER   PIC X(13)  VALUE    '227491 012575'.
               05  FILLER   PIC X(13)  VALUE    '227495 013890'.
               05  FILLER   PIC X(13)  VALUE    '227496 013759'.
               05  FILLER   PIC X(13)  VALUE    '227497 013890'.
               05  FILLER   PIC X(13)  VALUE    '227500 013759'.
               05  FILLER   PIC X(13)  VALUE    '227501 013890'.
               05  FILLER   PIC X(13)  VALUE    '227503 013759'.
               05  FILLER   PIC X(13)  VALUE    '227505 013759'.
               05  FILLER   PIC X(13)  VALUE    '227506 013545'.
               05  FILLER   PIC X(13)  VALUE    '227507 013545'.
               05  FILLER   PIC X(13)  VALUE    '227508 013545'.
               05  FILLER   PIC X(13)  VALUE    '23S002 009258'.
               05  FILLER   PIC X(13)  VALUE    '23S013 009685'.
               05  FILLER   PIC X(13)  VALUE    '23S019 009685'.
               05  FILLER   PIC X(13)  VALUE    '23S021 008690'.
               05  FILLER   PIC X(13)  VALUE    '23S022 008440'.
               05  FILLER   PIC X(13)  VALUE    '23S024 009258'.
               05  FILLER   PIC X(13)  VALUE    '23S029 009685'.
               05  FILLER   PIC X(13)  VALUE    '23S030 008735'.
               05  FILLER   PIC X(13)  VALUE    '23S036 008469'.
               05  FILLER   PIC X(13)  VALUE    '23S037 008841'.
               05  FILLER   PIC X(13)  VALUE    '23S041 009593'.
               05  FILLER   PIC X(13)  VALUE    '23S042 008469'.
               05  FILLER   PIC X(13)  VALUE    '23S046 010129'.
               05  FILLER   PIC X(13)  VALUE    '23S047 009685'.
               05  FILLER   PIC X(13)  VALUE    '23S054 008469'.
               05  FILLER   PIC X(13)  VALUE    '23S059 008928'.
               05  FILLER   PIC X(13)  VALUE    '23S066 009409'.
               05  FILLER   PIC X(13)  VALUE    '23S070 008969'.
               05  FILLER   PIC X(13)  VALUE    '23S072 008928'.
               05  FILLER   PIC X(13)  VALUE    '23S075 009521'.
               05  FILLER   PIC X(13)  VALUE    '23S080 008469'.
               05  FILLER   PIC X(13)  VALUE    '23S092 010130'.
               05  FILLER   PIC X(13)  VALUE    '23S097 008469'.
               05  FILLER   PIC X(13)  VALUE    '23S099 008939'.
               05  FILLER   PIC X(13)  VALUE    '23S104 009289'.
               05  FILLER   PIC X(13)  VALUE    '23S105 008469'.
               05  FILLER   PIC X(13)  VALUE    '23S106 008928'.
               05  FILLER   PIC X(13)  VALUE    '23S110 008469'.
               05  FILLER   PIC X(13)  VALUE    '23S117 010015'.
               05  FILLER   PIC X(13)  VALUE    '23S119 009043'.
               05  FILLER   PIC X(13)  VALUE    '23S121 009573'.
               05  FILLER   PIC X(13)  VALUE    '23S130 009685'.
               05  FILLER   PIC X(13)  VALUE    '23S132 011019'.
               05  FILLER   PIC X(13)  VALUE    '23S135 009043'.
               05  FILLER   PIC X(13)  VALUE    '23S141 011019'.
               05  FILLER   PIC X(13)  VALUE    '23S146 009258'.
               05  FILLER   PIC X(13)  VALUE    '23S151 009685'.
               05  FILLER   PIC X(13)  VALUE    '23S156 010129'.
               05  FILLER   PIC X(13)  VALUE    '23S165 009258'.
               05  FILLER   PIC X(13)  VALUE    '23S167 010015'.
               05  FILLER   PIC X(13)  VALUE    '23S193 009976'.
               05  FILLER   PIC X(13)  VALUE    '23S195 009685'.
               05  FILLER   PIC X(13)  VALUE    '23S207 009685'.
               05  FILLER   PIC X(13)  VALUE    '23S208 009013'.
               05  FILLER   PIC X(13)  VALUE    '23S216 009685'.
               05  FILLER   PIC X(13)  VALUE    '23S222 009361'.
               05  FILLER   PIC X(13)  VALUE    '23S223 008469'.
               05  FILLER   PIC X(13)  VALUE    '23S230 010015'.
               05  FILLER   PIC X(13)  VALUE    '23S239 008469'.
               05  FILLER   PIC X(13)  VALUE    '23S254 009685'.
               05  FILLER   PIC X(13)  VALUE    '23S259 010129'.
               05  FILLER   PIC X(13)  VALUE    '23S270 009258'.
               05  FILLER   PIC X(13)  VALUE    '23S273 009258'.
               05  FILLER   PIC X(13)  VALUE    '23S275 008969'.
               05  FILLER   PIC X(13)  VALUE    '23S293 009043'.
               05  FILLER   PIC X(13)  VALUE    '23T002 009258'.
               05  FILLER   PIC X(13)  VALUE    '23T004 009409'.
               05  FILLER   PIC X(13)  VALUE    '23T013 009685'.
               05  FILLER   PIC X(13)  VALUE    '23T015 009025'.
               05  FILLER   PIC X(13)  VALUE    '23T019 009685'.
               05  FILLER   PIC X(13)  VALUE    '23T021 008690'.
               05  FILLER   PIC X(13)  VALUE    '23T024 009258'.
               05  FILLER   PIC X(13)  VALUE    '23T029 009685'.
               05  FILLER   PIC X(13)  VALUE    '23T030 008735'.
               05  FILLER   PIC X(13)  VALUE    '23T031 009685'.
               05  FILLER   PIC X(13)  VALUE    '23T036 008469'.
               05  FILLER   PIC X(13)  VALUE    '23T038 008928'.
               05  FILLER   PIC X(13)  VALUE    '23T041 009593'.
               05  FILLER   PIC X(13)  VALUE    '23T046 010129'.
               05  FILLER   PIC X(13)  VALUE    '23T047 009685'.
               05  FILLER   PIC X(13)  VALUE    '23T054 008469'.
               05  FILLER   PIC X(13)  VALUE    '23T066 009409'.
               05  FILLER   PIC X(13)  VALUE    '23T070 008969'.
               05  FILLER   PIC X(13)  VALUE    '23T078 008690'.
               05  FILLER   PIC X(13)  VALUE    '23T093 008703'.
               05  FILLER   PIC X(13)  VALUE    '23T097 008469'.
               05  FILLER   PIC X(13)  VALUE    '23T105 008469'.
               05  FILLER   PIC X(13)  VALUE    '23T117 010015'.
               05  FILLER   PIC X(13)  VALUE    '23T118 008417'.
               05  FILLER   PIC X(13)  VALUE    '23T119 009043'.
               05  FILLER   PIC X(13)  VALUE    '23T130 009685'.
               05  FILLER   PIC X(13)  VALUE    '23T132 011019'.
               05  FILLER   PIC X(13)  VALUE    '23T135 009043'.
               05  FILLER   PIC X(13)  VALUE    '23T141 011019'.
               05  FILLER   PIC X(13)  VALUE    '23T146 009258'.
               05  FILLER   PIC X(13)  VALUE    '23T151 009685'.
               05  FILLER   PIC X(13)  VALUE    '23T156 010129'.
               05  FILLER   PIC X(13)  VALUE    '23T165 009258'.
               05  FILLER   PIC X(13)  VALUE    '23T167 010015'.
               05  FILLER   PIC X(13)  VALUE    '23T190 010015'.
               05  FILLER   PIC X(13)  VALUE    '23T195 009685'.
               05  FILLER   PIC X(13)  VALUE    '23T197 011019'.
               05  FILLER   PIC X(13)  VALUE    '23T204 008469'.
               05  FILLER   PIC X(13)  VALUE    '23T207 009685'.
               05  FILLER   PIC X(13)  VALUE    '23T222 008969'.
               05  FILLER   PIC X(13)  VALUE    '23T230 010015'.
               05  FILLER   PIC X(13)  VALUE    '23T236 008928'.
               05  FILLER   PIC X(13)  VALUE    '23T244 009258'.
               05  FILLER   PIC X(13)  VALUE    '23T254 009685'.
               05  FILLER   PIC X(13)  VALUE    '23T257 008469'.
               05  FILLER   PIC X(13)  VALUE    '23T259 010129'.
               05  FILLER   PIC X(13)  VALUE    '23T269 009685'.
               05  FILLER   PIC X(13)  VALUE    '23T270 009258'.
               05  FILLER   PIC X(13)  VALUE    '23T275 008969'.
               05  FILLER   PIC X(13)  VALUE    '23T301 009685'.
               05  FILLER   PIC X(13)  VALUE    '230002 009258'.
               05  FILLER   PIC X(13)  VALUE    '230003 009099'.
               05  FILLER   PIC X(13)  VALUE    '230004 009409'.
               05  FILLER   PIC X(13)  VALUE    '230005 009481'.
               05  FILLER   PIC X(13)  VALUE    '230013 010072'.
               05  FILLER   PIC X(13)  VALUE    '230015 009025'.
               05  FILLER   PIC X(13)  VALUE    '230017 010015'.
               05  FILLER   PIC X(13)  VALUE    '230019 010072'.
               05  FILLER   PIC X(13)  VALUE    '230020 009481'.
               05  FILLER   PIC X(13)  VALUE    '230021 009560'.
               05  FILLER   PIC X(13)  VALUE    '230022 009708'.
               05  FILLER   PIC X(13)  VALUE    '230024 009534'.
               05  FILLER   PIC X(13)  VALUE    '230029 010072'.
               05  FILLER   PIC X(13)  VALUE    '230030 008928'.
               05  FILLER   PIC X(13)  VALUE    '230031 009685'.
               05  FILLER   PIC X(13)  VALUE    '230035 008928'.
               05  FILLER   PIC X(13)  VALUE    '230036 008469'.
               05  FILLER   PIC X(13)  VALUE    '230037 009481'.
               05  FILLER   PIC X(13)  VALUE    '230038 009099'.
               05  FILLER   PIC X(13)  VALUE    '230040 008469'.
               05  FILLER   PIC X(13)  VALUE    '230041 009593'.
               05  FILLER   PIC X(13)  VALUE    '230046 010129'.
               05  FILLER   PIC X(13)  VALUE    '230047 009685'.
               05  FILLER   PIC X(13)  VALUE    '230053 009534'.
               05  FILLER   PIC X(13)  VALUE    '230054 009081'.
               05  FILLER   PIC X(13)  VALUE    '230055 008469'.
               05  FILLER   PIC X(13)  VALUE    '230058 008469'.
               05  FILLER   PIC X(13)  VALUE    '230059 009099'.
               05  FILLER   PIC X(13)  VALUE    '230066 009409'.
               05  FILLER   PIC X(13)  VALUE    '230069 009685'.
               05  FILLER   PIC X(13)  VALUE    '230070 008969'.
               05  FILLER   PIC X(13)  VALUE    '230071 010072'.
               05  FILLER   PIC X(13)  VALUE    '230072 009099'.
               05  FILLER   PIC X(13)  VALUE    '230075 009708'.
               05  FILLER   PIC X(13)  VALUE    '230077 009534'.
               05  FILLER   PIC X(13)  VALUE    '230078 008469'.
               05  FILLER   PIC X(13)  VALUE    '230080 008469'.
               05  FILLER   PIC X(13)  VALUE    '230081 008469'.
               05  FILLER   PIC X(13)  VALUE    '230085 010015'.
               05  FILLER   PIC X(13)  VALUE    '230089 009258'.
               05  FILLER   PIC X(13)  VALUE    '230092 010130'.
               05  FILLER   PIC X(13)  VALUE    '230093 008703'.
               05  FILLER   PIC X(13)  VALUE    '230095 008469'.
               05  FILLER   PIC X(13)  VALUE    '230096 009025'.
               05  FILLER   PIC X(13)  VALUE    '230097 009086'.
               05  FILLER   PIC X(13)  VALUE    '230099 009481'.
               05  FILLER   PIC X(13)  VALUE    '230100 008469'.
               05  FILLER   PIC X(13)  VALUE    '230104 009534'.
               05  FILLER   PIC X(13)  VALUE    '230105 009593'.
               05  FILLER   PIC X(13)  VALUE    '230108 008469'.
               05  FILLER   PIC X(13)  VALUE    '230110 008469'.
               05  FILLER   PIC X(13)  VALUE    '230117 010015'.
               05  FILLER   PIC X(13)  VALUE    '230118 008469'.
               05  FILLER   PIC X(13)  VALUE    '230121 009708'.
               05  FILLER   PIC X(13)  VALUE    '230130 010072'.
               05  FILLER   PIC X(13)  VALUE    '230132 011019'.
               05  FILLER   PIC X(13)  VALUE    '230133 008469'.
               05  FILLER   PIC X(13)  VALUE    '230141 011019'.
               05  FILLER   PIC X(13)  VALUE    '230142 009258'.
               05  FILLER   PIC X(13)  VALUE    '230144 010129'.
               05  FILLER   PIC X(13)  VALUE    '230146 009534'.
               05  FILLER   PIC X(13)  VALUE    '230151 010072'.
               05  FILLER   PIC X(13)  VALUE    '230156 010129'.
               05  FILLER   PIC X(13)  VALUE    '230165 009534'.
               05  FILLER   PIC X(13)  VALUE    '230167 010015'.
               05  FILLER   PIC X(13)  VALUE    '230174 009099'.
               05  FILLER   PIC X(13)  VALUE    '230176 009258'.
               05  FILLER   PIC X(13)  VALUE    '230180 008469'.
               05  FILLER   PIC X(13)  VALUE    '230193 010072'.
               05  FILLER   PIC X(13)  VALUE    '230195 009685'.
               05  FILLER   PIC X(13)  VALUE    '230197 011019'.
               05  FILLER   PIC X(13)  VALUE    '230207 010072'.
               05  FILLER   PIC X(13)  VALUE    '230208 008928'.
               05  FILLER   PIC X(13)  VALUE    '230216 009685'.
               05  FILLER   PIC X(13)  VALUE    '230217 009521'.
               05  FILLER   PIC X(13)  VALUE    '230222 009361'.
               05  FILLER   PIC X(13)  VALUE    '230227 009685'.
               05  FILLER   PIC X(13)  VALUE    '230230 010015'.
               05  FILLER   PIC X(13)  VALUE    '230236 009099'.
               05  FILLER   PIC X(13)  VALUE    '230239 008469'.
               05  FILLER   PIC X(13)  VALUE    '230241 009685'.
               05  FILLER   PIC X(13)  VALUE    '230244 009258'.
               05  FILLER   PIC X(13)  VALUE    '230254 010072'.
               05  FILLER   PIC X(13)  VALUE    '230259 010129'.
               05  FILLER   PIC X(13)  VALUE    '230264 009685'.
               05  FILLER   PIC X(13)  VALUE    '230269 010072'.
               05  FILLER   PIC X(13)  VALUE    '230270 009258'.
               05  FILLER   PIC X(13)  VALUE    '230273 009258'.
               05  FILLER   PIC X(13)  VALUE    '230275 008969'.
               05  FILLER   PIC X(13)  VALUE    '230277 010072'.
               05  FILLER   PIC X(13)  VALUE    '230279 009685'.
               05  FILLER   PIC X(13)  VALUE    '230297 009258'.
               05  FILLER   PIC X(13)  VALUE    '230301 010072'.
               05  FILLER   PIC X(13)  VALUE    '230302 010072'.
               05  FILLER   PIC X(13)  VALUE    '230303 009099'.
               05  FILLER   PIC X(13)  VALUE    '230304 009685'.
               05  FILLER   PIC X(13)  VALUE    '231500 009502'.
               05  FILLER   PIC X(13)  VALUE    '231501 009043'.
               05  FILLER   PIC X(13)  VALUE    '231504 008469'.
               05  FILLER   PIC X(13)  VALUE    '231505 010015'.
               05  FILLER   PIC X(13)  VALUE    '231508 009409'.
               05  FILLER   PIC X(13)  VALUE    '231509 011019'.
               05  FILLER   PIC X(13)  VALUE    '231510 008928'.
               05  FILLER   PIC X(13)  VALUE    '231511 010129'.
               05  FILLER   PIC X(13)  VALUE    '231512 008469'.
               05  FILLER   PIC X(13)  VALUE    '231513 008469'.
               05  FILLER   PIC X(13)  VALUE    '231514 008469'.
               05  FILLER   PIC X(13)  VALUE    '231515 008469'.
               05  FILLER   PIC X(13)  VALUE    '231517 009685'.
               05  FILLER   PIC X(13)  VALUE    '231518 009685'.
               05  FILLER   PIC X(13)  VALUE    '231519 010015'.
               05  FILLER   PIC X(13)  VALUE    '231520 009043'.
               05  FILLER   PIC X(13)  VALUE    '231521 011019'.
               05  FILLER   PIC X(13)  VALUE    '231522 010015'.
               05  FILLER   PIC X(13)  VALUE    '231523 009847'.
               05  FILLER   PIC X(13)  VALUE    '231524 011019'.
               05  FILLER   PIC X(13)  VALUE    '231526 010129'.
               05  FILLER   PIC X(13)  VALUE    '231527 009043'.
               05  FILLER   PIC X(13)  VALUE    '231530 009685'.
               05  FILLER   PIC X(13)  VALUE    '231532 008469'.
               05  FILLER   PIC X(13)  VALUE    '231533 008469'.
               05  FILLER   PIC X(13)  VALUE    '231534 008928'.
               05  FILLER   PIC X(13)  VALUE    '231536 008469'.
               05  FILLER   PIC X(13)  VALUE    '231537 008469'.
               05  FILLER   PIC X(13)  VALUE    '231538 008469'.
               05  FILLER   PIC X(13)  VALUE    '231540 008469'.
               05  FILLER   PIC X(13)  VALUE    '231541 008469'.
               05  FILLER   PIC X(13)  VALUE    '231542 008469'.
               05  FILLER   PIC X(13)  VALUE    '231543 009685'.
               05  FILLER   PIC X(13)  VALUE    '231544 008928'.
               05  FILLER   PIC X(13)  VALUE    '231546 008928'.
               05  FILLER   PIC X(13)  VALUE    '231547 008469'.
               05  FILLER   PIC X(13)  VALUE    '231548 010015'.
               05  FILLER   PIC X(13)  VALUE    '231549 008469'.
               05  FILLER   PIC X(13)  VALUE    '231550 009593'.
               05  FILLER   PIC X(13)  VALUE    '231552 008469'.
               05  FILLER   PIC X(13)  VALUE    '231553 008469'.
               05  FILLER   PIC X(13)  VALUE    '231555 008469'.
               05  FILLER   PIC X(13)  VALUE    '231556 008469'.
               05  FILLER   PIC X(13)  VALUE    '231557 008469'.
               05  FILLER   PIC X(13)  VALUE    '231558 008469'.
               05  FILLER   PIC X(13)  VALUE    '231559 008469'.
               05  FILLER   PIC X(13)  VALUE    '231560 008469'.
               05  FILLER   PIC X(13)  VALUE    '231562 009685'.
               05  FILLER   PIC X(13)  VALUE    '231563 008469'.
               05  FILLER   PIC X(13)  VALUE    '231564 009685'.
               05  FILLER   PIC X(13)  VALUE    '231567 008469'.
               05  FILLER   PIC X(13)  VALUE    '231568 009043'.
               05  FILLER   PIC X(13)  VALUE    '231569 009685'.
               05  FILLER   PIC X(13)  VALUE    '231570 008928'.
               05  FILLER   PIC X(13)  VALUE    '231571 008469'.
               05  FILLER   PIC X(13)  VALUE    '231572 010129'.
               05  FILLER   PIC X(13)  VALUE    '231573 008469'.
               05  FILLER   PIC X(13)  VALUE    '231574 009685'.
               05  FILLER   PIC X(13)  VALUE    '231576 009685'.
               05  FILLER   PIC X(13)  VALUE    '231577 008469'.
               05  FILLER   PIC X(13)  VALUE    '231578 008469'.
               05  FILLER   PIC X(13)  VALUE    '231579 009685'.
               05  FILLER   PIC X(13)  VALUE    '231580 008469'.
               05  FILLER   PIC X(13)  VALUE    '231581 009847'.
               05  FILLER   PIC X(13)  VALUE    '231582 008928'.
               05  FILLER   PIC X(13)  VALUE    '231583 009685'.
               05  FILLER   PIC X(13)  VALUE    '231584 008469'.
               05  FILLER   PIC X(13)  VALUE    '231585 008469'.
               05  FILLER   PIC X(13)  VALUE    '231586 008469'.
               05  FILLER   PIC X(13)  VALUE    '231587 008969'.
               05  FILLER   PIC X(13)  VALUE    '231588 010015'.
               05  FILLER   PIC X(13)  VALUE    '231589 011019'.
               05  FILLER   PIC X(13)  VALUE    '231590 009409'.
               05  FILLER   PIC X(13)  VALUE    '231595 009685'.
               05  FILLER   PIC X(13)  VALUE    '231596 009593'.
               05  FILLER   PIC X(13)  VALUE    '231597 009685'.
               05  FILLER   PIC X(13)  VALUE    '231598 011019'.
               05  FILLER   PIC X(13)  VALUE    '231599 010015'.
               05  FILLER   PIC X(13)  VALUE    '231600 009043'.
               05  FILLER   PIC X(13)  VALUE    '231601 009685'.
               05  FILLER   PIC X(13)  VALUE    '231602 008469'.
               05  FILLER   PIC X(13)  VALUE    '231603 009685'.
               05  FILLER   PIC X(13)  VALUE    '231604 009043'.
               05  FILLER   PIC X(13)  VALUE    '231605 008469'.
               05  FILLER   PIC X(13)  VALUE    '231608 008969'.
               05  FILLER   PIC X(13)  VALUE    '231609 008469'.
               05  FILLER   PIC X(13)  VALUE    '231610 008928'.
               05  FILLER   PIC X(13)  VALUE    '231611 009685'.
               05  FILLER   PIC X(13)  VALUE    '231612 009502'.
               05  FILLER   PIC X(13)  VALUE    '231614 008469'.
               05  FILLER   PIC X(13)  VALUE    '231615 009685'.
               05  FILLER   PIC X(13)  VALUE    '231616 009043'.
               05  FILLER   PIC X(13)  VALUE    '231617 009685'.
               05  FILLER   PIC X(13)  VALUE    '231618 008469'.
               05  FILLER   PIC X(13)  VALUE    '231619 009685'.
               05  FILLER   PIC X(13)  VALUE    '231620 009685'.
               05  FILLER   PIC X(13)  VALUE    '231621 009685'.
               05  FILLER   PIC X(13)  VALUE    '231622 008469'.
               05  FILLER   PIC X(13)  VALUE    '231623 009685'.
               05  FILLER   PIC X(13)  VALUE    '231624 010129'.
               05  FILLER   PIC X(13)  VALUE    '231625 009685'.
               05  FILLER   PIC X(13)  VALUE    '231626 009685'.
               05  FILLER   PIC X(13)  VALUE    '231627 008928'.
               05  FILLER   PIC X(13)  VALUE    '232012 011019'.
               05  FILLER   PIC X(13)  VALUE    '232019 009258'.
               05  FILLER   PIC X(13)  VALUE    '232020 009593'.
               05  FILLER   PIC X(13)  VALUE    '232021 009409'.
               05  FILLER   PIC X(13)  VALUE    '232023 009685'.
               05  FILLER   PIC X(13)  VALUE    '232024 010129'.
               05  FILLER   PIC X(13)  VALUE    '232029 008928'.
               05  FILLER   PIC X(13)  VALUE    '232031 009258'.
               05  FILLER   PIC X(13)  VALUE    '232033 008969'.
               05  FILLER   PIC X(13)  VALUE    '232034 008469'.
               05  FILLER   PIC X(13)  VALUE    '232036 010130'.
               05  FILLER   PIC X(13)  VALUE    '233026 008928'.
               05  FILLER   PIC X(13)  VALUE    '233027 009258'.
               05  FILLER   PIC X(13)  VALUE    '233300 009258'.
               05  FILLER   PIC X(13)  VALUE    '234006 008928'.
               05  FILLER   PIC X(13)  VALUE    '234011 009685'.
               05  FILLER   PIC X(13)  VALUE    '234021 009685'.
               05  FILLER   PIC X(13)  VALUE    '234023 009685'.
               05  FILLER   PIC X(13)  VALUE    '234025 008469'.
               05  FILLER   PIC X(13)  VALUE    '234026 010015'.
               05  FILLER   PIC X(13)  VALUE    '234030 008928'.
               05  FILLER   PIC X(13)  VALUE    '234035 009258'.
               05  FILLER   PIC X(13)  VALUE    '234041 010129'.
               05  FILLER   PIC X(13)  VALUE    '234042 009685'.
               05  FILLER   PIC X(13)  VALUE    '234043 010015'.
               05  FILLER   PIC X(13)  VALUE    '234500 010129'.
               05  FILLER   PIC X(13)  VALUE    '234501 008469'.
               05  FILLER   PIC X(13)  VALUE    '234502 009685'.
               05  FILLER   PIC X(13)  VALUE    '234505 011019'.
               05  FILLER   PIC X(13)  VALUE    '234507 008469'.
               05  FILLER   PIC X(13)  VALUE    '234509 010129'.
               05  FILLER   PIC X(13)  VALUE    '234511 010015'.
               05  FILLER   PIC X(13)  VALUE    '234512 009043'.
               05  FILLER   PIC X(13)  VALUE    '234513 010171'.
               05  FILLER   PIC X(13)  VALUE    '234514 009471'.
               05  FILLER   PIC X(13)  VALUE    '234515 009471'.
               05  FILLER   PIC X(13)  VALUE    '234516 010253'.
               05  FILLER   PIC X(13)  VALUE    '234517 010015'.
               05  FILLER   PIC X(13)  VALUE    '234518 009471'.
               05  FILLER   PIC X(13)  VALUE    '234519 008469'.
               05  FILLER   PIC X(13)  VALUE    '234520 010262'.
               05  FILLER   PIC X(13)  VALUE    '234604 008959'.
               05  FILLER   PIC X(13)  VALUE    '234619 008928'.
               05  FILLER   PIC X(13)  VALUE    '234647 009685'.
               05  FILLER   PIC X(13)  VALUE    '234650 009043'.
               05  FILLER   PIC X(13)  VALUE    '234652 009685'.
               05  FILLER   PIC X(13)  VALUE    '237124 009685'.
               05  FILLER   PIC X(13)  VALUE    '237258 009685'.
               05  FILLER   PIC X(13)  VALUE    '237425 009685'.
               05  FILLER   PIC X(13)  VALUE    '237444 010015'.
               05  FILLER   PIC X(13)  VALUE    '237451 008469'.
               05  FILLER   PIC X(13)  VALUE    '237495 009685'.
               05  FILLER   PIC X(13)  VALUE    '237528 009685'.
               05  FILLER   PIC X(13)  VALUE    '237550 008469'.
               05  FILLER   PIC X(13)  VALUE    '237591 008469'.
               05  FILLER   PIC X(13)  VALUE    '237749 009685'.
               05  FILLER   PIC X(13)  VALUE    '237751 009685'.
               05  FILLER   PIC X(13)  VALUE    '237753 009685'.
               05  FILLER   PIC X(13)  VALUE    '237758 009685'.
               05  FILLER   PIC X(13)  VALUE    '237763 009685'.
               05  FILLER   PIC X(13)  VALUE    '237764 009043'.
               05  FILLER   PIC X(13)  VALUE    '237766 009043'.
               05  FILLER   PIC X(13)  VALUE    '237767 009685'.
               05  FILLER   PIC X(13)  VALUE    '237768 009043'.
               05  FILLER   PIC X(13)  VALUE    '237770 008469'.
               05  FILLER   PIC X(13)  VALUE    '237771 009685'.
               05  FILLER   PIC X(13)  VALUE    '237772 009685'.
               05  FILLER   PIC X(13)  VALUE    '237773 010129'.
               05  FILLER   PIC X(13)  VALUE    '237774 009685'.
               05  FILLER   PIC X(13)  VALUE    '237775 009685'.
               05  FILLER   PIC X(13)  VALUE    '237776 009043'.
               05  FILLER   PIC X(13)  VALUE    '237777 009685'.
               05  FILLER   PIC X(13)  VALUE    '237778 009043'.
               05  FILLER   PIC X(13)  VALUE    '237779 009685'.
               05  FILLER   PIC X(13)  VALUE    '237780 009043'.
               05  FILLER   PIC X(13)  VALUE    '237781 009685'.
               05  FILLER   PIC X(13)  VALUE    '237782 009043'.
               05  FILLER   PIC X(13)  VALUE    '237783 009043'.
               05  FILLER   PIC X(13)  VALUE    '237784 009685'.
               05  FILLER   PIC X(13)  VALUE    '237785 010129'.
               05  FILLER   PIC X(13)  VALUE    '237786 009685'.
               05  FILLER   PIC X(13)  VALUE    '237787 010129'.
               05  FILLER   PIC X(13)  VALUE    '237788 009685'.
               05  FILLER   PIC X(13)  VALUE    '237789 008928'.
               05  FILLER   PIC X(13)  VALUE    '237790 009685'.
               05  FILLER   PIC X(13)  VALUE    '237791 009043'.
               05  FILLER   PIC X(13)  VALUE    '237792 009043'.
               05  FILLER   PIC X(13)  VALUE    '237793 009685'.
               05  FILLER   PIC X(13)  VALUE    '237794 009685'.
               05  FILLER   PIC X(13)  VALUE    '237795 009685'.
               05  FILLER   PIC X(13)  VALUE    '237796 010129'.
               05  FILLER   PIC X(13)  VALUE    '237797 009685'.
               05  FILLER   PIC X(13)  VALUE    '237798 009685'.
               05  FILLER   PIC X(13)  VALUE    '237799 009685'.
               05  FILLER   PIC X(13)  VALUE    '237800 009043'.
               05  FILLER   PIC X(13)  VALUE    '239000 009043'.
               05  FILLER   PIC X(13)  VALUE    '239001 009043'.
               05  FILLER   PIC X(13)  VALUE    '239002 009043'.
               05  FILLER   PIC X(13)  VALUE    '239003 009043'.
               05  FILLER   PIC X(13)  VALUE    '239004 009043'.
               05  FILLER   PIC X(13)  VALUE    '239005 009685'.
               05  FILLER   PIC X(13)  VALUE    '239006 009685'.
               05  FILLER   PIC X(13)  VALUE    '239007 009685'.
               05  FILLER   PIC X(13)  VALUE    '239008 010129'.
               05  FILLER   PIC X(13)  VALUE    '239009 009685'.
               05  FILLER   PIC X(13)  VALUE    '239010 009043'.
               05  FILLER   PIC X(13)  VALUE    '239011 009043'.
               05  FILLER   PIC X(13)  VALUE    '239012 009043'.
               05  FILLER   PIC X(13)  VALUE    '239013 009043'.
               05  FILLER   PIC X(13)  VALUE    '239014 009685'.
               05  FILLER   PIC X(13)  VALUE    '239015 009043'.
               05  FILLER   PIC X(13)  VALUE    '239016 009685'.
               05  FILLER   PIC X(13)  VALUE    '239017 009685'.
               05  FILLER   PIC X(13)  VALUE    '239018 010528'.
               05  FILLER   PIC X(13)  VALUE    '239019 009685'.
               05  FILLER   PIC X(13)  VALUE    '239020 009043'.
               05  FILLER   PIC X(13)  VALUE    '239021 009685'.
               05  FILLER   PIC X(13)  VALUE    '239022 009685'.
               05  FILLER   PIC X(13)  VALUE    '239023 010129'.
               05  FILLER   PIC X(13)  VALUE    '239024 009685'.
               05  FILLER   PIC X(13)  VALUE    '239025 009685'.
               05  FILLER   PIC X(13)  VALUE    '239026 008969'.
               05  FILLER   PIC X(13)  VALUE    '239027 009685'.
               05  FILLER   PIC X(13)  VALUE    '239028 009043'.
               05  FILLER   PIC X(13)  VALUE    '239029 009685'.
               05  FILLER   PIC X(13)  VALUE    '239030 009685'.
               05  FILLER   PIC X(13)  VALUE    '239031 009685'.
               05  FILLER   PIC X(13)  VALUE    '239032 008469'.
               05  FILLER   PIC X(13)  VALUE    '239033 010129'.
               05  FILLER   PIC X(13)  VALUE    '239034 009685'.
               05  FILLER   PIC X(13)  VALUE    '239035 008469'.
               05  FILLER   PIC X(13)  VALUE    '239036 009685'.
               05  FILLER   PIC X(13)  VALUE    '239037 009043'.
               05  FILLER   PIC X(13)  VALUE    '239038 009685'.
               05  FILLER   PIC X(13)  VALUE    '239039 009685'.
               05  FILLER   PIC X(13)  VALUE    '239040 009685'.
               05  FILLER   PIC X(13)  VALUE    '239041 009685'.
               05  FILLER   PIC X(13)  VALUE    '239042 009043'.
               05  FILLER   PIC X(13)  VALUE    '239044 009685'.
               05  FILLER   PIC X(13)  VALUE    '239045 009685'.
               05  FILLER   PIC X(13)  VALUE    '239046 009043'.
               05  FILLER   PIC X(13)  VALUE    '239047 009043'.
               05  FILLER   PIC X(13)  VALUE    '239048 009685'.
               05  FILLER   PIC X(13)  VALUE    '239049 009043'.
               05  FILLER   PIC X(13)  VALUE    '239050 009685'.
               05  FILLER   PIC X(13)  VALUE    '239051 009685'.
               05  FILLER   PIC X(13)  VALUE    '239052 009685'.
               05  FILLER   PIC X(13)  VALUE    '239053 009043'.
               05  FILLER   PIC X(13)  VALUE    '239054 009043'.
               05  FILLER   PIC X(13)  VALUE    '239055 009043'.
               05  FILLER   PIC X(13)  VALUE    '239056 009685'.
               05  FILLER   PIC X(13)  VALUE    '239057 009685'.
               05  FILLER   PIC X(13)  VALUE    '239058 009685'.
               05  FILLER   PIC X(13)  VALUE    '239059 009685'.
               05  FILLER   PIC X(13)  VALUE    '239060 008928'.
               05  FILLER   PIC X(13)  VALUE    '239061 009043'.
               05  FILLER   PIC X(13)  VALUE    '239062 010129'.
               05  FILLER   PIC X(13)  VALUE    '239063 009043'.
               05  FILLER   PIC X(13)  VALUE    '239064 009685'.
               05  FILLER   PIC X(13)  VALUE    '239065 009685'.
               05  FILLER   PIC X(13)  VALUE    '239066 009685'.
               05  FILLER   PIC X(13)  VALUE    '239067 009685'.
               05  FILLER   PIC X(13)  VALUE    '239068 009685'.
               05  FILLER   PIC X(13)  VALUE    '239069 008928'.
               05  FILLER   PIC X(13)  VALUE    '239070 009043'.
               05  FILLER   PIC X(13)  VALUE    '239071 009043'.
               05  FILLER   PIC X(13)  VALUE    '239072 009043'.
               05  FILLER   PIC X(13)  VALUE    '239073 009043'.
               05  FILLER   PIC X(13)  VALUE    '239074 009685'.
               05  FILLER   PIC X(13)  VALUE    '239075 009685'.
               05  FILLER   PIC X(13)  VALUE    '239076 009685'.
               05  FILLER   PIC X(13)  VALUE    '239077 008969'.
               05  FILLER   PIC X(13)  VALUE    '239078 009685'.
               05  FILLER   PIC X(13)  VALUE    '239079 009685'.
               05  FILLER   PIC X(13)  VALUE    '239080 009685'.
               05  FILLER   PIC X(13)  VALUE    '239081 009685'.
               05  FILLER   PIC X(13)  VALUE    '239082 009685'.
               05  FILLER   PIC X(13)  VALUE    '239083 009685'.
               05  FILLER   PIC X(13)  VALUE    '239084 008969'.
               05  FILLER   PIC X(13)  VALUE    '239085 009685'.
               05  FILLER   PIC X(13)  VALUE    '239086 009685'.
               05  FILLER   PIC X(13)  VALUE    '239087 009685'.
               05  FILLER   PIC X(13)  VALUE    '239088 009685'.
               05  FILLER   PIC X(13)  VALUE    '239089 009685'.
               05  FILLER   PIC X(13)  VALUE    '239090 009685'.
               05  FILLER   PIC X(13)  VALUE    '239091 009685'.
               05  FILLER   PIC X(13)  VALUE    '239092 009043'.
               05  FILLER   PIC X(13)  VALUE    '239093 009043'.
               05  FILLER   PIC X(13)  VALUE    '239094 009685'.
               05  FILLER   PIC X(13)  VALUE    '239095 009685'.
               05  FILLER   PIC X(13)  VALUE    '239096 009043'.
               05  FILLER   PIC X(13)  VALUE    '239097 009685'.
               05  FILLER   PIC X(13)  VALUE    '239098 009043'.
               05  FILLER   PIC X(13)  VALUE    '239099 009685'.
               05  FILLER   PIC X(13)  VALUE    '239100 009409'.
               05  FILLER   PIC X(13)  VALUE    '239101 009043'.
               05  FILLER   PIC X(13)  VALUE    '239102 009685'.
               05  FILLER   PIC X(13)  VALUE    '239103 010129'.
               05  FILLER   PIC X(13)  VALUE    '239104 009685'.
               05  FILLER   PIC X(13)  VALUE    '239105 009685'.
               05  FILLER   PIC X(13)  VALUE    '239106 010129'.
               05  FILLER   PIC X(13)  VALUE    '239107 009685'.
               05  FILLER   PIC X(13)  VALUE    '239108 009043'.
               05  FILLER   PIC X(13)  VALUE    '239109 009043'.
               05  FILLER   PIC X(13)  VALUE    '239111 008928'.
               05  FILLER   PIC X(13)  VALUE    '239112 009043'.
               05  FILLER   PIC X(13)  VALUE    '239113 009685'.
               05  FILLER   PIC X(13)  VALUE    '239114 008969'.
               05  FILLER   PIC X(13)  VALUE    '239115 011019'.
               05  FILLER   PIC X(13)  VALUE    '239116 009685'.
               05  FILLER   PIC X(13)  VALUE    '239117 009043'.
               05  FILLER   PIC X(13)  VALUE    '239118 010054'.
               05  FILLER   PIC X(13)  VALUE    '239119 009685'.
               05  FILLER   PIC X(13)  VALUE    '239120 009685'.
               05  FILLER   PIC X(13)  VALUE    '239121 009685'.
               05  FILLER   PIC X(13)  VALUE    '239122 009685'.
               05  FILLER   PIC X(13)  VALUE    '239123 009685'.
               05  FILLER   PIC X(13)  VALUE    '239124 008469'.
               05  FILLER   PIC X(13)  VALUE    '239125 009685'.
               05  FILLER   PIC X(13)  VALUE    '239126 009685'.
               05  FILLER   PIC X(13)  VALUE    '239127 009685'.
               05  FILLER   PIC X(13)  VALUE    '239128 009685'.
               05  FILLER   PIC X(13)  VALUE    '239129 009685'.
               05  FILLER   PIC X(13)  VALUE    '239130 009043'.
               05  FILLER   PIC X(13)  VALUE    '239131 009685'.
               05  FILLER   PIC X(13)  VALUE    '239132 009043'.
               05  FILLER   PIC X(13)  VALUE    '239133 009043'.
               05  FILLER   PIC X(13)  VALUE    '239134 009685'.
               05  FILLER   PIC X(13)  VALUE    '239135 009685'.
               05  FILLER   PIC X(13)  VALUE    '239136 010129'.
               05  FILLER   PIC X(13)  VALUE    '239137 009685'.
               05  FILLER   PIC X(13)  VALUE    '239138 009043'.
               05  FILLER   PIC X(13)  VALUE    '239139 009685'.
               05  FILLER   PIC X(13)  VALUE    '239140 009685'.
               05  FILLER   PIC X(13)  VALUE    '239141 009685'.
               05  FILLER   PIC X(13)  VALUE    '239142 009043'.
               05  FILLER   PIC X(13)  VALUE    '239143 009685'.
               05  FILLER   PIC X(13)  VALUE    '239144 009685'.
               05  FILLER   PIC X(13)  VALUE    '239145 009043'.
               05  FILLER   PIC X(13)  VALUE    '239146 011019'.
               05  FILLER   PIC X(13)  VALUE    '239147 009043'.
               05  FILLER   PIC X(13)  VALUE    '239148 009685'.
               05  FILLER   PIC X(13)  VALUE    '239149 009685'.
               05  FILLER   PIC X(13)  VALUE    '239150 009685'.
               05  FILLER   PIC X(13)  VALUE    '239151 008469'.
               05  FILLER   PIC X(13)  VALUE    '239152 009685'.
               05  FILLER   PIC X(13)  VALUE    '239153 010015'.
               05  FILLER   PIC X(13)  VALUE    '239154 009685'.
               05  FILLER   PIC X(13)  VALUE    '239155 009043'.
               05  FILLER   PIC X(13)  VALUE    '239156 009685'.
               05  FILLER   PIC X(13)  VALUE    '239157 009043'.
               05  FILLER   PIC X(13)  VALUE    '239158 009685'.
               05  FILLER   PIC X(13)  VALUE    '239159 008469'.
               05  FILLER   PIC X(13)  VALUE    '239160 009043'.
               05  FILLER   PIC X(13)  VALUE    '239161 009043'.
               05  FILLER   PIC X(13)  VALUE    '239162 009685'.
               05  FILLER   PIC X(13)  VALUE    '239163 009043'.
               05  FILLER   PIC X(13)  VALUE    '239164 009685'.
               05  FILLER   PIC X(13)  VALUE    '239165 009685'.
               05  FILLER   PIC X(13)  VALUE    '239166 009685'.
               05  FILLER   PIC X(13)  VALUE    '239167 009685'.
               05  FILLER   PIC X(13)  VALUE    '239168 009685'.
               05  FILLER   PIC X(13)  VALUE    '239169 009685'.
               05  FILLER   PIC X(13)  VALUE    '239170 009685'.
               05  FILLER   PIC X(13)  VALUE    '239171 009043'.
               05  FILLER   PIC X(13)  VALUE    '239172 009043'.
               05  FILLER   PIC X(13)  VALUE    '239173 009685'.
               05  FILLER   PIC X(13)  VALUE    '239175 010129'.
               05  FILLER   PIC X(13)  VALUE    '239176 009685'.
               05  FILLER   PIC X(13)  VALUE    '239177 009043'.
               05  FILLER   PIC X(13)  VALUE    '239178 009685'.
               05  FILLER   PIC X(13)  VALUE    '239179 009043'.
               05  FILLER   PIC X(13)  VALUE    '239180 009685'.
               05  FILLER   PIC X(13)  VALUE    '239181 009685'.
               05  FILLER   PIC X(13)  VALUE    '239182 009043'.
               05  FILLER   PIC X(13)  VALUE    '239183 009685'.
               05  FILLER   PIC X(13)  VALUE    '239184 008928'.
               05  FILLER   PIC X(13)  VALUE    '239187 009685'.
               05  FILLER   PIC X(13)  VALUE    '239188 009685'.
               05  FILLER   PIC X(13)  VALUE    '239189 009043'.
               05  FILLER   PIC X(13)  VALUE    '239190 009685'.
               05  FILLER   PIC X(13)  VALUE    '239191 009685'.
               05  FILLER   PIC X(13)  VALUE    '239192 010129'.
               05  FILLER   PIC X(13)  VALUE    '239193 009685'.
               05  FILLER   PIC X(13)  VALUE    '239194 009685'.
               05  FILLER   PIC X(13)  VALUE    '239195 009685'.
               05  FILLER   PIC X(13)  VALUE    '239196 009685'.
               05  FILLER   PIC X(13)  VALUE    '239198 008469'.
               05  FILLER   PIC X(13)  VALUE    '239199 009685'.
               05  FILLER   PIC X(13)  VALUE    '239200 009043'.
               05  FILLER   PIC X(13)  VALUE    '239201 008469'.
               05  FILLER   PIC X(13)  VALUE    '239202 009043'.
               05  FILLER   PIC X(13)  VALUE    '239203 009685'.
               05  FILLER   PIC X(13)  VALUE    '239205 009043'.
               05  FILLER   PIC X(13)  VALUE    '239206 009043'.
               05  FILLER   PIC X(13)  VALUE    '239207 009043'.
               05  FILLER   PIC X(13)  VALUE    '239208 009685'.
               05  FILLER   PIC X(13)  VALUE    '239209 009043'.
               05  FILLER   PIC X(13)  VALUE    '239210 009043'.
               05  FILLER   PIC X(13)  VALUE    '239211 009043'.
               05  FILLER   PIC X(13)  VALUE    '239212 009685'.
               05  FILLER   PIC X(13)  VALUE    '239213 009847'.
               05  FILLER   PIC X(13)  VALUE    '239214 009043'.
               05  FILLER   PIC X(13)  VALUE    '239215 009685'.
               05  FILLER   PIC X(13)  VALUE    '239216 009685'.
               05  FILLER   PIC X(13)  VALUE    '239217 009685'.
               05  FILLER   PIC X(13)  VALUE    '239218 009685'.
               05  FILLER   PIC X(13)  VALUE    '239220 009043'.
               05  FILLER   PIC X(13)  VALUE    '239221 009685'.
               05  FILLER   PIC X(13)  VALUE    '239222 008928'.
               05  FILLER   PIC X(13)  VALUE    '239223 009043'.
               05  FILLER   PIC X(13)  VALUE    '239224 009685'.
               05  FILLER   PIC X(13)  VALUE    '239225 009043'.
               05  FILLER   PIC X(13)  VALUE    '239226 009685'.
               05  FILLER   PIC X(13)  VALUE    '239227 009043'.
               05  FILLER   PIC X(13)  VALUE    '239228 008469'.
               05  FILLER   PIC X(13)  VALUE    '239230 009685'.
               05  FILLER   PIC X(13)  VALUE    '239244 009043'.
               05  FILLER   PIC X(13)  VALUE    '24S001 011038'.
               05  FILLER   PIC X(13)  VALUE    '24S004 011038'.
               05  FILLER   PIC X(13)  VALUE    '24S010 010691'.
               05  FILLER   PIC X(13)  VALUE    '24S038 011038'.
               05  FILLER   PIC X(13)  VALUE    '24S052 009013'.
               05  FILLER   PIC X(13)  VALUE    '24S059 011038'.
               05  FILLER   PIC X(13)  VALUE    '24S063 011038'.
               05  FILLER   PIC X(13)  VALUE    '24S069 009536'.
               05  FILLER   PIC X(13)  VALUE    '24S115 011038'.
               05  FILLER   PIC X(13)  VALUE    '24T001 011038'.
               05  FILLER   PIC X(13)  VALUE    '24T004 011038'.
               05  FILLER   PIC X(13)  VALUE    '24T010 010691'.
               05  FILLER   PIC X(13)  VALUE    '24T019 009910'.
               05  FILLER   PIC X(13)  VALUE    '24T036 010054'.
               05  FILLER   PIC X(13)  VALUE    '24T038 011038'.
               05  FILLER   PIC X(13)  VALUE    '24T043 009013'.
               05  FILLER   PIC X(13)  VALUE    '24T047 009910'.
               05  FILLER   PIC X(13)  VALUE    '24T057 011038'.
               05  FILLER   PIC X(13)  VALUE    '24T080 011038'.
               05  FILLER   PIC X(13)  VALUE    '24T084 009910'.
               05  FILLER   PIC X(13)  VALUE    '24T100 009013'.
               05  FILLER   PIC X(13)  VALUE    '24T106 011038'.
               05  FILLER   PIC X(13)  VALUE    '24U014 011038'.
               05  FILLER   PIC X(13)  VALUE    '24U044 009013'.
               05  FILLER   PIC X(13)  VALUE    '24U059 011038'.
               05  FILLER   PIC X(13)  VALUE    '24U101 009013'.
               05  FILLER   PIC X(13)  VALUE    '24U166 009013'.
               05  FILLER   PIC X(13)  VALUE    '240001 011038'.
               05  FILLER   PIC X(13)  VALUE    '240002 009910'.
               05  FILLER   PIC X(13)  VALUE    '240004 011038'.
               05  FILLER   PIC X(13)  VALUE    '240006 010691'.
               05  FILLER   PIC X(13)  VALUE    '240010 010691'.
               05  FILLER   PIC X(13)  VALUE    '240014 011038'.
               05  FILLER   PIC X(13)  VALUE    '240018 010770'.
               05  FILLER   PIC X(13)  VALUE    '240019 009910'.
               05  FILLER   PIC X(13)  VALUE    '240020 011038'.
               05  FILLER   PIC X(13)  VALUE    '240022 009013'.
               05  FILLER   PIC X(13)  VALUE    '240030 009013'.
               05  FILLER   PIC X(13)  VALUE    '240036 010770'.
               05  FILLER   PIC X(13)  VALUE    '240038 011038'.
               05  FILLER   PIC X(13)  VALUE    '240040 009910'.
               05  FILLER   PIC X(13)  VALUE    '240043 009013'.
               05  FILLER   PIC X(13)  VALUE    '240044 009082'.
               05  FILLER   PIC X(13)  VALUE    '240047 010770'.
               05  FILLER   PIC X(13)  VALUE    '240050 011038'.
               05  FILLER   PIC X(13)  VALUE    '240052 009013'.
               05  FILLER   PIC X(13)  VALUE    '240053 011038'.
               05  FILLER   PIC X(13)  VALUE    '240056 011038'.
               05  FILLER   PIC X(13)  VALUE    '240057 011038'.
               05  FILLER   PIC X(13)  VALUE    '240059 011038'.
               05  FILLER   PIC X(13)  VALUE    '240063 011038'.
               05  FILLER   PIC X(13)  VALUE    '240064 009179'.
               05  FILLER   PIC X(13)  VALUE    '240066 011038'.
               05  FILLER   PIC X(13)  VALUE    '240069 010770'.
               05  FILLER   PIC X(13)  VALUE    '240071 010480'.
               05  FILLER   PIC X(13)  VALUE    '240075 010770'.
               05  FILLER   PIC X(13)  VALUE    '240076 011038'.
               05  FILLER   PIC X(13)  VALUE    '240078 011038'.
               05  FILLER   PIC X(13)  VALUE    '240080 011038'.
               05  FILLER   PIC X(13)  VALUE    '240084 009910'.
               05  FILLER   PIC X(13)  VALUE    '240088 010054'.
               05  FILLER   PIC X(13)  VALUE    '240093 010770'.
               05  FILLER   PIC X(13)  VALUE    '240100 009013'.
               05  FILLER   PIC X(13)  VALUE    '240101 009200'.
               05  FILLER   PIC X(13)  VALUE    '240104 011038'.
               05  FILLER   PIC X(13)  VALUE    '240106 011038'.
               05  FILLER   PIC X(13)  VALUE    '240115 011038'.
               05  FILLER   PIC X(13)  VALUE    '240132 011038'.
               05  FILLER   PIC X(13)  VALUE    '240141 011038'.
               05  FILLER   PIC X(13)  VALUE    '240166 009013'.
               05  FILLER   PIC X(13)  VALUE    '240187 010770'.
               05  FILLER   PIC X(13)  VALUE    '240196 011038'.
               05  FILLER   PIC X(13)  VALUE    '240206 014448'.
               05  FILLER   PIC X(13)  VALUE    '240207 011038'.
               05  FILLER   PIC X(13)  VALUE    '240210 011038'.
               05  FILLER   PIC X(13)  VALUE    '240213 011038'.
               05  FILLER   PIC X(13)  VALUE    '240214 011038'.
               05  FILLER   PIC X(13)  VALUE    '241500 010054'.
               05  FILLER   PIC X(13)  VALUE    '241502 009013'.
               05  FILLER   PIC X(13)  VALUE    '241503 009013'.
               05  FILLER   PIC X(13)  VALUE    '241504 011038'.
               05  FILLER   PIC X(13)  VALUE    '241506 011038'.
               05  FILLER   PIC X(13)  VALUE    '241507 009013'.
               05  FILLER   PIC X(13)  VALUE    '241509 009013'.
               05  FILLER   PIC X(13)  VALUE    '241510 009013'.
               05  FILLER   PIC X(13)  VALUE    '241511 009013'.
               05  FILLER   PIC X(13)  VALUE    '241512 011038'.
               05  FILLER   PIC X(13)  VALUE    '241513 011038'.
               05  FILLER   PIC X(13)  VALUE    '241514 011038'.
               05  FILLER   PIC X(13)  VALUE    '241517 009013'.
               05  FILLER   PIC X(13)  VALUE    '241519 010691'.
               05  FILLER   PIC X(13)  VALUE    '241520 011038'.
               05  FILLER   PIC X(13)  VALUE    '241521 009910'.
               05  FILLER   PIC X(13)  VALUE    '241522 010054'.
               05  FILLER   PIC X(13)  VALUE    '241523 009013'.
               05  FILLER   PIC X(13)  VALUE    '241524 009910'.
               05  FILLER   PIC X(13)  VALUE    '241525 011038'.
               05  FILLER   PIC X(13)  VALUE    '241528 009013'.
               05  FILLER   PIC X(13)  VALUE    '241532 009013'.
               05  FILLER   PIC X(13)  VALUE    '241534 009013'.
               05  FILLER   PIC X(13)  VALUE    '241535 009013'.
               05  FILLER   PIC X(13)  VALUE    '241537 009013'.
               05  FILLER   PIC X(13)  VALUE    '241538 009013'.
               05  FILLER   PIC X(13)  VALUE    '241539 009013'.
               05  FILLER   PIC X(13)  VALUE    '241540 009013'.
               05  FILLER   PIC X(13)  VALUE    '241542 009013'.
               05  FILLER   PIC X(13)  VALUE    '241543 009013'.
               05  FILLER   PIC X(13)  VALUE    '241544 009013'.
               05  FILLER   PIC X(13)  VALUE    '241545 010691'.
               05  FILLER   PIC X(13)  VALUE    '241546 009013'.
               05  FILLER   PIC X(13)  VALUE    '241547 009013'.
               05  FILLER   PIC X(13)  VALUE    '241548 009013'.
               05  FILLER   PIC X(13)  VALUE    '241549 009013'.
               05  FILLER   PIC X(13)  VALUE    '241552 011038'.
               05  FILLER   PIC X(13)  VALUE    '241553 009013'.
               05  FILLER   PIC X(13)  VALUE    '241554 011038'.
               05  FILLER   PIC X(13)  VALUE    '241557 009013'.
               05  FILLER   PIC X(13)  VALUE    '241559 009013'.
               05  FILLER   PIC X(13)  VALUE    '241563 009013'.
               05  FILLER   PIC X(13)  VALUE    '241564 009013'.
               05  FILLER   PIC X(13)  VALUE    '241566 009013'.
               05  FILLER   PIC X(13)  VALUE    '241567 011038'.
               05  FILLER   PIC X(13)  VALUE    '241570 009013'.
               05  FILLER   PIC X(13)  VALUE    '241573 011038'.
               05  FILLER   PIC X(13)  VALUE    '241574 009910'.
               05  FILLER   PIC X(13)  VALUE    '241575 010054'.
               05  FILLER   PIC X(13)  VALUE    '241577 009013'.
               05  FILLER   PIC X(13)  VALUE    '241578 011038'.
               05  FILLER   PIC X(13)  VALUE    '241579 010691'.
               05  FILLER   PIC X(13)  VALUE    '241580 009013'.
               05  FILLER   PIC X(13)  VALUE    '241581 009013'.
               05  FILLER   PIC X(13)  VALUE    '241582 011038'.
               05  FILLER   PIC X(13)  VALUE    '241583 009013'.
               05  FILLER   PIC X(13)  VALUE    '241585 011038'.
               05  FILLER   PIC X(13)  VALUE    '241586 011038'.
               05  FILLER   PIC X(13)  VALUE    '241587 011038'.
               05  FILLER   PIC X(13)  VALUE    '241588 009013'.
               05  FILLER   PIC X(13)  VALUE    '241589 011038'.
               05  FILLER   PIC X(13)  VALUE    '241590 011038'.
               05  FILLER   PIC X(13)  VALUE    '241591 009013'.
               05  FILLER   PIC X(13)  VALUE    '241592 009013'.
               05  FILLER   PIC X(13)  VALUE    '242004 011038'.
               05  FILLER   PIC X(13)  VALUE    '242005 011038'.
               05  FILLER   PIC X(13)  VALUE    '243300 011038'.
               05  FILLER   PIC X(13)  VALUE    '243302 011038'.
               05  FILLER   PIC X(13)  VALUE    '244018 009013'.
               05  FILLER   PIC X(13)  VALUE    '244500 011038'.
               05  FILLER   PIC X(13)  VALUE    '244501 009910'.
               05  FILLER   PIC X(13)  VALUE    '244503 009013'.
               05  FILLER   PIC X(13)  VALUE    '244505 011038'.
               05  FILLER   PIC X(13)  VALUE    '244507 011038'.
               05  FILLER   PIC X(13)  VALUE    '244508 011038'.
               05  FILLER   PIC X(13)  VALUE    '244509 009013'.
               05  FILLER   PIC X(13)  VALUE    '244510 011038'.
               05  FILLER   PIC X(13)  VALUE    '244512 009013'.
               05  FILLER   PIC X(13)  VALUE    '244513 011038'.
               05  FILLER   PIC X(13)  VALUE    '244514 009013'.
               05  FILLER   PIC X(13)  VALUE    '244608 009013'.
               05  FILLER   PIC X(13)  VALUE    '244619 011038'.
               05  FILLER   PIC X(13)  VALUE    '247049 009013'.
               05  FILLER   PIC X(13)  VALUE    '247124 009685'.
               05  FILLER   PIC X(13)  VALUE    '247160 009013'.
               05  FILLER   PIC X(13)  VALUE    '247185 011038'.
               05  FILLER   PIC X(13)  VALUE    '247217 011038'.
               05  FILLER   PIC X(13)  VALUE    '247250 011038'.
               05  FILLER   PIC X(13)  VALUE    '247256 010054'.
               05  FILLER   PIC X(13)  VALUE    '248052 009013'.
               05  FILLER   PIC X(13)  VALUE    '248059 010691'.
               05  FILLER   PIC X(13)  VALUE    '248087 011038'.
               05  FILLER   PIC X(13)  VALUE    '248096 009013'.
               05  FILLER   PIC X(13)  VALUE    '248103 011038'.
               05  FILLER   PIC X(13)  VALUE    '248105 011038'.
               05  FILLER   PIC X(13)  VALUE    '248106 011038'.
               05  FILLER   PIC X(13)  VALUE    '248107 011038'.
               05  FILLER   PIC X(13)  VALUE    '248108 010691'.
               05  FILLER   PIC X(13)  VALUE    '248109 009910'.
               05  FILLER   PIC X(13)  VALUE    '248110 010054'.
               05  FILLER   PIC X(13)  VALUE    '248111 010691'.
               05  FILLER   PIC X(13)  VALUE    '248112 009013'.
               05  FILLER   PIC X(13)  VALUE    '248113 011038'.
               05  FILLER   PIC X(13)  VALUE    '248114 011038'.
               05  FILLER   PIC X(13)  VALUE    '248115 011038'.
               05  FILLER   PIC X(13)  VALUE    '248116 011038'.
               05  FILLER   PIC X(13)  VALUE    '248117 011038'.
               05  FILLER   PIC X(13)  VALUE    '248118 011038'.
               05  FILLER   PIC X(13)  VALUE    '248119 011038'.
               05  FILLER   PIC X(13)  VALUE    '248120 011038'.
               05  FILLER   PIC X(13)  VALUE    '248121 011038'.
               05  FILLER   PIC X(13)  VALUE    '25S004 007197'.
               05  FILLER   PIC X(13)  VALUE    '25S007 007902'.
               05  FILLER   PIC X(13)  VALUE    '25S009 007197'.
               05  FILLER   PIC X(13)  VALUE    '25S012 008713'.
               05  FILLER   PIC X(13)  VALUE    '25S017 007197'.
               05  FILLER   PIC X(13)  VALUE    '25S027 007197'.
               05  FILLER   PIC X(13)  VALUE    '25S031 007197'.
               05  FILLER   PIC X(13)  VALUE    '25S036 007197'.
               05  FILLER   PIC X(13)  VALUE    '25S040 007902'.
               05  FILLER   PIC X(13)  VALUE    '25S043 007197'.
               05  FILLER   PIC X(13)  VALUE    '25S044 007197'.
               05  FILLER   PIC X(13)  VALUE    '25S048 008117'.
               05  FILLER   PIC X(13)  VALUE    '25S049 007197'.
               05  FILLER   PIC X(13)  VALUE    '25S060 007197'.
               05  FILLER   PIC X(13)  VALUE    '25S072 008117'.
               05  FILLER   PIC X(13)  VALUE    '25S079 007197'.
               05  FILLER   PIC X(13)  VALUE    '25S081 007197'.
               05  FILLER   PIC X(13)  VALUE    '25S082 007197'.
               05  FILLER   PIC X(13)  VALUE    '25S084 007197'.
               05  FILLER   PIC X(13)  VALUE    '25S093 007197'.
               05  FILLER   PIC X(13)  VALUE    '25S094 007734'.
               05  FILLER   PIC X(13)  VALUE    '25S096 008117'.
               05  FILLER   PIC X(13)  VALUE    '25S100 007197'.
               05  FILLER   PIC X(13)  VALUE    '25S102 008117'.
               05  FILLER   PIC X(13)  VALUE    '25S120 007197'.
               05  FILLER   PIC X(13)  VALUE    '25S123 007902'.
               05  FILLER   PIC X(13)  VALUE    '25S125 007902'.
               05  FILLER   PIC X(13)  VALUE    '25S126 008713'.
               05  FILLER   PIC X(13)  VALUE    '25S128 007327'.
               05  FILLER   PIC X(13)  VALUE    '25S134 008117'.
               05  FILLER   PIC X(13)  VALUE    '25S151 007197'.
               05  FILLER   PIC X(13)  VALUE    '25S163 007318'.
               05  FILLER   PIC X(13)  VALUE    '25T001 008117'.
               05  FILLER   PIC X(13)  VALUE    '25T004 007197'.
               05  FILLER   PIC X(13)  VALUE    '25T034 007197'.
               05  FILLER   PIC X(13)  VALUE    '25T040 007902'.
               05  FILLER   PIC X(13)  VALUE    '25T042 007197'.
               05  FILLER   PIC X(13)  VALUE    '25T078 007734'.
               05  FILLER   PIC X(13)  VALUE    '25T081 007197'.
               05  FILLER   PIC X(13)  VALUE    '25T082 007197'.
               05  FILLER   PIC X(13)  VALUE    '25T084 007197'.
               05  FILLER   PIC X(13)  VALUE    '25T099 007197'.
               05  FILLER   PIC X(13)  VALUE    '25T141 008713'.
               05  FILLER   PIC X(13)  VALUE    '25T152 008117'.
               05  FILLER   PIC X(13)  VALUE    '25U002 007197'.
               05  FILLER   PIC X(13)  VALUE    '25U006 007197'.
               05  FILLER   PIC X(13)  VALUE    '25U010 007197'.
               05  FILLER   PIC X(13)  VALUE    '25U017 007197'.
               05  FILLER   PIC X(13)  VALUE    '25U018 007197'.
               05  FILLER   PIC X(13)  VALUE    '25U020 007197'.
               05  FILLER   PIC X(13)  VALUE    '25U023 007197'.
               05  FILLER   PIC X(13)  VALUE    '25U027 007197'.
               05  FILLER   PIC X(13)  VALUE    '25U031 007197'.
               05  FILLER   PIC X(13)  VALUE    '25U035 007197'.
               05  FILLER   PIC X(13)  VALUE    '25U036 007197'.
               05  FILLER   PIC X(13)  VALUE    '25U043 007197'.
               05  FILLER   PIC X(13)  VALUE    '25U049 007197'.
               05  FILLER   PIC X(13)  VALUE    '25U050 007197'.
               05  FILLER   PIC X(13)  VALUE    '25U060 007197'.
               05  FILLER   PIC X(13)  VALUE    '25U061 007197'.
               05  FILLER   PIC X(13)  VALUE    '25U067 007197'.
               05  FILLER   PIC X(13)  VALUE    '25U077 007197'.
               05  FILLER   PIC X(13)  VALUE    '25U079 007197'.
               05  FILLER   PIC X(13)  VALUE    '25U085 007197'.
               05  FILLER   PIC X(13)  VALUE    '25U093 007197'.
               05  FILLER   PIC X(13)  VALUE    '25U095 007197'.
               05  FILLER   PIC X(13)  VALUE    '25U112 007197'.
               05  FILLER   PIC X(13)  VALUE    '25U117 007197'.
               05  FILLER   PIC X(13)  VALUE    '25U124 008117'.
               05  FILLER   PIC X(13)  VALUE    '25U149 007197'.
               05  FILLER   PIC X(13)  VALUE    '25U164 007197'.
               05  FILLER   PIC X(13)  VALUE    '25W004 007197'.
               05  FILLER   PIC X(13)  VALUE    '25Z316 007197'.
               05  FILLER   PIC X(13)  VALUE    '250001 008117'.
               05  FILLER   PIC X(13)  VALUE    '250002 007197'.
               05  FILLER   PIC X(13)  VALUE    '250004 008421'.
               05  FILLER   PIC X(13)  VALUE    '250006 007197'.
               05  FILLER   PIC X(13)  VALUE    '250007 007902'.
               05  FILLER   PIC X(13)  VALUE    '250009 008421'.
               05  FILLER   PIC X(13)  VALUE    '250012 008713'.
               05  FILLER   PIC X(13)  VALUE    '250017 007197'.
               05  FILLER   PIC X(13)  VALUE    '250018 007197'.
               05  FILLER   PIC X(13)  VALUE    '250019 007902'.
               05  FILLER   PIC X(13)  VALUE    '250020 007768'.
               05  FILLER   PIC X(13)  VALUE    '250025 007197'.
               05  FILLER   PIC X(13)  VALUE    '250027 007197'.
               05  FILLER   PIC X(13)  VALUE    '250031 007766'.
               05  FILLER   PIC X(13)  VALUE    '250034 008421'.
               05  FILLER   PIC X(13)  VALUE    '250036 007197'.
               05  FILLER   PIC X(13)  VALUE    '250038 008117'.
               05  FILLER   PIC X(13)  VALUE    '250040 007902'.
               05  FILLER   PIC X(13)  VALUE    '250042 008421'.
               05  FILLER   PIC X(13)  VALUE    '250043 007197'.
               05  FILLER   PIC X(13)  VALUE    '250044 007197'.
               05  FILLER   PIC X(13)  VALUE    '250048 008117'.
               05  FILLER   PIC X(13)  VALUE    '250049 007197'.
               05  FILLER   PIC X(13)  VALUE    '250050 007197'.
               05  FILLER   PIC X(13)  VALUE    '250057 007766'.
               05  FILLER   PIC X(13)  VALUE    '250058 007197'.
               05  FILLER   PIC X(13)  VALUE    '250060 007766'.
               05  FILLER   PIC X(13)  VALUE    '250061 008421'.
               05  FILLER   PIC X(13)  VALUE    '250067 007768'.
               05  FILLER   PIC X(13)  VALUE    '250069 007768'.
               05  FILLER   PIC X(13)  VALUE    '250072 008117'.
               05  FILLER   PIC X(13)  VALUE    '250077 007197'.
               05  FILLER   PIC X(13)  VALUE    '250078 007766'.
               05  FILLER   PIC X(13)  VALUE    '250079 007197'.
               05  FILLER   PIC X(13)  VALUE    '250081 007197'.
               05  FILLER   PIC X(13)  VALUE    '250082 007766'.
               05  FILLER   PIC X(13)  VALUE    '250084 007197'.
               05  FILLER   PIC X(13)  VALUE    '250085 007197'.
               05  FILLER   PIC X(13)  VALUE    '250093 008421'.
               05  FILLER   PIC X(13)  VALUE    '250094 007734'.
               05  FILLER   PIC X(13)  VALUE    '250095 007197'.
               05  FILLER   PIC X(13)  VALUE    '250096 008117'.
               05  FILLER   PIC X(13)  VALUE    '250097 007766'.
               05  FILLER   PIC X(13)  VALUE    '250099 007766'.
               05  FILLER   PIC X(13)  VALUE    '250100 007768'.
               05  FILLER   PIC X(13)  VALUE    '250102 008117'.
               05  FILLER   PIC X(13)  VALUE    '250104 007766'.
               05  FILLER   PIC X(13)  VALUE    '250117 007517'.
               05  FILLER   PIC X(13)  VALUE    '250122 007197'.
               05  FILLER   PIC X(13)  VALUE    '250123 007902'.
               05  FILLER   PIC X(13)  VALUE    '250124 008117'.
               05  FILLER   PIC X(13)  VALUE    '250126 008713'.
               05  FILLER   PIC X(13)  VALUE    '250127 014448'.
               05  FILLER   PIC X(13)  VALUE    '250128 007327'.
               05  FILLER   PIC X(13)  VALUE    '250134 008117'.
               05  FILLER   PIC X(13)  VALUE    '250136 008117'.
               05  FILLER   PIC X(13)  VALUE    '250138 008117'.
               05  FILLER   PIC X(13)  VALUE    '250141 008713'.
               05  FILLER   PIC X(13)  VALUE    '250151 007197'.
               05  FILLER   PIC X(13)  VALUE    '250152 008117'.
               05  FILLER   PIC X(13)  VALUE    '250162 007902'.
               05  FILLER   PIC X(13)  VALUE    '250163 007318'.
               05  FILLER   PIC X(13)  VALUE    '250167 008713'.
               05  FILLER   PIC X(13)  VALUE    '250168 007197'.
               05  FILLER   PIC X(13)  VALUE    '251652 007902'.
               05  FILLER   PIC X(13)  VALUE    '251653 007197'.
               05  FILLER   PIC X(13)  VALUE    '251656 008713'.
               05  FILLER   PIC X(13)  VALUE    '251658 008713'.
               05  FILLER   PIC X(13)  VALUE    '251660 007197'.
               05  FILLER   PIC X(13)  VALUE    '251661 007734'.
               05  FILLER   PIC X(13)  VALUE    '251669 008713'.
               05  FILLER   PIC X(13)  VALUE    '251670 007902'.
               05  FILLER   PIC X(13)  VALUE    '251671 007197'.
               05  FILLER   PIC X(13)  VALUE    '251676 007197'.
               05  FILLER   PIC X(13)  VALUE    '251677 007197'.
               05  FILLER   PIC X(13)  VALUE    '251678 007197'.
               05  FILLER   PIC X(13)  VALUE    '251679 007902'.
               05  FILLER   PIC X(13)  VALUE    '251682 008713'.
               05  FILLER   PIC X(13)  VALUE    '251684 007734'.
               05  FILLER   PIC X(13)  VALUE    '252003 008117'.
               05  FILLER   PIC X(13)  VALUE    '252004 007197'.
               05  FILLER   PIC X(13)  VALUE    '252005 007902'.
               05  FILLER   PIC X(13)  VALUE    '252007 008117'.
               05  FILLER   PIC X(13)  VALUE    '252008 007197'.
               05  FILLER   PIC X(13)  VALUE    '252009 007734'.
               05  FILLER   PIC X(13)  VALUE    '252013 007197'.
               05  FILLER   PIC X(13)  VALUE    '254005 008713'.
               05  FILLER   PIC X(13)  VALUE    '254007 008117'.
               05  FILLER   PIC X(13)  VALUE    '254011 007902'.
               05  FILLER   PIC X(13)  VALUE    '254012 007902'.
               05  FILLER   PIC X(13)  VALUE    '254513 007197'.
               05  FILLER   PIC X(13)  VALUE    '254515 007197'.
               05  FILLER   PIC X(13)  VALUE    '254521 007902'.
               05  FILLER   PIC X(13)  VALUE    '254526 007197'.
               05  FILLER   PIC X(13)  VALUE    '254527 007197'.
               05  FILLER   PIC X(13)  VALUE    '254529 007197'.
               05  FILLER   PIC X(13)  VALUE    '254530 007197'.
               05  FILLER   PIC X(13)  VALUE    '254532 007197'.
               05  FILLER   PIC X(13)  VALUE    '254533 007197'.
               05  FILLER   PIC X(13)  VALUE    '254536 007197'.
               05  FILLER   PIC X(13)  VALUE    '254537 008332'.
               05  FILLER   PIC X(13)  VALUE    '254538 008713'.
               05  FILLER   PIC X(13)  VALUE    '254600 008117'.
               05  FILLER   PIC X(13)  VALUE    '254601 007197'.
               05  FILLER   PIC X(13)  VALUE    '254605 007734'.
               05  FILLER   PIC X(13)  VALUE    '254615 008117'.
               05  FILLER   PIC X(13)  VALUE    '254616 007197'.
               05  FILLER   PIC X(13)  VALUE    '254618 007902'.
               05  FILLER   PIC X(13)  VALUE    '254620 007734'.
               05  FILLER   PIC X(13)  VALUE    '254621 008117'.
               05  FILLER   PIC X(13)  VALUE    '254622 007197'.
               05  FILLER   PIC X(13)  VALUE    '254623 008117'.
               05  FILLER   PIC X(13)  VALUE    '254624 008117'.
               05  FILLER   PIC X(13)  VALUE    '254625 008117'.
               05  FILLER   PIC X(13)  VALUE    '254626 008117'.
               05  FILLER   PIC X(13)  VALUE    '26S005 009107'.
               05  FILLER   PIC X(13)  VALUE    '26S006 009728'.
               05  FILLER   PIC X(13)  VALUE    '26S011 008551'.
               05  FILLER   PIC X(13)  VALUE    '26S015 007698'.
               05  FILLER   PIC X(13)  VALUE    '26S017 007698'.
               05  FILLER   PIC X(13)  VALUE    '26S020 009107'.
               05  FILLER   PIC X(13)  VALUE    '26S021 009107'.
               05  FILLER   PIC X(13)  VALUE    '26S023 009107'.
               05  FILLER   PIC X(13)  VALUE    '26S025 007698'.
               05  FILLER   PIC X(13)  VALUE    '26S027 009165'.
               05  FILLER   PIC X(13)  VALUE    '26S032 009107'.
               05  FILLER   PIC X(13)  VALUE    '26S040 007943'.
               05  FILLER   PIC X(13)  VALUE    '26S048 009165'.
               05  FILLER   PIC X(13)  VALUE    '26S050 007954'.
               05  FILLER   PIC X(13)  VALUE    '26S057 009165'.
               05  FILLER   PIC X(13)  VALUE    '26S061 007698'.
               05  FILLER   PIC X(13)  VALUE    '26S062 009165'.
               05  FILLER   PIC X(13)  VALUE    '26S064 007756'.
               05  FILLER   PIC X(13)  VALUE    '26S065 007943'.
               05  FILLER   PIC X(13)  VALUE    '26S070 007698'.
               05  FILLER   PIC X(13)  VALUE    '26S074 007898'.
               05  FILLER   PIC X(13)  VALUE    '26S077 009107'.
               05  FILLER   PIC X(13)  VALUE    '26S080 007698'.
               05  FILLER   PIC X(13)  VALUE    '26S085 009165'.
               05  FILLER   PIC X(13)  VALUE    '26S091 009107'.
               05  FILLER   PIC X(13)  VALUE    '26S094 007698'.
               05  FILLER   PIC X(13)  VALUE    '26S095 009165'.
               05  FILLER   PIC X(13)  VALUE    '26S097 008160'.
               05  FILLER   PIC X(13)  VALUE    '26S102 009165'.
               05  FILLER   PIC X(13)  VALUE    '26S104 009107'.
               05  FILLER   PIC X(13)  VALUE    '26S105 009107'.
               05  FILLER   PIC X(13)  VALUE    '26S107 009165'.
               05  FILLER   PIC X(13)  VALUE    '26S110 007920'.
               05  FILLER   PIC X(13)  VALUE    '26S113 007698'.
               05  FILLER   PIC X(13)  VALUE    '26S115 009107'.
               05  FILLER   PIC X(13)  VALUE    '26S116 008064'.
               05  FILLER   PIC X(13)  VALUE    '26S119 007698'.
               05  FILLER   PIC X(13)  VALUE    '26S137 007702'.
               05  FILLER   PIC X(13)  VALUE    '26S141 008239'.
               05  FILLER   PIC X(13)  VALUE    '26S142 007698'.
               05  FILLER   PIC X(13)  VALUE    '26S160 007698'.
               05  FILLER   PIC X(13)  VALUE    '26S163 007814'.
               05  FILLER   PIC X(13)  VALUE    '26S178 008239'.
               05  FILLER   PIC X(13)  VALUE    '26S180 009107'.
               05  FILLER   PIC X(13)  VALUE    '26S195 007943'.
               05  FILLER   PIC X(13)  VALUE    '26S198 009107'.
               05  FILLER   PIC X(13)  VALUE    '26S207 007943'.
               05  FILLER   PIC X(13)  VALUE    '26S209 008551'.
               05  FILLER   PIC X(13)  VALUE    '26S210 009107'.
               05  FILLER   PIC X(13)  VALUE    '26T001 007702'.
               05  FILLER   PIC X(13)  VALUE    '26T005 009107'.
               05  FILLER   PIC X(13)  VALUE    '26T006 009728'.
               05  FILLER   PIC X(13)  VALUE    '26T009 007698'.
               05  FILLER   PIC X(13)  VALUE    '26T015 007698'.
               05  FILLER   PIC X(13)  VALUE    '26T017 007698'.
               05  FILLER   PIC X(13)  VALUE    '26T020 009107'.
               05  FILLER   PIC X(13)  VALUE    '26T021 009107'.
               05  FILLER   PIC X(13)  VALUE    '26T022 007698'.
               05  FILLER   PIC X(13)  VALUE    '26T023 009107'.
               05  FILLER   PIC X(13)  VALUE    '26T025 007877'.
               05  FILLER   PIC X(13)  VALUE    '26T027 009165'.
               05  FILLER   PIC X(13)  VALUE    '26T040 007943'.
               05  FILLER   PIC X(13)  VALUE    '26T047 008551'.
               05  FILLER   PIC X(13)  VALUE    '26T057 009165'.
               05  FILLER   PIC X(13)  VALUE    '26T062 009165'.
               05  FILLER   PIC X(13)  VALUE    '26T065 007943'.
               05  FILLER   PIC X(13)  VALUE    '26T068 008239'.
               05  FILLER   PIC X(13)  VALUE    '26T077 009107'.
               05  FILLER   PIC X(13)  VALUE    '26T081 009107'.
               05  FILLER   PIC X(13)  VALUE    '26T085 009165'.
               05  FILLER   PIC X(13)  VALUE    '26T091 009107'.
               05  FILLER   PIC X(13)  VALUE    '26T094 007737'.
               05  FILLER   PIC X(13)  VALUE    '26T095 009165'.
               05  FILLER   PIC X(13)  VALUE    '26T096 009165'.
               05  FILLER   PIC X(13)  VALUE    '26T104 009107'.
               05  FILLER   PIC X(13)  VALUE    '26T107 009165'.
               05  FILLER   PIC X(13)  VALUE    '26T108 009107'.
               05  FILLER   PIC X(13)  VALUE    '26T110 007920'.
               05  FILLER   PIC X(13)  VALUE    '26T113 007698'.
               05  FILLER   PIC X(13)  VALUE    '26T119 007698'.
               05  FILLER   PIC X(13)  VALUE    '26T137 007702'.
               05  FILLER   PIC X(13)  VALUE    '26T138 009165'.
               05  FILLER   PIC X(13)  VALUE    '26T175 007698'.
               05  FILLER   PIC X(13)  VALUE    '26T176 009107'.
               05  FILLER   PIC X(13)  VALUE    '26T178 008239'.
               05  FILLER   PIC X(13)  VALUE    '26T179 009107'.
               05  FILLER   PIC X(13)  VALUE    '26T180 009107'.
               05  FILLER   PIC X(13)  VALUE    '26T183 007920'.
               05  FILLER   PIC X(13)  VALUE    '26T193 009165'.
               05  FILLER   PIC X(13)  VALUE    '26T198 009107'.
               05  FILLER   PIC X(13)  VALUE    '26T210 009107'.
               05  FILLER   PIC X(13)  VALUE    '26U024 007698'.
               05  FILLER   PIC X(13)  VALUE    '26U057 009165'.
               05  FILLER   PIC X(13)  VALUE    '26U061 007698'.
               05  FILLER   PIC X(13)  VALUE    '26U070 007698'.
               05  FILLER   PIC X(13)  VALUE    '26U142 007698'.
               05  FILLER   PIC X(13)  VALUE    '26U195 007943'.
               05  FILLER   PIC X(13)  VALUE    '26U209 008551'.
               05  FILLER   PIC X(13)  VALUE    '26Z318 007698'.
               05  FILLER   PIC X(13)  VALUE    '26Z331 007702'.
               05  FILLER   PIC X(13)  VALUE    '260001 008000'.
               05  FILLER   PIC X(13)  VALUE    '260004 007698'.
               05  FILLER   PIC X(13)  VALUE    '260005 009107'.
               05  FILLER   PIC X(13)  VALUE    '260006 009728'.
               05  FILLER   PIC X(13)  VALUE    '260009 009165'.
               05  FILLER   PIC X(13)  VALUE    '260011 008551'.
               05  FILLER   PIC X(13)  VALUE    '260015 007698'.
               05  FILLER   PIC X(13)  VALUE    '260017 008551'.
               05  FILLER   PIC X(13)  VALUE    '260020 009107'.
               05  FILLER   PIC X(13)  VALUE    '260022 008249'.
               05  FILLER   PIC X(13)  VALUE    '260023 009107'.
               05  FILLER   PIC X(13)  VALUE    '260024 007698'.
               05  FILLER   PIC X(13)  VALUE    '260025 009107'.
               05  FILLER   PIC X(13)  VALUE    '260027 009165'.
               05  FILLER   PIC X(13)  VALUE    '260032 009107'.
               05  FILLER   PIC X(13)  VALUE    '260034 007698'.
               05  FILLER   PIC X(13)  VALUE    '260040 007943'.
               05  FILLER   PIC X(13)  VALUE    '260047 008551'.
               05  FILLER   PIC X(13)  VALUE    '260048 009165'.
               05  FILLER   PIC X(13)  VALUE    '260050 009728'.
               05  FILLER   PIC X(13)  VALUE    '260052 009107'.
               05  FILLER   PIC X(13)  VALUE    '260057 009165'.
               05  FILLER   PIC X(13)  VALUE    '260059 007735'.
               05  FILLER   PIC X(13)  VALUE    '260061 007698'.
               05  FILLER   PIC X(13)  VALUE    '260062 009165'.
               05  FILLER   PIC X(13)  VALUE    '260064 008551'.
               05  FILLER   PIC X(13)  VALUE    '260065 007943'.
               05  FILLER   PIC X(13)  VALUE    '260068 008239'.
               05  FILLER   PIC X(13)  VALUE    '260070 007698'.
               05  FILLER   PIC X(13)  VALUE    '260074 008551'.
               05  FILLER   PIC X(13)  VALUE    '260077 009107'.
               05  FILLER   PIC X(13)  VALUE    '260078 007943'.
               05  FILLER   PIC X(13)  VALUE    '260080 007698'.
               05  FILLER   PIC X(13)  VALUE    '260081 009107'.
               05  FILLER   PIC X(13)  VALUE    '260085 009165'.
               05  FILLER   PIC X(13)  VALUE    '260091 009107'.
               05  FILLER   PIC X(13)  VALUE    '260094 007943'.
               05  FILLER   PIC X(13)  VALUE    '260095 009165'.
               05  FILLER   PIC X(13)  VALUE    '260096 009165'.
               05  FILLER   PIC X(13)  VALUE    '260097 008160'.
               05  FILLER   PIC X(13)  VALUE    '260102 009165'.
               05  FILLER   PIC X(13)  VALUE    '260104 009107'.
               05  FILLER   PIC X(13)  VALUE    '260105 009107'.
               05  FILLER   PIC X(13)  VALUE    '260108 009107'.
               05  FILLER   PIC X(13)  VALUE    '260110 007967'.
               05  FILLER   PIC X(13)  VALUE    '260113 008486'.
               05  FILLER   PIC X(13)  VALUE    '260116 007814'.
               05  FILLER   PIC X(13)  VALUE    '260119 007786'.
               05  FILLER   PIC X(13)  VALUE    '260137 008000'.
               05  FILLER   PIC X(13)  VALUE    '260138 009165'.
               05  FILLER   PIC X(13)  VALUE    '260141 008239'.
               05  FILLER   PIC X(13)  VALUE    '260142 007698'.
               05  FILLER   PIC X(13)  VALUE    '260147 007698'.
               05  FILLER   PIC X(13)  VALUE    '260160 007698'.
               05  FILLER   PIC X(13)  VALUE    '260162 009107'.
               05  FILLER   PIC X(13)  VALUE    '260163 007814'.
               05  FILLER   PIC X(13)  VALUE    '260175 009165'.
               05  FILLER   PIC X(13)  VALUE    '260176 009107'.
               05  FILLER   PIC X(13)  VALUE    '260177 009165'.
               05  FILLER   PIC X(13)  VALUE    '260179 009107'.
               05  FILLER   PIC X(13)  VALUE    '260180 009107'.
               05  FILLER   PIC X(13)  VALUE    '260183 007920'.
               05  FILLER   PIC X(13)  VALUE    '260186 008551'.
               05  FILLER   PIC X(13)  VALUE    '260190 009165'.
               05  FILLER   PIC X(13)  VALUE    '260191 009107'.
               05  FILLER   PIC X(13)  VALUE    '260193 009165'.
               05  FILLER   PIC X(13)  VALUE    '260195 007698'.
               05  FILLER   PIC X(13)  VALUE    '260200 009107'.
               05  FILLER   PIC X(13)  VALUE    '260207 007943'.
               05  FILLER   PIC X(13)  VALUE    '260209 008551'.
               05  FILLER   PIC X(13)  VALUE    '260210 009107'.
               05  FILLER   PIC X(13)  VALUE    '260214 009165'.
               05  FILLER   PIC X(13)  VALUE    '260216 009165'.
               05  FILLER   PIC X(13)  VALUE    '260219 009107'.
               05  FILLER   PIC X(13)  VALUE    '260225 009107'.
               05  FILLER   PIC X(13)  VALUE    '260227 007698'.
               05  FILLER   PIC X(13)  VALUE    '261501 007698'.
               05  FILLER   PIC X(13)  VALUE    '261503 009165'.
               05  FILLER   PIC X(13)  VALUE    '261505 009107'.
               05  FILLER   PIC X(13)  VALUE    '261506 009165'.
               05  FILLER   PIC X(13)  VALUE    '261507 009728'.
               05  FILLER   PIC X(13)  VALUE    '261508 007943'.
               05  FILLER   PIC X(13)  VALUE    '261510 009107'.
               05  FILLER   PIC X(13)  VALUE    '261511 009107'.
               05  FILLER   PIC X(13)  VALUE    '261512 007702'.
               05  FILLER   PIC X(13)  VALUE    '261513 007943'.
               05  FILLER   PIC X(13)  VALUE    '261514 009107'.
               05  FILLER   PIC X(13)  VALUE    '261515 009107'.
               05  FILLER   PIC X(13)  VALUE    '261520 009107'.
               05  FILLER   PIC X(13)  VALUE    '261521 009165'.
               05  FILLER   PIC X(13)  VALUE    '261522 007698'.
               05  FILLER   PIC X(13)  VALUE    '261532 007698'.
               05  FILLER   PIC X(13)  VALUE    '261533 007698'.
               05  FILLER   PIC X(13)  VALUE    '261535 007698'.
               05  FILLER   PIC X(13)  VALUE    '261536 007698'.
               05  FILLER   PIC X(13)  VALUE    '261540 007698'.
               05  FILLER   PIC X(13)  VALUE    '261541 007698'.
               05  FILLER   PIC X(13)  VALUE    '261542 009165'.
               05  FILLER   PIC X(13)  VALUE    '261543 009165'.
               05  FILLER   PIC X(13)  VALUE    '261546 007698'.
               05  FILLER   PIC X(13)  VALUE    '261550 009107'.
               05  FILLER   PIC X(13)  VALUE    '261553 007698'.
               05  FILLER   PIC X(13)  VALUE    '261554 007698'.
               05  FILLER   PIC X(13)  VALUE    '261563 009165'.
               05  FILLER   PIC X(13)  VALUE    '261564 008239'.
               05  FILLER   PIC X(13)  VALUE    '261565 008239'.
               05  FILLER   PIC X(13)  VALUE    '261569 009165'.
               05  FILLER   PIC X(13)  VALUE    '261570 007698'.
               05  FILLER   PIC X(13)  VALUE    '261572 009165'.
               05  FILLER   PIC X(13)  VALUE    '261573 007698'.
               05  FILLER   PIC X(13)  VALUE    '261574 009107'.
               05  FILLER   PIC X(13)  VALUE    '261575 009107'.
               05  FILLER   PIC X(13)  VALUE    '261577 007698'.
               05  FILLER   PIC X(13)  VALUE    '261578 007943'.
               05  FILLER   PIC X(13)  VALUE    '261580 009165'.
               05  FILLER   PIC X(13)  VALUE    '261583 007698'.
               05  FILLER   PIC X(13)  VALUE    '261584 007698'.
               05  FILLER   PIC X(13)  VALUE    '261586 007698'.
               05  FILLER   PIC X(13)  VALUE    '261587 009107'.
               05  FILLER   PIC X(13)  VALUE    '261588 009165'.
               05  FILLER   PIC X(13)  VALUE    '261589 009165'.
               05  FILLER   PIC X(13)  VALUE    '261590 007943'.
               05  FILLER   PIC X(13)  VALUE    '261591 009107'.
               05  FILLER   PIC X(13)  VALUE    '261592 009107'.
               05  FILLER   PIC X(13)  VALUE    '261594 009107'.
               05  FILLER   PIC X(13)  VALUE    '261595 009165'.
               05  FILLER   PIC X(13)  VALUE    '261596 009165'.
               05  FILLER   PIC X(13)  VALUE    '261598 007698'.
               05  FILLER   PIC X(13)  VALUE    '261600 009165'.
               05  FILLER   PIC X(13)  VALUE    '261602 007943'.
               05  FILLER   PIC X(13)  VALUE    '261603 007698'.
               05  FILLER   PIC X(13)  VALUE    '261605 009165'.
               05  FILLER   PIC X(13)  VALUE    '261609 009165'.
               05  FILLER   PIC X(13)  VALUE    '261610 009107'.
               05  FILLER   PIC X(13)  VALUE    '261611 007698'.
               05  FILLER   PIC X(13)  VALUE    '261612 008239'.
               05  FILLER   PIC X(13)  VALUE    '261613 009107'.
               05  FILLER   PIC X(13)  VALUE    '261614 007698'.
               05  FILLER   PIC X(13)  VALUE    '261617 007698'.
               05  FILLER   PIC X(13)  VALUE    '261618 009165'.
               05  FILLER   PIC X(13)  VALUE    '261620 009107'.
               05  FILLER   PIC X(13)  VALUE    '261621 009165'.
               05  FILLER   PIC X(13)  VALUE    '261622 009165'.
               05  FILLER   PIC X(13)  VALUE    '261624 007943'.
               05  FILLER   PIC X(13)  VALUE    '261626 009107'.
               05  FILLER   PIC X(13)  VALUE    '261627 009107'.
               05  FILLER   PIC X(13)  VALUE    '261629 009107'.
               05  FILLER   PIC X(13)  VALUE    '261630 007943'.
               05  FILLER   PIC X(13)  VALUE    '261631 009107'.
               05  FILLER   PIC X(13)  VALUE    '261632 007698'.
               05  FILLER   PIC X(13)  VALUE    '261633 009107'.
               05  FILLER   PIC X(13)  VALUE    '261634 009165'.
               05  FILLER   PIC X(13)  VALUE    '261635 007943'.
               05  FILLER   PIC X(13)  VALUE    '261636 007698'.
               05  FILLER   PIC X(13)  VALUE    '261637 007698'.
               05  FILLER   PIC X(13)  VALUE    '261638 007943'.
               05  FILLER   PIC X(13)  VALUE    '261639 009107'.
               05  FILLER   PIC X(13)  VALUE    '261640 009107'.
               05  FILLER   PIC X(13)  VALUE    '261641 009107'.
               05  FILLER   PIC X(13)  VALUE    '261642 009165'.
               05  FILLER   PIC X(13)  VALUE    '261643 008239'.
               05  FILLER   PIC X(13)  VALUE    '261644 009165'.
               05  FILLER   PIC X(13)  VALUE    '261645 009107'.
               05  FILLER   PIC X(13)  VALUE    '261646 007943'.
               05  FILLER   PIC X(13)  VALUE    '261647 007698'.
               05  FILLER   PIC X(13)  VALUE    '261648 009165'.
               05  FILLER   PIC X(13)  VALUE    '261649 009165'.
               05  FILLER   PIC X(13)  VALUE    '261651 009107'.
               05  FILLER   PIC X(13)  VALUE    '262010 009107'.
               05  FILLER   PIC X(13)  VALUE    '262013 009107'.
               05  FILLER   PIC X(13)  VALUE    '262014 009847'.
               05  FILLER   PIC X(13)  VALUE    '262017 007943'.
               05  FILLER   PIC X(13)  VALUE    '262018 009165'.
               05  FILLER   PIC X(13)  VALUE    '262019 009728'.
               05  FILLER   PIC X(13)  VALUE    '263028 009107'.
               05  FILLER   PIC X(13)  VALUE    '263029 009107'.
               05  FILLER   PIC X(13)  VALUE    '263031 009107'.
               05  FILLER   PIC X(13)  VALUE    '263033 008239'.
               05  FILLER   PIC X(13)  VALUE    '263301 009107'.
               05  FILLER   PIC X(13)  VALUE    '263302 009165'.
               05  FILLER   PIC X(13)  VALUE    '264004 008551'.
               05  FILLER   PIC X(13)  VALUE    '264005 007814'.
               05  FILLER   PIC X(13)  VALUE    '264007 009728'.
               05  FILLER   PIC X(13)  VALUE    '264008 009165'.
               05  FILLER   PIC X(13)  VALUE    '264010 009107'.
               05  FILLER   PIC X(13)  VALUE    '264012 009107'.
               05  FILLER   PIC X(13)  VALUE    '264025 009107'.
               05  FILLER   PIC X(13)  VALUE    '264030 009165'.
               05  FILLER   PIC X(13)  VALUE    '264033 007943'.
               05  FILLER   PIC X(13)  VALUE    '264600 009165'.
               05  FILLER   PIC X(13)  VALUE    '264641 009107'.
               05  FILLER   PIC X(13)  VALUE    '267575 007698'.
               05  FILLER   PIC X(13)  VALUE    '267614 009728'.
               05  FILLER   PIC X(13)  VALUE    '267615 009165'.
               05  FILLER   PIC X(13)  VALUE    '267616 009107'.
               05  FILLER   PIC X(13)  VALUE    '267617 009165'.
               05  FILLER   PIC X(13)  VALUE    '267618 009165'.
               05  FILLER   PIC X(13)  VALUE    '267619 009107'.
               05  FILLER   PIC X(13)  VALUE    '267620 009165'.
               05  FILLER   PIC X(13)  VALUE    '267621 007698'.
               05  FILLER   PIC X(13)  VALUE    '267622 007698'.
               05  FILLER   PIC X(13)  VALUE    '267623 009165'.
               05  FILLER   PIC X(13)  VALUE    '267624 009165'.
               05  FILLER   PIC X(13)  VALUE    '267625 007698'.
               05  FILLER   PIC X(13)  VALUE    '267626 009107'.
               05  FILLER   PIC X(13)  VALUE    '267627 009728'.
               05  FILLER   PIC X(13)  VALUE    '267628 009107'.
               05  FILLER   PIC X(13)  VALUE    '267629 007943'.
               05  FILLER   PIC X(13)  VALUE    '267630 007698'.
               05  FILLER   PIC X(13)  VALUE    '267631 007698'.
               05  FILLER   PIC X(13)  VALUE    '267632 009107'.
               05  FILLER   PIC X(13)  VALUE    '267633 008239'.
               05  FILLER   PIC X(13)  VALUE    '267634 007698'.
               05  FILLER   PIC X(13)  VALUE    '267635 007943'.
               05  FILLER   PIC X(13)  VALUE    '267636 009107'.
               05  FILLER   PIC X(13)  VALUE    '267637 007698'.
               05  FILLER   PIC X(13)  VALUE    '267638 007943'.
               05  FILLER   PIC X(13)  VALUE    '267639 009165'.
               05  FILLER   PIC X(13)  VALUE    '267640 009107'.
               05  FILLER   PIC X(13)  VALUE    '267641 009107'.
               05  FILLER   PIC X(13)  VALUE    '267642 009107'.
               05  FILLER   PIC X(13)  VALUE    '267643 009107'.
               05  FILLER   PIC X(13)  VALUE    '267646 007698'.
               05  FILLER   PIC X(13)  VALUE    '267648 009107'.
               05  FILLER   PIC X(13)  VALUE    '27S003 010000'.
               05  FILLER   PIC X(13)  VALUE    '27S014 010000'.
               05  FILLER   PIC X(13)  VALUE    '27T012 010000'.
               05  FILLER   PIC X(13)  VALUE    '27T023 010000'.
               05  FILLER   PIC X(13)  VALUE    '27T049 010000'.
               05  FILLER   PIC X(13)  VALUE    '27T087 010000'.
               05  FILLER   PIC X(13)  VALUE    '27U003 010000'.
               05  FILLER   PIC X(13)  VALUE    '27U032 010000'.
               05  FILLER   PIC X(13)  VALUE    '270003 010000'.
               05  FILLER   PIC X(13)  VALUE    '270004 010000'.
               05  FILLER   PIC X(13)  VALUE    '270012 010000'.
               05  FILLER   PIC X(13)  VALUE    '270014 010000'.
               05  FILLER   PIC X(13)  VALUE    '270017 010000'.
               05  FILLER   PIC X(13)  VALUE    '270023 010000'.
               05  FILLER   PIC X(13)  VALUE    '270032 010000'.
               05  FILLER   PIC X(13)  VALUE    '270049 010000'.
               05  FILLER   PIC X(13)  VALUE    '270051 010000'.
               05  FILLER   PIC X(13)  VALUE    '270057 010000'.
               05  FILLER   PIC X(13)  VALUE    '270074 014448'.
               05  FILLER   PIC X(13)  VALUE    '270086 010000'.
               05  FILLER   PIC X(13)  VALUE    '270087 010000'.
               05  FILLER   PIC X(13)  VALUE    '270089 010000'.
               05  FILLER   PIC X(13)  VALUE    '271500 010000'.
               05  FILLER   PIC X(13)  VALUE    '271501 010000'.
               05  FILLER   PIC X(13)  VALUE    '271502 010000'.
               05  FILLER   PIC X(13)  VALUE    '271503 010000'.
               05  FILLER   PIC X(13)  VALUE    '271504 010000'.
               05  FILLER   PIC X(13)  VALUE    '271506 010000'.
               05  FILLER   PIC X(13)  VALUE    '271507 010000'.
               05  FILLER   PIC X(13)  VALUE    '271508 010000'.
               05  FILLER   PIC X(13)  VALUE    '271509 010000'.
               05  FILLER   PIC X(13)  VALUE    '271511 010000'.
               05  FILLER   PIC X(13)  VALUE    '271512 010000'.
               05  FILLER   PIC X(13)  VALUE    '271513 010000'.
               05  FILLER   PIC X(13)  VALUE    '271514 010000'.
               05  FILLER   PIC X(13)  VALUE    '271515 010000'.
               05  FILLER   PIC X(13)  VALUE    '271516 010000'.
               05  FILLER   PIC X(13)  VALUE    '271517 010000'.
               05  FILLER   PIC X(13)  VALUE    '271519 010000'.
               05  FILLER   PIC X(13)  VALUE    '271520 010000'.
               05  FILLER   PIC X(13)  VALUE    '271521 010000'.
               05  FILLER   PIC X(13)  VALUE    '271523 010000'.
               05  FILLER   PIC X(13)  VALUE    '271524 010000'.
               05  FILLER   PIC X(13)  VALUE    '271525 010000'.
               05  FILLER   PIC X(13)  VALUE    '271526 010000'.
               05  FILLER   PIC X(13)  VALUE    '271527 010000'.
               05  FILLER   PIC X(13)  VALUE    '271528 010000'.
               05  FILLER   PIC X(13)  VALUE    '271530 010000'.
               05  FILLER   PIC X(13)  VALUE    '272001 010000'.
               05  FILLER   PIC X(13)  VALUE    '274004 010000'.
               05  FILLER   PIC X(13)  VALUE    '274086 010000'.
               05  FILLER   PIC X(13)  VALUE    '277097 010000'.
               05  FILLER   PIC X(13)  VALUE    '28S003 009638'.
               05  FILLER   PIC X(13)  VALUE    '28S009 008747'.
               05  FILLER   PIC X(13)  VALUE    '28S013 009281'.
               05  FILLER   PIC X(13)  VALUE    '28S032 008747'.
               05  FILLER   PIC X(13)  VALUE    '28S061 008747'.
               05  FILLER   PIC X(13)  VALUE    '28S065 008747'.
               05  FILLER   PIC X(13)  VALUE    '28S077 008929'.
               05  FILLER   PIC X(13)  VALUE    '28S081 009281'.
               05  FILLER   PIC X(13)  VALUE    '28T003 009638'.
               05  FILLER   PIC X(13)  VALUE    '28T009 008747'.
               05  FILLER   PIC X(13)  VALUE    '28T023 009656'.
               05  FILLER   PIC X(13)  VALUE    '28T032 008747'.
               05  FILLER   PIC X(13)  VALUE    '28T040 009281'.
               05  FILLER   PIC X(13)  VALUE    '28T061 008747'.
               05  FILLER   PIC X(13)  VALUE    '28T081 009281'.
               05  FILLER   PIC X(13)  VALUE    '28T125 008747'.
               05  FILLER   PIC X(13)  VALUE    '28Z339 008747'.
               05  FILLER   PIC X(13)  VALUE    '280003 009638'.
               05  FILLER   PIC X(13)  VALUE    '280009 009656'.
               05  FILLER   PIC X(13)  VALUE    '280013 009281'.
               05  FILLER   PIC X(13)  VALUE    '280020 009638'.
               05  FILLER   PIC X(13)  VALUE    '280023 009638'.
               05  FILLER   PIC X(13)  VALUE    '280030 009281'.
               05  FILLER   PIC X(13)  VALUE    '280032 008747'.
               05  FILLER   PIC X(13)  VALUE    '280040 009281'.
               05  FILLER   PIC X(13)  VALUE    '280060 009281'.
               05  FILLER   PIC X(13)  VALUE    '280061 008979'.
               05  FILLER   PIC X(13)  VALUE    '280065 009726'.
               05  FILLER   PIC X(13)  VALUE    '280077 009281'.
               05  FILLER   PIC X(13)  VALUE    '280081 009281'.
               05  FILLER   PIC X(13)  VALUE    '280105 009281'.
               05  FILLER   PIC X(13)  VALUE    '280111 008747'.
               05  FILLER   PIC X(13)  VALUE    '280125 008747'.
               05  FILLER   PIC X(13)  VALUE    '280127 009638'.
               05  FILLER   PIC X(13)  VALUE    '280128 009638'.
               05  FILLER   PIC X(13)  VALUE    '280129 009281'.
               05  FILLER   PIC X(13)  VALUE    '280130 009281'.
               05  FILLER   PIC X(13)  VALUE    '280131 009281'.
               05  FILLER   PIC X(13)  VALUE    '280132 009281'.
               05  FILLER   PIC X(13)  VALUE    '280133 009281'.
               05  FILLER   PIC X(13)  VALUE    '280134 008747'.
               05  FILLER   PIC X(13)  VALUE    '280135 009638'.
               05  FILLER   PIC X(13)  VALUE    '281500 009281'.
               05  FILLER   PIC X(13)  VALUE    '281501 008747'.
               05  FILLER   PIC X(13)  VALUE    '281502 009638'.
               05  FILLER   PIC X(13)  VALUE    '281503 009281'.
               05  FILLER   PIC X(13)  VALUE    '281504 008747'.
               05  FILLER   PIC X(13)  VALUE    '281505 008747'.
               05  FILLER   PIC X(13)  VALUE    '281506 008747'.
               05  FILLER   PIC X(13)  VALUE    '281507 009638'.
               05  FILLER   PIC X(13)  VALUE    '281509 008747'.
               05  FILLER   PIC X(13)  VALUE    '281510 009281'.
               05  FILLER   PIC X(13)  VALUE    '281511 008747'.
               05  FILLER   PIC X(13)  VALUE    '281513 009281'.
               05  FILLER   PIC X(13)  VALUE    '281515 008747'.
               05  FILLER   PIC X(13)  VALUE    '281516 008747'.
               05  FILLER   PIC X(13)  VALUE    '281517 009281'.
               05  FILLER   PIC X(13)  VALUE    '281520 008747'.
               05  FILLER   PIC X(13)  VALUE    '281521 008747'.
               05  FILLER   PIC X(13)  VALUE    '281522 008747'.
               05  FILLER   PIC X(13)  VALUE    '281523 008747'.
               05  FILLER   PIC X(13)  VALUE    '281524 008747'.
               05  FILLER   PIC X(13)  VALUE    '281525 008747'.
               05  FILLER   PIC X(13)  VALUE    '281527 008747'.
               05  FILLER   PIC X(13)  VALUE    '281528 009281'.
               05  FILLER   PIC X(13)  VALUE    '281530 008747'.
               05  FILLER   PIC X(13)  VALUE    '281531 008747'.
               05  FILLER   PIC X(13)  VALUE    '281533 008747'.
               05  FILLER   PIC X(13)  VALUE    '281535 009281'.
               05  FILLER   PIC X(13)  VALUE    '281536 009638'.
               05  FILLER   PIC X(13)  VALUE    '281537 009281'.
               05  FILLER   PIC X(13)  VALUE    '281539 008747'.
               05  FILLER   PIC X(13)  VALUE    '281540 009281'.
               05  FILLER   PIC X(13)  VALUE    '281542 009281'.
               05  FILLER   PIC X(13)  VALUE    '281543 008747'.
               05  FILLER   PIC X(13)  VALUE    '281544 008747'.
               05  FILLER   PIC X(13)  VALUE    '281545 009281'.
               05  FILLER   PIC X(13)  VALUE    '281546 009638'.
               05  FILLER   PIC X(13)  VALUE    '281547 008430'.
               05  FILLER   PIC X(13)  VALUE    '281549 009281'.
               05  FILLER   PIC X(13)  VALUE    '282000 009638'.
               05  FILLER   PIC X(13)  VALUE    '282001 009281'.
               05  FILLER   PIC X(13)  VALUE    '282003 009281'.
               05  FILLER   PIC X(13)  VALUE    '283025 009638'.
               05  FILLER   PIC X(13)  VALUE    '283026 009281'.
               05  FILLER   PIC X(13)  VALUE    '283300 009281'.
               05  FILLER   PIC X(13)  VALUE    '283301 009281'.
               05  FILLER   PIC X(13)  VALUE    '284009 009281'.
               05  FILLER   PIC X(13)  VALUE    '284501 009281'.
               05  FILLER   PIC X(13)  VALUE    '284600 009638'.
               05  FILLER   PIC X(13)  VALUE    '287004 008747'.
               05  FILLER   PIC X(13)  VALUE    '287005 008747'.
               05  FILLER   PIC X(13)  VALUE    '287009 008747'.
               05  FILLER   PIC X(13)  VALUE    '287011 008747'.
               05  FILLER   PIC X(13)  VALUE    '287012 008747'.
               05  FILLER   PIC X(13)  VALUE    '287015 008747'.
               05  FILLER   PIC X(13)  VALUE    '287016 008747'.
               05  FILLER   PIC X(13)  VALUE    '287020 008747'.
               05  FILLER   PIC X(13)  VALUE    '287033 008747'.
               05  FILLER   PIC X(13)  VALUE    '287041 008747'.
               05  FILLER   PIC X(13)  VALUE    '287045 008747'.
               05  FILLER   PIC X(13)  VALUE    '287052 008747'.
               05  FILLER   PIC X(13)  VALUE    '287055 008747'.
               05  FILLER   PIC X(13)  VALUE    '287059 008747'.
               05  FILLER   PIC X(13)  VALUE    '287072 009281'.
               05  FILLER   PIC X(13)  VALUE    '287073 008747'.
               05  FILLER   PIC X(13)  VALUE    '287075 008747'.
               05  FILLER   PIC X(13)  VALUE    '287086 008747'.
               05  FILLER   PIC X(13)  VALUE    '287087 008747'.
               05  FILLER   PIC X(13)  VALUE    '287095 008747'.
               05  FILLER   PIC X(13)  VALUE    '287101 008747'.
               05  FILLER   PIC X(13)  VALUE    '287103 008747'.
               05  FILLER   PIC X(13)  VALUE    '287106 008747'.
               05  FILLER   PIC X(13)  VALUE    '287107 008747'.
               05  FILLER   PIC X(13)  VALUE    '287110 008747'.
               05  FILLER   PIC X(13)  VALUE    '287131 009638'.
               05  FILLER   PIC X(13)  VALUE    '287135 009281'.
               05  FILLER   PIC X(13)  VALUE    '287138 009281'.
               05  FILLER   PIC X(13)  VALUE    '287139 009281'.
               05  FILLER   PIC X(13)  VALUE    '287140 009281'.
               05  FILLER   PIC X(13)  VALUE    '287141 009281'.
               05  FILLER   PIC X(13)  VALUE    '287142 009281'.
               05  FILLER   PIC X(13)  VALUE    '287143 009281'.
               05  FILLER   PIC X(13)  VALUE    '287144 009281'.
               05  FILLER   PIC X(13)  VALUE    '287145 009281'.
               05  FILLER   PIC X(13)  VALUE    '29S001 010446'.
               05  FILLER   PIC X(13)  VALUE    '29S005 011690'.
               05  FILLER   PIC X(13)  VALUE    '29S008 010000'.
               05  FILLER   PIC X(13)  VALUE    '29S009 010000'.
               05  FILLER   PIC X(13)  VALUE    '29S019 010317'.
               05  FILLER   PIC X(13)  VALUE    '29S022 011690'.
               05  FILLER   PIC X(13)  VALUE    '29S032 010000'.
               05  FILLER   PIC X(13)  VALUE    '29S047 011690'.
               05  FILLER   PIC X(13)  VALUE    '29T003 011690'.
               05  FILLER   PIC X(13)  VALUE    '29T012 011690'.
               05  FILLER   PIC X(13)  VALUE    '29T021 011690'.
               05  FILLER   PIC X(13)  VALUE    '29T022 011690'.
               05  FILLER   PIC X(13)  VALUE    '29T032 010000'.
               05  FILLER   PIC X(13)  VALUE    '29T039 011690'.
               05  FILLER   PIC X(13)  VALUE    '29T041 011690'.
               05  FILLER   PIC X(13)  VALUE    '29T046 011690'.
               05  FILLER   PIC X(13)  VALUE    '29T049 010000'.
               05  FILLER   PIC X(13)  VALUE    '29U020 010000'.
               05  FILLER   PIC X(13)  VALUE    '290001 010000'.
               05  FILLER   PIC X(13)  VALUE    '290002 010000'.
               05  FILLER   PIC X(13)  VALUE    '290003 011690'.
               05  FILLER   PIC X(13)  VALUE    '290005 011690'.
               05  FILLER   PIC X(13)  VALUE    '290007 011690'.
               05  FILLER   PIC X(13)  VALUE    '290008 010000'.
               05  FILLER   PIC X(13)  VALUE    '290009 012500'.
               05  FILLER   PIC X(13)  VALUE    '290012 011690'.
               05  FILLER   PIC X(13)  VALUE    '290019 010317'.
               05  FILLER   PIC X(13)  VALUE    '290020 010000'.
               05  FILLER   PIC X(13)  VALUE    '290021 011690'.
               05  FILLER   PIC X(13)  VALUE    '290022 011690'.
               05  FILLER   PIC X(13)  VALUE    '290032 010000'.
               05  FILLER   PIC X(13)  VALUE    '290039 011690'.
               05  FILLER   PIC X(13)  VALUE    '290041 011690'.
               05  FILLER   PIC X(13)  VALUE    '290045 011690'.
               05  FILLER   PIC X(13)  VALUE    '290046 011690'.
               05  FILLER   PIC X(13)  VALUE    '290047 011690'.
               05  FILLER   PIC X(13)  VALUE    '290049 010000'.
               05  FILLER   PIC X(13)  VALUE    '290051 010317'.
               05  FILLER   PIC X(13)  VALUE    '290053 011690'.
               05  FILLER   PIC X(13)  VALUE    '290054 011690'.
               05  FILLER   PIC X(13)  VALUE    '290056 011690'.
               05  FILLER   PIC X(13)  VALUE    '290057 011690'.
               05  FILLER   PIC X(13)  VALUE    '290058 011690'.
               05  FILLER   PIC X(13)  VALUE    '291500 011690'.
               05  FILLER   PIC X(13)  VALUE    '291501 010000'.
               05  FILLER   PIC X(13)  VALUE    '291502 011690'.
               05  FILLER   PIC X(13)  VALUE    '291504 011690'.
               05  FILLER   PIC X(13)  VALUE    '291508 011690'.
               05  FILLER   PIC X(13)  VALUE    '291509 010000'.
               05  FILLER   PIC X(13)  VALUE    '291510 011690'.
               05  FILLER   PIC X(13)  VALUE    '291512 011690'.
               05  FILLER   PIC X(13)  VALUE    '291513 011690'.
               05  FILLER   PIC X(13)  VALUE    '291514 011690'.
               05  FILLER   PIC X(13)  VALUE    '291515 010000'.
               05  FILLER   PIC X(13)  VALUE    '291516 011690'.
               05  FILLER   PIC X(13)  VALUE    '291517 011690'.
               05  FILLER   PIC X(13)  VALUE    '291518 011690'.
               05  FILLER   PIC X(13)  VALUE    '291519 011690'.
               05  FILLER   PIC X(13)  VALUE    '291520 011690'.
               05  FILLER   PIC X(13)  VALUE    '291521 011690'.
               05  FILLER   PIC X(13)  VALUE    '291523 011690'.
               05  FILLER   PIC X(13)  VALUE    '291524 011690'.
               05  FILLER   PIC X(13)  VALUE    '291525 011690'.
               05  FILLER   PIC X(13)  VALUE    '291526 011690'.
               05  FILLER   PIC X(13)  VALUE    '291527 011690'.
               05  FILLER   PIC X(13)  VALUE    '291528 011690'.
               05  FILLER   PIC X(13)  VALUE    '291529 011690'.
               05  FILLER   PIC X(13)  VALUE    '291530 010000'.
               05  FILLER   PIC X(13)  VALUE    '291531 011690'.
               05  FILLER   PIC X(13)  VALUE    '291532 011690'.
               05  FILLER   PIC X(13)  VALUE    '291533 011690'.
               05  FILLER   PIC X(13)  VALUE    '292002 011690'.
               05  FILLER   PIC X(13)  VALUE    '292003 011690'.
               05  FILLER   PIC X(13)  VALUE    '292004 010000'.
               05  FILLER   PIC X(13)  VALUE    '292006 011690'.
               05  FILLER   PIC X(13)  VALUE    '292008 010317'.
               05  FILLER   PIC X(13)  VALUE    '293026 011690'.
               05  FILLER   PIC X(13)  VALUE    '293032 011690'.
               05  FILLER   PIC X(13)  VALUE    '293033 011690'.
               05  FILLER   PIC X(13)  VALUE    '293034 011690'.
               05  FILLER   PIC X(13)  VALUE    '294000 010000'.
               05  FILLER   PIC X(13)  VALUE    '294003 010000'.
               05  FILLER   PIC X(13)  VALUE    '294009 011690'.
               05  FILLER   PIC X(13)  VALUE    '294012 011690'.
               05  FILLER   PIC X(13)  VALUE    '294013 011690'.
               05  FILLER   PIC X(13)  VALUE    '294014 011690'.
               05  FILLER   PIC X(13)  VALUE    '294015 010000'.
               05  FILLER   PIC X(13)  VALUE    '294514 011690'.
               05  FILLER   PIC X(13)  VALUE    '294604 011690'.
               05  FILLER   PIC X(13)  VALUE    '294605 011690'.
               05  FILLER   PIC X(13)  VALUE    '297146 011690'.
               05  FILLER   PIC X(13)  VALUE    '297151 011690'.
               05  FILLER   PIC X(13)  VALUE    '297152 011690'.
               05  FILLER   PIC X(13)  VALUE    '297153 011690'.
               05  FILLER   PIC X(13)  VALUE    '297154 012827'.
               05  FILLER   PIC X(13)  VALUE    '297155 011690'.
               05  FILLER   PIC X(13)  VALUE    '297156 011690'.
               05  FILLER   PIC X(13)  VALUE    '297157 011690'.
               05  FILLER   PIC X(13)  VALUE    '297158 011690'.
               05  FILLER   PIC X(13)  VALUE    '297159 011690'.
               05  FILLER   PIC X(13)  VALUE    '297160 011690'.
               05  FILLER   PIC X(13)  VALUE    '297161 011690'.
               05  FILLER   PIC X(13)  VALUE    '297162 011690'.
               05  FILLER   PIC X(13)  VALUE    '297163 011690'.
               05  FILLER   PIC X(13)  VALUE    '297164 011690'.
               05  FILLER   PIC X(13)  VALUE    '297165 011690'.
               05  FILLER   PIC X(13)  VALUE    '297166 011690'.
               05  FILLER   PIC X(13)  VALUE    '297167 011690'.
               05  FILLER   PIC X(13)  VALUE    '297168 011690'.
               05  FILLER   PIC X(13)  VALUE    '297169 011690'.
               05  FILLER   PIC X(13)  VALUE    '297170 011690'.
               05  FILLER   PIC X(13)  VALUE    '297171 011690'.
               05  FILLER   PIC X(13)  VALUE    '297172 011690'.
               05  FILLER   PIC X(13)  VALUE    '297173 011690'.
               05  FILLER   PIC X(13)  VALUE    '297174 011690'.
               05  FILLER   PIC X(13)  VALUE    '297175 011690'.
               05  FILLER   PIC X(13)  VALUE    '297176 011690'.
               05  FILLER   PIC X(13)  VALUE    '297177 011690'.
               05  FILLER   PIC X(13)  VALUE    '297178 011690'.
               05  FILLER   PIC X(13)  VALUE    '297179 011690'.
               05  FILLER   PIC X(13)  VALUE    '297180 010000'.
               05  FILLER   PIC X(13)  VALUE    '297181 011690'.
               05  FILLER   PIC X(13)  VALUE    '297182 011690'.
               05  FILLER   PIC X(13)  VALUE    '297183 011690'.
               05  FILLER   PIC X(13)  VALUE    '297184 010000'.
               05  FILLER   PIC X(13)  VALUE    '297185 011690'.
               05  FILLER   PIC X(13)  VALUE    '297186 011690'.
               05  FILLER   PIC X(13)  VALUE    '297187 011690'.
               05  FILLER   PIC X(13)  VALUE    '297188 011690'.
               05  FILLER   PIC X(13)  VALUE    '297189 011690'.
               05  FILLER   PIC X(13)  VALUE    '297190 011690'.
               05  FILLER   PIC X(13)  VALUE    '297193 011690'.
               05  FILLER   PIC X(13)  VALUE    '297194 011690'.
               05  FILLER   PIC X(13)  VALUE    '297195 011690'.
               05  FILLER   PIC X(13)  VALUE    '297300 010000'.
               05  FILLER   PIC X(13)  VALUE    '30S001 010956'.
               05  FILLER   PIC X(13)  VALUE    '30S003 010956'.
               05  FILLER   PIC X(13)  VALUE    '30S005 010956'.
               05  FILLER   PIC X(13)  VALUE    '30S012 011159'.
               05  FILLER   PIC X(13)  VALUE    '30S014 010956'.
               05  FILLER   PIC X(13)  VALUE    '30S017 011281'.
               05  FILLER   PIC X(13)  VALUE    '30S020 011159'.
               05  FILLER   PIC X(13)  VALUE    '30S029 011281'.
               05  FILLER   PIC X(13)  VALUE    '30T011 011159'.
               05  FILLER   PIC X(13)  VALUE    '30T019 010956'.
               05  FILLER   PIC X(13)  VALUE    '30T034 011159'.
               05  FILLER   PIC X(13)  VALUE    '30U005 010956'.
               05  FILLER   PIC X(13)  VALUE    '300001 010956'.
               05  FILLER   PIC X(13)  VALUE    '300003 010956'.
               05  FILLER   PIC X(13)  VALUE    '300005 010956'.
               05  FILLER   PIC X(13)  VALUE    '300011 011159'.
               05  FILLER   PIC X(13)  VALUE    '300012 011159'.
               05  FILLER   PIC X(13)  VALUE    '300014 010956'.
               05  FILLER   PIC X(13)  VALUE    '300017 011281'.
               05  FILLER   PIC X(13)  VALUE    '300018 010956'.
               05  FILLER   PIC X(13)  VALUE    '300019 011244'.
               05  FILLER   PIC X(13)  VALUE    '300020 011159'.
               05  FILLER   PIC X(13)  VALUE    '300023 011244'.
               05  FILLER   PIC X(13)  VALUE    '300029 011281'.
               05  FILLER   PIC X(13)  VALUE    '300034 011159'.
               05  FILLER   PIC X(13)  VALUE    '301500 010956'.
               05  FILLER   PIC X(13)  VALUE    '301501 010956'.
               05  FILLER   PIC X(13)  VALUE    '301502 010956'.
               05  FILLER   PIC X(13)  VALUE    '301503 010956'.
               05  FILLER   PIC X(13)  VALUE    '301507 010956'.
               05  FILLER   PIC X(13)  VALUE    '301508 010956'.
               05  FILLER   PIC X(13)  VALUE    '301509 010956'.
               05  FILLER   PIC X(13)  VALUE    '301510 010956'.
               05  FILLER   PIC X(13)  VALUE    '301512 010956'.
               05  FILLER   PIC X(13)  VALUE    '301517 010956'.
               05  FILLER   PIC X(13)  VALUE    '301518 010956'.
               05  FILLER   PIC X(13)  VALUE    '301520 010956'.
               05  FILLER   PIC X(13)  VALUE    '301521 010956'.
               05  FILLER   PIC X(13)  VALUE    '301523 010956'.
               05  FILLER   PIC X(13)  VALUE    '301525 010956'.
               05  FILLER   PIC X(13)  VALUE    '301526 010956'.
               05  FILLER   PIC X(13)  VALUE    '301527 010956'.
               05  FILLER   PIC X(13)  VALUE    '301528 010956'.
               05  FILLER   PIC X(13)  VALUE    '301529 010956'.
               05  FILLER   PIC X(13)  VALUE    '301530 010956'.
               05  FILLER   PIC X(13)  VALUE    '301531 010956'.
               05  FILLER   PIC X(13)  VALUE    '301532 010956'.
               05  FILLER   PIC X(13)  VALUE    '303026 011281'.
               05  FILLER   PIC X(13)  VALUE    '303027 010956'.
               05  FILLER   PIC X(13)  VALUE    '304001 011281'.
               05  FILLER   PIC X(13)  VALUE    '304500 010574'.
               05  FILLER   PIC X(13)  VALUE    '307000 010956'.
               05  FILLER   PIC X(13)  VALUE    '307003 011278'.
               05  FILLER   PIC X(13)  VALUE    '307013 010956'.
               05  FILLER   PIC X(13)  VALUE    '307015 010956'.
               05  FILLER   PIC X(13)  VALUE    '307017 011278'.
               05  FILLER   PIC X(13)  VALUE    '307020 010956'.
               05  FILLER   PIC X(13)  VALUE    '307021 011789'.
               05  FILLER   PIC X(13)  VALUE    '307037 012096'.
               05  FILLER   PIC X(13)  VALUE    '307040 010956'.
               05  FILLER   PIC X(13)  VALUE    '307041 010956'.
               05  FILLER   PIC X(13)  VALUE    '307062 010956'.
               05  FILLER   PIC X(13)  VALUE    '307065 011278'.
               05  FILLER   PIC X(13)  VALUE    '307070 011278'.
               05  FILLER   PIC X(13)  VALUE    '307077 011789'.
               05  FILLER   PIC X(13)  VALUE    '307078 011789'.
               05  FILLER   PIC X(13)  VALUE    '307082 011278'.
               05  FILLER   PIC X(13)  VALUE    '307083 010956'.
               05  FILLER   PIC X(13)  VALUE    '307084 011278'.
               05  FILLER   PIC X(13)  VALUE    '31S001 012853'.
               05  FILLER   PIC X(13)  VALUE    '31S002 011853'.
               05  FILLER   PIC X(13)  VALUE    '31S008 012853'.
               05  FILLER   PIC X(13)  VALUE    '31S009 011853'.
               05  FILLER   PIC X(13)  VALUE    '31S010 012853'.
               05  FILLER   PIC X(13)  VALUE    '31S015 011758'.
               05  FILLER   PIC X(13)  VALUE    '31S025 012853'.
               05  FILLER   PIC X(13)  VALUE    '31S027 011482'.
               05  FILLER   PIC X(13)  VALUE    '31S028 011482'.
               05  FILLER   PIC X(13)  VALUE    '31S029 011370'.
               05  FILLER   PIC X(13)  VALUE    '31S032 010796'.
               05  FILLER   PIC X(13)  VALUE    '31S040 012853'.
               05  FILLER   PIC X(13)  VALUE    '31S045 012853'.
               05  FILLER   PIC X(13)  VALUE    '31S048 011482'.
               05  FILLER   PIC X(13)  VALUE    '31S050 011482'.
               05  FILLER   PIC X(13)  VALUE    '31S051 011482'.
               05  FILLER   PIC X(13)  VALUE    '31S054 011853'.
               05  FILLER   PIC X(13)  VALUE    '31S057 010713'.
               05  FILLER   PIC X(13)  VALUE    '31S058 012853'.
               05  FILLER   PIC X(13)  VALUE    '31S061 010713'.
               05  FILLER   PIC X(13)  VALUE    '31S073 012853'.
               05  FILLER   PIC X(13)  VALUE    '31S074 012853'.
               05  FILLER   PIC X(13)  VALUE    '31S075 012853'.
               05  FILLER   PIC X(13)  VALUE    '31S081 010713'.
               05  FILLER   PIC X(13)  VALUE    '31S083 011853'.
               05  FILLER   PIC X(13)  VALUE    '31S092 010661'.
               05  FILLER   PIC X(13)  VALUE    '31T010 012853'.
               05  FILLER   PIC X(13)  VALUE    '31T015 011758'.
               05  FILLER   PIC X(13)  VALUE    '31T019 012853'.
               05  FILLER   PIC X(13)  VALUE    '31T029 010795'.
               05  FILLER   PIC X(13)  VALUE    '31T034 012853'.
               05  FILLER   PIC X(13)  VALUE    '31T040 012853'.
               05  FILLER   PIC X(13)  VALUE    '31T108 012853'.
               05  FILLER   PIC X(13)  VALUE    '310001 012853'.
               05  FILLER   PIC X(13)  VALUE    '310002 012747'.
               05  FILLER   PIC X(13)  VALUE    '310003 012853'.
               05  FILLER   PIC X(13)  VALUE    '310005 011482'.
               05  FILLER   PIC X(13)  VALUE    '310006 012853'.
               05  FILLER   PIC X(13)  VALUE    '310008 012853'.
               05  FILLER   PIC X(13)  VALUE    '310009 012747'.
               05  FILLER   PIC X(13)  VALUE    '310010 012853'.
               05  FILLER   PIC X(13)  VALUE    '310011 011897'.
               05  FILLER   PIC X(13)  VALUE    '310012 012853'.
               05  FILLER   PIC X(13)  VALUE    '310014 010871'.
               05  FILLER   PIC X(13)  VALUE    '310015 012747'.
               05  FILLER   PIC X(13)  VALUE    '310016 012853'.
               05  FILLER   PIC X(13)  VALUE    '310017 012747'.
               05  FILLER   PIC X(13)  VALUE    '310019 012853'.
               05  FILLER   PIC X(13)  VALUE    '310021 010956'.
               05  FILLER   PIC X(13)  VALUE    '310022 010795'.
               05  FILLER   PIC X(13)  VALUE    '310024 011482'.
               05  FILLER   PIC X(13)  VALUE    '310025 012853'.
               05  FILLER   PIC X(13)  VALUE    '310027 011482'.
               05  FILLER   PIC X(13)  VALUE    '310028 012747'.
               05  FILLER   PIC X(13)  VALUE    '310029 010795'.
               05  FILLER   PIC X(13)  VALUE    '310031 010713'.
               05  FILLER   PIC X(13)  VALUE    '310032 011897'.
               05  FILLER   PIC X(13)  VALUE    '310034 012853'.
               05  FILLER   PIC X(13)  VALUE    '310038 012853'.
               05  FILLER   PIC X(13)  VALUE    '310039 012853'.
               05  FILLER   PIC X(13)  VALUE    '310040 012853'.
               05  FILLER   PIC X(13)  VALUE    '310041 012853'.
               05  FILLER   PIC X(13)  VALUE    '310044 010956'.
               05  FILLER   PIC X(13)  VALUE    '310045 012853'.
               05  FILLER   PIC X(13)  VALUE    '310047 012656'.
               05  FILLER   PIC X(13)  VALUE    '310048 011482'.
               05  FILLER   PIC X(13)  VALUE    '310050 012747'.
               05  FILLER   PIC X(13)  VALUE    '310051 012747'.
               05  FILLER   PIC X(13)  VALUE    '310052 012853'.
               05  FILLER   PIC X(13)  VALUE    '310054 012747'.
               05  FILLER   PIC X(13)  VALUE    '310057 010713'.
               05  FILLER   PIC X(13)  VALUE    '310058 012853'.
               05  FILLER   PIC X(13)  VALUE    '310060 009534'.
               05  FILLER   PIC X(13)  VALUE    '310061 010713'.
               05  FILLER   PIC X(13)  VALUE    '310064 012656'.
               05  FILLER   PIC X(13)  VALUE    '310069 011303'.
               05  FILLER   PIC X(13)  VALUE    '310070 012853'.
               05  FILLER   PIC X(13)  VALUE    '310073 012853'.
               05  FILLER   PIC X(13)  VALUE    '310074 012853'.
               05  FILLER   PIC X(13)  VALUE    '310075 012853'.
               05  FILLER   PIC X(13)  VALUE    '310076 012747'.
               05  FILLER   PIC X(13)  VALUE    '310081 010713'.
               05  FILLER   PIC X(13)  VALUE    '310083 012747'.
               05  FILLER   PIC X(13)  VALUE    '310084 012853'.
               05  FILLER   PIC X(13)  VALUE    '310086 010795'.
               05  FILLER   PIC X(13)  VALUE    '310091 011303'.
               05  FILLER   PIC X(13)  VALUE    '310092 010956'.
               05  FILLER   PIC X(13)  VALUE    '310096 012747'.
               05  FILLER   PIC X(13)  VALUE    '310108 012853'.
               05  FILLER   PIC X(13)  VALUE    '310110 010956'.
               05  FILLER   PIC X(13)  VALUE    '310111 012853'.
               05  FILLER   PIC X(13)  VALUE    '310112 012853'.
               05  FILLER   PIC X(13)  VALUE    '310113 012853'.
               05  FILLER   PIC X(13)  VALUE    '310115 009534'.
               05  FILLER   PIC X(13)  VALUE    '310118 012853'.
               05  FILLER   PIC X(13)  VALUE    '310119 012747'.
               05  FILLER   PIC X(13)  VALUE    '310130 012853'.
               05  FILLER   PIC X(13)  VALUE    '310898 011482'.
               05  FILLER   PIC X(13)  VALUE    '310899 011482'.
               05  FILLER   PIC X(13)  VALUE    '311501 011482'.
               05  FILLER   PIC X(13)  VALUE    '311503 011482'.
               05  FILLER   PIC X(13)  VALUE    '311504 010713'.
               05  FILLER   PIC X(13)  VALUE    '311505 011482'.
               05  FILLER   PIC X(13)  VALUE    '311506 010419'.
               05  FILLER   PIC X(13)  VALUE    '311507 011482'.
               05  FILLER   PIC X(13)  VALUE    '311508 012853'.
               05  FILLER   PIC X(13)  VALUE    '311509 011482'.
               05  FILLER   PIC X(13)  VALUE    '311510 012853'.
               05  FILLER   PIC X(13)  VALUE    '311513 010713'.
               05  FILLER   PIC X(13)  VALUE    '311515 011189'.
               05  FILLER   PIC X(13)  VALUE    '311516 012656'.
               05  FILLER   PIC X(13)  VALUE    '311517 012853'.
               05  FILLER   PIC X(13)  VALUE    '311520 010665'.
               05  FILLER   PIC X(13)  VALUE    '311521 012853'.
               05  FILLER   PIC X(13)  VALUE    '311522 012853'.
               05  FILLER   PIC X(13)  VALUE    '311523 012853'.
               05  FILLER   PIC X(13)  VALUE    '311524 011482'.
               05  FILLER   PIC X(13)  VALUE    '311525 012853'.
               05  FILLER   PIC X(13)  VALUE    '311526 012853'.
               05  FILLER   PIC X(13)  VALUE    '311528 012853'.
               05  FILLER   PIC X(13)  VALUE    '311529 012853'.
               05  FILLER   PIC X(13)  VALUE    '311530 012853'.
               05  FILLER   PIC X(13)  VALUE    '311532 012853'.
               05  FILLER   PIC X(13)  VALUE    '311533 012853'.
               05  FILLER   PIC X(13)  VALUE    '311534 010419'.
               05  FILLER   PIC X(13)  VALUE    '311536 010713'.
               05  FILLER   PIC X(13)  VALUE    '311537 010713'.
               05  FILLER   PIC X(13)  VALUE    '311539 012853'.
               05  FILLER   PIC X(13)  VALUE    '311541 011482'.
               05  FILLER   PIC X(13)  VALUE    '311542 012853'.
               05  FILLER   PIC X(13)  VALUE    '311543 011482'.
               05  FILLER   PIC X(13)  VALUE    '311545 012853'.
               05  FILLER   PIC X(13)  VALUE    '311546 010713'.
               05  FILLER   PIC X(13)  VALUE    '311547 012853'.
               05  FILLER   PIC X(13)  VALUE    '311549 012853'.
               05  FILLER   PIC X(13)  VALUE    '311550 010713'.
               05  FILLER   PIC X(13)  VALUE    '311551 010713'.
               05  FILLER   PIC X(13)  VALUE    '311554 012853'.
               05  FILLER   PIC X(13)  VALUE    '311559 012853'.
               05  FILLER   PIC X(13)  VALUE    '311560 012853'.
               05  FILLER   PIC X(13)  VALUE    '311561 011482'.
               05  FILLER   PIC X(13)  VALUE    '311562 012853'.
               05  FILLER   PIC X(13)  VALUE    '311563 012853'.
               05  FILLER   PIC X(13)  VALUE    '311564 012853'.
               05  FILLER   PIC X(13)  VALUE    '311566 010713'.
               05  FILLER   PIC X(13)  VALUE    '311567 010419'.
               05  FILLER   PIC X(13)  VALUE    '311569 010713'.
               05  FILLER   PIC X(13)  VALUE    '311570 012853'.
               05  FILLER   PIC X(13)  VALUE    '311571 012853'.
               05  FILLER   PIC X(13)  VALUE    '311572 012853'.
               05  FILLER   PIC X(13)  VALUE    '311573 011482'.
               05  FILLER   PIC X(13)  VALUE    '311574 010419'.
               05  FILLER   PIC X(13)  VALUE    '311575 012853'.
               05  FILLER   PIC X(13)  VALUE    '312014 011482'.
               05  FILLER   PIC X(13)  VALUE    '312017 012853'.
               05  FILLER   PIC X(13)  VALUE    '312019 012853'.
               05  FILLER   PIC X(13)  VALUE    '312020 011758'.
               05  FILLER   PIC X(13)  VALUE    '312022 010713'.
               05  FILLER   PIC X(13)  VALUE    '312023 012656'.
               05  FILLER   PIC X(13)  VALUE    '313025 011853'.
               05  FILLER   PIC X(13)  VALUE    '313027 010661'.
               05  FILLER   PIC X(13)  VALUE    '313029 012853'.
               05  FILLER   PIC X(13)  VALUE    '313030 012656'.
               05  FILLER   PIC X(13)  VALUE    '313032 010713'.
               05  FILLER   PIC X(13)  VALUE    '313033 012853'.
               05  FILLER   PIC X(13)  VALUE    '313035 012853'.
               05  FILLER   PIC X(13)  VALUE    '313036 010796'.
               05  FILLER   PIC X(13)  VALUE    '313300 012853'.
               05  FILLER   PIC X(13)  VALUE    '314001 011482'.
               05  FILLER   PIC X(13)  VALUE    '314005 010713'.
               05  FILLER   PIC X(13)  VALUE    '314011 012853'.
               05  FILLER   PIC X(13)  VALUE    '314012 011482'.
               05  FILLER   PIC X(13)  VALUE    '314013 010661'.
               05  FILLER   PIC X(13)  VALUE    '314016 011758'.
               05  FILLER   PIC X(13)  VALUE    '314019 012853'.
               05  FILLER   PIC X(13)  VALUE    '314020 011853'.
               05  FILLER   PIC X(13)  VALUE    '314021 010713'.
               05  FILLER   PIC X(13)  VALUE    '314022 012853'.
               05  FILLER   PIC X(13)  VALUE    '314024 012853'.
               05  FILLER   PIC X(13)  VALUE    '314026 011482'.
               05  FILLER   PIC X(13)  VALUE    '314500 011482'.
               05  FILLER   PIC X(13)  VALUE    '314505 010713'.
               05  FILLER   PIC X(13)  VALUE    '314506 012853'.
               05  FILLER   PIC X(13)  VALUE    '314507 012853'.
               05  FILLER   PIC X(13)  VALUE    '314509 010713'.
               05  FILLER   PIC X(13)  VALUE    '314510 012853'.
               05  FILLER   PIC X(13)  VALUE    '314512 011482'.
               05  FILLER   PIC X(13)  VALUE    '314514 012853'.
               05  FILLER   PIC X(13)  VALUE    '314515 012853'.
               05  FILLER   PIC X(13)  VALUE    '314516 012853'.
               05  FILLER   PIC X(13)  VALUE    '314519 011482'.
               05  FILLER   PIC X(13)  VALUE    '314523 012853'.
               05  FILLER   PIC X(13)  VALUE    '314601 012853'.
               05  FILLER   PIC X(13)  VALUE    '314603 012853'.
               05  FILLER   PIC X(13)  VALUE    '314607 011189'.
               05  FILLER   PIC X(13)  VALUE    '314609 012853'.
               05  FILLER   PIC X(13)  VALUE    '314630 012853'.
               05  FILLER   PIC X(13)  VALUE    '314647 012853'.
               05  FILLER   PIC X(13)  VALUE    '314648 012853'.
               05  FILLER   PIC X(13)  VALUE    '317075 012853'.
               05  FILLER   PIC X(13)  VALUE    '317092 011482'.
               05  FILLER   PIC X(13)  VALUE    '317093 012853'.
               05  FILLER   PIC X(13)  VALUE    '32S001 009073'.
               05  FILLER   PIC X(13)  VALUE    '32S002 011220'.
               05  FILLER   PIC X(13)  VALUE    '32S004 008588'.
               05  FILLER   PIC X(13)  VALUE    '32S006 008588'.
               05  FILLER   PIC X(13)  VALUE    '32S016 008588'.
               05  FILLER   PIC X(13)  VALUE    '32S021 009073'.
               05  FILLER   PIC X(13)  VALUE    '32S030 008588'.
               05  FILLER   PIC X(13)  VALUE    '32S065 008588'.
               05  FILLER   PIC X(13)  VALUE    '32S074 009073'.
               05  FILLER   PIC X(13)  VALUE    '32S089 009073'.
               05  FILLER   PIC X(13)  VALUE    '32T002 011220'.
               05  FILLER   PIC X(13)  VALUE    '32T004 008588'.
               05  FILLER   PIC X(13)  VALUE    '32T063 008588'.
               05  FILLER   PIC X(13)  VALUE    '32T065 008588'.
               05  FILLER   PIC X(13)  VALUE    '32T085 009187'.
               05  FILLER   PIC X(13)  VALUE    '32Z307 008588'.
               05  FILLER   PIC X(13)  VALUE    '32Z308 008588'.
               05  FILLER   PIC X(13)  VALUE    '320001 009269'.
               05  FILLER   PIC X(13)  VALUE    '320002 011220'.
               05  FILLER   PIC X(13)  VALUE    '320003 009269'.
               05  FILLER   PIC X(13)  VALUE    '320004 008588'.
               05  FILLER   PIC X(13)  VALUE    '320005 009726'.
               05  FILLER   PIC X(13)  VALUE    '320006 009073'.
               05  FILLER   PIC X(13)  VALUE    '320009 009269'.
               05  FILLER   PIC X(13)  VALUE    '320011 009269'.
               05  FILLER   PIC X(13)  VALUE    '320016 008588'.
               05  FILLER   PIC X(13)  VALUE    '320017 009269'.
               05  FILLER   PIC X(13)  VALUE    '320018 008588'.
               05  FILLER   PIC X(13)  VALUE    '320021 009269'.
               05  FILLER   PIC X(13)  VALUE    '320022 008588'.
               05  FILLER   PIC X(13)  VALUE    '320030 008588'.
               05  FILLER   PIC X(13)  VALUE    '320033 009269'.
               05  FILLER   PIC X(13)  VALUE    '320038 008588'.
               05  FILLER   PIC X(13)  VALUE    '320057 014448'.
               05  FILLER   PIC X(13)  VALUE    '320058 014448'.
               05  FILLER   PIC X(13)  VALUE    '320059 014448'.
               05  FILLER   PIC X(13)  VALUE    '320060 014448'.
               05  FILLER   PIC X(13)  VALUE    '320061 014448'.
               05  FILLER   PIC X(13)  VALUE    '320062 014448'.
               05  FILLER   PIC X(13)  VALUE    '320063 008588'.
               05  FILLER   PIC X(13)  VALUE    '320065 008969'.
               05  FILLER   PIC X(13)  VALUE    '320067 008588'.
               05  FILLER   PIC X(13)  VALUE    '320070 014448'.
               05  FILLER   PIC X(13)  VALUE    '320074 009269'.
               05  FILLER   PIC X(13)  VALUE    '320084 008588'.
               05  FILLER   PIC X(13)  VALUE    '320085 008588'.
               05  FILLER   PIC X(13)  VALUE    '320086 008588'.
               05  FILLER   PIC X(13)  VALUE    '320089 009073'.
               05  FILLER   PIC X(13)  VALUE    '320090 011220'.
               05  FILLER   PIC X(13)  VALUE    '321547 009073'.
               05  FILLER   PIC X(13)  VALUE    '321561 008588'.
               05  FILLER   PIC X(13)  VALUE    '321562 009399'.
               05  FILLER   PIC X(13)  VALUE    '321563 009073'.
               05  FILLER   PIC X(13)  VALUE    '321564 009073'.
               05  FILLER   PIC X(13)  VALUE    '321565 011220'.
               05  FILLER   PIC X(13)  VALUE    '322002 009073'.
               05  FILLER   PIC X(13)  VALUE    '322004 008588'.
               05  FILLER   PIC X(13)  VALUE    '323027 009073'.
               05  FILLER   PIC X(13)  VALUE    '323028 009073'.
               05  FILLER   PIC X(13)  VALUE    '323032 008588'.
               05  FILLER   PIC X(13)  VALUE    '324010 008588'.
               05  FILLER   PIC X(13)  VALUE    '324012 008588'.
               05  FILLER   PIC X(13)  VALUE    '324013 009073'.
               05  FILLER   PIC X(13)  VALUE    '324014 009073'.
               05  FILLER   PIC X(13)  VALUE    '327204 008588'.
               05  FILLER   PIC X(13)  VALUE    '33B195 013348'.
               05  FILLER   PIC X(13)  VALUE    '33B234 012211'.
               05  FILLER   PIC X(13)  VALUE    '33S006 012853'.
               05  FILLER   PIC X(13)  VALUE    '33S008 008903'.
               05  FILLER   PIC X(13)  VALUE    '33S009 012853'.
               05  FILLER   PIC X(13)  VALUE    '33S013 008640'.
               05  FILLER   PIC X(13)  VALUE    '33S014 012913'.
               05  FILLER   PIC X(13)  VALUE    '33S024 012853'.
               05  FILLER   PIC X(13)  VALUE    '33S027 013348'.
               05  FILLER   PIC X(13)  VALUE    '33S028 012853'.
               05  FILLER   PIC X(13)  VALUE    '33S030 008640'.
               05  FILLER   PIC X(13)  VALUE    '33S043 013348'.
               05  FILLER   PIC X(13)  VALUE    '33S044 008893'.
               05  FILLER   PIC X(13)  VALUE    '33S045 013348'.
               05  FILLER   PIC X(13)  VALUE    '33S046 012853'.
               05  FILLER   PIC X(13)  VALUE    '33S047 008640'.
               05  FILLER   PIC X(13)  VALUE    '33S059 012853'.
               05  FILLER   PIC X(13)  VALUE    '33S079 008640'.
               05  FILLER   PIC X(13)  VALUE    '33S080 012853'.
               05  FILLER   PIC X(13)  VALUE    '33S086 012853'.
               05  FILLER   PIC X(13)  VALUE    '33S088 013348'.
               05  FILLER   PIC X(13)  VALUE    '33S090 008702'.
               05  FILLER   PIC X(13)  VALUE    '33S094 009264'.
               05  FILLER   PIC X(13)  VALUE    '33S101 012853'.
               05  FILLER   PIC X(13)  VALUE    '33S103 008897'.
               05  FILLER   PIC X(13)  VALUE    '33S104 012853'.
               05  FILLER   PIC X(13)  VALUE    '33S106 013348'.
               05  FILLER   PIC X(13)  VALUE    '33S119 012853'.
               05  FILLER   PIC X(13)  VALUE    '33S125 008640'.
               05  FILLER   PIC X(13)  VALUE    '33S126 012853'.
               05  FILLER   PIC X(13)  VALUE    '33S127 012853'.
               05  FILLER   PIC X(13)  VALUE    '33S128 012913'.
               05  FILLER   PIC X(13)  VALUE    '33S135 012853'.
               05  FILLER   PIC X(13)  VALUE    '33S136 008640'.
               05  FILLER   PIC X(13)  VALUE    '33S141 013348'.
               05  FILLER   PIC X(13)  VALUE    '33S157 009627'.
               05  FILLER   PIC X(13)  VALUE    '33S160 012853'.
               05  FILLER   PIC X(13)  VALUE    '33S162 012853'.
               05  FILLER   PIC X(13)  VALUE    '33S169 012853'.
               05  FILLER   PIC X(13)  VALUE    '33S175 008836'.
               05  FILLER   PIC X(13)  VALUE    '33S180 008640'.
               05  FILLER   PIC X(13)  VALUE    '33S185 013348'.
               05  FILLER   PIC X(13)  VALUE    '33S191 008673'.
               05  FILLER   PIC X(13)  VALUE    '33S193 012913'.
               05  FILLER   PIC X(13)  VALUE    '33S194 012853'.
               05  FILLER   PIC X(13)  VALUE    '33S195 012913'.
               05  FILLER   PIC X(13)  VALUE    '33S196 012853'.
               05  FILLER   PIC X(13)  VALUE    '33S198 013348'.
               05  FILLER   PIC X(13)  VALUE    '33S199 012853'.
               05  FILLER   PIC X(13)  VALUE    '33S201 012853'.
               05  FILLER   PIC X(13)  VALUE    '33S202 012853'.
               05  FILLER   PIC X(13)  VALUE    '33S204 012853'.
               05  FILLER   PIC X(13)  VALUE    '33S211 008640'.
               05  FILLER   PIC X(13)  VALUE    '33S214 012853'.
               05  FILLER   PIC X(13)  VALUE    '33S215 008893'.
               05  FILLER   PIC X(13)  VALUE    '33S218 009977'.
               05  FILLER   PIC X(13)  VALUE    '33S219 010280'.
               05  FILLER   PIC X(13)  VALUE    '33S224 009966'.
               05  FILLER   PIC X(13)  VALUE    '33S226 008640'.
               05  FILLER   PIC X(13)  VALUE    '33S229 008640'.
               05  FILLER   PIC X(13)  VALUE    '33S231 012913'.
               05  FILLER   PIC X(13)  VALUE    '33S233 012853'.
               05  FILLER   PIC X(13)  VALUE    '33S234 012853'.
               05  FILLER   PIC X(13)  VALUE    '33S235 008912'.
               05  FILLER   PIC X(13)  VALUE    '33S236 012853'.
               05  FILLER   PIC X(13)  VALUE    '33S239 008640'.
               05  FILLER   PIC X(13)  VALUE    '33S240 012853'.
               05  FILLER   PIC X(13)  VALUE    '33S241 009977'.
               05  FILLER   PIC X(13)  VALUE    '33S245 008893'.
               05  FILLER   PIC X(13)  VALUE    '33S259 013348'.
               05  FILLER   PIC X(13)  VALUE    '33S261 012853'.
               05  FILLER   PIC X(13)  VALUE    '33S265 008640'.
               05  FILLER   PIC X(13)  VALUE    '33S273 013273'.
               05  FILLER   PIC X(13)  VALUE    '33S285 008640'.
               05  FILLER   PIC X(13)  VALUE    '33S331 013348'.
               05  FILLER   PIC X(13)  VALUE    '33S357 008640'.
               05  FILLER   PIC X(13)  VALUE    '33S385 012853'.
               05  FILLER   PIC X(13)  VALUE    '33S386 009864'.
               05  FILLER   PIC X(13)  VALUE    '33S393 013348'.
               05  FILLER   PIC X(13)  VALUE    '33S394 008640'.
               05  FILLER   PIC X(13)  VALUE    '33S395 012913'.
               05  FILLER   PIC X(13)  VALUE    '33S396 012853'.
               05  FILLER   PIC X(13)  VALUE    '33S397 012853'.
               05  FILLER   PIC X(13)  VALUE    '33S399 012853'.
               05  FILLER   PIC X(13)  VALUE    '33S401 013348'.
               05  FILLER   PIC X(13)  VALUE    '33T005 010280'.
               05  FILLER   PIC X(13)  VALUE    '33T013 008640'.
               05  FILLER   PIC X(13)  VALUE    '33T014 012913'.
               05  FILLER   PIC X(13)  VALUE    '33T024 012853'.
               05  FILLER   PIC X(13)  VALUE    '33T027 013348'.
               05  FILLER   PIC X(13)  VALUE    '33T044 008893'.
               05  FILLER   PIC X(13)  VALUE    '33T046 012853'.
               05  FILLER   PIC X(13)  VALUE    '33T047 008640'.
               05  FILLER   PIC X(13)  VALUE    '33T049 012211'.
               05  FILLER   PIC X(13)  VALUE    '33T056 012853'.
               05  FILLER   PIC X(13)  VALUE    '33T058 008640'.
               05  FILLER   PIC X(13)  VALUE    '33T059 012853'.
               05  FILLER   PIC X(13)  VALUE    '33T078 010280'.
               05  FILLER   PIC X(13)  VALUE    '33T090 008702'.
               05  FILLER   PIC X(13)  VALUE    '33T101 012853'.
               05  FILLER   PIC X(13)  VALUE    '33T102 010280'.
               05  FILLER   PIC X(13)  VALUE    '33T125 008640'.
               05  FILLER   PIC X(13)  VALUE    '33T126 012853'.
               05  FILLER   PIC X(13)  VALUE    '33T127 012853'.
               05  FILLER   PIC X(13)  VALUE    '33T128 012913'.
               05  FILLER   PIC X(13)  VALUE    '33T133 008640'.
               05  FILLER   PIC X(13)  VALUE    '33T157 009627'.
               05  FILLER   PIC X(13)  VALUE    '33T160 012853'.
               05  FILLER   PIC X(13)  VALUE    '33T181 013348'.
               05  FILLER   PIC X(13)  VALUE    '33T191 008673'.
               05  FILLER   PIC X(13)  VALUE    '33T199 012853'.
               05  FILLER   PIC X(13)  VALUE    '33T201 012853'.
               05  FILLER   PIC X(13)  VALUE    '33T202 012853'.
               05  FILLER   PIC X(13)  VALUE    '33T204 012853'.
               05  FILLER   PIC X(13)  VALUE    '33T211 008640'.
               05  FILLER   PIC X(13)  VALUE    '33T214 012853'.
               05  FILLER   PIC X(13)  VALUE    '33T219 010280'.
               05  FILLER   PIC X(13)  VALUE    '33T224 009966'.
               05  FILLER   PIC X(13)  VALUE    '33T226 008640'.
               05  FILLER   PIC X(13)  VALUE    '33T234 012853'.
               05  FILLER   PIC X(13)  VALUE    '33T236 012853'.
               05  FILLER   PIC X(13)  VALUE    '33T239 008640'.
               05  FILLER   PIC X(13)  VALUE    '33T241 009977'.
               05  FILLER   PIC X(13)  VALUE    '33T246 013348'.
               05  FILLER   PIC X(13)  VALUE    '33T259 013348'.
               05  FILLER   PIC X(13)  VALUE    '33T261 012853'.
               05  FILLER   PIC X(13)  VALUE    '33T279 010280'.
               05  FILLER   PIC X(13)  VALUE    '33T285 008640'.
               05  FILLER   PIC X(13)  VALUE    '33T307 009034'.
               05  FILLER   PIC X(13)  VALUE    '33T350 012853'.
               05  FILLER   PIC X(13)  VALUE    '33T394 008640'.
               05  FILLER   PIC X(13)  VALUE    '33T399 008640'.
               05  FILLER   PIC X(13)  VALUE    '33T405 012853'.
               05  FILLER   PIC X(13)  VALUE    '33T406 008640'.
               05  FILLER   PIC X(13)  VALUE    '33U008 008200'.
               05  FILLER   PIC X(13)  VALUE    '33U033 008200'.
               05  FILLER   PIC X(13)  VALUE    '33U079 008200'.
               05  FILLER   PIC X(13)  VALUE    '33U096 008200'.
               05  FILLER   PIC X(13)  VALUE    '33U103 008200'.
               05  FILLER   PIC X(13)  VALUE    '33U144 008200'.
               05  FILLER   PIC X(13)  VALUE    '33U175 008200'.
               05  FILLER   PIC X(13)  VALUE    '33U197 008200'.
               05  FILLER   PIC X(13)  VALUE    '33U211 008200'.
               05  FILLER   PIC X(13)  VALUE    '33U238 008640'.
               05  FILLER   PIC X(13)  VALUE    '33U307 009034'.
               05  FILLER   PIC X(13)  VALUE    '33Z309 008640'.
               05  FILLER   PIC X(13)  VALUE    '33Z310 008926'.
               05  FILLER   PIC X(13)  VALUE    '33Z316 009977'.
               05  FILLER   PIC X(13)  VALUE    '33Z317 008640'.
               05  FILLER   PIC X(13)  VALUE    '33Z318 008640'.
               05  FILLER   PIC X(13)  VALUE    '33Z319 008640'.
               05  FILLER   PIC X(13)  VALUE    '330003 008640'.
               05  FILLER   PIC X(13)  VALUE    '330004 009966'.
               05  FILLER   PIC X(13)  VALUE    '330005 010280'.
               05  FILLER   PIC X(13)  VALUE    '330006 012853'.
               05  FILLER   PIC X(13)  VALUE    '330008 008903'.
               05  FILLER   PIC X(13)  VALUE    '330009 012853'.
               05  FILLER   PIC X(13)  VALUE    '330011 008640'.
               05  FILLER   PIC X(13)  VALUE    '330013 008640'.
               05  FILLER   PIC X(13)  VALUE    '330014 013348'.
               05  FILLER   PIC X(13)  VALUE    '330019 013348'.
               05  FILLER   PIC X(13)  VALUE    '330023 012747'.
               05  FILLER   PIC X(13)  VALUE    '330024 012853'.
               05  FILLER   PIC X(13)  VALUE    '330027 013348'.
               05  FILLER   PIC X(13)  VALUE    '330028 012853'.
               05  FILLER   PIC X(13)  VALUE    '330030 008640'.
               05  FILLER   PIC X(13)  VALUE    '330033 008640'.
               05  FILLER   PIC X(13)  VALUE    '330043 013348'.
               05  FILLER   PIC X(13)  VALUE    '330044 008893'.
               05  FILLER   PIC X(13)  VALUE    '330045 013348'.
               05  FILLER   PIC X(13)  VALUE    '330046 013348'.
               05  FILLER   PIC X(13)  VALUE    '330047 008640'.
               05  FILLER   PIC X(13)  VALUE    '330049 012747'.
               05  FILLER   PIC X(13)  VALUE    '330055 013348'.
               05  FILLER   PIC X(13)  VALUE    '330056 012853'.
               05  FILLER   PIC X(13)  VALUE    '330057 008640'.
               05  FILLER   PIC X(13)  VALUE    '330058 008640'.
               05  FILLER   PIC X(13)  VALUE    '330059 013348'.
               05  FILLER   PIC X(13)  VALUE    '330061 012853'.
               05  FILLER   PIC X(13)  VALUE    '330065 010280'.
               05  FILLER   PIC X(13)  VALUE    '330067 012211'.
               05  FILLER   PIC X(13)  VALUE    '330073 008640'.
               05  FILLER   PIC X(13)  VALUE    '330074 008640'.
               05  FILLER   PIC X(13)  VALUE    '330078 010280'.
               05  FILLER   PIC X(13)  VALUE    '330079 010175'.
               05  FILLER   PIC X(13)  VALUE    '330080 012853'.
               05  FILLER   PIC X(13)  VALUE    '330084 008640'.
               05  FILLER   PIC X(13)  VALUE    '330085 008640'.
               05  FILLER   PIC X(13)  VALUE    '330086 012853'.
               05  FILLER   PIC X(13)  VALUE    '330088 013348'.
               05  FILLER   PIC X(13)  VALUE    '330090 008702'.
               05  FILLER   PIC X(13)  VALUE    '330094 010560'.
               05  FILLER   PIC X(13)  VALUE    '330096 008640'.
               05  FILLER   PIC X(13)  VALUE    '330100 012853'.
               05  FILLER   PIC X(13)  VALUE    '330101 013348'.
               05  FILLER   PIC X(13)  VALUE    '330102 010280'.
               05  FILLER   PIC X(13)  VALUE    '330103 008897'.
               05  FILLER   PIC X(13)  VALUE    '330104 012853'.
               05  FILLER   PIC X(13)  VALUE    '330106 013348'.
               05  FILLER   PIC X(13)  VALUE    '330107 013348'.
               05  FILLER   PIC X(13)  VALUE    '330108 008640'.
               05  FILLER   PIC X(13)  VALUE    '330111 010280'.
               05  FILLER   PIC X(13)  VALUE    '330115 009977'.
               05  FILLER   PIC X(13)  VALUE    '330119 013348'.
               05  FILLER   PIC X(13)  VALUE    '330125 008640'.
               05  FILLER   PIC X(13)  VALUE    '330126 012853'.
               05  FILLER   PIC X(13)  VALUE    '330127 012853'.
               05  FILLER   PIC X(13)  VALUE    '330128 013348'.
               05  FILLER   PIC X(13)  VALUE    '330132 008897'.
               05  FILLER   PIC X(13)  VALUE    '330135 012853'.
               05  FILLER   PIC X(13)  VALUE    '330136 009526'.
               05  FILLER   PIC X(13)  VALUE    '330140 009977'.
               05  FILLER   PIC X(13)  VALUE    '330141 013348'.
               05  FILLER   PIC X(13)  VALUE    '330144 008640'.
               05  FILLER   PIC X(13)  VALUE    '330151 008640'.
               05  FILLER   PIC X(13)  VALUE    '330153 008640'.
               05  FILLER   PIC X(13)  VALUE    '330154 012853'.
               05  FILLER   PIC X(13)  VALUE    '330157 009526'.
               05  FILLER   PIC X(13)  VALUE    '330158 012853'.
               05  FILLER   PIC X(13)  VALUE    '330160 012853'.
               05  FILLER   PIC X(13)  VALUE    '330162 012853'.
               05  FILLER   PIC X(13)  VALUE    '330163 010280'.
               05  FILLER   PIC X(13)  VALUE    '330164 009830'.
               05  FILLER   PIC X(13)  VALUE    '330166 008640'.
               05  FILLER   PIC X(13)  VALUE    '330167 013348'.
               05  FILLER   PIC X(13)  VALUE    '330169 013348'.
               05  FILLER   PIC X(13)  VALUE    '330175 008804'.
               05  FILLER   PIC X(13)  VALUE    '330180 009086'.
               05  FILLER   PIC X(13)  VALUE    '330181 013348'.
               05  FILLER   PIC X(13)  VALUE    '330182 013348'.
               05  FILLER   PIC X(13)  VALUE    '330184 013348'.
               05  FILLER   PIC X(13)  VALUE    '330185 013348'.
               05  FILLER   PIC X(13)  VALUE    '330188 010280'.
               05  FILLER   PIC X(13)  VALUE    '330191 009086'.
               05  FILLER   PIC X(13)  VALUE    '330193 013348'.
               05  FILLER   PIC X(13)  VALUE    '330194 013348'.
               05  FILLER   PIC X(13)  VALUE    '330195 013348'.
               05  FILLER   PIC X(13)  VALUE    '330196 012853'.
               05  FILLER   PIC X(13)  VALUE    '330197 009627'.
               05  FILLER   PIC X(13)  VALUE    '330198 013348'.
               05  FILLER   PIC X(13)  VALUE    '330199 012853'.
               05  FILLER   PIC X(13)  VALUE    '330201 012853'.
               05  FILLER   PIC X(13)  VALUE    '330202 013348'.
               05  FILLER   PIC X(13)  VALUE    '330203 009977'.
               05  FILLER   PIC X(13)  VALUE    '330204 012853'.
               05  FILLER   PIC X(13)  VALUE    '330205 012853'.
               05  FILLER   PIC X(13)  VALUE    '330208 013348'.
               05  FILLER   PIC X(13)  VALUE    '330211 008640'.
               05  FILLER   PIC X(13)  VALUE    '330214 012853'.
               05  FILLER   PIC X(13)  VALUE    '330215 009526'.
               05  FILLER   PIC X(13)  VALUE    '330218 009977'.
               05  FILLER   PIC X(13)  VALUE    '330219 010280'.
               05  FILLER   PIC X(13)  VALUE    '330221 012853'.
               05  FILLER   PIC X(13)  VALUE    '330222 009086'.
               05  FILLER   PIC X(13)  VALUE    '330223 009627'.
               05  FILLER   PIC X(13)  VALUE    '330224 012090'.
               05  FILLER   PIC X(13)  VALUE    '330226 008640'.
               05  FILLER   PIC X(13)  VALUE    '330229 008640'.
               05  FILLER   PIC X(13)  VALUE    '330231 013348'.
               05  FILLER   PIC X(13)  VALUE    '330232 008640'.
               05  FILLER   PIC X(13)  VALUE    '330233 012853'.
               05  FILLER   PIC X(13)  VALUE    '330234 012660'.
               05  FILLER   PIC X(13)  VALUE    '330235 009526'.
               05  FILLER   PIC X(13)  VALUE    '330236 012853'.
               05  FILLER   PIC X(13)  VALUE    '330238 008640'.
               05  FILLER   PIC X(13)  VALUE    '330239 008640'.
               05  FILLER   PIC X(13)  VALUE    '330240 012853'.
               05  FILLER   PIC X(13)  VALUE    '330241 009977'.
               05  FILLER   PIC X(13)  VALUE    '330245 008893'.
               05  FILLER   PIC X(13)  VALUE    '330246 013348'.
               05  FILLER   PIC X(13)  VALUE    '330250 010175'.
               05  FILLER   PIC X(13)  VALUE    '330259 013348'.
               05  FILLER   PIC X(13)  VALUE    '330261 012853'.
               05  FILLER   PIC X(13)  VALUE    '330264 012853'.
               05  FILLER   PIC X(13)  VALUE    '330265 008640'.
               05  FILLER   PIC X(13)  VALUE    '330267 012853'.
               05  FILLER   PIC X(13)  VALUE    '330270 013348'.
               05  FILLER   PIC X(13)  VALUE    '330273 012747'.
               05  FILLER   PIC X(13)  VALUE    '330276 008640'.
               05  FILLER   PIC X(13)  VALUE    '330277 008640'.
               05  FILLER   PIC X(13)  VALUE    '330279 010280'.
               05  FILLER   PIC X(13)  VALUE    '330285 009830'.
               05  FILLER   PIC X(13)  VALUE    '330286 013348'.
               05  FILLER   PIC X(13)  VALUE    '330304 013348'.
               05  FILLER   PIC X(13)  VALUE    '330306 012853'.
               05  FILLER   PIC X(13)  VALUE    '330307 009034'.
               05  FILLER   PIC X(13)  VALUE    '330331 013348'.
               05  FILLER   PIC X(13)  VALUE    '330332 013348'.
               05  FILLER   PIC X(13)  VALUE    '330340 013348'.
               05  FILLER   PIC X(13)  VALUE    '330350 012853'.
               05  FILLER   PIC X(13)  VALUE    '330353 012913'.
               05  FILLER   PIC X(13)  VALUE    '330354 010280'.
               05  FILLER   PIC X(13)  VALUE    '330372 013348'.
               05  FILLER   PIC X(13)  VALUE    '330385 013348'.
               05  FILLER   PIC X(13)  VALUE    '330386 012747'.
               05  FILLER   PIC X(13)  VALUE    '330393 013348'.
               05  FILLER   PIC X(13)  VALUE    '330394 008640'.
               05  FILLER   PIC X(13)  VALUE    '330395 013348'.
               05  FILLER   PIC X(13)  VALUE    '330396 012853'.
               05  FILLER   PIC X(13)  VALUE    '330397 012853'.
               05  FILLER   PIC X(13)  VALUE    '330399 013348'.
               05  FILLER   PIC X(13)  VALUE    '330401 013348'.
               05  FILLER   PIC X(13)  VALUE    '330404 012853'.
               05  FILLER   PIC X(13)  VALUE    '330405 012853'.
               05  FILLER   PIC X(13)  VALUE    '330406 008640'.
               05  FILLER   PIC X(13)  VALUE    '330408 008640'.
               05  FILLER   PIC X(13)  VALUE    '330409 008640'.
               05  FILLER   PIC X(13)  VALUE    '331501 008640'.
               05  FILLER   PIC X(13)  VALUE    '331502 010280'.
               05  FILLER   PIC X(13)  VALUE    '331504 012853'.
               05  FILLER   PIC X(13)  VALUE    '331505 008640'.
               05  FILLER   PIC X(13)  VALUE    '331506 008640'.
               05  FILLER   PIC X(13)  VALUE    '331510 008893'.
               05  FILLER   PIC X(13)  VALUE    '331511 009977'.
               05  FILLER   PIC X(13)  VALUE    '331512 009034'.
               05  FILLER   PIC X(13)  VALUE    '331513 008640'.
               05  FILLER   PIC X(13)  VALUE    '331514 008640'.
               05  FILLER   PIC X(13)  VALUE    '331515 008640'.
               05  FILLER   PIC X(13)  VALUE    '331518 012853'.
               05  FILLER   PIC X(13)  VALUE    '331519 012853'.
               05  FILLER   PIC X(13)  VALUE    '331520 012853'.
               05  FILLER   PIC X(13)  VALUE    '331521 012211'.
               05  FILLER   PIC X(13)  VALUE    '331522 012853'.
               05  FILLER   PIC X(13)  VALUE    '331523 008640'.
               05  FILLER   PIC X(13)  VALUE    '331524 008640'.
               05  FILLER   PIC X(13)  VALUE    '331525 012853'.
               05  FILLER   PIC X(13)  VALUE    '331526 008640'.
               05  FILLER   PIC X(13)  VALUE    '331527 012211'.
               05  FILLER   PIC X(13)  VALUE    '331528 008640'.
               05  FILLER   PIC X(13)  VALUE    '331529 012853'.
               05  FILLER   PIC X(13)  VALUE    '331530 010280'.
               05  FILLER   PIC X(13)  VALUE    '331531 008640'.
               05  FILLER   PIC X(13)  VALUE    '331532 013348'.
               05  FILLER   PIC X(13)  VALUE    '331535 013348'.
               05  FILLER   PIC X(13)  VALUE    '331537 013348'.
               05  FILLER   PIC X(13)  VALUE    '331539 009977'.
               05  FILLER   PIC X(13)  VALUE    '331540 008640'.
               05  FILLER   PIC X(13)  VALUE    '331542 012853'.
               05  FILLER   PIC X(13)  VALUE    '331544 013348'.
               05  FILLER   PIC X(13)  VALUE    '331546 013348'.
               05  FILLER   PIC X(13)  VALUE    '331547 008640'.
               05  FILLER   PIC X(13)  VALUE    '331548 008640'.
               05  FILLER   PIC X(13)  VALUE    '331549 008640'.
               05  FILLER   PIC X(13)  VALUE    '331550 008640'.
               05  FILLER   PIC X(13)  VALUE    '331551 012853'.
               05  FILLER   PIC X(13)  VALUE    '331553 008640'.
               05  FILLER   PIC X(13)  VALUE    '331554 008640'.
               05  FILLER   PIC X(13)  VALUE    '331555 008673'.
               05  FILLER   PIC X(13)  VALUE    '331556 008640'.
               05  FILLER   PIC X(13)  VALUE    '331557 008640'.
               05  FILLER   PIC X(13)  VALUE    '331560 012853'.
               05  FILLER   PIC X(13)  VALUE    '331561 013348'.
               05  FILLER   PIC X(13)  VALUE    '331562 012853'.
               05  FILLER   PIC X(13)  VALUE    '331563 012853'.
               05  FILLER   PIC X(13)  VALUE    '331564 012853'.
               05  FILLER   PIC X(13)  VALUE    '332006 012853'.
               05  FILLER   PIC X(13)  VALUE    '332008 012853'.
               05  FILLER   PIC X(13)  VALUE    '333030 012853'.
               05  FILLER   PIC X(13)  VALUE    '333301 012853'.
               05  FILLER   PIC X(13)  VALUE    '334001 009977'.
               05  FILLER   PIC X(13)  VALUE    '334002 012853'.
               05  FILLER   PIC X(13)  VALUE    '334003 008640'.
               05  FILLER   PIC X(13)  VALUE    '334004 012913'.
               05  FILLER   PIC X(13)  VALUE    '334009 012853'.
               05  FILLER   PIC X(13)  VALUE    '334012 008640'.
               05  FILLER   PIC X(13)  VALUE    '334013 013348'.
               05  FILLER   PIC X(13)  VALUE    '334015 012853'.
               05  FILLER   PIC X(13)  VALUE    '334020 008640'.
               05  FILLER   PIC X(13)  VALUE    '334021 008893'.
               05  FILLER   PIC X(13)  VALUE    '334022 010280'.
               05  FILLER   PIC X(13)  VALUE    '334026 013348'.
               05  FILLER   PIC X(13)  VALUE    '334027 013348'.
               05  FILLER   PIC X(13)  VALUE    '334043 012853'.
               05  FILLER   PIC X(13)  VALUE    '334045 008702'.
               05  FILLER   PIC X(13)  VALUE    '334046 008640'.
               05  FILLER   PIC X(13)  VALUE    '334048 012853'.
               05  FILLER   PIC X(13)  VALUE    '334049 008645'.
               05  FILLER   PIC X(13)  VALUE    '334052 010280'.
               05  FILLER   PIC X(13)  VALUE    '334053 012853'.
               05  FILLER   PIC X(13)  VALUE    '334054 012853'.
               05  FILLER   PIC X(13)  VALUE    '334060 012853'.
               05  FILLER   PIC X(13)  VALUE    '334061 012853'.
               05  FILLER   PIC X(13)  VALUE    '334063 012853'.
               05  FILLER   PIC X(13)  VALUE    '334604 012853'.
               05  FILLER   PIC X(13)  VALUE    '337032 008640'.
               05  FILLER   PIC X(13)  VALUE    '337075 008640'.
               05  FILLER   PIC X(13)  VALUE    '337076 008640'.
               05  FILLER   PIC X(13)  VALUE    '337147 013348'.
               05  FILLER   PIC X(13)  VALUE    '337173 008640'.
               05  FILLER   PIC X(13)  VALUE    '337197 013348'.
               05  FILLER   PIC X(13)  VALUE    '337299 012853'.
               05  FILLER   PIC X(13)  VALUE    '337374 012853'.
               05  FILLER   PIC X(13)  VALUE    '337415 008640'.
               05  FILLER   PIC X(13)  VALUE    '337428 012853'.
               05  FILLER   PIC X(13)  VALUE    '337431 012853'.
               05  FILLER   PIC X(13)  VALUE    '337434 012853'.
               05  FILLER   PIC X(13)  VALUE    '337436 012853'.
               05  FILLER   PIC X(13)  VALUE    '337438 013348'.
               05  FILLER   PIC X(13)  VALUE    '337439 012853'.
               05  FILLER   PIC X(13)  VALUE    '337440 012853'.
               05  FILLER   PIC X(13)  VALUE    '34B115 008239'.
               05  FILLER   PIC X(13)  VALUE    '34S001 009422'.
               05  FILLER   PIC X(13)  VALUE    '34S002 008959'.
               05  FILLER   PIC X(13)  VALUE    '34S013 007850'.
               05  FILLER   PIC X(13)  VALUE    '34S014 009158'.
               05  FILLER   PIC X(13)  VALUE    '34S015 009422'.
               05  FILLER   PIC X(13)  VALUE    '34S023 008959'.
               05  FILLER   PIC X(13)  VALUE    '34S030 009847'.
               05  FILLER   PIC X(13)  VALUE    '34S036 009413'.
               05  FILLER   PIC X(13)  VALUE    '34S037 008053'.
               05  FILLER   PIC X(13)  VALUE    '34S040 009431'.
               05  FILLER   PIC X(13)  VALUE    '34S047 009158'.
               05  FILLER   PIC X(13)  VALUE    '34S053 009422'.
               05  FILLER   PIC X(13)  VALUE    '34S061 009847'.
               05  FILLER   PIC X(13)  VALUE    '34S070 009098'.
               05  FILLER   PIC X(13)  VALUE    '34S085 009158'.
               05  FILLER   PIC X(13)  VALUE    '34S090 009413'.
               05  FILLER   PIC X(13)  VALUE    '34S091 008727'.
               05  FILLER   PIC X(13)  VALUE    '34S099 007850'.
               05  FILLER   PIC X(13)  VALUE    '34S113 009422'.
               05  FILLER   PIC X(13)  VALUE    '34S115 007992'.
               05  FILLER   PIC X(13)  VALUE    '34S116 008796'.
               05  FILLER   PIC X(13)  VALUE    '34S119 009422'.
               05  FILLER   PIC X(13)  VALUE    '34S120 007850'.
               05  FILLER   PIC X(13)  VALUE    '34S124 007850'.
               05  FILLER   PIC X(13)  VALUE    '34S141 008802'.
               05  FILLER   PIC X(13)  VALUE    '34S143 008796'.
               05  FILLER   PIC X(13)  VALUE    '34S144 009422'.
               05  FILLER   PIC X(13)  VALUE    '34S151 008046'.
               05  FILLER   PIC X(13)  VALUE    '34S155 009847'.
               05  FILLER   PIC X(13)  VALUE    '34S184 008959'.
               05  FILLER   PIC X(13)  VALUE    '34S186 008389'.
               05  FILLER   PIC X(13)  VALUE    '34T004 008727'.
               05  FILLER   PIC X(13)  VALUE    '34T008 007850'.
               05  FILLER   PIC X(13)  VALUE    '34T015 009422'.
               05  FILLER   PIC X(13)  VALUE    '34T027 008014'.
               05  FILLER   PIC X(13)  VALUE    '34T028 008239'.
               05  FILLER   PIC X(13)  VALUE    '34T040 009431'.
               05  FILLER   PIC X(13)  VALUE    '34T047 009158'.
               05  FILLER   PIC X(13)  VALUE    '34T061 009847'.
               05  FILLER   PIC X(13)  VALUE    '34T069 009524'.
               05  FILLER   PIC X(13)  VALUE    '34T091 008727'.
               05  FILLER   PIC X(13)  VALUE    '34T097 007850'.
               05  FILLER   PIC X(13)  VALUE    '34T098 009422'.
               05  FILLER   PIC X(13)  VALUE    '34T107 008586'.
               05  FILLER   PIC X(13)  VALUE    '34T113 009422'.
               05  FILLER   PIC X(13)  VALUE    '34T115 007992'.
               05  FILLER   PIC X(13)  VALUE    '34T116 008796'.
               05  FILLER   PIC X(13)  VALUE    '34T131 008149'.
               05  FILLER   PIC X(13)  VALUE    '34T132 007850'.
               05  FILLER   PIC X(13)  VALUE    '34T141 008802'.
               05  FILLER   PIC X(13)  VALUE    '34T143 008796'.
               05  FILLER   PIC X(13)  VALUE    '34T147 008586'.
               05  FILLER   PIC X(13)  VALUE    '34T155 009847'.
               05  FILLER   PIC X(13)  VALUE    '34U024 007850'.
               05  FILLER   PIC X(13)  VALUE    '340001 009422'.
               05  FILLER   PIC X(13)  VALUE    '340002 008889'.
               05  FILLER   PIC X(13)  VALUE    '340003 007850'.
               05  FILLER   PIC X(13)  VALUE    '340004 009399'.
               05  FILLER   PIC X(13)  VALUE    '340008 007850'.
               05  FILLER   PIC X(13)  VALUE    '340010 008997'.
               05  FILLER   PIC X(13)  VALUE    '340013 009298'.
               05  FILLER   PIC X(13)  VALUE    '340014 009158'.
               05  FILLER   PIC X(13)  VALUE    '340015 009422'.
               05  FILLER   PIC X(13)  VALUE    '340016 007850'.
               05  FILLER   PIC X(13)  VALUE    '340017 008959'.
               05  FILLER   PIC X(13)  VALUE    '340020 008179'.
               05  FILLER   PIC X(13)  VALUE    '340021 009298'.
               05  FILLER   PIC X(13)  VALUE    '340023 008889'.
               05  FILLER   PIC X(13)  VALUE    '340024 008038'.
               05  FILLER   PIC X(13)  VALUE    '340027 008963'.
               05  FILLER   PIC X(13)  VALUE    '340028 008997'.
               05  FILLER   PIC X(13)  VALUE    '340030 009847'.
               05  FILLER   PIC X(13)  VALUE    '340032 009422'.
               05  FILLER   PIC X(13)  VALUE    '340036 009413'.
               05  FILLER   PIC X(13)  VALUE    '340037 008053'.
               05  FILLER   PIC X(13)  VALUE    '340039 009422'.
               05  FILLER   PIC X(13)  VALUE    '340040 009431'.
               05  FILLER   PIC X(13)  VALUE    '340041 008703'.
               05  FILLER   PIC X(13)  VALUE    '340042 008149'.
               05  FILLER   PIC X(13)  VALUE    '340047 009158'.
               05  FILLER   PIC X(13)  VALUE    '340049 009847'.
               05  FILLER   PIC X(13)  VALUE    '340050 008239'.
               05  FILLER   PIC X(13)  VALUE    '340051 008703'.
               05  FILLER   PIC X(13)  VALUE    '340053 009422'.
               05  FILLER   PIC X(13)  VALUE    '340060 008727'.
               05  FILLER   PIC X(13)  VALUE    '340061 009847'.
               05  FILLER   PIC X(13)  VALUE    '340064 007850'.
               05  FILLER   PIC X(13)  VALUE    '340068 008605'.
               05  FILLER   PIC X(13)  VALUE    '340069 009524'.
               05  FILLER   PIC X(13)  VALUE    '340070 009399'.
               05  FILLER   PIC X(13)  VALUE    '340071 008997'.
               05  FILLER   PIC X(13)  VALUE    '340073 009524'.
               05  FILLER   PIC X(13)  VALUE    '340075 008703'.
               05  FILLER   PIC X(13)  VALUE    '340084 008190'.
               05  FILLER   PIC X(13)  VALUE    '340085 009158'.
               05  FILLER   PIC X(13)  VALUE    '340087 007850'.
               05  FILLER   PIC X(13)  VALUE    '340090 009413'.
               05  FILLER   PIC X(13)  VALUE    '340091 009399'.
               05  FILLER   PIC X(13)  VALUE    '340096 009158'.
               05  FILLER   PIC X(13)  VALUE    '340097 007850'.
               05  FILLER   PIC X(13)  VALUE    '340098 009422'.
               05  FILLER   PIC X(13)  VALUE    '340099 007850'.
               05  FILLER   PIC X(13)  VALUE    '340106 007850'.
               05  FILLER   PIC X(13)  VALUE    '340107 008586'.
               05  FILLER   PIC X(13)  VALUE    '340109 008852'.
               05  FILLER   PIC X(13)  VALUE    '340113 009422'.
               05  FILLER   PIC X(13)  VALUE    '340114 009524'.
               05  FILLER   PIC X(13)  VALUE    '340115 009399'.
               05  FILLER   PIC X(13)  VALUE    '340116 009298'.
               05  FILLER   PIC X(13)  VALUE    '340119 009422'.
               05  FILLER   PIC X(13)  VALUE    '340120 007850'.
               05  FILLER   PIC X(13)  VALUE    '340123 009298'.
               05  FILLER   PIC X(13)  VALUE    '340126 008963'.
               05  FILLER   PIC X(13)  VALUE    '340127 009399'.
               05  FILLER   PIC X(13)  VALUE    '340129 009422'.
               05  FILLER   PIC X(13)  VALUE    '340130 009422'.
               05  FILLER   PIC X(13)  VALUE    '340131 008963'.
               05  FILLER   PIC X(13)  VALUE    '340132 007850'.
               05  FILLER   PIC X(13)  VALUE    '340133 007850'.
               05  FILLER   PIC X(13)  VALUE    '340141 008802'.
               05  FILLER   PIC X(13)  VALUE    '340142 007928'.
               05  FILLER   PIC X(13)  VALUE    '340143 009298'.
               05  FILLER   PIC X(13)  VALUE    '340144 009422'.
               05  FILLER   PIC X(13)  VALUE    '340145 009422'.
               05  FILLER   PIC X(13)  VALUE    '340147 008997'.
               05  FILLER   PIC X(13)  VALUE    '340148 009158'.
               05  FILLER   PIC X(13)  VALUE    '340151 008046'.
               05  FILLER   PIC X(13)  VALUE    '340153 009422'.
               05  FILLER   PIC X(13)  VALUE    '340155 009847'.
               05  FILLER   PIC X(13)  VALUE    '340156 014448'.
               05  FILLER   PIC X(13)  VALUE    '340158 008336'.
               05  FILLER   PIC X(13)  VALUE    '340159 009847'.
               05  FILLER   PIC X(13)  VALUE    '340166 009422'.
               05  FILLER   PIC X(13)  VALUE    '340168 008802'.
               05  FILLER   PIC X(13)  VALUE    '340171 009422'.
               05  FILLER   PIC X(13)  VALUE    '340173 009524'.
               05  FILLER   PIC X(13)  VALUE    '340183 009422'.
               05  FILLER   PIC X(13)  VALUE    '340184 008959'.
               05  FILLER   PIC X(13)  VALUE    '340186 008389'.
               05  FILLER   PIC X(13)  VALUE    '340187 009158'.
               05  FILLER   PIC X(13)  VALUE    '340188 008239'.
               05  FILLER   PIC X(13)  VALUE    '341560 009413'.
               05  FILLER   PIC X(13)  VALUE    '341587 009413'.
               05  FILLER   PIC X(13)  VALUE    '341595 007850'.
               05  FILLER   PIC X(13)  VALUE    '341596 007850'.
               05  FILLER   PIC X(13)  VALUE    '341597 007850'.
               05  FILLER   PIC X(13)  VALUE    '342012 008727'.
               05  FILLER   PIC X(13)  VALUE    '342013 008586'.
               05  FILLER   PIC X(13)  VALUE    '342014 008239'.
               05  FILLER   PIC X(13)  VALUE    '342015 009422'.
               05  FILLER   PIC X(13)  VALUE    '342020 008727'.
               05  FILLER   PIC X(13)  VALUE    '343025 008959'.
               05  FILLER   PIC X(13)  VALUE    '343026 009422'.
               05  FILLER   PIC X(13)  VALUE    '343027 009158'.
               05  FILLER   PIC X(13)  VALUE    '344007 009158'.
               05  FILLER   PIC X(13)  VALUE    '344014 009524'.
               05  FILLER   PIC X(13)  VALUE    '344032 009524'.
               05  FILLER   PIC X(13)  VALUE    '344033 009431'.
               05  FILLER   PIC X(13)  VALUE    '344653 009422'.
               05  FILLER   PIC X(13)  VALUE    '35S002 010000'.
               05  FILLER   PIC X(13)  VALUE    '35S006 010000'.
               05  FILLER   PIC X(13)  VALUE    '35S011 009013'.
               05  FILLER   PIC X(13)  VALUE    '35S015 010000'.
               05  FILLER   PIC X(13)  VALUE    '35T006 010000'.
               05  FILLER   PIC X(13)  VALUE    '35T011 009013'.
               05  FILLER   PIC X(13)  VALUE    '35T019 009013'.
               05  FILLER   PIC X(13)  VALUE    '35U006 010000'.
               05  FILLER   PIC X(13)  VALUE    '350002 010000'.
               05  FILLER   PIC X(13)  VALUE    '350006 010000'.
               05  FILLER   PIC X(13)  VALUE    '350011 010000'.
               05  FILLER   PIC X(13)  VALUE    '350015 010000'.
               05  FILLER   PIC X(13)  VALUE    '350019 010000'.
               05  FILLER   PIC X(13)  VALUE    '350063 014448'.
               05  FILLER   PIC X(13)  VALUE    '350064 010000'.
               05  FILLER   PIC X(13)  VALUE    '350070 010000'.
               05  FILLER   PIC X(13)  VALUE    '351500 009013'.
               05  FILLER   PIC X(13)  VALUE    '351501 009013'.
               05  FILLER   PIC X(13)  VALUE    '351502 010000'.
               05  FILLER   PIC X(13)  VALUE    '351504 010000'.
               05  FILLER   PIC X(13)  VALUE    '351505 010000'.
               05  FILLER   PIC X(13)  VALUE    '351506 010000'.
               05  FILLER   PIC X(13)  VALUE    '351507 010000'.
               05  FILLER   PIC X(13)  VALUE    '351509 010000'.
               05  FILLER   PIC X(13)  VALUE    '351510 010000'.
               05  FILLER   PIC X(13)  VALUE    '351511 010000'.
               05  FILLER   PIC X(13)  VALUE    '351512 010000'.
               05  FILLER   PIC X(13)  VALUE    '352004 010000'.
               05  FILLER   PIC X(13)  VALUE    '352005 010000'.
               05  FILLER   PIC X(13)  VALUE    '354004 010000'.
               05  FILLER   PIC X(13)  VALUE    '354501 010000'.
               05  FILLER   PIC X(13)  VALUE    '354502 010000'.
               05  FILLER   PIC X(13)  VALUE    '354503 010000'.
               05  FILLER   PIC X(13)  VALUE    '36B019 007993'.
               05  FILLER   PIC X(13)  VALUE    '36B020 008829'.
               05  FILLER   PIC X(13)  VALUE    '36S002 007993'.
               05  FILLER   PIC X(13)  VALUE    '36S003 009203'.
               05  FILLER   PIC X(13)  VALUE    '36S006 009549'.
               05  FILLER   PIC X(13)  VALUE    '36S011 009256'.
               05  FILLER   PIC X(13)  VALUE    '36S013 008489'.
               05  FILLER   PIC X(13)  VALUE    '36S020 008585'.
               05  FILLER   PIC X(13)  VALUE    '36S027 008585'.
               05  FILLER   PIC X(13)  VALUE    '36S032 008489'.
               05  FILLER   PIC X(13)  VALUE    '36S035 009549'.
               05  FILLER   PIC X(13)  VALUE    '36S037 008829'.
               05  FILLER   PIC X(13)  VALUE    '36S039 007993'.
               05  FILLER   PIC X(13)  VALUE    '36S041 008829'.
               05  FILLER   PIC X(13)  VALUE    '36S044 007993'.
               05  FILLER   PIC X(13)  VALUE    '36S048 008671'.
               05  FILLER   PIC X(13)  VALUE    '36S051 009256'.
               05  FILLER   PIC X(13)  VALUE    '36S054 007993'.
               05  FILLER   PIC X(13)  VALUE    '36S055 008585'.
               05  FILLER   PIC X(13)  VALUE    '36S059 008829'.
               05  FILLER   PIC X(13)  VALUE    '36S064 008585'.
               05  FILLER   PIC X(13)  VALUE    '36S069 008671'.
               05  FILLER   PIC X(13)  VALUE    '36S076 009203'.
               05  FILLER   PIC X(13)  VALUE    '36S081 008671'.
               05  FILLER   PIC X(13)  VALUE    '36S082 008829'.
               05  FILLER   PIC X(13)  VALUE    '36S085 009549'.
               05  FILLER   PIC X(13)  VALUE    '36S087 008829'.
               05  FILLER   PIC X(13)  VALUE    '36S095 008489'.
               05  FILLER   PIC X(13)  VALUE    '36S096 007894'.
               05  FILLER   PIC X(13)  VALUE    '36S098 008829'.
               05  FILLER   PIC X(13)  VALUE    '36S100 009076'.
               05  FILLER   PIC X(13)  VALUE    '36S101 008829'.
               05  FILLER   PIC X(13)  VALUE    '36S106 007993'.
               05  FILLER   PIC X(13)  VALUE    '36S125 008585'.
               05  FILLER   PIC X(13)  VALUE    '36S131 007993'.
               05  FILLER   PIC X(13)  VALUE    '36S132 009203'.
               05  FILLER   PIC X(13)  VALUE    '36S133 009203'.
               05  FILLER   PIC X(13)  VALUE    '36S134 009203'.
               05  FILLER   PIC X(13)  VALUE    '36S137 008829'.
               05  FILLER   PIC X(13)  VALUE    '36S142 007993'.
               05  FILLER   PIC X(13)  VALUE    '36S143 008829'.
               05  FILLER   PIC X(13)  VALUE    '36S145 008829'.
               05  FILLER   PIC X(13)  VALUE    '36S147 007993'.
               05  FILLER   PIC X(13)  VALUE    '36S153 007335'.
               05  FILLER   PIC X(13)  VALUE    '36S155 008829'.
               05  FILLER   PIC X(13)  VALUE    '36S156 008896'.
               05  FILLER   PIC X(13)  VALUE    '36S161 007894'.
               05  FILLER   PIC X(13)  VALUE    '36S163 009203'.
               05  FILLER   PIC X(13)  VALUE    '36S172 008829'.
               05  FILLER   PIC X(13)  VALUE    '36S174 008823'.
               05  FILLER   PIC X(13)  VALUE    '36S175 007993'.
               05  FILLER   PIC X(13)  VALUE    '36S178 009203'.
               05  FILLER   PIC X(13)  VALUE    '36S189 009743'.
               05  FILLER   PIC X(13)  VALUE    '36S192 008829'.
               05  FILLER   PIC X(13)  VALUE    '36S211 007993'.
               05  FILLER   PIC X(13)  VALUE    '36S212 008829'.
               05  FILLER   PIC X(13)  VALUE    '36S234 009203'.
               05  FILLER   PIC X(13)  VALUE    '36S236 009203'.
               05  FILLER   PIC X(13)  VALUE    '36S239 008823'.
               05  FILLER   PIC X(13)  VALUE    '36T001 009203'.
               05  FILLER   PIC X(13)  VALUE    '36T008 008250'.
               05  FILLER   PIC X(13)  VALUE    '36T009 008713'.
               05  FILLER   PIC X(13)  VALUE    '36T010 007993'.
               05  FILLER   PIC X(13)  VALUE    '36T011 007993'.
               05  FILLER   PIC X(13)  VALUE    '36T016 009203'.
               05  FILLER   PIC X(13)  VALUE    '36T017 009549'.
               05  FILLER   PIC X(13)  VALUE    '36T025 008540'.
               05  FILLER   PIC X(13)  VALUE    '36T032 008489'.
               05  FILLER   PIC X(13)  VALUE    '36T036 008585'.
               05  FILLER   PIC X(13)  VALUE    '36T041 008829'.
               05  FILLER   PIC X(13)  VALUE    '36T051 009256'.
               05  FILLER   PIC X(13)  VALUE    '36T054 007993'.
               05  FILLER   PIC X(13)  VALUE    '36T056 009203'.
               05  FILLER   PIC X(13)  VALUE    '36T059 008829'.
               05  FILLER   PIC X(13)  VALUE    '36T064 008585'.
               05  FILLER   PIC X(13)  VALUE    '36T066 008713'.
               05  FILLER   PIC X(13)  VALUE    '36T070 008585'.
               05  FILLER   PIC X(13)  VALUE    '36T072 009549'.
               05  FILLER   PIC X(13)  VALUE    '36T076 009203'.
               05  FILLER   PIC X(13)  VALUE    '36T079 009256'.
               05  FILLER   PIC X(13)  VALUE    '36T081 008671'.
               05  FILLER   PIC X(13)  VALUE    '36T084 008585'.
               05  FILLER   PIC X(13)  VALUE    '36T085 009549'.
               05  FILLER   PIC X(13)  VALUE    '36T086 009256'.
               05  FILLER   PIC X(13)  VALUE    '36T098 008829'.
               05  FILLER   PIC X(13)  VALUE    '36T100 009076'.
               05  FILLER   PIC X(13)  VALUE    '36T112 008671'.
               05  FILLER   PIC X(13)  VALUE    '36T113 009203'.
               05  FILLER   PIC X(13)  VALUE    '36T118 008243'.
               05  FILLER   PIC X(13)  VALUE    '36T121 007993'.
               05  FILLER   PIC X(13)  VALUE    '36T141 007894'.
               05  FILLER   PIC X(13)  VALUE    '36T143 008829'.
               05  FILLER   PIC X(13)  VALUE    '36T147 007335'.
               05  FILLER   PIC X(13)  VALUE    '36T152 009549'.
               05  FILLER   PIC X(13)  VALUE    '36T155 008829'.
               05  FILLER   PIC X(13)  VALUE    '36T163 009203'.
               05  FILLER   PIC X(13)  VALUE    '36T172 008829'.
               05  FILLER   PIC X(13)  VALUE    '36T174 008823'.
               05  FILLER   PIC X(13)  VALUE    '36T175 008595'.
               05  FILLER   PIC X(13)  VALUE    '36T187 008883'.
               05  FILLER   PIC X(13)  VALUE    '36T211 007677'.
               05  FILLER   PIC X(13)  VALUE    '36T212 008829'.
               05  FILLER   PIC X(13)  VALUE    '36T218 009549'.
               05  FILLER   PIC X(13)  VALUE    '36T234 009203'.
               05  FILLER   PIC X(13)  VALUE    '36U109 007993'.
               05  FILLER   PIC X(13)  VALUE    '36U197 007993'.
               05  FILLER   PIC X(13)  VALUE    '36Z318 007993'.
               05  FILLER   PIC X(13)  VALUE    '36Z327 007993'.
               05  FILLER   PIC X(13)  VALUE    '36Z328 007993'.
               05  FILLER   PIC X(13)  VALUE    '360001 009203'.
               05  FILLER   PIC X(13)  VALUE    '360002 007993'.
               05  FILLER   PIC X(13)  VALUE    '360003 009203'.
               05  FILLER   PIC X(13)  VALUE    '360006 009549'.
               05  FILLER   PIC X(13)  VALUE    '360008 008250'.
               05  FILLER   PIC X(13)  VALUE    '360009 008713'.
               05  FILLER   PIC X(13)  VALUE    '360010 008019'.
               05  FILLER   PIC X(13)  VALUE    '360011 009256'.
               05  FILLER   PIC X(13)  VALUE    '360012 009549'.
               05  FILLER   PIC X(13)  VALUE    '360013 008489'.
               05  FILLER   PIC X(13)  VALUE    '360014 009256'.
               05  FILLER   PIC X(13)  VALUE    '360016 009203'.
               05  FILLER   PIC X(13)  VALUE    '360017 009549'.
               05  FILLER   PIC X(13)  VALUE    '360019 008585'.
               05  FILLER   PIC X(13)  VALUE    '360020 008585'.
               05  FILLER   PIC X(13)  VALUE    '360025 008540'.
               05  FILLER   PIC X(13)  VALUE    '360026 008823'.
               05  FILLER   PIC X(13)  VALUE    '360027 008585'.
               05  FILLER   PIC X(13)  VALUE    '360029 008671'.
               05  FILLER   PIC X(13)  VALUE    '360032 008489'.
               05  FILLER   PIC X(13)  VALUE    '360035 009549'.
               05  FILLER   PIC X(13)  VALUE    '360036 008585'.
               05  FILLER   PIC X(13)  VALUE    '360037 008829'.
               05  FILLER   PIC X(13)  VALUE    '360039 009256'.
               05  FILLER   PIC X(13)  VALUE    '360040 008593'.
               05  FILLER   PIC X(13)  VALUE    '360041 008829'.
               05  FILLER   PIC X(13)  VALUE    '360044 008214'.
               05  FILLER   PIC X(13)  VALUE    '360046 009203'.
               05  FILLER   PIC X(13)  VALUE    '360048 008671'.
               05  FILLER   PIC X(13)  VALUE    '360051 009256'.
               05  FILLER   PIC X(13)  VALUE    '360052 008823'.
               05  FILLER   PIC X(13)  VALUE    '360054 007993'.
               05  FILLER   PIC X(13)  VALUE    '360055 008585'.
               05  FILLER   PIC X(13)  VALUE    '360056 009203'.
               05  FILLER   PIC X(13)  VALUE    '360058 007993'.
               05  FILLER   PIC X(13)  VALUE    '360059 008829'.
               05  FILLER   PIC X(13)  VALUE    '360064 008585'.
               05  FILLER   PIC X(13)  VALUE    '360065 008585'.
               05  FILLER   PIC X(13)  VALUE    '360066 008713'.
               05  FILLER   PIC X(13)  VALUE    '360068 009481'.
               05  FILLER   PIC X(13)  VALUE    '360070 008585'.
               05  FILLER   PIC X(13)  VALUE    '360071 008048'.
               05  FILLER   PIC X(13)  VALUE    '360072 009549'.
               05  FILLER   PIC X(13)  VALUE    '360074 008671'.
               05  FILLER   PIC X(13)  VALUE    '360075 008829'.
               05  FILLER   PIC X(13)  VALUE    '360076 009203'.
               05  FILLER   PIC X(13)  VALUE    '360077 008829'.
               05  FILLER   PIC X(13)  VALUE    '360078 008136'.
               05  FILLER   PIC X(13)  VALUE    '360079 009256'.
               05  FILLER   PIC X(13)  VALUE    '360080 007993'.
               05  FILLER   PIC X(13)  VALUE    '360081 008671'.
               05  FILLER   PIC X(13)  VALUE    '360082 008829'.
               05  FILLER   PIC X(13)  VALUE    '360084 008585'.
               05  FILLER   PIC X(13)  VALUE    '360085 009549'.
               05  FILLER   PIC X(13)  VALUE    '360086 009256'.
               05  FILLER   PIC X(13)  VALUE    '360087 008829'.
               05  FILLER   PIC X(13)  VALUE    '360089 007993'.
               05  FILLER   PIC X(13)  VALUE    '360090 008671'.
               05  FILLER   PIC X(13)  VALUE    '360091 008829'.
               05  FILLER   PIC X(13)  VALUE    '360092 009549'.
               05  FILLER   PIC X(13)  VALUE    '360095 008489'.
               05  FILLER   PIC X(13)  VALUE    '360096 007993'.
               05  FILLER   PIC X(13)  VALUE    '360098 008829'.
               05  FILLER   PIC X(13)  VALUE    '360107 008097'.
               05  FILLER   PIC X(13)  VALUE    '360109 009256'.
               05  FILLER   PIC X(13)  VALUE    '360112 008671'.
               05  FILLER   PIC X(13)  VALUE    '360118 008243'.
               05  FILLER   PIC X(13)  VALUE    '360121 008540'.
               05  FILLER   PIC X(13)  VALUE    '360123 008829'.
               05  FILLER   PIC X(13)  VALUE    '360125 008585'.
               05  FILLER   PIC X(13)  VALUE    '360131 008034'.
               05  FILLER   PIC X(13)  VALUE    '360132 009203'.
               05  FILLER   PIC X(13)  VALUE    '360133 009203'.
               05  FILLER   PIC X(13)  VALUE    '360134 009203'.
               05  FILLER   PIC X(13)  VALUE    '360137 008829'.
               05  FILLER   PIC X(13)  VALUE    '360141 008585'.
               05  FILLER   PIC X(13)  VALUE    '360143 008829'.
               05  FILLER   PIC X(13)  VALUE    '360144 008829'.
               05  FILLER   PIC X(13)  VALUE    '360145 008829'.
               05  FILLER   PIC X(13)  VALUE    '360147 007993'.
               05  FILLER   PIC X(13)  VALUE    '360148 007993'.
               05  FILLER   PIC X(13)  VALUE    '360150 008585'.
               05  FILLER   PIC X(13)  VALUE    '360151 008585'.
               05  FILLER   PIC X(13)  VALUE    '360152 009549'.
               05  FILLER   PIC X(13)  VALUE    '360153 007993'.
               05  FILLER   PIC X(13)  VALUE    '360155 008829'.
               05  FILLER   PIC X(13)  VALUE    '360156 008097'.
               05  FILLER   PIC X(13)  VALUE    '360159 009256'.
               05  FILLER   PIC X(13)  VALUE    '360161 008058'.
               05  FILLER   PIC X(13)  VALUE    '360163 009203'.
               05  FILLER   PIC X(13)  VALUE    '360170 009549'.
               05  FILLER   PIC X(13)  VALUE    '360172 008829'.
               05  FILLER   PIC X(13)  VALUE    '360174 008823'.
               05  FILLER   PIC X(13)  VALUE    '360175 008221'.
               05  FILLER   PIC X(13)  VALUE    '360179 009203'.
               05  FILLER   PIC X(13)  VALUE    '360180 008829'.
               05  FILLER   PIC X(13)  VALUE    '360185 008272'.
               05  FILLER   PIC X(13)  VALUE    '360189 009549'.
               05  FILLER   PIC X(13)  VALUE    '360192 008829'.
               05  FILLER   PIC X(13)  VALUE    '360195 008829'.
               05  FILLER   PIC X(13)  VALUE    '360197 009256'.
               05  FILLER   PIC X(13)  VALUE    '360203 007993'.
               05  FILLER   PIC X(13)  VALUE    '360210 009549'.
               05  FILLER   PIC X(13)  VALUE    '360211 008040'.
               05  FILLER   PIC X(13)  VALUE    '360212 008829'.
               05  FILLER   PIC X(13)  VALUE    '360218 009549'.
               05  FILLER   PIC X(13)  VALUE    '360230 008829'.
               05  FILLER   PIC X(13)  VALUE    '360234 009203'.
               05  FILLER   PIC X(13)  VALUE    '360236 009203'.
               05  FILLER   PIC X(13)  VALUE    '360239 008823'.
               05  FILLER   PIC X(13)  VALUE    '360241 008585'.
               05  FILLER   PIC X(13)  VALUE    '360242 009549'.
               05  FILLER   PIC X(13)  VALUE    '360245 008585'.
               05  FILLER   PIC X(13)  VALUE    '360247 009549'.
               05  FILLER   PIC X(13)  VALUE    '360259 008671'.
               05  FILLER   PIC X(13)  VALUE    '360261 008369'.
               05  FILLER   PIC X(13)  VALUE    '360262 008671'.
               05  FILLER   PIC X(13)  VALUE    '360263 008713'.
               05  FILLER   PIC X(13)  VALUE    '360266 009549'.
               05  FILLER   PIC X(13)  VALUE    '360270 007993'.
               05  FILLER   PIC X(13)  VALUE    '360274 008823'.
               05  FILLER   PIC X(13)  VALUE    '360276 007993'.
               05  FILLER   PIC X(13)  VALUE    '360348 009549'.
               05  FILLER   PIC X(13)  VALUE    '360351 008585'.
               05  FILLER   PIC X(13)  VALUE    '360352 007993'.
               05  FILLER   PIC X(13)  VALUE    '360354 009203'.
               05  FILLER   PIC X(13)  VALUE    '360355 008712'.
               05  FILLER   PIC X(13)  VALUE    '360358 009549'.
               05  FILLER   PIC X(13)  VALUE    '360359 008829'.
               05  FILLER   PIC X(13)  VALUE    '360360 008823'.
               05  FILLER   PIC X(13)  VALUE    '360361 007993'.
               05  FILLER   PIC X(13)  VALUE    '360362 009203'.
               05  FILLER   PIC X(13)  VALUE    '360363 007993'.
               05  FILLER   PIC X(13)  VALUE    '360364 008829'.
               05  FILLER   PIC X(13)  VALUE    '360365 008243'.
               05  FILLER   PIC X(13)  VALUE    '361556 007993'.
               05  FILLER   PIC X(13)  VALUE    '361560 009203'.
               05  FILLER   PIC X(13)  VALUE    '361577 008671'.
               05  FILLER   PIC X(13)  VALUE    '361584 008829'.
               05  FILLER   PIC X(13)  VALUE    '361589 008823'.
               05  FILLER   PIC X(13)  VALUE    '361591 007993'.
               05  FILLER   PIC X(13)  VALUE    '361595 007993'.
               05  FILLER   PIC X(13)  VALUE    '361610 007993'.
               05  FILLER   PIC X(13)  VALUE    '361620 009549'.
               05  FILLER   PIC X(13)  VALUE    '361621 009549'.
               05  FILLER   PIC X(13)  VALUE    '361644 008829'.
               05  FILLER   PIC X(13)  VALUE    '361645 009549'.
               05  FILLER   PIC X(13)  VALUE    '361646 009549'.
               05  FILLER   PIC X(13)  VALUE    '361647 008823'.
               05  FILLER   PIC X(13)  VALUE    '361648 007993'.
               05  FILLER   PIC X(13)  VALUE    '361649 008369'.
               05  FILLER   PIC X(13)  VALUE    '361650 007335'.
               05  FILLER   PIC X(13)  VALUE    '361651 008671'.
               05  FILLER   PIC X(13)  VALUE    '361652 007993'.
               05  FILLER   PIC X(13)  VALUE    '361653 008369'.
               05  FILLER   PIC X(13)  VALUE    '361654 008823'.
               05  FILLER   PIC X(13)  VALUE    '361655 009203'.
               05  FILLER   PIC X(13)  VALUE    '361656 008829'.
               05  FILLER   PIC X(13)  VALUE    '361657 008136'.
               05  FILLER   PIC X(13)  VALUE    '361658 008829'.
               05  FILLER   PIC X(13)  VALUE    '361659 009549'.
               05  FILLER   PIC X(13)  VALUE    '361660 008823'.
               05  FILLER   PIC X(13)  VALUE    '361662 007993'.
               05  FILLER   PIC X(13)  VALUE    '361664 009203'.
               05  FILLER   PIC X(13)  VALUE    '361665 009549'.
               05  FILLER   PIC X(13)  VALUE    '361666 008829'.
               05  FILLER   PIC X(13)  VALUE    '361668 007993'.
               05  FILLER   PIC X(13)  VALUE    '361669 008136'.
               05  FILLER   PIC X(13)  VALUE    '361670 008829'.
               05  FILLER   PIC X(13)  VALUE    '362004 009203'.
               05  FILLER   PIC X(13)  VALUE    '362007 007993'.
               05  FILLER   PIC X(13)  VALUE    '362015 008829'.
               05  FILLER   PIC X(13)  VALUE    '362016 008034'.
               05  FILLER   PIC X(13)  VALUE    '362019 009203'.
               05  FILLER   PIC X(13)  VALUE    '362020 008713'.
               05  FILLER   PIC X(13)  VALUE    '362022 009549'.
               05  FILLER   PIC X(13)  VALUE    '362023 007993'.
               05  FILLER   PIC X(13)  VALUE    '362024 007993'.
               05  FILLER   PIC X(13)  VALUE    '362026 008829'.
               05  FILLER   PIC X(13)  VALUE    '362027 008273'.
               05  FILLER   PIC X(13)  VALUE    '362028 008823'.
               05  FILLER   PIC X(13)  VALUE    '362029 008829'.
               05  FILLER   PIC X(13)  VALUE    '362031 009549'.
               05  FILLER   PIC X(13)  VALUE    '362033 008823'.
               05  FILLER   PIC X(13)  VALUE    '362035 007993'.
               05  FILLER   PIC X(13)  VALUE    '362036 008671'.
               05  FILLER   PIC X(13)  VALUE    '362037 009549'.
               05  FILLER   PIC X(13)  VALUE    '362038 008671'.
               05  FILLER   PIC X(13)  VALUE    '363026 008058'.
               05  FILLER   PIC X(13)  VALUE    '363033 008823'.
               05  FILLER   PIC X(13)  VALUE    '363034 009203'.
               05  FILLER   PIC X(13)  VALUE    '363037 009549'.
               05  FILLER   PIC X(13)  VALUE    '363038 008829'.
               05  FILLER   PIC X(13)  VALUE    '363040 008671'.
               05  FILLER   PIC X(13)  VALUE    '363041 009203'.
               05  FILLER   PIC X(13)  VALUE    '363042 009549'.
               05  FILLER   PIC X(13)  VALUE    '363300 009203'.
               05  FILLER   PIC X(13)  VALUE    '363302 008829'.
               05  FILLER   PIC X(13)  VALUE    '363303 008273'.
               05  FILLER   PIC X(13)  VALUE    '363304 008829'.
               05  FILLER   PIC X(13)  VALUE    '363305 009549'.
               05  FILLER   PIC X(13)  VALUE    '363306 008823'.
               05  FILLER   PIC X(13)  VALUE    '364007 009549'.
               05  FILLER   PIC X(13)  VALUE    '364011 008273'.
               05  FILLER   PIC X(13)  VALUE    '364014 008671'.
               05  FILLER   PIC X(13)  VALUE    '364015 007993'.
               05  FILLER   PIC X(13)  VALUE    '364029 008829'.
               05  FILLER   PIC X(13)  VALUE    '364031 008034'.
               05  FILLER   PIC X(13)  VALUE    '364035 009203'.
               05  FILLER   PIC X(13)  VALUE    '364036 008671'.
               05  FILLER   PIC X(13)  VALUE    '364041 009549'.
               05  FILLER   PIC X(13)  VALUE    '364042 008019'.
               05  FILLER   PIC X(13)  VALUE    '364044 009203'.
               05  FILLER   PIC X(13)  VALUE    '364049 009549'.
               05  FILLER   PIC X(13)  VALUE    '364050 008823'.
               05  FILLER   PIC X(13)  VALUE    '364051 009203'.
               05  FILLER   PIC X(13)  VALUE    '364052 008829'.
               05  FILLER   PIC X(13)  VALUE    '364053 008829'.
               05  FILLER   PIC X(13)  VALUE    '364058 009549'.
               05  FILLER   PIC X(13)  VALUE    '364059 008273'.
               05  FILLER   PIC X(13)  VALUE    '364060 007993'.
               05  FILLER   PIC X(13)  VALUE    '364061 009549'.
               05  FILLER   PIC X(13)  VALUE    '364511 007894'.
               05  FILLER   PIC X(13)  VALUE    '364627 007993'.
               05  FILLER   PIC X(13)  VALUE    '364628 007993'.
               05  FILLER   PIC X(13)  VALUE    '364629 009203'.
               05  FILLER   PIC X(13)  VALUE    '364635 008671'.
               05  FILLER   PIC X(13)  VALUE    '368214 007993'.
               05  FILLER   PIC X(13)  VALUE    '368216 009549'.
               05  FILLER   PIC X(13)  VALUE    '368217 009549'.
               05  FILLER   PIC X(13)  VALUE    '368219 007993'.
               05  FILLER   PIC X(13)  VALUE    '368220 008823'.
               05  FILLER   PIC X(13)  VALUE    '368224 007993'.
               05  FILLER   PIC X(13)  VALUE    '368225 009549'.
               05  FILLER   PIC X(13)  VALUE    '368226 007993'.
               05  FILLER   PIC X(13)  VALUE    '368227 009549'.
               05  FILLER   PIC X(13)  VALUE    '368229 008829'.
               05  FILLER   PIC X(13)  VALUE    '368231 009203'.
               05  FILLER   PIC X(13)  VALUE    '368232 008823'.
               05  FILLER   PIC X(13)  VALUE    '368233 009203'.
               05  FILLER   PIC X(13)  VALUE    '368234 008823'.
               05  FILLER   PIC X(13)  VALUE    '368235 009549'.
               05  FILLER   PIC X(13)  VALUE    '368238 008136'.
               05  FILLER   PIC X(13)  VALUE    '368268 007335'.
               05  FILLER   PIC X(13)  VALUE    '37B041 007706'.
               05  FILLER   PIC X(13)  VALUE    '37S002 007706'.
               05  FILLER   PIC X(13)  VALUE    '37S006 007706'.
               05  FILLER   PIC X(13)  VALUE    '37S008 008909'.
               05  FILLER   PIC X(13)  VALUE    '37S016 008881'.
               05  FILLER   PIC X(13)  VALUE    '37S018 007822'.
               05  FILLER   PIC X(13)  VALUE    '37S019 007706'.
               05  FILLER   PIC X(13)  VALUE    '37S020 007706'.
               05  FILLER   PIC X(13)  VALUE    '37S023 007735'.
               05  FILLER   PIC X(13)  VALUE    '37S025 007823'.
               05  FILLER   PIC X(13)  VALUE    '37S034 007706'.
               05  FILLER   PIC X(13)  VALUE    '37S037 008909'.
               05  FILLER   PIC X(13)  VALUE    '37S039 008643'.
               05  FILLER   PIC X(13)  VALUE    '37S047 007706'.
               05  FILLER   PIC X(13)  VALUE    '37S056 007706'.
               05  FILLER   PIC X(13)  VALUE    '37S057 008643'.
               05  FILLER   PIC X(13)  VALUE    '37S089 007706'.
               05  FILLER   PIC X(13)  VALUE    '37S093 008909'.
               05  FILLER   PIC X(13)  VALUE    '37S094 008909'.
               05  FILLER   PIC X(13)  VALUE    '37S097 007706'.
               05  FILLER   PIC X(13)  VALUE    '37S099 007706'.
               05  FILLER   PIC X(13)  VALUE    '37S178 007706'.
               05  FILLER   PIC X(13)  VALUE    '37S237 007723'.
               05  FILLER   PIC X(13)  VALUE    '37T001 008643'.
               05  FILLER   PIC X(13)  VALUE    '37T008 008909'.
               05  FILLER   PIC X(13)  VALUE    '37T018 007822'.
               05  FILLER   PIC X(13)  VALUE    '37T019 007706'.
               05  FILLER   PIC X(13)  VALUE    '37T020 007706'.
               05  FILLER   PIC X(13)  VALUE    '37T023 007735'.
               05  FILLER   PIC X(13)  VALUE    '37T025 007823'.
               05  FILLER   PIC X(13)  VALUE    '37T026 008881'.
               05  FILLER   PIC X(13)  VALUE    '37T028 008909'.
               05  FILLER   PIC X(13)  VALUE    '37T029 007706'.
               05  FILLER   PIC X(13)  VALUE    '37T034 007706'.
               05  FILLER   PIC X(13)  VALUE    '37T037 008909'.
               05  FILLER   PIC X(13)  VALUE    '37T047 007706'.
               05  FILLER   PIC X(13)  VALUE    '37T049 007706'.
               05  FILLER   PIC X(13)  VALUE    '37T056 007706'.
               05  FILLER   PIC X(13)  VALUE    '37T089 007706'.
               05  FILLER   PIC X(13)  VALUE    '37T091 008643'.
               05  FILLER   PIC X(13)  VALUE    '37T093 008909'.
               05  FILLER   PIC X(13)  VALUE    '37T097 007706'.
               05  FILLER   PIC X(13)  VALUE    '37T106 008909'.
               05  FILLER   PIC X(13)  VALUE    '37U015 007706'.
               05  FILLER   PIC X(13)  VALUE    '37U022 007706'.
               05  FILLER   PIC X(13)  VALUE    '37U030 007706'.
               05  FILLER   PIC X(13)  VALUE    '37U057 008643'.
               05  FILLER   PIC X(13)  VALUE    '37U083 007706'.
               05  FILLER   PIC X(13)  VALUE    '37U097 007706'.
               05  FILLER   PIC X(13)  VALUE    '37U112 007648'.
               05  FILLER   PIC X(13)  VALUE    '37U139 007706'.
               05  FILLER   PIC X(13)  VALUE    '37U237 007706'.
               05  FILLER   PIC X(13)  VALUE    '370001 008909'.
               05  FILLER   PIC X(13)  VALUE    '370002 008425'.
               05  FILLER   PIC X(13)  VALUE    '370004 007706'.
               05  FILLER   PIC X(13)  VALUE    '370006 008425'.
               05  FILLER   PIC X(13)  VALUE    '370008 008909'.
               05  FILLER   PIC X(13)  VALUE    '370011 008909'.
               05  FILLER   PIC X(13)  VALUE    '370013 008909'.
               05  FILLER   PIC X(13)  VALUE    '370014 008025'.
               05  FILLER   PIC X(13)  VALUE    '370015 008643'.
               05  FILLER   PIC X(13)  VALUE    '370016 008881'.
               05  FILLER   PIC X(13)  VALUE    '370018 008643'.
               05  FILLER   PIC X(13)  VALUE    '370019 007706'.
               05  FILLER   PIC X(13)  VALUE    '370020 008909'.
               05  FILLER   PIC X(13)  VALUE    '370022 008106'.
               05  FILLER   PIC X(13)  VALUE    '370023 007735'.
               05  FILLER   PIC X(13)  VALUE    '370025 008643'.
               05  FILLER   PIC X(13)  VALUE    '370026 008881'.
               05  FILLER   PIC X(13)  VALUE    '370028 008909'.
               05  FILLER   PIC X(13)  VALUE    '370029 008909'.
               05  FILLER   PIC X(13)  VALUE    '370030 007706'.
               05  FILLER   PIC X(13)  VALUE    '370032 008909'.
               05  FILLER   PIC X(13)  VALUE    '370034 008643'.
               05  FILLER   PIC X(13)  VALUE    '370037 008909'.
               05  FILLER   PIC X(13)  VALUE    '370039 008643'.
               05  FILLER   PIC X(13)  VALUE    '370041 008643'.
               05  FILLER   PIC X(13)  VALUE    '370047 008909'.
               05  FILLER   PIC X(13)  VALUE    '370049 008909'.
               05  FILLER   PIC X(13)  VALUE    '370051 007706'.
               05  FILLER   PIC X(13)  VALUE    '370054 008909'.
               05  FILLER   PIC X(13)  VALUE    '370056 007706'.
               05  FILLER   PIC X(13)  VALUE    '370057 008643'.
               05  FILLER   PIC X(13)  VALUE    '370065 007723'.
               05  FILLER   PIC X(13)  VALUE    '370072 007706'.
               05  FILLER   PIC X(13)  VALUE    '370078 008643'.
               05  FILLER   PIC X(13)  VALUE    '370083 007706'.
               05  FILLER   PIC X(13)  VALUE    '370089 007706'.
               05  FILLER   PIC X(13)  VALUE    '370091 008643'.
               05  FILLER   PIC X(13)  VALUE    '370093 008909'.
               05  FILLER   PIC X(13)  VALUE    '370094 008909'.
               05  FILLER   PIC X(13)  VALUE    '370097 008909'.
               05  FILLER   PIC X(13)  VALUE    '370099 008909'.
               05  FILLER   PIC X(13)  VALUE    '370100 007706'.
               05  FILLER   PIC X(13)  VALUE    '370103 007706'.
               05  FILLER   PIC X(13)  VALUE    '370106 008909'.
               05  FILLER   PIC X(13)  VALUE    '370112 007706'.
               05  FILLER   PIC X(13)  VALUE    '370113 008000'.
               05  FILLER   PIC X(13)  VALUE    '370114 008909'.
               05  FILLER   PIC X(13)  VALUE    '370139 007706'.
               05  FILLER   PIC X(13)  VALUE    '370149 008909'.
               05  FILLER   PIC X(13)  VALUE    '370153 007756'.
               05  FILLER   PIC X(13)  VALUE    '370156 007919'.
               05  FILLER   PIC X(13)  VALUE    '370158 008909'.
               05  FILLER   PIC X(13)  VALUE    '370166 008643'.
               05  FILLER   PIC X(13)  VALUE    '370169 007741'.
               05  FILLER   PIC X(13)  VALUE    '370170 014448'.
               05  FILLER   PIC X(13)  VALUE    '370171 014448'.
               05  FILLER   PIC X(13)  VALUE    '370172 014448'.
               05  FILLER   PIC X(13)  VALUE    '370173 014448'.
               05  FILLER   PIC X(13)  VALUE    '370178 007706'.
               05  FILLER   PIC X(13)  VALUE    '370180 014448'.
               05  FILLER   PIC X(13)  VALUE    '370183 008643'.
               05  FILLER   PIC X(13)  VALUE    '370190 008643'.
               05  FILLER   PIC X(13)  VALUE    '370192 008909'.
               05  FILLER   PIC X(13)  VALUE    '370199 008909'.
               05  FILLER   PIC X(13)  VALUE    '370201 008909'.
               05  FILLER   PIC X(13)  VALUE    '370202 008643'.
               05  FILLER   PIC X(13)  VALUE    '370203 008909'.
               05  FILLER   PIC X(13)  VALUE    '370206 008909'.
               05  FILLER   PIC X(13)  VALUE    '370210 008643'.
               05  FILLER   PIC X(13)  VALUE    '370211 008909'.
               05  FILLER   PIC X(13)  VALUE    '370212 008909'.
               05  FILLER   PIC X(13)  VALUE    '370214 007919'.
               05  FILLER   PIC X(13)  VALUE    '370215 008909'.
               05  FILLER   PIC X(13)  VALUE    '370216 008643'.
               05  FILLER   PIC X(13)  VALUE    '370218 008643'.
               05  FILLER   PIC X(13)  VALUE    '370220 008909'.
               05  FILLER   PIC X(13)  VALUE    '370222 008909'.
               05  FILLER   PIC X(13)  VALUE    '370225 008909'.
               05  FILLER   PIC X(13)  VALUE    '370227 008643'.
               05  FILLER   PIC X(13)  VALUE    '370228 008643'.
               05  FILLER   PIC X(13)  VALUE    '370229 007706'.
               05  FILLER   PIC X(13)  VALUE    '370233 008643'.
               05  FILLER   PIC X(13)  VALUE    '370234 008909'.
               05  FILLER   PIC X(13)  VALUE    '370235 008643'.
               05  FILLER   PIC X(13)  VALUE    '370236 008909'.
               05  FILLER   PIC X(13)  VALUE    '370237 007723'.
               05  FILLER   PIC X(13)  VALUE    '370239 007706'.
               05  FILLER   PIC X(13)  VALUE    '371500 007706'.
               05  FILLER   PIC X(13)  VALUE    '371514 007706'.
               05  FILLER   PIC X(13)  VALUE    '371622 007706'.
               05  FILLER   PIC X(13)  VALUE    '371625 007706'.
               05  FILLER   PIC X(13)  VALUE    '371641 008909'.
               05  FILLER   PIC X(13)  VALUE    '371677 008643'.
               05  FILLER   PIC X(13)  VALUE    '371678 007706'.
               05  FILLER   PIC X(13)  VALUE    '371685 008909'.
               05  FILLER   PIC X(13)  VALUE    '371689 008643'.
               05  FILLER   PIC X(13)  VALUE    '371692 007706'.
               05  FILLER   PIC X(13)  VALUE    '371694 008909'.
               05  FILLER   PIC X(13)  VALUE    '371695 007706'.
               05  FILLER   PIC X(13)  VALUE    '371696 007706'.
               05  FILLER   PIC X(13)  VALUE    '371697 008643'.
               05  FILLER   PIC X(13)  VALUE    '371698 007706'.
               05  FILLER   PIC X(13)  VALUE    '371700 008643'.
               05  FILLER   PIC X(13)  VALUE    '372004 008909'.
               05  FILLER   PIC X(13)  VALUE    '372007 008643'.
               05  FILLER   PIC X(13)  VALUE    '372009 008909'.
               05  FILLER   PIC X(13)  VALUE    '372016 008881'.
               05  FILLER   PIC X(13)  VALUE    '372018 008643'.
               05  FILLER   PIC X(13)  VALUE    '372019 008102'.
               05  FILLER   PIC X(13)  VALUE    '372022 007823'.
               05  FILLER   PIC X(13)  VALUE    '372023 008643'.
               05  FILLER   PIC X(13)  VALUE    '373025 008909'.
               05  FILLER   PIC X(13)  VALUE    '373033 008909'.
               05  FILLER   PIC X(13)  VALUE    '373035 008643'.
               05  FILLER   PIC X(13)  VALUE    '374012 008643'.
               05  FILLER   PIC X(13)  VALUE    '374020 008643'.
               05  FILLER   PIC X(13)  VALUE    '374021 008643'.
               05  FILLER   PIC X(13)  VALUE    '374023 008909'.
               05  FILLER   PIC X(13)  VALUE    '374024 008643'.
               05  FILLER   PIC X(13)  VALUE    '374025 008909'.
               05  FILLER   PIC X(13)  VALUE    '374026 008643'.
               05  FILLER   PIC X(13)  VALUE    '377722 007706'.
               05  FILLER   PIC X(13)  VALUE    '377723 007706'.
               05  FILLER   PIC X(13)  VALUE    '377724 007706'.
               05  FILLER   PIC X(13)  VALUE    '377725 008909'.
               05  FILLER   PIC X(13)  VALUE    '377726 007706'.
               05  FILLER   PIC X(13)  VALUE    '38S007 011888'.
               05  FILLER   PIC X(13)  VALUE    '38S014 010861'.
               05  FILLER   PIC X(13)  VALUE    '38S017 011888'.
               05  FILLER   PIC X(13)  VALUE    '38S018 010731'.
               05  FILLER   PIC X(13)  VALUE    '38S033 011883'.
               05  FILLER   PIC X(13)  VALUE    '38S047 011321'.
               05  FILLER   PIC X(13)  VALUE    '38S051 010746'.
               05  FILLER   PIC X(13)  VALUE    '38S060 011888'.
               05  FILLER   PIC X(13)  VALUE    '38S061 011888'.
               05  FILLER   PIC X(13)  VALUE    '38S071 011888'.
               05  FILLER   PIC X(13)  VALUE    '38S082 011888'.
               05  FILLER   PIC X(13)  VALUE    '38T001 010634'.
               05  FILLER   PIC X(13)  VALUE    '38T017 011888'.
               05  FILLER   PIC X(13)  VALUE    '38T018 010731'.
               05  FILLER   PIC X(13)  VALUE    '38T027 010634'.
               05  FILLER   PIC X(13)  VALUE    '38T033 011883'.
               05  FILLER   PIC X(13)  VALUE    '38T047 011321'.
               05  FILLER   PIC X(13)  VALUE    '38T051 010746'.
               05  FILLER   PIC X(13)  VALUE    '38T061 011888'.
               05  FILLER   PIC X(13)  VALUE    '38T071 011888'.
               05  FILLER   PIC X(13)  VALUE    '38T075 010731'.
               05  FILLER   PIC X(13)  VALUE    '38U001 010634'.
               05  FILLER   PIC X(13)  VALUE    '38U056 010746'.
               05  FILLER   PIC X(13)  VALUE    '380001 011786'.
               05  FILLER   PIC X(13)  VALUE    '380002 010650'.
               05  FILLER   PIC X(13)  VALUE    '380004 011888'.
               05  FILLER   PIC X(13)  VALUE    '380005 010731'.
               05  FILLER   PIC X(13)  VALUE    '380007 011888'.
               05  FILLER   PIC X(13)  VALUE    '380009 011888'.
               05  FILLER   PIC X(13)  VALUE    '380014 010634'.
               05  FILLER   PIC X(13)  VALUE    '380017 011888'.
               05  FILLER   PIC X(13)  VALUE    '380018 012500'.
               05  FILLER   PIC X(13)  VALUE    '380020 011883'.
               05  FILLER   PIC X(13)  VALUE    '380021 011888'.
               05  FILLER   PIC X(13)  VALUE    '380022 011083'.
               05  FILLER   PIC X(13)  VALUE    '380025 011888'.
               05  FILLER   PIC X(13)  VALUE    '380027 011760'.
               05  FILLER   PIC X(13)  VALUE    '380029 010836'.
               05  FILLER   PIC X(13)  VALUE    '380033 011883'.
               05  FILLER   PIC X(13)  VALUE    '380037 011888'.
               05  FILLER   PIC X(13)  VALUE    '380038 011888'.
               05  FILLER   PIC X(13)  VALUE    '380040 010634'.
               05  FILLER   PIC X(13)  VALUE    '380047 011321'.
               05  FILLER   PIC X(13)  VALUE    '380050 010634'.
               05  FILLER   PIC X(13)  VALUE    '380051 011786'.
               05  FILLER   PIC X(13)  VALUE    '380052 010634'.
               05  FILLER   PIC X(13)  VALUE    '380056 010836'.
               05  FILLER   PIC X(13)  VALUE    '380060 011888'.
               05  FILLER   PIC X(13)  VALUE    '380061 011888'.
               05  FILLER   PIC X(13)  VALUE    '380071 011888'.
               05  FILLER   PIC X(13)  VALUE    '380075 012500'.
               05  FILLER   PIC X(13)  VALUE    '380082 011888'.
               05  FILLER   PIC X(13)  VALUE    '380089 011888'.
               05  FILLER   PIC X(13)  VALUE    '380090 011760'.
               05  FILLER   PIC X(13)  VALUE    '380091 011888'.
               05  FILLER   PIC X(13)  VALUE    '380102 011883'.
               05  FILLER   PIC X(13)  VALUE    '380103 011888'.
               05  FILLER   PIC X(13)  VALUE    '381500 011888'.
               05  FILLER   PIC X(13)  VALUE    '381501 011883'.
               05  FILLER   PIC X(13)  VALUE    '381502 011888'.
               05  FILLER   PIC X(13)  VALUE    '381503 011888'.
               05  FILLER   PIC X(13)  VALUE    '381505 011888'.
               05  FILLER   PIC X(13)  VALUE    '381506 010731'.
               05  FILLER   PIC X(13)  VALUE    '381507 011888'.
               05  FILLER   PIC X(13)  VALUE    '381509 010634'.
               05  FILLER   PIC X(13)  VALUE    '381510 011888'.
               05  FILLER   PIC X(13)  VALUE    '381512 011321'.
               05  FILLER   PIC X(13)  VALUE    '381514 011888'.
               05  FILLER   PIC X(13)  VALUE    '381515 011321'.
               05  FILLER   PIC X(13)  VALUE    '381516 010746'.
               05  FILLER   PIC X(13)  VALUE    '381517 010634'.
               05  FILLER   PIC X(13)  VALUE    '381518 010634'.
               05  FILLER   PIC X(13)  VALUE    '381519 010861'.
               05  FILLER   PIC X(13)  VALUE    '381520 010634'.
               05  FILLER   PIC X(13)  VALUE    '381521 010634'.
               05  FILLER   PIC X(13)  VALUE    '381522 010634'.
               05  FILLER   PIC X(13)  VALUE    '381523 010634'.
               05  FILLER   PIC X(13)  VALUE    '381524 010634'.
               05  FILLER   PIC X(13)  VALUE    '381525 010634'.
               05  FILLER   PIC X(13)  VALUE    '381526 010634'.
               05  FILLER   PIC X(13)  VALUE    '381527 010731'.
               05  FILLER   PIC X(13)  VALUE    '381528 010634'.
               05  FILLER   PIC X(13)  VALUE    '381529 011883'.
               05  FILLER   PIC X(13)  VALUE    '381530 010634'.
               05  FILLER   PIC X(13)  VALUE    '381533 010634'.
               05  FILLER   PIC X(13)  VALUE    '381534 010634'.
               05  FILLER   PIC X(13)  VALUE    '381535 010634'.
               05  FILLER   PIC X(13)  VALUE    '381536 011883'.
               05  FILLER   PIC X(13)  VALUE    '381538 010634'.
               05  FILLER   PIC X(13)  VALUE    '381539 011321'.
               05  FILLER   PIC X(13)  VALUE    '381540 010634'.
               05  FILLER   PIC X(13)  VALUE    '381541 010634'.
               05  FILLER   PIC X(13)  VALUE    '381542 011321'.
               05  FILLER   PIC X(13)  VALUE    '381543 010634'.
               05  FILLER   PIC X(13)  VALUE    '381545 010634'.
               05  FILLER   PIC X(13)  VALUE    '381546 010634'.
               05  FILLER   PIC X(13)  VALUE    '381547 011888'.
               05  FILLER   PIC X(13)  VALUE    '381548 011888'.
               05  FILLER   PIC X(13)  VALUE    '381550 010731'.
               05  FILLER   PIC X(13)  VALUE    '381551 010634'.
               05  FILLER   PIC X(13)  VALUE    '381552 010634'.
               05  FILLER   PIC X(13)  VALUE    '381553 011888'.
               05  FILLER   PIC X(13)  VALUE    '381554 010634'.
               05  FILLER   PIC X(13)  VALUE    '381555 011888'.
               05  FILLER   PIC X(13)  VALUE    '381556 011888'.
               05  FILLER   PIC X(13)  VALUE    '381557 010746'.
               05  FILLER   PIC X(13)  VALUE    '381558 011888'.
               05  FILLER   PIC X(13)  VALUE    '381559 011888'.
               05  FILLER   PIC X(13)  VALUE    '382004 011888'.
               05  FILLER   PIC X(13)  VALUE    '384012 011888'.
               05  FILLER   PIC X(13)  VALUE    '387154 011321'.
               05  FILLER   PIC X(13)  VALUE    '387155 010634'.
               05  FILLER   PIC X(13)  VALUE    '387159 010634'.
               05  FILLER   PIC X(13)  VALUE    '39B006 008657'.
               05  FILLER   PIC X(13)  VALUE    '39B115 010871'.
               05  FILLER   PIC X(13)  VALUE    '39B142 010307'.
               05  FILLER   PIC X(13)  VALUE    '39S001 008541'.
               05  FILLER   PIC X(13)  VALUE    '39S003 009086'.
               05  FILLER   PIC X(13)  VALUE    '39S004 009309'.
               05  FILLER   PIC X(13)  VALUE    '39S006 009086'.
               05  FILLER   PIC X(13)  VALUE    '39S008 008013'.
               05  FILLER   PIC X(13)  VALUE    '39S009 007894'.
               05  FILLER   PIC X(13)  VALUE    '39S026 010871'.
               05  FILLER   PIC X(13)  VALUE    '39S027 010871'.
               05  FILLER   PIC X(13)  VALUE    '39S030 008416'.
               05  FILLER   PIC X(13)  VALUE    '39S032 008411'.
               05  FILLER   PIC X(13)  VALUE    '39S036 008411'.
               05  FILLER   PIC X(13)  VALUE    '39S037 008411'.
               05  FILLER   PIC X(13)  VALUE    '39S039 007894'.
               05  FILLER   PIC X(13)  VALUE    '39S042 008411'.
               05  FILLER   PIC X(13)  VALUE    '39S044 009843'.
               05  FILLER   PIC X(13)  VALUE    '39S046 009476'.
               05  FILLER   PIC X(13)  VALUE    '39S048 007894'.
               05  FILLER   PIC X(13)  VALUE    '39S052 008350'.
               05  FILLER   PIC X(13)  VALUE    '39S056 008425'.
               05  FILLER   PIC X(13)  VALUE    '39S061 009234'.
               05  FILLER   PIC X(13)  VALUE    '39S070 009915'.
               05  FILLER   PIC X(13)  VALUE    '39S072 009086'.
               05  FILLER   PIC X(13)  VALUE    '39S076 010211'.
               05  FILLER   PIC X(13)  VALUE    '39S079 008023'.
               05  FILLER   PIC X(13)  VALUE    '39S084 007894'.
               05  FILLER   PIC X(13)  VALUE    '39S091 007894'.
               05  FILLER   PIC X(13)  VALUE    '39S097 010307'.
               05  FILLER   PIC X(13)  VALUE    '39S101 009461'.
               05  FILLER   PIC X(13)  VALUE    '39S110 008257'.
               05  FILLER   PIC X(13)  VALUE    '39S113 007894'.
               05  FILLER   PIC X(13)  VALUE    '39S116 010307'.
               05  FILLER   PIC X(13)  VALUE    '39S119 008541'.
               05  FILLER   PIC X(13)  VALUE    '39S123 010307'.
               05  FILLER   PIC X(13)  VALUE    '39S133 009534'.
               05  FILLER   PIC X(13)  VALUE    '39S139 009915'.
               05  FILLER   PIC X(13)  VALUE    '39S142 010871'.
               05  FILLER   PIC X(13)  VALUE    '39S147 008411'.
               05  FILLER   PIC X(13)  VALUE    '39S150 007978'.
               05  FILLER   PIC X(13)  VALUE    '39S151 011747'.
               05  FILLER   PIC X(13)  VALUE    '39S156 010871'.
               05  FILLER   PIC X(13)  VALUE    '39S157 008411'.
               05  FILLER   PIC X(13)  VALUE    '39S162 009820'.
               05  FILLER   PIC X(13)  VALUE    '39S164 008411'.
               05  FILLER   PIC X(13)  VALUE    '39S168 008411'.
               05  FILLER   PIC X(13)  VALUE    '39S173 008029'.
               05  FILLER   PIC X(13)  VALUE    '39S174 010871'.
               05  FILLER   PIC X(13)  VALUE    '39S180 010871'.
               05  FILLER   PIC X(13)  VALUE    '39S194 009534'.
               05  FILLER   PIC X(13)  VALUE    '39S197 009534'.
               05  FILLER   PIC X(13)  VALUE    '39S198 007894'.
               05  FILLER   PIC X(13)  VALUE    '39S201 010304'.
               05  FILLER   PIC X(13)  VALUE    '39S223 010871'.
               05  FILLER   PIC X(13)  VALUE    '39S225 009423'.
               05  FILLER   PIC X(13)  VALUE    '39S226 010871'.
               05  FILLER   PIC X(13)  VALUE    '39S228 008411'.
               05  FILLER   PIC X(13)  VALUE    '39S231 010307'.
               05  FILLER   PIC X(13)  VALUE    '39S256 009309'.
               05  FILLER   PIC X(13)  VALUE    '39S265 008411'.
               05  FILLER   PIC X(13)  VALUE    '39S267 008411'.
               05  FILLER   PIC X(13)  VALUE    '39S268 009936'.
               05  FILLER   PIC X(13)  VALUE    '39S278 010307'.
               05  FILLER   PIC X(13)  VALUE    '39S290 010871'.
               05  FILLER   PIC X(13)  VALUE    '39S304 010871'.
               05  FILLER   PIC X(13)  VALUE    '39T002 008411'.
               05  FILLER   PIC X(13)  VALUE    '39T009 007894'.
               05  FILLER   PIC X(13)  VALUE    '39T013 008191'.
               05  FILLER   PIC X(13)  VALUE    '39T016 008013'.
               05  FILLER   PIC X(13)  VALUE    '39T027 010871'.
               05  FILLER   PIC X(13)  VALUE    '39T028 008411'.
               05  FILLER   PIC X(13)  VALUE    '39T030 008416'.
               05  FILLER   PIC X(13)  VALUE    '39T032 008411'.
               05  FILLER   PIC X(13)  VALUE    '39T037 008411'.
               05  FILLER   PIC X(13)  VALUE    '39T041 008411'.
               05  FILLER   PIC X(13)  VALUE    '39T042 008411'.
               05  FILLER   PIC X(13)  VALUE    '39T044 009843'.
               05  FILLER   PIC X(13)  VALUE    '39T045 008751'.
               05  FILLER   PIC X(13)  VALUE    '39T049 009820'.
               05  FILLER   PIC X(13)  VALUE    '39T057 009915'.
               05  FILLER   PIC X(13)  VALUE    '39T058 009309'.
               05  FILLER   PIC X(13)  VALUE    '39T061 009234'.
               05  FILLER   PIC X(13)  VALUE    '39T066 009437'.
               05  FILLER   PIC X(13)  VALUE    '39T073 010112'.
               05  FILLER   PIC X(13)  VALUE    '39T081 010871'.
               05  FILLER   PIC X(13)  VALUE    '39T086 008350'.
               05  FILLER   PIC X(13)  VALUE    '39T090 008411'.
               05  FILLER   PIC X(13)  VALUE    '39T091 007894'.
               05  FILLER   PIC X(13)  VALUE    '39T093 007894'.
               05  FILLER   PIC X(13)  VALUE    '39T100 009423'.
               05  FILLER   PIC X(13)  VALUE    '39T102 008411'.
               05  FILLER   PIC X(13)  VALUE    '39T107 008411'.
               05  FILLER   PIC X(13)  VALUE    '39T110 008257'.
               05  FILLER   PIC X(13)  VALUE    '39T111 010871'.
               05  FILLER   PIC X(13)  VALUE    '39T113 007894'.
               05  FILLER   PIC X(13)  VALUE    '39T123 010871'.
               05  FILLER   PIC X(13)  VALUE    '39T125 008316'.
               05  FILLER   PIC X(13)  VALUE    '39T127 010211'.
               05  FILLER   PIC X(13)  VALUE    '39T133 009534'.
               05  FILLER   PIC X(13)  VALUE    '39T137 008541'.
               05  FILLER   PIC X(13)  VALUE    '39T142 009915'.
               05  FILLER   PIC X(13)  VALUE    '39T145 008411'.
               05  FILLER   PIC X(13)  VALUE    '39T147 008411'.
               05  FILLER   PIC X(13)  VALUE    '39T151 011747'.
               05  FILLER   PIC X(13)  VALUE    '39T156 010871'.
               05  FILLER   PIC X(13)  VALUE    '39T157 008411'.
               05  FILLER   PIC X(13)  VALUE    '39T160 008411'.
               05  FILLER   PIC X(13)  VALUE    '39T162 009820'.
               05  FILLER   PIC X(13)  VALUE    '39T163 008411'.
               05  FILLER   PIC X(13)  VALUE    '39T164 008411'.
               05  FILLER   PIC X(13)  VALUE    '39T173 008029'.
               05  FILLER   PIC X(13)  VALUE    '39T174 010871'.
               05  FILLER   PIC X(13)  VALUE    '39T180 010871'.
               05  FILLER   PIC X(13)  VALUE    '39T185 008541'.
               05  FILLER   PIC X(13)  VALUE    '39T194 009534'.
               05  FILLER   PIC X(13)  VALUE    '39T198 007894'.
               05  FILLER   PIC X(13)  VALUE    '39T201 010304'.
               05  FILLER   PIC X(13)  VALUE    '39T203 009915'.
               05  FILLER   PIC X(13)  VALUE    '39T204 010871'.
               05  FILLER   PIC X(13)  VALUE    '39T225 009234'.
               05  FILLER   PIC X(13)  VALUE    '39T226 010871'.
               05  FILLER   PIC X(13)  VALUE    '39T231 010307'.
               05  FILLER   PIC X(13)  VALUE    '39T258 009915'.
               05  FILLER   PIC X(13)  VALUE    '39T265 008411'.
               05  FILLER   PIC X(13)  VALUE    '39T267 008411'.
               05  FILLER   PIC X(13)  VALUE    '39T270 008541'.
               05  FILLER   PIC X(13)  VALUE    '39T286 009915'.
               05  FILLER   PIC X(13)  VALUE    '39T304 010871'.
               05  FILLER   PIC X(13)  VALUE    '39T327 009476'.
               05  FILLER   PIC X(13)  VALUE    '39T328 008411'.
               05  FILLER   PIC X(13)  VALUE    '39U008 007894'.
               05  FILLER   PIC X(13)  VALUE    '39U039 007894'.
               05  FILLER   PIC X(13)  VALUE    '39U052 007894'.
               05  FILLER   PIC X(13)  VALUE    '39U056 007894'.
               05  FILLER   PIC X(13)  VALUE    '39U093 007894'.
               05  FILLER   PIC X(13)  VALUE    '39U104 008411'.
               05  FILLER   PIC X(13)  VALUE    '39U125 007894'.
               05  FILLER   PIC X(13)  VALUE    '39U130 008069'.
               05  FILLER   PIC X(13)  VALUE    '39U138 007894'.
               05  FILLER   PIC X(13)  VALUE    '39U146 007894'.
               05  FILLER   PIC X(13)  VALUE    '39U150 007894'.
               05  FILLER   PIC X(13)  VALUE    '39U199 007894'.
               05  FILLER   PIC X(13)  VALUE    '39U236 007894'.
               05  FILLER   PIC X(13)  VALUE    '390001 009150'.
               05  FILLER   PIC X(13)  VALUE    '390002 008411'.
               05  FILLER   PIC X(13)  VALUE    '390003 009086'.
               05  FILLER   PIC X(13)  VALUE    '390004 009461'.
               05  FILLER   PIC X(13)  VALUE    '390006 009086'.
               05  FILLER   PIC X(13)  VALUE    '390008 008013'.
               05  FILLER   PIC X(13)  VALUE    '390009 008442'.
               05  FILLER   PIC X(13)  VALUE    '390012 010307'.
               05  FILLER   PIC X(13)  VALUE    '390013 009309'.
               05  FILLER   PIC X(13)  VALUE    '390016 008272'.
               05  FILLER   PIC X(13)  VALUE    '390019 009534'.
               05  FILLER   PIC X(13)  VALUE    '390025 010871'.
               05  FILLER   PIC X(13)  VALUE    '390026 010871'.
               05  FILLER   PIC X(13)  VALUE    '390027 010871'.
               05  FILLER   PIC X(13)  VALUE    '390028 008411'.
               05  FILLER   PIC X(13)  VALUE    '390030 009512'.
               05  FILLER   PIC X(13)  VALUE    '390031 009512'.
               05  FILLER   PIC X(13)  VALUE    '390032 008411'.
               05  FILLER   PIC X(13)  VALUE    '390035 010871'.
               05  FILLER   PIC X(13)  VALUE    '390036 008411'.
               05  FILLER   PIC X(13)  VALUE    '390037 008411'.
               05  FILLER   PIC X(13)  VALUE    '390039 007894'.
               05  FILLER   PIC X(13)  VALUE    '390041 008411'.
               05  FILLER   PIC X(13)  VALUE    '390042 008411'.
               05  FILLER   PIC X(13)  VALUE    '390044 009915'.
               05  FILLER   PIC X(13)  VALUE    '390045 009223'.
               05  FILLER   PIC X(13)  VALUE    '390046 009585'.
               05  FILLER   PIC X(13)  VALUE    '390048 009223'.
               05  FILLER   PIC X(13)  VALUE    '390049 010956'.
               05  FILLER   PIC X(13)  VALUE    '390050 008411'.
               05  FILLER   PIC X(13)  VALUE    '390052 008350'.
               05  FILLER   PIC X(13)  VALUE    '390056 008425'.
               05  FILLER   PIC X(13)  VALUE    '390057 010871'.
               05  FILLER   PIC X(13)  VALUE    '390058 009461'.
               05  FILLER   PIC X(13)  VALUE    '390061 009234'.
               05  FILLER   PIC X(13)  VALUE    '390062 010112'.
               05  FILLER   PIC X(13)  VALUE    '390063 008442'.
               05  FILLER   PIC X(13)  VALUE    '390065 011386'.
               05  FILLER   PIC X(13)  VALUE    '390066 009437'.
               05  FILLER   PIC X(13)  VALUE    '390067 009585'.
               05  FILLER   PIC X(13)  VALUE    '390068 009234'.
               05  FILLER   PIC X(13)  VALUE    '390070 010871'.
               05  FILLER   PIC X(13)  VALUE    '390071 009223'.
               05  FILLER   PIC X(13)  VALUE    '390072 009086'.
               05  FILLER   PIC X(13)  VALUE    '390073 010112'.
               05  FILLER   PIC X(13)  VALUE    '390076 010211'.
               05  FILLER   PIC X(13)  VALUE    '390079 008570'.
               05  FILLER   PIC X(13)  VALUE    '390080 010871'.
               05  FILLER   PIC X(13)  VALUE    '390081 010871'.
               05  FILLER   PIC X(13)  VALUE    '390084 008657'.
               05  FILLER   PIC X(13)  VALUE    '390086 008350'.
               05  FILLER   PIC X(13)  VALUE    '390090 008411'.
               05  FILLER   PIC X(13)  VALUE    '390091 008272'.
               05  FILLER   PIC X(13)  VALUE    '390093 007894'.
               05  FILLER   PIC X(13)  VALUE    '390096 009915'.
               05  FILLER   PIC X(13)  VALUE    '390097 010307'.
               05  FILLER   PIC X(13)  VALUE    '390100 009461'.
               05  FILLER   PIC X(13)  VALUE    '390101 009476'.
               05  FILLER   PIC X(13)  VALUE    '390102 008411'.
               05  FILLER   PIC X(13)  VALUE    '390104 007894'.
               05  FILLER   PIC X(13)  VALUE    '390107 008411'.
               05  FILLER   PIC X(13)  VALUE    '390110 008257'.
               05  FILLER   PIC X(13)  VALUE    '390111 010871'.
               05  FILLER   PIC X(13)  VALUE    '390112 007894'.
               05  FILLER   PIC X(13)  VALUE    '390113 007993'.
               05  FILLER   PIC X(13)  VALUE    '390114 008411'.
               05  FILLER   PIC X(13)  VALUE    '390115 010871'.
               05  FILLER   PIC X(13)  VALUE    '390116 010307'.
               05  FILLER   PIC X(13)  VALUE    '390117 008466'.
               05  FILLER   PIC X(13)  VALUE    '390118 007894'.
               05  FILLER   PIC X(13)  VALUE    '390119 009150'.
               05  FILLER   PIC X(13)  VALUE    '390123 010307'.
               05  FILLER   PIC X(13)  VALUE    '390125 008316'.
               05  FILLER   PIC X(13)  VALUE    '390127 010211'.
               05  FILLER   PIC X(13)  VALUE    '390130 007894'.
               05  FILLER   PIC X(13)  VALUE    '390132 010871'.
               05  FILLER   PIC X(13)  VALUE    '390133 010956'.
               05  FILLER   PIC X(13)  VALUE    '390137 009150'.
               05  FILLER   PIC X(13)  VALUE    '390138 011747'.
               05  FILLER   PIC X(13)  VALUE    '390139 010871'.
               05  FILLER   PIC X(13)  VALUE    '390142 010871'.
               05  FILLER   PIC X(13)  VALUE    '390145 008411'.
               05  FILLER   PIC X(13)  VALUE    '390146 008442'.
               05  FILLER   PIC X(13)  VALUE    '390147 008411'.
               05  FILLER   PIC X(13)  VALUE    '390150 007978'.
               05  FILLER   PIC X(13)  VALUE    '390151 011747'.
               05  FILLER   PIC X(13)  VALUE    '390153 010871'.
               05  FILLER   PIC X(13)  VALUE    '390156 010871'.
               05  FILLER   PIC X(13)  VALUE    '390157 008411'.
               05  FILLER   PIC X(13)  VALUE    '390160 008411'.
               05  FILLER   PIC X(13)  VALUE    '390162 010956'.
               05  FILLER   PIC X(13)  VALUE    '390163 008411'.
               05  FILLER   PIC X(13)  VALUE    '390164 008411'.
               05  FILLER   PIC X(13)  VALUE    '390168 008411'.
               05  FILLER   PIC X(13)  VALUE    '390173 008029'.
               05  FILLER   PIC X(13)  VALUE    '390174 010871'.
               05  FILLER   PIC X(13)  VALUE    '390178 007894'.
               05  FILLER   PIC X(13)  VALUE    '390179 010211'.
               05  FILLER   PIC X(13)  VALUE    '390180 010871'.
               05  FILLER   PIC X(13)  VALUE    '390183 009512'.
               05  FILLER   PIC X(13)  VALUE    '390184 008411'.
               05  FILLER   PIC X(13)  VALUE    '390185 009150'.
               05  FILLER   PIC X(13)  VALUE    '390192 008541'.
               05  FILLER   PIC X(13)  VALUE    '390194 009534'.
               05  FILLER   PIC X(13)  VALUE    '390195 010871'.
               05  FILLER   PIC X(13)  VALUE    '390196 010871'.
               05  FILLER   PIC X(13)  VALUE    '390197 009534'.
               05  FILLER   PIC X(13)  VALUE    '390198 007894'.
               05  FILLER   PIC X(13)  VALUE    '390199 007894'.
               05  FILLER   PIC X(13)  VALUE    '390201 010304'.
               05  FILLER   PIC X(13)  VALUE    '390203 010871'.
               05  FILLER   PIC X(13)  VALUE    '390204 010871'.
               05  FILLER   PIC X(13)  VALUE    '390211 008585'.
               05  FILLER   PIC X(13)  VALUE    '390217 008411'.
               05  FILLER   PIC X(13)  VALUE    '390219 008411'.
               05  FILLER   PIC X(13)  VALUE    '390220 010211'.
               05  FILLER   PIC X(13)  VALUE    '390222 010871'.
               05  FILLER   PIC X(13)  VALUE    '390223 010871'.
               05  FILLER   PIC X(13)  VALUE    '390225 009234'.
               05  FILLER   PIC X(13)  VALUE    '390226 010871'.
               05  FILLER   PIC X(13)  VALUE    '390228 008411'.
               05  FILLER   PIC X(13)  VALUE    '390231 010307'.
               05  FILLER   PIC X(13)  VALUE    '390233 009476'.
               05  FILLER   PIC X(13)  VALUE    '390236 008023'.
               05  FILLER   PIC X(13)  VALUE    '390237 009150'.
               05  FILLER   PIC X(13)  VALUE    '390256 009585'.
               05  FILLER   PIC X(13)  VALUE    '390258 010871'.
               05  FILLER   PIC X(13)  VALUE    '390263 009534'.
               05  FILLER   PIC X(13)  VALUE    '390265 008411'.
               05  FILLER   PIC X(13)  VALUE    '390266 007894'.
               05  FILLER   PIC X(13)  VALUE    '390267 008411'.
               05  FILLER   PIC X(13)  VALUE    '390268 010112'.
               05  FILLER   PIC X(13)  VALUE    '390270 010956'.
               05  FILLER   PIC X(13)  VALUE    '390272 010307'.
               05  FILLER   PIC X(13)  VALUE    '390278 010307'.
               05  FILLER   PIC X(13)  VALUE    '390290 010871'.
               05  FILLER   PIC X(13)  VALUE    '390302 010871'.
               05  FILLER   PIC X(13)  VALUE    '390304 010871'.
               05  FILLER   PIC X(13)  VALUE    '390307 007894'.
               05  FILLER   PIC X(13)  VALUE    '390312 010871'.
               05  FILLER   PIC X(13)  VALUE    '390314 009534'.
               05  FILLER   PIC X(13)  VALUE    '390316 009915'.
               05  FILLER   PIC X(13)  VALUE    '390321 009534'.
               05  FILLER   PIC X(13)  VALUE    '390322 010871'.
               05  FILLER   PIC X(13)  VALUE    '390323 008411'.
               05  FILLER   PIC X(13)  VALUE    '390324 010307'.
               05  FILLER   PIC X(13)  VALUE    '390325 009476'.
               05  FILLER   PIC X(13)  VALUE    '390326 009820'.
               05  FILLER   PIC X(13)  VALUE    '390327 009476'.
               05  FILLER   PIC X(13)  VALUE    '390328 008411'.
               05  FILLER   PIC X(13)  VALUE    '390329 010307'.
               05  FILLER   PIC X(13)  VALUE    '390330 010304'.
               05  FILLER   PIC X(13)  VALUE    '390331 010871'.
               05  FILLER   PIC X(13)  VALUE    '391500 008541'.
               05  FILLER   PIC X(13)  VALUE    '391501 010871'.
               05  FILLER   PIC X(13)  VALUE    '391502 010871'.
               05  FILLER   PIC X(13)  VALUE    '391504 008411'.
               05  FILLER   PIC X(13)  VALUE    '391505 010112'.
               05  FILLER   PIC X(13)  VALUE    '391507 008411'.
               05  FILLER   PIC X(13)  VALUE    '391508 008541'.
               05  FILLER   PIC X(13)  VALUE    '391510 007894'.
               05  FILLER   PIC X(13)  VALUE    '391511 007894'.
               05  FILLER   PIC X(13)  VALUE    '391513 008751'.
               05  FILLER   PIC X(13)  VALUE    '391514 010871'.
               05  FILLER   PIC X(13)  VALUE    '391515 009134'.
               05  FILLER   PIC X(13)  VALUE    '391518 009936'.
               05  FILLER   PIC X(13)  VALUE    '391519 008411'.
               05  FILLER   PIC X(13)  VALUE    '391521 009534'.
               05  FILLER   PIC X(13)  VALUE    '391522 010871'.
               05  FILLER   PIC X(13)  VALUE    '391523 007894'.
               05  FILLER   PIC X(13)  VALUE    '391524 010871'.
               05  FILLER   PIC X(13)  VALUE    '391530 009309'.
               05  FILLER   PIC X(13)  VALUE    '391531 010112'.
               05  FILLER   PIC X(13)  VALUE    '391532 008541'.
               05  FILLER   PIC X(13)  VALUE    '391533 007894'.
               05  FILLER   PIC X(13)  VALUE    '391535 009534'.
               05  FILLER   PIC X(13)  VALUE    '391536 009785'.
               05  FILLER   PIC X(13)  VALUE    '391537 007894'.
               05  FILLER   PIC X(13)  VALUE    '391538 010871'.
               05  FILLER   PIC X(13)  VALUE    '391539 007993'.
               05  FILLER   PIC X(13)  VALUE    '391540 007894'.
               05  FILLER   PIC X(13)  VALUE    '391541 007894'.
               05  FILLER   PIC X(13)  VALUE    '391542 007894'.
               05  FILLER   PIC X(13)  VALUE    '391543 008541'.
               05  FILLER   PIC X(13)  VALUE    '391544 010871'.
               05  FILLER   PIC X(13)  VALUE    '391545 007894'.
               05  FILLER   PIC X(13)  VALUE    '391546 010871'.
               05  FILLER   PIC X(13)  VALUE    '391548 009461'.
               05  FILLER   PIC X(13)  VALUE    '391550 007894'.
               05  FILLER   PIC X(13)  VALUE    '391551 007894'.
               05  FILLER   PIC X(13)  VALUE    '391552 009461'.
               05  FILLER   PIC X(13)  VALUE    '391555 007894'.
               05  FILLER   PIC X(13)  VALUE    '391557 010871'.
               05  FILLER   PIC X(13)  VALUE    '391558 008411'.
               05  FILLER   PIC X(13)  VALUE    '391559 010871'.
               05  FILLER   PIC X(13)  VALUE    '391561 009437'.
               05  FILLER   PIC X(13)  VALUE    '391562 007894'.
               05  FILLER   PIC X(13)  VALUE    '391564 007894'.
               05  FILLER   PIC X(13)  VALUE    '391566 007894'.
               05  FILLER   PIC X(13)  VALUE    '391567 010871'.
               05  FILLER   PIC X(13)  VALUE    '391570 010871'.
               05  FILLER   PIC X(13)  VALUE    '391572 008541'.
               05  FILLER   PIC X(13)  VALUE    '391573 010871'.
               05  FILLER   PIC X(13)  VALUE    '391574 010871'.
               05  FILLER   PIC X(13)  VALUE    '391575 007894'.
               05  FILLER   PIC X(13)  VALUE    '391576 007894'.
               05  FILLER   PIC X(13)  VALUE    '391581 007894'.
               05  FILLER   PIC X(13)  VALUE    '391583 010871'.
               05  FILLER   PIC X(13)  VALUE    '391589 009309'.
               05  FILLER   PIC X(13)  VALUE    '391590 010871'.
               05  FILLER   PIC X(13)  VALUE    '391592 008541'.
               05  FILLER   PIC X(13)  VALUE    '391593 010871'.
               05  FILLER   PIC X(13)  VALUE    '391595 008541'.
               05  FILLER   PIC X(13)  VALUE    '391597 010871'.
               05  FILLER   PIC X(13)  VALUE    '391598 007894'.
               05  FILLER   PIC X(13)  VALUE    '391604 010871'.
               05  FILLER   PIC X(13)  VALUE    '391605 007894'.
               05  FILLER   PIC X(13)  VALUE    '391606 009309'.
               05  FILLER   PIC X(13)  VALUE    '391608 008411'.
               05  FILLER   PIC X(13)  VALUE    '391610 008411'.
               05  FILLER   PIC X(13)  VALUE    '391612 008411'.
               05  FILLER   PIC X(13)  VALUE    '391615 008411'.
               05  FILLER   PIC X(13)  VALUE    '391616 010871'.
               05  FILLER   PIC X(13)  VALUE    '391617 008411'.
               05  FILLER   PIC X(13)  VALUE    '391620 007894'.
               05  FILLER   PIC X(13)  VALUE    '391621 007894'.
               05  FILLER   PIC X(13)  VALUE    '391625 007894'.
               05  FILLER   PIC X(13)  VALUE    '391629 008411'.
               05  FILLER   PIC X(13)  VALUE    '391634 008411'.
               05  FILLER   PIC X(13)  VALUE    '391637 009534'.
               05  FILLER   PIC X(13)  VALUE    '391638 009461'.
               05  FILLER   PIC X(13)  VALUE    '391641 008411'.
               05  FILLER   PIC X(13)  VALUE    '391642 007894'.
               05  FILLER   PIC X(13)  VALUE    '391643 010871'.
               05  FILLER   PIC X(13)  VALUE    '391644 007894'.
               05  FILLER   PIC X(13)  VALUE    '391645 007894'.
               05  FILLER   PIC X(13)  VALUE    '391648 007894'.
               05  FILLER   PIC X(13)  VALUE    '391649 010871'.
               05  FILLER   PIC X(13)  VALUE    '391651 009785'.
               05  FILLER   PIC X(13)  VALUE    '391652 010871'.
               05  FILLER   PIC X(13)  VALUE    '391654 010871'.
               05  FILLER   PIC X(13)  VALUE    '391656 008541'.
               05  FILLER   PIC X(13)  VALUE    '391657 010112'.
               05  FILLER   PIC X(13)  VALUE    '391658 008751'.
               05  FILLER   PIC X(13)  VALUE    '391660 008411'.
               05  FILLER   PIC X(13)  VALUE    '391664 008411'.
               05  FILLER   PIC X(13)  VALUE    '391665 008411'.
               05  FILLER   PIC X(13)  VALUE    '391666 009534'.
               05  FILLER   PIC X(13)  VALUE    '391667 008541'.
               05  FILLER   PIC X(13)  VALUE    '391668 010871'.
               05  FILLER   PIC X(13)  VALUE    '391669 008541'.
               05  FILLER   PIC X(13)  VALUE    '391670 008411'.
               05  FILLER   PIC X(13)  VALUE    '391671 009309'.
               05  FILLER   PIC X(13)  VALUE    '391673 007894'.
               05  FILLER   PIC X(13)  VALUE    '391674 008411'.
               05  FILLER   PIC X(13)  VALUE    '391675 008541'.
               05  FILLER   PIC X(13)  VALUE    '391676 007894'.
               05  FILLER   PIC X(13)  VALUE    '391680 008541'.
               05  FILLER   PIC X(13)  VALUE    '391681 007894'.
               05  FILLER   PIC X(13)  VALUE    '391684 010871'.
               05  FILLER   PIC X(13)  VALUE    '391685 008411'.
               05  FILLER   PIC X(13)  VALUE    '391687 008751'.
               05  FILLER   PIC X(13)  VALUE    '391688 010871'.
               05  FILLER   PIC X(13)  VALUE    '391689 010871'.
               05  FILLER   PIC X(13)  VALUE    '391691 010112'.
               05  FILLER   PIC X(13)  VALUE    '391692 009309'.
               05  FILLER   PIC X(13)  VALUE    '391693 010112'.
               05  FILLER   PIC X(13)  VALUE    '391695 010871'.
               05  FILLER   PIC X(13)  VALUE    '391696 009936'.
               05  FILLER   PIC X(13)  VALUE    '391697 008411'.
               05  FILLER   PIC X(13)  VALUE    '391698 009785'.
               05  FILLER   PIC X(13)  VALUE    '391699 009534'.
               05  FILLER   PIC X(13)  VALUE    '391700 010871'.
               05  FILLER   PIC X(13)  VALUE    '391701 008541'.
               05  FILLER   PIC X(13)  VALUE    '391702 008411'.
               05  FILLER   PIC X(13)  VALUE    '391703 008411'.
               05  FILLER   PIC X(13)  VALUE    '391704 011482'.
               05  FILLER   PIC X(13)  VALUE    '391705 008411'.
               05  FILLER   PIC X(13)  VALUE    '391706 008411'.
               05  FILLER   PIC X(13)  VALUE    '391707 008411'.
               05  FILLER   PIC X(13)  VALUE    '391709 010871'.
               05  FILLER   PIC X(13)  VALUE    '391710 008411'.
               05  FILLER   PIC X(13)  VALUE    '391711 010871'.
               05  FILLER   PIC X(13)  VALUE    '391713 008541'.
               05  FILLER   PIC X(13)  VALUE    '391714 009309'.
               05  FILLER   PIC X(13)  VALUE    '391715 008411'.
               05  FILLER   PIC X(13)  VALUE    '391716 010871'.
               05  FILLER   PIC X(13)  VALUE    '391718 008411'.
               05  FILLER   PIC X(13)  VALUE    '391719 009309'.
               05  FILLER   PIC X(13)  VALUE    '391721 009134'.
               05  FILLER   PIC X(13)  VALUE    '391722 010871'.
               05  FILLER   PIC X(13)  VALUE    '391723 010871'.
               05  FILLER   PIC X(13)  VALUE    '391724 008411'.
               05  FILLER   PIC X(13)  VALUE    '391725 008411'.
               05  FILLER   PIC X(13)  VALUE    '391726 008411'.
               05  FILLER   PIC X(13)  VALUE    '391727 008411'.
               05  FILLER   PIC X(13)  VALUE    '391728 008411'.
               05  FILLER   PIC X(13)  VALUE    '391729 007894'.
               05  FILLER   PIC X(13)  VALUE    '391730 010871'.
               05  FILLER   PIC X(13)  VALUE    '391731 008411'.
               05  FILLER   PIC X(13)  VALUE    '391732 009309'.
               05  FILLER   PIC X(13)  VALUE    '391733 009309'.
               05  FILLER   PIC X(13)  VALUE    '391734 008411'.
               05  FILLER   PIC X(13)  VALUE    '391735 009134'.
               05  FILLER   PIC X(13)  VALUE    '391736 008411'.
               05  FILLER   PIC X(13)  VALUE    '391737 008069'.
               05  FILLER   PIC X(13)  VALUE    '391739 007894'.
               05  FILLER   PIC X(13)  VALUE    '391740 008541'.
               05  FILLER   PIC X(13)  VALUE    '391741 010871'.
               05  FILLER   PIC X(13)  VALUE    '391745 009309'.
               05  FILLER   PIC X(13)  VALUE    '391746 010871'.
               05  FILLER   PIC X(13)  VALUE    '391747 010871'.
               05  FILLER   PIC X(13)  VALUE    '391748 009534'.
               05  FILLER   PIC X(13)  VALUE    '391749 010871'.
               05  FILLER   PIC X(13)  VALUE    '391750 010871'.
               05  FILLER   PIC X(13)  VALUE    '391751 010871'.
               05  FILLER   PIC X(13)  VALUE    '391752 010112'.
               05  FILLER   PIC X(13)  VALUE    '391754 008411'.
               05  FILLER   PIC X(13)  VALUE    '391755 010871'.
               05  FILLER   PIC X(13)  VALUE    '391756 008069'.
               05  FILLER   PIC X(13)  VALUE    '391758 007894'.
               05  FILLER   PIC X(13)  VALUE    '392024 008411'.
               05  FILLER   PIC X(13)  VALUE    '392027 010871'.
               05  FILLER   PIC X(13)  VALUE    '392031 008257'.
               05  FILLER   PIC X(13)  VALUE    '392036 008411'.
               05  FILLER   PIC X(13)  VALUE    '392037 007894'.
               05  FILLER   PIC X(13)  VALUE    '392039 009309'.
               05  FILLER   PIC X(13)  VALUE    '392044 008411'.
               05  FILLER   PIC X(13)  VALUE    '392045 008411'.
               05  FILLER   PIC X(13)  VALUE    '392046 010871'.
               05  FILLER   PIC X(13)  VALUE    '392047 009086'.
               05  FILLER   PIC X(13)  VALUE    '392048 010211'.
               05  FILLER   PIC X(13)  VALUE    '392050 010871'.
               05  FILLER   PIC X(13)  VALUE    '393025 010211'.
               05  FILLER   PIC X(13)  VALUE    '393026 009843'.
               05  FILLER   PIC X(13)  VALUE    '393027 008411'.
               05  FILLER   PIC X(13)  VALUE    '393030 008541'.
               05  FILLER   PIC X(13)  VALUE    '393031 009309'.
               05  FILLER   PIC X(13)  VALUE    '393035 009534'.
               05  FILLER   PIC X(13)  VALUE    '393036 008541'.
               05  FILLER   PIC X(13)  VALUE    '393037 009476'.
               05  FILLER   PIC X(13)  VALUE    '393038 010871'.
               05  FILLER   PIC X(13)  VALUE    '393039 009936'.
               05  FILLER   PIC X(13)  VALUE    '393040 010112'.
               05  FILLER   PIC X(13)  VALUE    '393045 008411'.
               05  FILLER   PIC X(13)  VALUE    '393047 009086'.
               05  FILLER   PIC X(13)  VALUE    '393053 009309'.
               05  FILLER   PIC X(13)  VALUE    '393056 009309'.
               05  FILLER   PIC X(13)  VALUE    '393302 008411'.
               05  FILLER   PIC X(13)  VALUE    '393303 010871'.
               05  FILLER   PIC X(13)  VALUE    '393307 010871'.
               05  FILLER   PIC X(13)  VALUE    '394001 010307'.
               05  FILLER   PIC X(13)  VALUE    '394004 009086'.
               05  FILLER   PIC X(13)  VALUE    '394012 008541'.
               05  FILLER   PIC X(13)  VALUE    '394014 009843'.
               05  FILLER   PIC X(13)  VALUE    '394016 007894'.
               05  FILLER   PIC X(13)  VALUE    '394020 009437'.
               05  FILLER   PIC X(13)  VALUE    '394023 010871'.
               05  FILLER   PIC X(13)  VALUE    '394026 008411'.
               05  FILLER   PIC X(13)  VALUE    '394034 010307'.
               05  FILLER   PIC X(13)  VALUE    '394051 009309'.
               05  FILLER   PIC X(13)  VALUE    '394052 009843'.
               05  FILLER   PIC X(13)  VALUE    '394054 007894'.
               05  FILLER   PIC X(13)  VALUE    '394055 009234'.
               05  FILLER   PIC X(13)  VALUE    '394524 009915'.
               05  FILLER   PIC X(13)  VALUE    '394570 008411'.
               05  FILLER   PIC X(13)  VALUE    '394573 008411'.
               05  FILLER   PIC X(13)  VALUE    '394575 008411'.
               05  FILLER   PIC X(13)  VALUE    '394576 008411'.
               05  FILLER   PIC X(13)  VALUE    '394602 008411'.
               05  FILLER   PIC X(13)  VALUE    '394608 008411'.
               05  FILLER   PIC X(13)  VALUE    '394623 008411'.
               05  FILLER   PIC X(13)  VALUE    '394635 010871'.
               05  FILLER   PIC X(13)  VALUE    '394645 010112'.
               05  FILLER   PIC X(13)  VALUE    '394647 009915'.
               05  FILLER   PIC X(13)  VALUE    '394669 008541'.
               05  FILLER   PIC X(13)  VALUE    '394670 007894'.
               05  FILLER   PIC X(13)  VALUE    '394678 007894'.
               05  FILLER   PIC X(13)  VALUE    '394679 010871'.
               05  FILLER   PIC X(13)  VALUE    '394680 008411'.
               05  FILLER   PIC X(13)  VALUE    '394681 010112'.
               05  FILLER   PIC X(13)  VALUE    '394682 009534'.
               05  FILLER   PIC X(13)  VALUE    '394683 010871'.
               05  FILLER   PIC X(13)  VALUE    '397012 010871'.
               05  FILLER   PIC X(13)  VALUE    '397436 010871'.
               05  FILLER   PIC X(13)  VALUE    '397509 007993'.
               05  FILLER   PIC X(13)  VALUE    '398020 010871'.
               05  FILLER   PIC X(13)  VALUE    '398082 008411'.
               05  FILLER   PIC X(13)  VALUE    '398083 010871'.
               05  FILLER   PIC X(13)  VALUE    '398084 010871'.
               05  FILLER   PIC X(13)  VALUE    '398085 011482'.
               05  FILLER   PIC X(13)  VALUE    '398086 008541'.
               05  FILLER   PIC X(13)  VALUE    '398087 008411'.
               05  FILLER   PIC X(13)  VALUE    '398088 008411'.
               05  FILLER   PIC X(13)  VALUE    '398089 008411'.
               05  FILLER   PIC X(13)  VALUE    '398090 010871'.
               05  FILLER   PIC X(13)  VALUE    '398091 010871'.
               05  FILLER   PIC X(13)  VALUE    '398092 008541'.
               05  FILLER   PIC X(13)  VALUE    '398093 008541'.
               05  FILLER   PIC X(13)  VALUE    '398095 008411'.
               05  FILLER   PIC X(13)  VALUE    '398096 010871'.
               05  FILLER   PIC X(13)  VALUE    '398097 007894'.
               05  FILLER   PIC X(13)  VALUE    '398098 008411'.
               05  FILLER   PIC X(13)  VALUE    '398099 008411'.
               05  FILLER   PIC X(13)  VALUE    '398100 010871'.
               05  FILLER   PIC X(13)  VALUE    '398101 007894'.
               05  FILLER   PIC X(13)  VALUE    '398102 009309'.
               05  FILLER   PIC X(13)  VALUE    '398104 010871'.
               05  FILLER   PIC X(13)  VALUE    '398106 010871'.
               05  FILLER   PIC X(13)  VALUE    '398109 010871'.
               05  FILLER   PIC X(13)  VALUE    '398137 010112'.
               05  FILLER   PIC X(13)  VALUE    '398138 009309'.
               05  FILLER   PIC X(13)  VALUE    '398139 010871'.
               05  FILLER   PIC X(13)  VALUE    '398140 009534'.
               05  FILLER   PIC X(13)  VALUE    '398141 007894'.
               05  FILLER   PIC X(13)  VALUE    '398142 007894'.
               05  FILLER   PIC X(13)  VALUE    '398143 010871'.
               05  FILLER   PIC X(13)  VALUE    '398144 008751'.
               05  FILLER   PIC X(13)  VALUE    '398145 010871'.
               05  FILLER   PIC X(13)  VALUE    '398146 008411'.
               05  FILLER   PIC X(13)  VALUE    '398147 007894'.
               05  FILLER   PIC X(13)  VALUE    '398148 008411'.
               05  FILLER   PIC X(13)  VALUE    '398149 007894'.
               05  FILLER   PIC X(13)  VALUE    '398150 008411'.
               05  FILLER   PIC X(13)  VALUE    '398151 007894'.
               05  FILLER   PIC X(13)  VALUE    '398152 010871'.
               05  FILLER   PIC X(13)  VALUE    '398153 010871'.
               05  FILLER   PIC X(13)  VALUE    '398154 010871'.
               05  FILLER   PIC X(13)  VALUE    '398155 009785'.
               05  FILLER   PIC X(13)  VALUE    '398156 007894'.
               05  FILLER   PIC X(13)  VALUE    '398157 008541'.
               05  FILLER   PIC X(13)  VALUE    '398158 008751'.
               05  FILLER   PIC X(13)  VALUE    '398159 009309'.
               05  FILLER   PIC X(13)  VALUE    '398160 009534'.
               05  FILLER   PIC X(13)  VALUE    '398161 007894'.
               05  FILLER   PIC X(13)  VALUE    '398162 010871'.
               05  FILLER   PIC X(13)  VALUE    '398163 009309'.
               05  FILLER   PIC X(13)  VALUE    '398164 008411'.
               05  FILLER   PIC X(13)  VALUE    '398165 010871'.
               05  FILLER   PIC X(13)  VALUE    '398166 007894'.
               05  FILLER   PIC X(13)  VALUE    '398167 008751'.
               05  FILLER   PIC X(13)  VALUE    '398168 007894'.
               05  FILLER   PIC X(13)  VALUE    '398169 009534'.
               05  FILLER   PIC X(13)  VALUE    '398170 007894'.
               05  FILLER   PIC X(13)  VALUE    '398171 008411'.
               05  FILLER   PIC X(13)  VALUE    '398172 010871'.
               05  FILLER   PIC X(13)  VALUE    '398173 009936'.
               05  FILLER   PIC X(13)  VALUE    '398174 010871'.
               05  FILLER   PIC X(13)  VALUE    '398175 008069'.
               05  FILLER   PIC X(13)  VALUE    '398176 010871'.
               05  FILLER   PIC X(13)  VALUE    '398177 009936'.
               05  FILLER   PIC X(13)  VALUE    '398178 007894'.
               05  FILLER   PIC X(13)  VALUE    '398179 008411'.
               05  FILLER   PIC X(13)  VALUE    '398180 010871'.
               05  FILLER   PIC X(13)  VALUE    '398181 010871'.
               05  FILLER   PIC X(13)  VALUE    '398182 008411'.
               05  FILLER   PIC X(13)  VALUE    '398183 009534'.
               05  FILLER   PIC X(13)  VALUE    '398184 010871'.
               05  FILLER   PIC X(13)  VALUE    '398185 010871'.
               05  FILLER   PIC X(13)  VALUE    '398186 009534'.
               05  FILLER   PIC X(13)  VALUE    '398187 010871'.
               05  FILLER   PIC X(13)  VALUE    '398188 009309'.
               05  FILLER   PIC X(13)  VALUE    '398189 010871'.
               05  FILLER   PIC X(13)  VALUE    '398190 007894'.
               05  FILLER   PIC X(13)  VALUE    '398191 010871'.
               05  FILLER   PIC X(13)  VALUE    '398192 008541'.
               05  FILLER   PIC X(13)  VALUE    '398193 009461'.
               05  FILLER   PIC X(13)  VALUE    '398194 010871'.
               05  FILLER   PIC X(13)  VALUE    '398195 010871'.
               05  FILLER   PIC X(13)  VALUE    '398197 009309'.
               05  FILLER   PIC X(13)  VALUE    '398198 008411'.
               05  FILLER   PIC X(13)  VALUE    '398200 009534'.
               05  FILLER   PIC X(13)  VALUE    '398201 010871'.
               05  FILLER   PIC X(13)  VALUE    '398202 010871'.
               05  FILLER   PIC X(13)  VALUE    '398203 007894'.
               05  FILLER   PIC X(13)  VALUE    '398204 010871'.
               05  FILLER   PIC X(13)  VALUE    '398210 010871'.
               05  FILLER   PIC X(13)  VALUE    '398211 009534'.
               05  FILLER   PIC X(13)  VALUE    '40S110 003846'.
               05  FILLER   PIC X(13)  VALUE    '40S128 004141'.
               05  FILLER   PIC X(13)  VALUE    '40S130 003860'.
               05  FILLER   PIC X(13)  VALUE    '40T014 003711'.
               05  FILLER   PIC X(13)  VALUE    '40T016 004141'.
               05  FILLER   PIC X(13)  VALUE    '40T021 004232'.
               05  FILLER   PIC X(13)  VALUE    '400001 004141'.
               05  FILLER   PIC X(13)  VALUE    '400003 003846'.
               05  FILLER   PIC X(13)  VALUE    '400004 004141'.
               05  FILLER   PIC X(13)  VALUE    '400005 004141'.
               05  FILLER   PIC X(13)  VALUE    '400006 004141'.
               05  FILLER   PIC X(13)  VALUE    '400007 004141'.
               05  FILLER   PIC X(13)  VALUE    '400009 003821'.
               05  FILLER   PIC X(13)  VALUE    '400010 003711'.
               05  FILLER   PIC X(13)  VALUE    '400011 004141'.
               05  FILLER   PIC X(13)  VALUE    '400012 004141'.
               05  FILLER   PIC X(13)  VALUE    '400013 004141'.
               05  FILLER   PIC X(13)  VALUE    '400014 003711'.
               05  FILLER   PIC X(13)  VALUE    '400015 004141'.
               05  FILLER   PIC X(13)  VALUE    '400016 004141'.
               05  FILLER   PIC X(13)  VALUE    '400018 004141'.
               05  FILLER   PIC X(13)  VALUE    '400019 004141'.
               05  FILLER   PIC X(13)  VALUE    '400021 004232'.
               05  FILLER   PIC X(13)  VALUE    '400022 003846'.
               05  FILLER   PIC X(13)  VALUE    '400026 003711'.
               05  FILLER   PIC X(13)  VALUE    '400032 004141'.
               05  FILLER   PIC X(13)  VALUE    '400044 003846'.
               05  FILLER   PIC X(13)  VALUE    '400048 003821'.
               05  FILLER   PIC X(13)  VALUE    '400061 004141'.
               05  FILLER   PIC X(13)  VALUE    '400079 003711'.
               05  FILLER   PIC X(13)  VALUE    '400087 003882'.
               05  FILLER   PIC X(13)  VALUE    '400098 004141'.
               05  FILLER   PIC X(13)  VALUE    '400102 004141'.
               05  FILLER   PIC X(13)  VALUE    '400103 003711'.
               05  FILLER   PIC X(13)  VALUE    '400104 004141'.
               05  FILLER   PIC X(13)  VALUE    '400105 004141'.
               05  FILLER   PIC X(13)  VALUE    '400106 004141'.
               05  FILLER   PIC X(13)  VALUE    '400109 004141'.
               05  FILLER   PIC X(13)  VALUE    '400110 003846'.
               05  FILLER   PIC X(13)  VALUE    '400111 003711'.
               05  FILLER   PIC X(13)  VALUE    '400112 004141'.
               05  FILLER   PIC X(13)  VALUE    '400113 003846'.
               05  FILLER   PIC X(13)  VALUE    '400114 004141'.
               05  FILLER   PIC X(13)  VALUE    '400115 004141'.
               05  FILLER   PIC X(13)  VALUE    '400117 003882'.
               05  FILLER   PIC X(13)  VALUE    '400118 004141'.
               05  FILLER   PIC X(13)  VALUE    '400120 004141'.
               05  FILLER   PIC X(13)  VALUE    '400121 004141'.
               05  FILLER   PIC X(13)  VALUE    '400122 004141'.
               05  FILLER   PIC X(13)  VALUE    '400123 003711'.
               05  FILLER   PIC X(13)  VALUE    '400124 004141'.
               05  FILLER   PIC X(13)  VALUE    '400125 004141'.
               05  FILLER   PIC X(13)  VALUE    '400126 004232'.
               05  FILLER   PIC X(13)  VALUE    '400127 004141'.
               05  FILLER   PIC X(13)  VALUE    '400128 004141'.
               05  FILLER   PIC X(13)  VALUE    '400130 003860'.
               05  FILLER   PIC X(13)  VALUE    '400131 004141'.
               05  FILLER   PIC X(13)  VALUE    '400132 004141'.
               05  FILLER   PIC X(13)  VALUE    '400133 004141'.
               05  FILLER   PIC X(13)  VALUE    '400134 004141'.
               05  FILLER   PIC X(13)  VALUE    '401500 003846'.
               05  FILLER   PIC X(13)  VALUE    '401503 004141'.
               05  FILLER   PIC X(13)  VALUE    '401504 004141'.
               05  FILLER   PIC X(13)  VALUE    '401509 004141'.
               05  FILLER   PIC X(13)  VALUE    '401510 004141'.
               05  FILLER   PIC X(13)  VALUE    '401512 004141'.
               05  FILLER   PIC X(13)  VALUE    '401516 003711'.
               05  FILLER   PIC X(13)  VALUE    '401520 004232'.
               05  FILLER   PIC X(13)  VALUE    '401521 004141'.
               05  FILLER   PIC X(13)  VALUE    '401527 004141'.
               05  FILLER   PIC X(13)  VALUE    '401529 004141'.
               05  FILLER   PIC X(13)  VALUE    '401530 003846'.
               05  FILLER   PIC X(13)  VALUE    '401533 003711'.
               05  FILLER   PIC X(13)  VALUE    '401534 004141'.
               05  FILLER   PIC X(13)  VALUE    '401538 004141'.
               05  FILLER   PIC X(13)  VALUE    '401540 004141'.
               05  FILLER   PIC X(13)  VALUE    '401543 004141'.
               05  FILLER   PIC X(13)  VALUE    '401546 004141'.
               05  FILLER   PIC X(13)  VALUE    '401547 004141'.
               05  FILLER   PIC X(13)  VALUE    '401548 003846'.
               05  FILLER   PIC X(13)  VALUE    '401549 003711'.
               05  FILLER   PIC X(13)  VALUE    '401551 003711'.
               05  FILLER   PIC X(13)  VALUE    '401552 004141'.
               05  FILLER   PIC X(13)  VALUE    '401553 003846'.
               05  FILLER   PIC X(13)  VALUE    '401554 003711'.
               05  FILLER   PIC X(13)  VALUE    '401555 004141'.
               05  FILLER   PIC X(13)  VALUE    '401558 004141'.
               05  FILLER   PIC X(13)  VALUE    '401560 004141'.
               05  FILLER   PIC X(13)  VALUE    '401561 003711'.
               05  FILLER   PIC X(13)  VALUE    '401562 004141'.
               05  FILLER   PIC X(13)  VALUE    '401563 004141'.
               05  FILLER   PIC X(13)  VALUE    '401564 004141'.
               05  FILLER   PIC X(13)  VALUE    '401565 004141'.
               05  FILLER   PIC X(13)  VALUE    '401566 004141'.
               05  FILLER   PIC X(13)  VALUE    '401567 004232'.
               05  FILLER   PIC X(13)  VALUE    '403025 004141'.
               05  FILLER   PIC X(13)  VALUE    '403026 004141'.
               05  FILLER   PIC X(13)  VALUE    '403301 004141'.
               05  FILLER   PIC X(13)  VALUE    '404004 004141'.
               05  FILLER   PIC X(13)  VALUE    '404005 004141'.
               05  FILLER   PIC X(13)  VALUE    '404007 004232'.
               05  FILLER   PIC X(13)  VALUE    '404602 004141'.
               05  FILLER   PIC X(13)  VALUE    '404616 004141'.
               05  FILLER   PIC X(13)  VALUE    '404617 004141'.
               05  FILLER   PIC X(13)  VALUE    '404618 004141'.
               05  FILLER   PIC X(13)  VALUE    '407033 003711'.
               05  FILLER   PIC X(13)  VALUE    '407034 004141'.
               05  FILLER   PIC X(13)  VALUE    '41S004 010445'.
               05  FILLER   PIC X(13)  VALUE    '41S005 010445'.
               05  FILLER   PIC X(13)  VALUE    '41S006 010445'.
               05  FILLER   PIC X(13)  VALUE    '41S007 010445'.
               05  FILLER   PIC X(13)  VALUE    '41S011 010445'.
               05  FILLER   PIC X(13)  VALUE    '41T005 010445'.
               05  FILLER   PIC X(13)  VALUE    '41T006 010445'.
               05  FILLER   PIC X(13)  VALUE    '41T007 010445'.
               05  FILLER   PIC X(13)  VALUE    '41T009 010445'.
               05  FILLER   PIC X(13)  VALUE    '410001 010445'.
               05  FILLER   PIC X(13)  VALUE    '410004 010445'.
               05  FILLER   PIC X(13)  VALUE    '410005 010445'.
               05  FILLER   PIC X(13)  VALUE    '410006 010445'.
               05  FILLER   PIC X(13)  VALUE    '410007 010445'.
               05  FILLER   PIC X(13)  VALUE    '410008 010445'.
               05  FILLER   PIC X(13)  VALUE    '410009 011322'.
               05  FILLER   PIC X(13)  VALUE    '410010 012200'.
               05  FILLER   PIC X(13)  VALUE    '410011 010445'.
               05  FILLER   PIC X(13)  VALUE    '410012 010445'.
               05  FILLER   PIC X(13)  VALUE    '410013 010445'.
               05  FILLER   PIC X(13)  VALUE    '411500 013545'.
               05  FILLER   PIC X(13)  VALUE    '411502 013545'.
               05  FILLER   PIC X(13)  VALUE    '411503 013545'.
               05  FILLER   PIC X(13)  VALUE    '411505 013545'.
               05  FILLER   PIC X(13)  VALUE    '411506 013545'.
               05  FILLER   PIC X(13)  VALUE    '411508 013545'.
               05  FILLER   PIC X(13)  VALUE    '411510 013545'.
               05  FILLER   PIC X(13)  VALUE    '411511 013545'.
               05  FILLER   PIC X(13)  VALUE    '413025 010445'.
               05  FILLER   PIC X(13)  VALUE    '414000 010445'.
               05  FILLER   PIC X(13)  VALUE    '42S002 009422'.
               05  FILLER   PIC X(13)  VALUE    '42S004 008778'.
               05  FILLER   PIC X(13)  VALUE    '42S018 008382'.
               05  FILLER   PIC X(13)  VALUE    '42S027 008889'.
               05  FILLER   PIC X(13)  VALUE    '42S030 008168'.
               05  FILLER   PIC X(13)  VALUE    '42S036 009422'.
               05  FILLER   PIC X(13)  VALUE    '42S048 008382'.
               05  FILLER   PIC X(13)  VALUE    '42S054 008048'.
               05  FILLER   PIC X(13)  VALUE    '42S057 008048'.
               05  FILLER   PIC X(13)  VALUE    '42S067 008048'.
               05  FILLER   PIC X(13)  VALUE    '42S068 008088'.
               05  FILLER   PIC X(13)  VALUE    '42S071 008048'.
               05  FILLER   PIC X(13)  VALUE    '42S078 008889'.
               05  FILLER   PIC X(13)  VALUE    '42S079 008778'.
               05  FILLER   PIC X(13)  VALUE    '42S082 008690'.
               05  FILLER   PIC X(13)  VALUE    '42S083 008536'.
               05  FILLER   PIC X(13)  VALUE    '42S085 008336'.
               05  FILLER   PIC X(13)  VALUE    '42S086 008382'.
               05  FILLER   PIC X(13)  VALUE    '42T023 008889'.
               05  FILLER   PIC X(13)  VALUE    '42T030 008168'.
               05  FILLER   PIC X(13)  VALUE    '42T036 009422'.
               05  FILLER   PIC X(13)  VALUE    '42T067 008048'.
               05  FILLER   PIC X(13)  VALUE    '42T068 008088'.
               05  FILLER   PIC X(13)  VALUE    '42T070 008092'.
               05  FILLER   PIC X(13)  VALUE    '42T078 008889'.
               05  FILLER   PIC X(13)  VALUE    '42T079 008778'.
               05  FILLER   PIC X(13)  VALUE    '42T082 008690'.
               05  FILLER   PIC X(13)  VALUE    '42T083 008536'.
               05  FILLER   PIC X(13)  VALUE    '42T085 008336'.
               05  FILLER   PIC X(13)  VALUE    '42T087 008778'.
               05  FILLER   PIC X(13)  VALUE    '42T091 008048'.
               05  FILLER   PIC X(13)  VALUE    '420002 009422'.
               05  FILLER   PIC X(13)  VALUE    '420004 008778'.
               05  FILLER   PIC X(13)  VALUE    '420005 008048'.
               05  FILLER   PIC X(13)  VALUE    '420007 008889'.
               05  FILLER   PIC X(13)  VALUE    '420009 008284'.
               05  FILLER   PIC X(13)  VALUE    '420010 009298'.
               05  FILLER   PIC X(13)  VALUE    '420011 008889'.
               05  FILLER   PIC X(13)  VALUE    '420015 008889'.
               05  FILLER   PIC X(13)  VALUE    '420016 008048'.
               05  FILLER   PIC X(13)  VALUE    '420018 008557'.
               05  FILLER   PIC X(13)  VALUE    '420019 009422'.
               05  FILLER   PIC X(13)  VALUE    '420020 008778'.
               05  FILLER   PIC X(13)  VALUE    '420023 008889'.
               05  FILLER   PIC X(13)  VALUE    '420026 008557'.
               05  FILLER   PIC X(13)  VALUE    '420027 008889'.
               05  FILLER   PIC X(13)  VALUE    '420030 008778'.
               05  FILLER   PIC X(13)  VALUE    '420033 008889'.
               05  FILLER   PIC X(13)  VALUE    '420036 009422'.
               05  FILLER   PIC X(13)  VALUE    '420037 008889'.
               05  FILLER   PIC X(13)  VALUE    '420038 008048'.
               05  FILLER   PIC X(13)  VALUE    '420039 008406'.
               05  FILLER   PIC X(13)  VALUE    '420043 008172'.
               05  FILLER   PIC X(13)  VALUE    '420048 008382'.
               05  FILLER   PIC X(13)  VALUE    '420049 008336'.
               05  FILLER   PIC X(13)  VALUE    '420051 008048'.
               05  FILLER   PIC X(13)  VALUE    '420053 008223'.
               05  FILLER   PIC X(13)  VALUE    '420055 008048'.
               05  FILLER   PIC X(13)  VALUE    '420057 008048'.
               05  FILLER   PIC X(13)  VALUE    '420062 008048'.
               05  FILLER   PIC X(13)  VALUE    '420065 008778'.
               05  FILLER   PIC X(13)  VALUE    '420066 008048'.
               05  FILLER   PIC X(13)  VALUE    '420067 008048'.
               05  FILLER   PIC X(13)  VALUE    '420068 008778'.
               05  FILLER   PIC X(13)  VALUE    '420069 008048'.
               05  FILLER   PIC X(13)  VALUE    '420070 008223'.
               05  FILLER   PIC X(13)  VALUE    '420071 008889'.
               05  FILLER   PIC X(13)  VALUE    '420072 008048'.
               05  FILLER   PIC X(13)  VALUE    '420073 008382'.
               05  FILLER   PIC X(13)  VALUE    '420078 008889'.
               05  FILLER   PIC X(13)  VALUE    '420079 008778'.
               05  FILLER   PIC X(13)  VALUE    '420080 008048'.
               05  FILLER   PIC X(13)  VALUE    '420082 008690'.
               05  FILLER   PIC X(13)  VALUE    '420083 008889'.
               05  FILLER   PIC X(13)  VALUE    '420085 008336'.
               05  FILLER   PIC X(13)  VALUE    '420086 008382'.
               05  FILLER   PIC X(13)  VALUE    '420087 008778'.
               05  FILLER   PIC X(13)  VALUE    '420089 008778'.
               05  FILLER   PIC X(13)  VALUE    '420091 008048'.
               05  FILLER   PIC X(13)  VALUE    '420098 008098'.
               05  FILLER   PIC X(13)  VALUE    '420101 008059'.
               05  FILLER   PIC X(13)  VALUE    '420102 008889'.
               05  FILLER   PIC X(13)  VALUE    '420103 008889'.
               05  FILLER   PIC X(13)  VALUE    '420104 008778'.
               05  FILLER   PIC X(13)  VALUE    '420105 008336'.
               05  FILLER   PIC X(13)  VALUE    '420106 008382'.
               05  FILLER   PIC X(13)  VALUE    '420107 008048'.
               05  FILLER   PIC X(13)  VALUE    '420108 008406'.
               05  FILLER   PIC X(13)  VALUE    '420109 008048'.
               05  FILLER   PIC X(13)  VALUE    '421545 008382'.
               05  FILLER   PIC X(13)  VALUE    '421546 008778'.
               05  FILLER   PIC X(13)  VALUE    '421548 008382'.
               05  FILLER   PIC X(13)  VALUE    '421558 008889'.
               05  FILLER   PIC X(13)  VALUE    '421586 008690'.
               05  FILLER   PIC X(13)  VALUE    '421587 008406'.
               05  FILLER   PIC X(13)  VALUE    '421588 008382'.
               05  FILLER   PIC X(13)  VALUE    '421590 008048'.
               05  FILLER   PIC X(13)  VALUE    '421592 008048'.
               05  FILLER   PIC X(13)  VALUE    '421593 008048'.
               05  FILLER   PIC X(13)  VALUE    '421594 008048'.
               05  FILLER   PIC X(13)  VALUE    '421595 008690'.
               05  FILLER   PIC X(13)  VALUE    '421596 008382'.
               05  FILLER   PIC X(13)  VALUE    '421597 008690'.
               05  FILLER   PIC X(13)  VALUE    '421599 008048'.
               05  FILLER   PIC X(13)  VALUE    '421601 008048'.
               05  FILLER   PIC X(13)  VALUE    '421602 008778'.
               05  FILLER   PIC X(13)  VALUE    '421603 008382'.
               05  FILLER   PIC X(13)  VALUE    '421605 008048'.
               05  FILLER   PIC X(13)  VALUE    '421606 008336'.
               05  FILLER   PIC X(13)  VALUE    '421608 008382'.
               05  FILLER   PIC X(13)  VALUE    '421609 008382'.
               05  FILLER   PIC X(13)  VALUE    '421611 008889'.
               05  FILLER   PIC X(13)  VALUE    '421612 008778'.
               05  FILLER   PIC X(13)  VALUE    '421613 008382'.
               05  FILLER   PIC X(13)  VALUE    '421614 008889'.
               05  FILLER   PIC X(13)  VALUE    '421615 008690'.
               05  FILLER   PIC X(13)  VALUE    '421616 008048'.
               05  FILLER   PIC X(13)  VALUE    '421617 008778'.
               05  FILLER   PIC X(13)  VALUE    '422004 008536'.
               05  FILLER   PIC X(13)  VALUE    '422005 008778'.
               05  FILLER   PIC X(13)  VALUE    '422007 008048'.
               05  FILLER   PIC X(13)  VALUE    '422008 008889'.
               05  FILLER   PIC X(13)  VALUE    '423025 008382'.
               05  FILLER   PIC X(13)  VALUE    '423028 009422'.
               05  FILLER   PIC X(13)  VALUE    '423029 008889'.
               05  FILLER   PIC X(13)  VALUE    '423031 008536'.
               05  FILLER   PIC X(13)  VALUE    '423032 008048'.
               05  FILLER   PIC X(13)  VALUE    '424005 008382'.
               05  FILLER   PIC X(13)  VALUE    '424006 008778'.
               05  FILLER   PIC X(13)  VALUE    '424008 008382'.
               05  FILLER   PIC X(13)  VALUE    '424010 008889'.
               05  FILLER   PIC X(13)  VALUE    '424011 008889'.
               05  FILLER   PIC X(13)  VALUE    '424014 009422'.
               05  FILLER   PIC X(13)  VALUE    '424601 008406'.
               05  FILLER   PIC X(13)  VALUE    '424602 008406'.
               05  FILLER   PIC X(13)  VALUE    '424615 008889'.
               05  FILLER   PIC X(13)  VALUE    '43S014 010000'.
               05  FILLER   PIC X(13)  VALUE    '43S016 010000'.
               05  FILLER   PIC X(13)  VALUE    '43S077 010000'.
               05  FILLER   PIC X(13)  VALUE    '43T016 010000'.
               05  FILLER   PIC X(13)  VALUE    '43T027 010000'.
               05  FILLER   PIC X(13)  VALUE    '43T077 010000'.
               05  FILLER   PIC X(13)  VALUE    '43U005 010000'.
               05  FILLER   PIC X(13)  VALUE    '43U008 010000'.
               05  FILLER   PIC X(13)  VALUE    '43U012 010000'.
               05  FILLER   PIC X(13)  VALUE    '43U013 010000'.
               05  FILLER   PIC X(13)  VALUE    '43U014 010000'.
               05  FILLER   PIC X(13)  VALUE    '43U064 010000'.
               05  FILLER   PIC X(13)  VALUE    '430005 010000'.
               05  FILLER   PIC X(13)  VALUE    '430008 010000'.
               05  FILLER   PIC X(13)  VALUE    '430012 010000'.
               05  FILLER   PIC X(13)  VALUE    '430013 010000'.
               05  FILLER   PIC X(13)  VALUE    '430014 010000'.
               05  FILLER   PIC X(13)  VALUE    '430015 010000'.
               05  FILLER   PIC X(13)  VALUE    '430016 010000'.
               05  FILLER   PIC X(13)  VALUE    '430027 010000'.
               05  FILLER   PIC X(13)  VALUE    '430048 010000'.
               05  FILLER   PIC X(13)  VALUE    '430077 010000'.
               05  FILLER   PIC X(13)  VALUE    '430081 014448'.
               05  FILLER   PIC X(13)  VALUE    '430082 010000'.
               05  FILLER   PIC X(13)  VALUE    '430083 014448'.
               05  FILLER   PIC X(13)  VALUE    '430084 014448'.
               05  FILLER   PIC X(13)  VALUE    '430089 010000'.
               05  FILLER   PIC X(13)  VALUE    '430090 010000'.
               05  FILLER   PIC X(13)  VALUE    '430091 010000'.
               05  FILLER   PIC X(13)  VALUE    '430092 010000'.
               05  FILLER   PIC X(13)  VALUE    '430093 010000'.
               05  FILLER   PIC X(13)  VALUE    '430095 010000'.
               05  FILLER   PIC X(13)  VALUE    '430096 010000'.
               05  FILLER   PIC X(13)  VALUE    '430097 010000'.
               05  FILLER   PIC X(13)  VALUE    '431501 010000'.
               05  FILLER   PIC X(13)  VALUE    '431502 010000'.
               05  FILLER   PIC X(13)  VALUE    '431503 010000'.
               05  FILLER   PIC X(13)  VALUE    '431504 010000'.
               05  FILLER   PIC X(13)  VALUE    '431505 010000'.
               05  FILLER   PIC X(13)  VALUE    '431506 010000'.
               05  FILLER   PIC X(13)  VALUE    '431507 010000'.
               05  FILLER   PIC X(13)  VALUE    '431508 010000'.
               05  FILLER   PIC X(13)  VALUE    '431509 010000'.
               05  FILLER   PIC X(13)  VALUE    '431512 010000'.
               05  FILLER   PIC X(13)  VALUE    '431513 010000'.
               05  FILLER   PIC X(13)  VALUE    '431515 010000'.
               05  FILLER   PIC X(13)  VALUE    '431516 010000'.
               05  FILLER   PIC X(13)  VALUE    '432002 010000'.
               05  FILLER   PIC X(13)  VALUE    '433300 010000'.
               05  FILLER   PIC X(13)  VALUE    '434003 010000'.
               05  FILLER   PIC X(13)  VALUE    '437081 010000'.
               05  FILLER   PIC X(13)  VALUE    '44S003 008799'.
               05  FILLER   PIC X(13)  VALUE    '44S006 008799'.
               05  FILLER   PIC X(13)  VALUE    '44S011 007175'.
               05  FILLER   PIC X(13)  VALUE    '44S012 007101'.
               05  FILLER   PIC X(13)  VALUE    '44S016 007101'.
               05  FILLER   PIC X(13)  VALUE    '44S018 007101'.
               05  FILLER   PIC X(13)  VALUE    '44S020 007101'.
               05  FILLER   PIC X(13)  VALUE    '44S030 007101'.
               05  FILLER   PIC X(13)  VALUE    '44S031 007101'.
               05  FILLER   PIC X(13)  VALUE    '44S033 007175'.
               05  FILLER   PIC X(13)  VALUE    '44S034 007175'.
               05  FILLER   PIC X(13)  VALUE    '44S039 008799'.
               05  FILLER   PIC X(13)  VALUE    '44S040 007101'.
               05  FILLER   PIC X(13)  VALUE    '44S049 008713'.
               05  FILLER   PIC X(13)  VALUE    '44S050 007101'.
               05  FILLER   PIC X(13)  VALUE    '44S052 007101'.
               05  FILLER   PIC X(13)  VALUE    '44S058 007101'.
               05  FILLER   PIC X(13)  VALUE    '44S059 007101'.
               05  FILLER   PIC X(13)  VALUE    '44S063 007101'.
               05  FILLER   PIC X(13)  VALUE    '44S068 007101'.
               05  FILLER   PIC X(13)  VALUE    '44S082 008799'.
               05  FILLER   PIC X(13)  VALUE    '44S120 007175'.
               05  FILLER   PIC X(13)  VALUE    '44S132 007101'.
               05  FILLER   PIC X(13)  VALUE    '44S144 008142'.
               05  FILLER   PIC X(13)  VALUE    '44S151 007101'.
               05  FILLER   PIC X(13)  VALUE    '44S156 008519'.
               05  FILLER   PIC X(13)  VALUE    '44S159 008713'.
               05  FILLER   PIC X(13)  VALUE    '44S161 008799'.
               05  FILLER   PIC X(13)  VALUE    '44S173 007175'.
               05  FILLER   PIC X(13)  VALUE    '44S183 008713'.
               05  FILLER   PIC X(13)  VALUE    '44S185 008120'.
               05  FILLER   PIC X(13)  VALUE    '44S187 007101'.
               05  FILLER   PIC X(13)  VALUE    '44S192 007101'.
               05  FILLER   PIC X(13)  VALUE    '44S193 008799'.
               05  FILLER   PIC X(13)  VALUE    '44S200 008799'.
               05  FILLER   PIC X(13)  VALUE    '44S231 008799'.
               05  FILLER   PIC X(13)  VALUE    '44T003 008799'.
               05  FILLER   PIC X(13)  VALUE    '44T006 008799'.
               05  FILLER   PIC X(13)  VALUE    '44T009 007101'.
               05  FILLER   PIC X(13)  VALUE    '44T026 008799'.
               05  FILLER   PIC X(13)  VALUE    '44T035 007312'.
               05  FILLER   PIC X(13)  VALUE    '44T039 008799'.
               05  FILLER   PIC X(13)  VALUE    '44T046 008799'.
               05  FILLER   PIC X(13)  VALUE    '44T050 007101'.
               05  FILLER   PIC X(13)  VALUE    '44T057 007101'.
               05  FILLER   PIC X(13)  VALUE    '44T058 007101'.
               05  FILLER   PIC X(13)  VALUE    '44T059 007101'.
               05  FILLER   PIC X(13)  VALUE    '44T067 007101'.
               05  FILLER   PIC X(13)  VALUE    '44T120 007175'.
               05  FILLER   PIC X(13)  VALUE    '44T125 007175'.
               05  FILLER   PIC X(13)  VALUE    '44T133 008799'.
               05  FILLER   PIC X(13)  VALUE    '44T150 008799'.
               05  FILLER   PIC X(13)  VALUE    '44T151 007101'.
               05  FILLER   PIC X(13)  VALUE    '44T152 008713'.
               05  FILLER   PIC X(13)  VALUE    '44T156 008519'.
               05  FILLER   PIC X(13)  VALUE    '44T162 008519'.
               05  FILLER   PIC X(13)  VALUE    '44T175 007101'.
               05  FILLER   PIC X(13)  VALUE    '44T183 008713'.
               05  FILLER   PIC X(13)  VALUE    '44T187 007101'.
               05  FILLER   PIC X(13)  VALUE    '44T193 008799'.
               05  FILLER   PIC X(13)  VALUE    '44T197 008799'.
               05  FILLER   PIC X(13)  VALUE    '44T200 008799'.
               05  FILLER   PIC X(13)  VALUE    '44T231 008799'.
               05  FILLER   PIC X(13)  VALUE    '44U007 008162'.
               05  FILLER   PIC X(13)  VALUE    '44U010 007101'.
               05  FILLER   PIC X(13)  VALUE    '44U016 008087'.
               05  FILLER   PIC X(13)  VALUE    '44U020 007101'.
               05  FILLER   PIC X(13)  VALUE    '44U032 007101'.
               05  FILLER   PIC X(13)  VALUE    '44U033 007970'.
               05  FILLER   PIC X(13)  VALUE    '44U040 007101'.
               05  FILLER   PIC X(13)  VALUE    '44U047 008281'.
               05  FILLER   PIC X(13)  VALUE    '44U056 007101'.
               05  FILLER   PIC X(13)  VALUE    '44U060 008281'.
               05  FILLER   PIC X(13)  VALUE    '44U064 008519'.
               05  FILLER   PIC X(13)  VALUE    '44U070 008052'.
               05  FILLER   PIC X(13)  VALUE    '44U109 008013'.
               05  FILLER   PIC X(13)  VALUE    '44U132 007101'.
               05  FILLER   PIC X(13)  VALUE    '44U148 008253'.
               05  FILLER   PIC X(13)  VALUE    '44U151 007101'.
               05  FILLER   PIC X(13)  VALUE    '44U168 008713'.
               05  FILLER   PIC X(13)  VALUE    '44U186 008799'.
               05  FILLER   PIC X(13)  VALUE    '44U187 007101'.
               05  FILLER   PIC X(13)  VALUE    '44U200 008799'.
               05  FILLER   PIC X(13)  VALUE    '440001 007101'.
               05  FILLER   PIC X(13)  VALUE    '440002 008421'.
               05  FILLER   PIC X(13)  VALUE    '440003 008799'.
               05  FILLER   PIC X(13)  VALUE    '440006 008799'.
               05  FILLER   PIC X(13)  VALUE    '440007 007305'.
               05  FILLER   PIC X(13)  VALUE    '440008 007265'.
               05  FILLER   PIC X(13)  VALUE    '440009 007101'.
               05  FILLER   PIC X(13)  VALUE    '440010 007101'.
               05  FILLER   PIC X(13)  VALUE    '440011 007850'.
               05  FILLER   PIC X(13)  VALUE    '440012 007364'.
               05  FILLER   PIC X(13)  VALUE    '440015 007175'.
               05  FILLER   PIC X(13)  VALUE    '440016 007174'.
               05  FILLER   PIC X(13)  VALUE    '440017 007364'.
               05  FILLER   PIC X(13)  VALUE    '440018 007101'.
               05  FILLER   PIC X(13)  VALUE    '440020 008577'.
               05  FILLER   PIC X(13)  VALUE    '440025 007101'.
               05  FILLER   PIC X(13)  VALUE    '440029 008799'.
               05  FILLER   PIC X(13)  VALUE    '440030 007101'.
               05  FILLER   PIC X(13)  VALUE    '440031 007175'.
               05  FILLER   PIC X(13)  VALUE    '440032 007101'.
               05  FILLER   PIC X(13)  VALUE    '440033 007965'.
               05  FILLER   PIC X(13)  VALUE    '440034 007175'.
               05  FILLER   PIC X(13)  VALUE    '440035 008577'.
               05  FILLER   PIC X(13)  VALUE    '440039 008799'.
               05  FILLER   PIC X(13)  VALUE    '440040 007101'.
               05  FILLER   PIC X(13)  VALUE    '440046 008799'.
               05  FILLER   PIC X(13)  VALUE    '440048 008713'.
               05  FILLER   PIC X(13)  VALUE    '440049 008713'.
               05  FILLER   PIC X(13)  VALUE    '440050 007101'.
               05  FILLER   PIC X(13)  VALUE    '440051 007125'.
               05  FILLER   PIC X(13)  VALUE    '440053 008799'.
               05  FILLER   PIC X(13)  VALUE    '440056 007175'.
               05  FILLER   PIC X(13)  VALUE    '440057 007101'.
               05  FILLER   PIC X(13)  VALUE    '440058 008331'.
               05  FILLER   PIC X(13)  VALUE    '440059 008577'.
               05  FILLER   PIC X(13)  VALUE    '440060 007275'.
               05  FILLER   PIC X(13)  VALUE    '440061 007167'.
               05  FILLER   PIC X(13)  VALUE    '440063 008463'.
               05  FILLER   PIC X(13)  VALUE    '440064 008519'.
               05  FILLER   PIC X(13)  VALUE    '440065 008799'.
               05  FILLER   PIC X(13)  VALUE    '440067 007175'.
               05  FILLER   PIC X(13)  VALUE    '440068 008331'.
               05  FILLER   PIC X(13)  VALUE    '440070 007101'.
               05  FILLER   PIC X(13)  VALUE    '440072 007101'.
               05  FILLER   PIC X(13)  VALUE    '440073 008799'.
               05  FILLER   PIC X(13)  VALUE    '440081 007101'.
               05  FILLER   PIC X(13)  VALUE    '440082 008799'.
               05  FILLER   PIC X(13)  VALUE    '440083 007965'.
               05  FILLER   PIC X(13)  VALUE    '440084 007101'.
               05  FILLER   PIC X(13)  VALUE    '440091 008519'.
               05  FILLER   PIC X(13)  VALUE    '440102 007101'.
               05  FILLER   PIC X(13)  VALUE    '440104 008519'.
               05  FILLER   PIC X(13)  VALUE    '440109 007101'.
               05  FILLER   PIC X(13)  VALUE    '440110 007175'.
               05  FILLER   PIC X(13)  VALUE    '440111 008799'.
               05  FILLER   PIC X(13)  VALUE    '440120 007175'.
               05  FILLER   PIC X(13)  VALUE    '440125 007175'.
               05  FILLER   PIC X(13)  VALUE    '440130 007965'.
               05  FILLER   PIC X(13)  VALUE    '440131 008713'.
               05  FILLER   PIC X(13)  VALUE    '440132 007101'.
               05  FILLER   PIC X(13)  VALUE    '440133 008799'.
               05  FILLER   PIC X(13)  VALUE    '440137 008577'.
               05  FILLER   PIC X(13)  VALUE    '440144 008577'.
               05  FILLER   PIC X(13)  VALUE    '440147 008713'.
               05  FILLER   PIC X(13)  VALUE    '440148 007101'.
               05  FILLER   PIC X(13)  VALUE    '440150 008799'.
               05  FILLER   PIC X(13)  VALUE    '440151 008577'.
               05  FILLER   PIC X(13)  VALUE    '440152 008713'.
               05  FILLER   PIC X(13)  VALUE    '440153 007101'.
               05  FILLER   PIC X(13)  VALUE    '440156 008519'.
               05  FILLER   PIC X(13)  VALUE    '440159 008713'.
               05  FILLER   PIC X(13)  VALUE    '440161 008799'.
               05  FILLER   PIC X(13)  VALUE    '440168 008713'.
               05  FILLER   PIC X(13)  VALUE    '440173 007175'.
               05  FILLER   PIC X(13)  VALUE    '440174 007785'.
               05  FILLER   PIC X(13)  VALUE    '440175 008165'.
               05  FILLER   PIC X(13)  VALUE    '440176 007116'.
               05  FILLER   PIC X(13)  VALUE    '440180 007175'.
               05  FILLER   PIC X(13)  VALUE    '440181 007576'.
               05  FILLER   PIC X(13)  VALUE    '440182 007174'.
               05  FILLER   PIC X(13)  VALUE    '440183 008713'.
               05  FILLER   PIC X(13)  VALUE    '440184 007101'.
               05  FILLER   PIC X(13)  VALUE    '440185 008331'.
               05  FILLER   PIC X(13)  VALUE    '440187 008577'.
               05  FILLER   PIC X(13)  VALUE    '440189 008421'.
               05  FILLER   PIC X(13)  VALUE    '440192 008577'.
               05  FILLER   PIC X(13)  VALUE    '440193 008799'.
               05  FILLER   PIC X(13)  VALUE    '440194 008799'.
               05  FILLER   PIC X(13)  VALUE    '440197 008799'.
               05  FILLER   PIC X(13)  VALUE    '440200 008799'.
               05  FILLER   PIC X(13)  VALUE    '440218 008799'.
               05  FILLER   PIC X(13)  VALUE    '440227 008799'.
               05  FILLER   PIC X(13)  VALUE    '440228 008713'.
               05  FILLER   PIC X(13)  VALUE    '440231 008799'.
               05  FILLER   PIC X(13)  VALUE    '440234 008713'.
               05  FILLER   PIC X(13)  VALUE    '440235 007101'.
               05  FILLER   PIC X(13)  VALUE    '441533 008519'.
               05  FILLER   PIC X(13)  VALUE    '441578 007101'.
               05  FILLER   PIC X(13)  VALUE    '441598 008799'.
               05  FILLER   PIC X(13)  VALUE    '441599 007101'.
               05  FILLER   PIC X(13)  VALUE    '441600 008519'.
               05  FILLER   PIC X(13)  VALUE    '442006 008799'.
               05  FILLER   PIC X(13)  VALUE    '442007 008519'.
               05  FILLER   PIC X(13)  VALUE    '442010 008713'.
               05  FILLER   PIC X(13)  VALUE    '442011 008799'.
               05  FILLER   PIC X(13)  VALUE    '442014 008713'.
               05  FILLER   PIC X(13)  VALUE    '442015 007175'.
               05  FILLER   PIC X(13)  VALUE    '443025 008519'.
               05  FILLER   PIC X(13)  VALUE    '443027 007116'.
               05  FILLER   PIC X(13)  VALUE    '443029 008713'.
               05  FILLER   PIC X(13)  VALUE    '443031 008713'.
               05  FILLER   PIC X(13)  VALUE    '443033 007101'.
               05  FILLER   PIC X(13)  VALUE    '443303 007175'.
               05  FILLER   PIC X(13)  VALUE    '444001 008713'.
               05  FILLER   PIC X(13)  VALUE    '444002 008519'.
               05  FILLER   PIC X(13)  VALUE    '444003 007175'.
               05  FILLER   PIC X(13)  VALUE    '444004 008713'.
               05  FILLER   PIC X(13)  VALUE    '444007 008799'.
               05  FILLER   PIC X(13)  VALUE    '444008 007576'.
               05  FILLER   PIC X(13)  VALUE    '444010 007586'.
               05  FILLER   PIC X(13)  VALUE    '444014 008799'.
               05  FILLER   PIC X(13)  VALUE    '444022 007101'.
               05  FILLER   PIC X(13)  VALUE    '444025 008713'.
               05  FILLER   PIC X(13)  VALUE    '444026 008519'.
               05  FILLER   PIC X(13)  VALUE    '444027 007116'.
               05  FILLER   PIC X(13)  VALUE    '444504 007101'.
               05  FILLER   PIC X(13)  VALUE    '444507 007101'.
               05  FILLER   PIC X(13)  VALUE    '444521 009778'.
               05  FILLER   PIC X(13)  VALUE    '444526 007101'.
               05  FILLER   PIC X(13)  VALUE    '444527 008799'.
               05  FILLER   PIC X(13)  VALUE    '444529 009778'.
               05  FILLER   PIC X(13)  VALUE    '444530 007175'.
               05  FILLER   PIC X(13)  VALUE    '444603 008799'.
               05  FILLER   PIC X(13)  VALUE    '444606 007101'.
               05  FILLER   PIC X(13)  VALUE    '444626 007101'.
               05  FILLER   PIC X(13)  VALUE    '444645 008799'.
               05  FILLER   PIC X(13)  VALUE    '444647 008713'.
               05  FILLER   PIC X(13)  VALUE    '444648 008519'.
               05  FILLER   PIC X(13)  VALUE    '444649 008799'.
               05  FILLER   PIC X(13)  VALUE    '447500 007101'.
               05  FILLER   PIC X(13)  VALUE    '447565 007586'.
               05  FILLER   PIC X(13)  VALUE    '447574 007101'.
               05  FILLER   PIC X(13)  VALUE    '45S002 008106'.
               05  FILLER   PIC X(13)  VALUE    '45S015 009736'.
               05  FILLER   PIC X(13)  VALUE    '45S033 008760'.
               05  FILLER   PIC X(13)  VALUE    '45S035 009754'.
               05  FILLER   PIC X(13)  VALUE    '45S039 009681'.
               05  FILLER   PIC X(13)  VALUE    '45S042 008993'.
               05  FILLER   PIC X(13)  VALUE    '45S046 009170'.
               05  FILLER   PIC X(13)  VALUE    '45S054 009701'.
               05  FILLER   PIC X(13)  VALUE    '45S058 008538'.
               05  FILLER   PIC X(13)  VALUE    '45S064 009681'.
               05  FILLER   PIC X(13)  VALUE    '45S080 008106'.
               05  FILLER   PIC X(13)  VALUE    '45S087 009681'.
               05  FILLER   PIC X(13)  VALUE    '45S099 008106'.
               05  FILLER   PIC X(13)  VALUE    '45S119 008224'.
               05  FILLER   PIC X(13)  VALUE    '45S130 008538'.
               05  FILLER   PIC X(13)  VALUE    '45S147 008725'.
               05  FILLER   PIC X(13)  VALUE    '45S165 008538'.
               05  FILLER   PIC X(13)  VALUE    '45S200 008803'.
               05  FILLER   PIC X(13)  VALUE    '45S203 009592'.
               05  FILLER   PIC X(13)  VALUE    '45S271 009592'.
               05  FILLER   PIC X(13)  VALUE    '45S289 009754'.
               05  FILLER   PIC X(13)  VALUE    '45S324 008421'.
               05  FILLER   PIC X(13)  VALUE    '45S330 009754'.
               05  FILLER   PIC X(13)  VALUE    '45S346 008878'.
               05  FILLER   PIC X(13)  VALUE    '45S352 009736'.
               05  FILLER   PIC X(13)  VALUE    '45S358 009754'.
               05  FILLER   PIC X(13)  VALUE    '45S379 009736'.
               05  FILLER   PIC X(13)  VALUE    '45S388 008538'.
               05  FILLER   PIC X(13)  VALUE    '45S400 008203'.
               05  FILLER   PIC X(13)  VALUE    '45S403 009736'.
               05  FILLER   PIC X(13)  VALUE    '45S424 009754'.
               05  FILLER   PIC X(13)  VALUE    '45S462 009736'.
               05  FILLER   PIC X(13)  VALUE    '45S465 008106'.
               05  FILLER   PIC X(13)  VALUE    '45S469 008421'.
               05  FILLER   PIC X(13)  VALUE    '45S508 008106'.
               05  FILLER   PIC X(13)  VALUE    '45S518 008878'.
               05  FILLER   PIC X(13)  VALUE    '45S537 009736'.
               05  FILLER   PIC X(13)  VALUE    '45S571 008106'.
               05  FILLER   PIC X(13)  VALUE    '45S584 008106'.
               05  FILLER   PIC X(13)  VALUE    '45S587 008106'.
               05  FILLER   PIC X(13)  VALUE    '45S639 009681'.
               05  FILLER   PIC X(13)  VALUE    '45S644 009754'.
               05  FILLER   PIC X(13)  VALUE    '45S653 008106'.
               05  FILLER   PIC X(13)  VALUE    '45S670 009754'.
               05  FILLER   PIC X(13)  VALUE    '45S690 008244'.
               05  FILLER   PIC X(13)  VALUE    '45S694 008106'.
               05  FILLER   PIC X(13)  VALUE    '45S697 008538'.
               05  FILLER   PIC X(13)  VALUE    '45S747 008164'.
               05  FILLER   PIC X(13)  VALUE    '45S766 009736'.
               05  FILLER   PIC X(13)  VALUE    '45S771 009736'.
               05  FILLER   PIC X(13)  VALUE    '45S788 009170'.
               05  FILLER   PIC X(13)  VALUE    '45S869 008224'.
               05  FILLER   PIC X(13)  VALUE    '45T007 008106'.
               05  FILLER   PIC X(13)  VALUE    '45T011 008491'.
               05  FILLER   PIC X(13)  VALUE    '45T015 009736'.
               05  FILLER   PIC X(13)  VALUE    '45T029 008106'.
               05  FILLER   PIC X(13)  VALUE    '45T032 008270'.
               05  FILLER   PIC X(13)  VALUE    '45T033 008760'.
               05  FILLER   PIC X(13)  VALUE    '45T035 009754'.
               05  FILLER   PIC X(13)  VALUE    '45T046 009170'.
               05  FILLER   PIC X(13)  VALUE    '45T058 008538'.
               05  FILLER   PIC X(13)  VALUE    '45T059 008538'.
               05  FILLER   PIC X(13)  VALUE    '45T068 009754'.
               05  FILLER   PIC X(13)  VALUE    '45T072 009754'.
               05  FILLER   PIC X(13)  VALUE    '45T079 009736'.
               05  FILLER   PIC X(13)  VALUE    '45T080 008106'.
               05  FILLER   PIC X(13)  VALUE    '45T092 008106'.
               05  FILLER   PIC X(13)  VALUE    '45T097 009754'.
               05  FILLER   PIC X(13)  VALUE    '45T099 007974'.
               05  FILLER   PIC X(13)  VALUE    '45T101 008993'.
               05  FILLER   PIC X(13)  VALUE    '45T104 008538'.
               05  FILLER   PIC X(13)  VALUE    '45T107 008106'.
               05  FILLER   PIC X(13)  VALUE    '45T119 008224'.
               05  FILLER   PIC X(13)  VALUE    '45T132 008969'.
               05  FILLER   PIC X(13)  VALUE    '45T137 009681'.
               05  FILLER   PIC X(13)  VALUE    '45T147 008725'.
               05  FILLER   PIC X(13)  VALUE    '45T165 008538'.
               05  FILLER   PIC X(13)  VALUE    '45T176 008224'.
               05  FILLER   PIC X(13)  VALUE    '45T184 009754'.
               05  FILLER   PIC X(13)  VALUE    '45T193 009754'.
               05  FILLER   PIC X(13)  VALUE    '45T196 008106'.
               05  FILLER   PIC X(13)  VALUE    '45T209 008154'.
               05  FILLER   PIC X(13)  VALUE    '45T211 008106'.
               05  FILLER   PIC X(13)  VALUE    '45T213 008538'.
               05  FILLER   PIC X(13)  VALUE    '45T214 008106'.
               05  FILLER   PIC X(13)  VALUE    '45T222 009754'.
               05  FILLER   PIC X(13)  VALUE    '45T229 008247'.
               05  FILLER   PIC X(13)  VALUE    '45T231 008154'.
               05  FILLER   PIC X(13)  VALUE    '45T236 008414'.
               05  FILLER   PIC X(13)  VALUE    '45T271 009592'.
               05  FILLER   PIC X(13)  VALUE    '45T299 008491'.
               05  FILLER   PIC X(13)  VALUE    '45T324 008421'.
               05  FILLER   PIC X(13)  VALUE    '45T346 008878'.
               05  FILLER   PIC X(13)  VALUE    '45T347 008513'.
               05  FILLER   PIC X(13)  VALUE    '45T352 009736'.
               05  FILLER   PIC X(13)  VALUE    '45T358 009754'.
               05  FILLER   PIC X(13)  VALUE    '45T378 009999'.
               05  FILLER   PIC X(13)  VALUE    '45T379 009736'.
               05  FILLER   PIC X(13)  VALUE    '45T388 008538'.
               05  FILLER   PIC X(13)  VALUE    '45T403 009736'.
               05  FILLER   PIC X(13)  VALUE    '45T424 009754'.
               05  FILLER   PIC X(13)  VALUE    '45T431 009417'.
               05  FILLER   PIC X(13)  VALUE    '45T447 008106'.
               05  FILLER   PIC X(13)  VALUE    '45T462 009736'.
               05  FILLER   PIC X(13)  VALUE    '45T484 008106'.
               05  FILLER   PIC X(13)  VALUE    '45T508 008106'.
               05  FILLER   PIC X(13)  VALUE    '45T518 008878'.
               05  FILLER   PIC X(13)  VALUE    '45T563 009681'.
               05  FILLER   PIC X(13)  VALUE    '45T571 008106'.
               05  FILLER   PIC X(13)  VALUE    '45T587 008106'.
               05  FILLER   PIC X(13)  VALUE    '45T617 009754'.
               05  FILLER   PIC X(13)  VALUE    '45T630 009754'.
               05  FILLER   PIC X(13)  VALUE    '45T638 009754'.
               05  FILLER   PIC X(13)  VALUE    '45T643 008106'.
               05  FILLER   PIC X(13)  VALUE    '45T644 009754'.
               05  FILLER   PIC X(13)  VALUE    '45T646 008106'.
               05  FILLER   PIC X(13)  VALUE    '45T647 009736'.
               05  FILLER   PIC X(13)  VALUE    '45T651 009736'.
               05  FILLER   PIC X(13)  VALUE    '45T659 009754'.
               05  FILLER   PIC X(13)  VALUE    '45T661 008969'.
               05  FILLER   PIC X(13)  VALUE    '45T668 008106'.
               05  FILLER   PIC X(13)  VALUE    '45T669 009736'.
               05  FILLER   PIC X(13)  VALUE    '45T670 009754'.
               05  FILLER   PIC X(13)  VALUE    '45T672 009681'.
               05  FILLER   PIC X(13)  VALUE    '45T675 009681'.
               05  FILLER   PIC X(13)  VALUE    '45T688 009736'.
               05  FILLER   PIC X(13)  VALUE    '45T697 008538'.
               05  FILLER   PIC X(13)  VALUE    '45T702 008106'.
               05  FILLER   PIC X(13)  VALUE    '45T716 010049'.
               05  FILLER   PIC X(13)  VALUE    '45T718 009417'.
               05  FILLER   PIC X(13)  VALUE    '45T747 008164'.
               05  FILLER   PIC X(13)  VALUE    '45T766 009736'.
               05  FILLER   PIC X(13)  VALUE    '45T775 009754'.
               05  FILLER   PIC X(13)  VALUE    '45T788 009170'.
               05  FILLER   PIC X(13)  VALUE    '45T809 009417'.
               05  FILLER   PIC X(13)  VALUE    '45T811 008224'.
               05  FILLER   PIC X(13)  VALUE    '45T862 009754'.
               05  FILLER   PIC X(13)  VALUE    '45T869 008224'.
               05  FILLER   PIC X(13)  VALUE    '45U055 008106'.
               05  FILLER   PIC X(13)  VALUE    '45U085 008106'.
               05  FILLER   PIC X(13)  VALUE    '45U090 008106'.
               05  FILLER   PIC X(13)  VALUE    '45U144 008106'.
               05  FILLER   PIC X(13)  VALUE    '45U154 008106'.
               05  FILLER   PIC X(13)  VALUE    '45U155 008106'.
               05  FILLER   PIC X(13)  VALUE    '45U187 008106'.
               05  FILLER   PIC X(13)  VALUE    '45U210 008106'.
               05  FILLER   PIC X(13)  VALUE    '45U241 008106'.
               05  FILLER   PIC X(13)  VALUE    '45U253 008106'.
               05  FILLER   PIC X(13)  VALUE    '45U348 008993'.
               05  FILLER   PIC X(13)  VALUE    '45U351 008106'.
               05  FILLER   PIC X(13)  VALUE    '45U369 008106'.
               05  FILLER   PIC X(13)  VALUE    '45U370 008106'.
               05  FILLER   PIC X(13)  VALUE    '45U399 008106'.
               05  FILLER   PIC X(13)  VALUE    '45U400 008106'.
               05  FILLER   PIC X(13)  VALUE    '45U411 008106'.
               05  FILLER   PIC X(13)  VALUE    '45U451 009592'.
               05  FILLER   PIC X(13)  VALUE    '45U489 008106'.
               05  FILLER   PIC X(13)  VALUE    '45U497 008106'.
               05  FILLER   PIC X(13)  VALUE    '45U498 008106'.
               05  FILLER   PIC X(13)  VALUE    '45U539 008106'.
               05  FILLER   PIC X(13)  VALUE    '45U565 008106'.
               05  FILLER   PIC X(13)  VALUE    '45U573 008106'.
               05  FILLER   PIC X(13)  VALUE    '45U578 008106'.
               05  FILLER   PIC X(13)  VALUE    '45U584 008106'.
               05  FILLER   PIC X(13)  VALUE    '45U586 008106'.
               05  FILLER   PIC X(13)  VALUE    '45U604 008106'.
               05  FILLER   PIC X(13)  VALUE    '45U641 008106'.
               05  FILLER   PIC X(13)  VALUE    '45U658 008106'.
               05  FILLER   PIC X(13)  VALUE    '45U694 008106'.
               05  FILLER   PIC X(13)  VALUE    '45U698 008106'.
               05  FILLER   PIC X(13)  VALUE    '45U755 008106'.
               05  FILLER   PIC X(13)  VALUE    '45U770 008106'.
               05  FILLER   PIC X(13)  VALUE    '45Z329 008106'.
               05  FILLER   PIC X(13)  VALUE    '45Z353 008106'.
               05  FILLER   PIC X(13)  VALUE    '45Z361 008106'.
               05  FILLER   PIC X(13)  VALUE    '45Z379 009701'.
               05  FILLER   PIC X(13)  VALUE    '45Z380 008106'.
               05  FILLER   PIC X(13)  VALUE    '45Z381 008106'.
               05  FILLER   PIC X(13)  VALUE    '45Z382 008106'.
               05  FILLER   PIC X(13)  VALUE    '450002 008106'.
               05  FILLER   PIC X(13)  VALUE    '450005 008878'.
               05  FILLER   PIC X(13)  VALUE    '450007 008538'.
               05  FILLER   PIC X(13)  VALUE    '450010 008643'.
               05  FILLER   PIC X(13)  VALUE    '450011 008106'.
               05  FILLER   PIC X(13)  VALUE    '450015 009736'.
               05  FILLER   PIC X(13)  VALUE    '450018 009754'.
               05  FILLER   PIC X(13)  VALUE    '450021 009736'.
               05  FILLER   PIC X(13)  VALUE    '450023 008106'.
               05  FILLER   PIC X(13)  VALUE    '450024 008106'.
               05  FILLER   PIC X(13)  VALUE    '450028 008760'.
               05  FILLER   PIC X(13)  VALUE    '450029 008840'.
               05  FILLER   PIC X(13)  VALUE    '450032 008106'.
               05  FILLER   PIC X(13)  VALUE    '450033 008760'.
               05  FILLER   PIC X(13)  VALUE    '450034 009754'.
               05  FILLER   PIC X(13)  VALUE    '450035 009754'.
               05  FILLER   PIC X(13)  VALUE    '450037 008106'.
               05  FILLER   PIC X(13)  VALUE    '450039 009736'.
               05  FILLER   PIC X(13)  VALUE    '450040 008597'.
               05  FILLER   PIC X(13)  VALUE    '450042 009510'.
               05  FILLER   PIC X(13)  VALUE    '450044 009736'.
               05  FILLER   PIC X(13)  VALUE    '450046 009170'.
               05  FILLER   PIC X(13)  VALUE    '450051 009736'.
               05  FILLER   PIC X(13)  VALUE    '450054 009701'.
               05  FILLER   PIC X(13)  VALUE    '450055 008138'.
               05  FILLER   PIC X(13)  VALUE    '450056 009417'.
               05  FILLER   PIC X(13)  VALUE    '450058 008538'.
               05  FILLER   PIC X(13)  VALUE    '450064 009736'.
               05  FILLER   PIC X(13)  VALUE    '450068 009754'.
               05  FILLER   PIC X(13)  VALUE    '450072 009754'.
               05  FILLER   PIC X(13)  VALUE    '450076 009754'.
               05  FILLER   PIC X(13)  VALUE    '450078 008106'.
               05  FILLER   PIC X(13)  VALUE    '450079 009736'.
               05  FILLER   PIC X(13)  VALUE    '450080 008106'.
               05  FILLER   PIC X(13)  VALUE    '450082 008296'.
               05  FILLER   PIC X(13)  VALUE    '450083 008244'.
               05  FILLER   PIC X(13)  VALUE    '450085 008106'.
               05  FILLER   PIC X(13)  VALUE    '450087 009736'.
               05  FILLER   PIC X(13)  VALUE    '450090 008810'.
               05  FILLER   PIC X(13)  VALUE    '450092 008106'.
               05  FILLER   PIC X(13)  VALUE    '450097 009754'.
               05  FILLER   PIC X(13)  VALUE    '450099 008106'.
               05  FILLER   PIC X(13)  VALUE    '450101 009510'.
               05  FILLER   PIC X(13)  VALUE    '450102 008244'.
               05  FILLER   PIC X(13)  VALUE    '450104 008538'.
               05  FILLER   PIC X(13)  VALUE    '450107 008566'.
               05  FILLER   PIC X(13)  VALUE    '450108 008538'.
               05  FILLER   PIC X(13)  VALUE    '450119 008760'.
               05  FILLER   PIC X(13)  VALUE    '450124 009417'.
               05  FILLER   PIC X(13)  VALUE    '450128 008224'.
               05  FILLER   PIC X(13)  VALUE    '450130 008538'.
               05  FILLER   PIC X(13)  VALUE    '450132 008969'.
               05  FILLER   PIC X(13)  VALUE    '450133 008969'.
               05  FILLER   PIC X(13)  VALUE    '450135 009736'.
               05  FILLER   PIC X(13)  VALUE    '450137 009736'.
               05  FILLER   PIC X(13)  VALUE    '450143 009417'.
               05  FILLER   PIC X(13)  VALUE    '450144 008969'.
               05  FILLER   PIC X(13)  VALUE    '450147 008725'.
               05  FILLER   PIC X(13)  VALUE    '450148 009736'.
               05  FILLER   PIC X(13)  VALUE    '450152 009701'.
               05  FILLER   PIC X(13)  VALUE    '450154 008106'.
               05  FILLER   PIC X(13)  VALUE    '450155 008106'.
               05  FILLER   PIC X(13)  VALUE    '450162 008597'.
               05  FILLER   PIC X(13)  VALUE    '450163 008267'.
               05  FILLER   PIC X(13)  VALUE    '450165 008538'.
               05  FILLER   PIC X(13)  VALUE    '450176 008224'.
               05  FILLER   PIC X(13)  VALUE    '450184 009754'.
               05  FILLER   PIC X(13)  VALUE    '450187 008106'.
               05  FILLER   PIC X(13)  VALUE    '450188 008106'.
               05  FILLER   PIC X(13)  VALUE    '450192 009592'.
               05  FILLER   PIC X(13)  VALUE    '450193 009754'.
               05  FILLER   PIC X(13)  VALUE    '450194 008106'.
               05  FILLER   PIC X(13)  VALUE    '450196 009736'.
               05  FILLER   PIC X(13)  VALUE    '450200 008803'.
               05  FILLER   PIC X(13)  VALUE    '450203 009592'.
               05  FILLER   PIC X(13)  VALUE    '450209 008597'.
               05  FILLER   PIC X(13)  VALUE    '450210 008291'.
               05  FILLER   PIC X(13)  VALUE    '450211 008106'.
               05  FILLER   PIC X(13)  VALUE    '450213 009250'.
               05  FILLER   PIC X(13)  VALUE    '450214 008106'.
               05  FILLER   PIC X(13)  VALUE    '450219 008106'.
               05  FILLER   PIC X(13)  VALUE    '450222 009754'.
               05  FILLER   PIC X(13)  VALUE    '450229 008247'.
               05  FILLER   PIC X(13)  VALUE    '450231 008154'.
               05  FILLER   PIC X(13)  VALUE    '450235 008106'.
               05  FILLER   PIC X(13)  VALUE    '450236 008414'.
               05  FILLER   PIC X(13)  VALUE    '450237 009250'.
               05  FILLER   PIC X(13)  VALUE    '450241 008106'.
               05  FILLER   PIC X(13)  VALUE    '450243 008106'.
               05  FILLER   PIC X(13)  VALUE    '450253 009754'.
               05  FILLER   PIC X(13)  VALUE    '450271 009592'.
               05  FILLER   PIC X(13)  VALUE    '450272 009417'.
               05  FILLER   PIC X(13)  VALUE    '450280 009736'.
               05  FILLER   PIC X(13)  VALUE    '450289 009754'.
               05  FILLER   PIC X(13)  VALUE    '450292 009736'.
               05  FILLER   PIC X(13)  VALUE    '450299 008491'.
               05  FILLER   PIC X(13)  VALUE    '450306 008247'.
               05  FILLER   PIC X(13)  VALUE    '450324 009736'.
               05  FILLER   PIC X(13)  VALUE    '450330 009754'.
               05  FILLER   PIC X(13)  VALUE    '450340 008106'.
               05  FILLER   PIC X(13)  VALUE    '450346 009754'.
               05  FILLER   PIC X(13)  VALUE    '450347 009754'.
               05  FILLER   PIC X(13)  VALUE    '450348 008106'.
               05  FILLER   PIC X(13)  VALUE    '450351 009592'.
               05  FILLER   PIC X(13)  VALUE    '450352 009736'.
               05  FILLER   PIC X(13)  VALUE    '450358 009754'.
               05  FILLER   PIC X(13)  VALUE    '450369 008106'.
               05  FILLER   PIC X(13)  VALUE    '450370 009754'.
               05  FILLER   PIC X(13)  VALUE    '450372 009736'.
               05  FILLER   PIC X(13)  VALUE    '450373 008106'.
               05  FILLER   PIC X(13)  VALUE    '450379 009736'.
               05  FILLER   PIC X(13)  VALUE    '450388 008538'.
               05  FILLER   PIC X(13)  VALUE    '450389 008244'.
               05  FILLER   PIC X(13)  VALUE    '450395 008106'.
               05  FILLER   PIC X(13)  VALUE    '450399 008106'.
               05  FILLER   PIC X(13)  VALUE    '450400 008491'.
               05  FILLER   PIC X(13)  VALUE    '450403 009736'.
               05  FILLER   PIC X(13)  VALUE    '450411 008106'.
               05  FILLER   PIC X(13)  VALUE    '450419 009736'.
               05  FILLER   PIC X(13)  VALUE    '450422 009736'.
               05  FILLER   PIC X(13)  VALUE    '450424 009754'.
               05  FILLER   PIC X(13)  VALUE    '450431 009417'.
               05  FILLER   PIC X(13)  VALUE    '450447 009736'.
               05  FILLER   PIC X(13)  VALUE    '450451 009592'.
               05  FILLER   PIC X(13)  VALUE    '450460 008210'.
               05  FILLER   PIC X(13)  VALUE    '450462 009736'.
               05  FILLER   PIC X(13)  VALUE    '450465 009754'.
               05  FILLER   PIC X(13)  VALUE    '450469 009736'.
               05  FILLER   PIC X(13)  VALUE    '450475 008106'.
               05  FILLER   PIC X(13)  VALUE    '450484 008106'.
               05  FILLER   PIC X(13)  VALUE    '450488 008106'.
               05  FILLER   PIC X(13)  VALUE    '450489 008106'.
               05  FILLER   PIC X(13)  VALUE    '450497 008106'.
               05  FILLER   PIC X(13)  VALUE    '450498 008106'.
               05  FILLER   PIC X(13)  VALUE    '450508 008106'.
               05  FILLER   PIC X(13)  VALUE    '450518 008878'.
               05  FILLER   PIC X(13)  VALUE    '450537 009736'.
               05  FILLER   PIC X(13)  VALUE    '450539 008205'.
               05  FILLER   PIC X(13)  VALUE    '450558 008247'.
               05  FILLER   PIC X(13)  VALUE    '450563 009736'.
               05  FILLER   PIC X(13)  VALUE    '450565 008656'.
               05  FILLER   PIC X(13)  VALUE    '450571 008106'.
               05  FILLER   PIC X(13)  VALUE    '450573 008548'.
               05  FILLER   PIC X(13)  VALUE    '450578 008106'.
               05  FILLER   PIC X(13)  VALUE    '450580 008106'.
               05  FILLER   PIC X(13)  VALUE    '450584 008106'.
               05  FILLER   PIC X(13)  VALUE    '450586 008106'.
               05  FILLER   PIC X(13)  VALUE    '450587 008106'.
               05  FILLER   PIC X(13)  VALUE    '450591 009754'.
               05  FILLER   PIC X(13)  VALUE    '450596 009592'.
               05  FILLER   PIC X(13)  VALUE    '450597 008240'.
               05  FILLER   PIC X(13)  VALUE    '450604 008538'.
               05  FILLER   PIC X(13)  VALUE    '450605 009170'.
               05  FILLER   PIC X(13)  VALUE    '450610 009754'.
               05  FILLER   PIC X(13)  VALUE    '450617 009754'.
               05  FILLER   PIC X(13)  VALUE    '450634 009736'.
               05  FILLER   PIC X(13)  VALUE    '450638 009754'.
               05  FILLER   PIC X(13)  VALUE    '450639 009736'.
               05  FILLER   PIC X(13)  VALUE    '450641 008680'.
               05  FILLER   PIC X(13)  VALUE    '450643 008106'.
               05  FILLER   PIC X(13)  VALUE    '450644 009754'.
               05  FILLER   PIC X(13)  VALUE    '450647 009736'.
               05  FILLER   PIC X(13)  VALUE    '450651 009736'.
               05  FILLER   PIC X(13)  VALUE    '450653 008918'.
               05  FILLER   PIC X(13)  VALUE    '450654 008106'.
               05  FILLER   PIC X(13)  VALUE    '450656 008106'.
               05  FILLER   PIC X(13)  VALUE    '450658 008106'.
               05  FILLER   PIC X(13)  VALUE    '450659 009754'.
               05  FILLER   PIC X(13)  VALUE    '450661 008969'.
               05  FILLER   PIC X(13)  VALUE    '450662 008760'.
               05  FILLER   PIC X(13)  VALUE    '450668 008106'.
               05  FILLER   PIC X(13)  VALUE    '450669 009736'.
               05  FILLER   PIC X(13)  VALUE    '450670 009754'.
               05  FILLER   PIC X(13)  VALUE    '450672 009736'.
               05  FILLER   PIC X(13)  VALUE    '450674 009754'.
               05  FILLER   PIC X(13)  VALUE    '450675 009736'.
               05  FILLER   PIC X(13)  VALUE    '450677 009736'.
               05  FILLER   PIC X(13)  VALUE    '450678 009736'.
               05  FILLER   PIC X(13)  VALUE    '450684 009754'.
               05  FILLER   PIC X(13)  VALUE    '450686 008597'.
               05  FILLER   PIC X(13)  VALUE    '450688 009736'.
               05  FILLER   PIC X(13)  VALUE    '450690 008244'.
               05  FILLER   PIC X(13)  VALUE    '450694 008106'.
               05  FILLER   PIC X(13)  VALUE    '450697 008538'.
               05  FILLER   PIC X(13)  VALUE    '450698 008106'.
               05  FILLER   PIC X(13)  VALUE    '450702 008106'.
               05  FILLER   PIC X(13)  VALUE    '450709 009754'.
               05  FILLER   PIC X(13)  VALUE    '450711 008760'.
               05  FILLER   PIC X(13)  VALUE    '450713 009417'.
               05  FILLER   PIC X(13)  VALUE    '450716 009754'.
               05  FILLER   PIC X(13)  VALUE    '450718 009417'.
               05  FILLER   PIC X(13)  VALUE    '450723 009736'.
               05  FILLER   PIC X(13)  VALUE    '450730 009736'.
               05  FILLER   PIC X(13)  VALUE    '450742 009736'.
               05  FILLER   PIC X(13)  VALUE    '450743 009736'.
               05  FILLER   PIC X(13)  VALUE    '450746 008106'.
               05  FILLER   PIC X(13)  VALUE    '450747 008244'.
               05  FILLER   PIC X(13)  VALUE    '450749 008106'.
               05  FILLER   PIC X(13)  VALUE    '450755 008106'.
               05  FILLER   PIC X(13)  VALUE    '450766 009736'.
               05  FILLER   PIC X(13)  VALUE    '450770 009417'.
               05  FILLER   PIC X(13)  VALUE    '450771 009736'.
               05  FILLER   PIC X(13)  VALUE    '450774 009754'.
               05  FILLER   PIC X(13)  VALUE    '450775 009754'.
               05  FILLER   PIC X(13)  VALUE    '450779 009736'.
               05  FILLER   PIC X(13)  VALUE    '450780 008538'.
               05  FILLER   PIC X(13)  VALUE    '450788 009170'.
               05  FILLER   PIC X(13)  VALUE    '450796 008154'.
               05  FILLER   PIC X(13)  VALUE    '450797 009754'.
               05  FILLER   PIC X(13)  VALUE    '450801 008803'.
               05  FILLER   PIC X(13)  VALUE    '450803 009754'.
               05  FILLER   PIC X(13)  VALUE    '450804 009754'.
               05  FILLER   PIC X(13)  VALUE    '450808 009417'.
               05  FILLER   PIC X(13)  VALUE    '450809 009417'.
               05  FILLER   PIC X(13)  VALUE    '450820 009754'.
               05  FILLER   PIC X(13)  VALUE    '450822 009736'.
               05  FILLER   PIC X(13)  VALUE    '450825 008224'.
               05  FILLER   PIC X(13)  VALUE    '450827 008643'.
               05  FILLER   PIC X(13)  VALUE    '450828 008106'.
               05  FILLER   PIC X(13)  VALUE    '450831 009754'.
               05  FILLER   PIC X(13)  VALUE    '450832 009754'.
               05  FILLER   PIC X(13)  VALUE    '450833 009736'.
               05  FILLER   PIC X(13)  VALUE    '450834 008491'.
               05  FILLER   PIC X(13)  VALUE    '450840 009736'.
               05  FILLER   PIC X(13)  VALUE    '450844 009754'.
               05  FILLER   PIC X(13)  VALUE    '450845 008566'.
               05  FILLER   PIC X(13)  VALUE    '450847 009754'.
               05  FILLER   PIC X(13)  VALUE    '450848 009754'.
               05  FILLER   PIC X(13)  VALUE    '450851 009736'.
               05  FILLER   PIC X(13)  VALUE    '450853 009736'.
               05  FILLER   PIC X(13)  VALUE    '450855 008760'.
               05  FILLER   PIC X(13)  VALUE    '450856 008538'.
               05  FILLER   PIC X(13)  VALUE    '450860 009754'.
               05  FILLER   PIC X(13)  VALUE    '450862 009754'.
               05  FILLER   PIC X(13)  VALUE    '450864 008244'.
               05  FILLER   PIC X(13)  VALUE    '450865 009417'.
               05  FILLER   PIC X(13)  VALUE    '450867 009417'.
               05  FILLER   PIC X(13)  VALUE    '450869 008224'.
               05  FILLER   PIC X(13)  VALUE    '450871 009417'.
               05  FILLER   PIC X(13)  VALUE    '450872 009736'.
               05  FILLER   PIC X(13)  VALUE    '450874 009736'.
               05  FILLER   PIC X(13)  VALUE    '450875 008154'.
               05  FILLER   PIC X(13)  VALUE    '450876 008597'.
               05  FILLER   PIC X(13)  VALUE    '450877 008106'.
               05  FILLER   PIC X(13)  VALUE    '450880 009736'.
               05  FILLER   PIC X(13)  VALUE    '450883 009736'.
               05  FILLER   PIC X(13)  VALUE    '450884 008106'.
               05  FILLER   PIC X(13)  VALUE    '450885 009736'.
               05  FILLER   PIC X(13)  VALUE    '450888 009736'.
               05  FILLER   PIC X(13)  VALUE    '450889 009736'.
               05  FILLER   PIC X(13)  VALUE    '450890 009736'.
               05  FILLER   PIC X(13)  VALUE    '450891 009736'.
               05  FILLER   PIC X(13)  VALUE    '450893 009736'.
               05  FILLER   PIC X(13)  VALUE    '450894 009736'.
               05  FILLER   PIC X(13)  VALUE    '450895 008803'.
               05  FILLER   PIC X(13)  VALUE    '451515 009417'.
               05  FILLER   PIC X(13)  VALUE    '451642 009736'.
               05  FILLER   PIC X(13)  VALUE    '451651 008538'.
               05  FILLER   PIC X(13)  VALUE    '451663 008154'.
               05  FILLER   PIC X(13)  VALUE    '451707 008106'.
               05  FILLER   PIC X(13)  VALUE    '451743 009736'.
               05  FILLER   PIC X(13)  VALUE    '451758 009736'.
               05  FILLER   PIC X(13)  VALUE    '451774 008597'.
               05  FILLER   PIC X(13)  VALUE    '451783 009736'.
               05  FILLER   PIC X(13)  VALUE    '452015 009736'.
               05  FILLER   PIC X(13)  VALUE    '452016 008538'.
               05  FILLER   PIC X(13)  VALUE    '452018 009681'.
               05  FILLER   PIC X(13)  VALUE    '452019 009681'.
               05  FILLER   PIC X(13)  VALUE    '452022 009736'.
               05  FILLER   PIC X(13)  VALUE    '452023 009754'.
               05  FILLER   PIC X(13)  VALUE    '452028 009681'.
               05  FILLER   PIC X(13)  VALUE    '452031 008106'.
               05  FILLER   PIC X(13)  VALUE    '452032 009754'.
               05  FILLER   PIC X(13)  VALUE    '452034 009417'.
               05  FILLER   PIC X(13)  VALUE    '452035 008106'.
               05  FILLER   PIC X(13)  VALUE    '452038 009417'.
               05  FILLER   PIC X(13)  VALUE    '452039 009754'.
               05  FILLER   PIC X(13)  VALUE    '452041 008421'.
               05  FILLER   PIC X(13)  VALUE    '452044 009736'.
               05  FILLER   PIC X(13)  VALUE    '452046 009754'.
               05  FILLER   PIC X(13)  VALUE    '452051 008244'.
               05  FILLER   PIC X(13)  VALUE    '452055 009754'.
               05  FILLER   PIC X(13)  VALUE    '452056 008725'.
               05  FILLER   PIC X(13)  VALUE    '452057 009754'.
               05  FILLER   PIC X(13)  VALUE    '452059 008538'.
               05  FILLER   PIC X(13)  VALUE    '452060 008154'.
               05  FILLER   PIC X(13)  VALUE    '452062 009417'.
               05  FILLER   PIC X(13)  VALUE    '452067 009736'.
               05  FILLER   PIC X(13)  VALUE    '452073 008538'.
               05  FILLER   PIC X(13)  VALUE    '452074 009754'.
               05  FILLER   PIC X(13)  VALUE    '452075 009754'.
               05  FILLER   PIC X(13)  VALUE    '452080 009754'.
               05  FILLER   PIC X(13)  VALUE    '452086 009170'.
               05  FILLER   PIC X(13)  VALUE    '452088 009681'.
               05  FILLER   PIC X(13)  VALUE    '452090 008538'.
               05  FILLER   PIC X(13)  VALUE    '452092 009170'.
               05  FILLER   PIC X(13)  VALUE    '452094 008725'.
               05  FILLER   PIC X(13)  VALUE    '452095 008224'.
               05  FILLER   PIC X(13)  VALUE    '452096 008106'.
               05  FILLER   PIC X(13)  VALUE    '452097 009736'.
               05  FILLER   PIC X(13)  VALUE    '452100 009736'.
               05  FILLER   PIC X(13)  VALUE    '452101 008760'.
               05  FILLER   PIC X(13)  VALUE    '452105 009701'.
               05  FILLER   PIC X(13)  VALUE    '452106 008672'.
               05  FILLER   PIC X(13)  VALUE    '452107 009754'.
               05  FILLER   PIC X(13)  VALUE    '452108 009736'.
               05  FILLER   PIC X(13)  VALUE    '452110 009681'.
               05  FILLER   PIC X(13)  VALUE    '452111 009736'.
               05  FILLER   PIC X(13)  VALUE    '452112 009754'.
               05  FILLER   PIC X(13)  VALUE    '452114 009754'.
               05  FILLER   PIC X(13)  VALUE    '452118 009754'.
               05  FILLER   PIC X(13)  VALUE    '453025 009754'.
               05  FILLER   PIC X(13)  VALUE    '453029 009754'.
               05  FILLER   PIC X(13)  VALUE    '453031 008538'.
               05  FILLER   PIC X(13)  VALUE    '453035 008538'.
               05  FILLER   PIC X(13)  VALUE    '453036 009736'.
               05  FILLER   PIC X(13)  VALUE    '453040 009681'.
               05  FILLER   PIC X(13)  VALUE    '453041 009681'.
               05  FILLER   PIC X(13)  VALUE    '453042 009681'.
               05  FILLER   PIC X(13)  VALUE    '453048 008878'.
               05  FILLER   PIC X(13)  VALUE    '453052 009754'.
               05  FILLER   PIC X(13)  VALUE    '453053 008803'.
               05  FILLER   PIC X(13)  VALUE    '453054 008643'.
               05  FILLER   PIC X(13)  VALUE    '453056 008244'.
               05  FILLER   PIC X(13)  VALUE    '453059 009754'.
               05  FILLER   PIC X(13)  VALUE    '453065 008803'.
               05  FILLER   PIC X(13)  VALUE    '453072 008244'.
               05  FILLER   PIC X(13)  VALUE    '453086 008106'.
               05  FILLER   PIC X(13)  VALUE    '453092 008760'.
               05  FILLER   PIC X(13)  VALUE    '453096 008154'.
               05  FILLER   PIC X(13)  VALUE    '453300 009681'.
               05  FILLER   PIC X(13)  VALUE    '453301 009170'.
               05  FILLER   PIC X(13)  VALUE    '453302 009736'.
               05  FILLER   PIC X(13)  VALUE    '453304 009754'.
               05  FILLER   PIC X(13)  VALUE    '453306 008597'.
               05  FILLER   PIC X(13)  VALUE    '453308 009736'.
               05  FILLER   PIC X(13)  VALUE    '453310 009417'.
               05  FILLER   PIC X(13)  VALUE    '453313 008106'.
               05  FILLER   PIC X(13)  VALUE    '453314 009736'.
               05  FILLER   PIC X(13)  VALUE    '453315 008538'.
               05  FILLER   PIC X(13)  VALUE    '453316 009736'.
               05  FILLER   PIC X(13)  VALUE    '454000 008106'.
               05  FILLER   PIC X(13)  VALUE    '454006 009736'.
               05  FILLER   PIC X(13)  VALUE    '454009 008106'.
               05  FILLER   PIC X(13)  VALUE    '454011 008538'.
               05  FILLER   PIC X(13)  VALUE    '454012 009681'.
               05  FILLER   PIC X(13)  VALUE    '454014 008106'.
               05  FILLER   PIC X(13)  VALUE    '454018 008643'.
               05  FILLER   PIC X(13)  VALUE    '454026 009754'.
               05  FILLER   PIC X(13)  VALUE    '454029 009417'.
               05  FILLER   PIC X(13)  VALUE    '454050 009736'.
               05  FILLER   PIC X(13)  VALUE    '454060 008538'.
               05  FILLER   PIC X(13)  VALUE    '454064 008106'.
               05  FILLER   PIC X(13)  VALUE    '454065 009736'.
               05  FILLER   PIC X(13)  VALUE    '454069 009417'.
               05  FILLER   PIC X(13)  VALUE    '454076 009754'.
               05  FILLER   PIC X(13)  VALUE    '454083 009754'.
               05  FILLER   PIC X(13)  VALUE    '454084 009417'.
               05  FILLER   PIC X(13)  VALUE    '454088 008760'.
               05  FILLER   PIC X(13)  VALUE    '454094 009736'.
               05  FILLER   PIC X(13)  VALUE    '454100 008106'.
               05  FILLER   PIC X(13)  VALUE    '454101 008205'.
               05  FILLER   PIC X(13)  VALUE    '454103 009754'.
               05  FILLER   PIC X(13)  VALUE    '454104 009736'.
               05  FILLER   PIC X(13)  VALUE    '454107 009754'.
               05  FILLER   PIC X(13)  VALUE    '454108 009754'.
               05  FILLER   PIC X(13)  VALUE    '454109 008106'.
               05  FILLER   PIC X(13)  VALUE    '454110 008927'.
               05  FILLER   PIC X(13)  VALUE    '454111 009417'.
               05  FILLER   PIC X(13)  VALUE    '454114 009701'.
               05  FILLER   PIC X(13)  VALUE    '454117 008106'.
               05  FILLER   PIC X(13)  VALUE    '454118 009754'.
               05  FILLER   PIC X(13)  VALUE    '454119 009736'.
               05  FILLER   PIC X(13)  VALUE    '454121 009417'.
               05  FILLER   PIC X(13)  VALUE    '454122 008247'.
               05  FILLER   PIC X(13)  VALUE    '454123 008106'.
               05  FILLER   PIC X(13)  VALUE    '454124 009681'.
               05  FILLER   PIC X(13)  VALUE    '454125 008491'.
               05  FILLER   PIC X(13)  VALUE    '454126 009736'.
               05  FILLER   PIC X(13)  VALUE    '454127 009417'.
               05  FILLER   PIC X(13)  VALUE    '454128 009681'.
               05  FILLER   PIC X(13)  VALUE    '454129 009417'.
               05  FILLER   PIC X(13)  VALUE    '454130 009736'.
               05  FILLER   PIC X(13)  VALUE    '454131 009754'.
               05  FILLER   PIC X(13)  VALUE    '454132 008538'.
               05  FILLER   PIC X(13)  VALUE    '454134 009736'.
               05  FILLER   PIC X(13)  VALUE    '454135 009754'.
               05  FILLER   PIC X(13)  VALUE    '454136 009754'.
               05  FILLER   PIC X(13)  VALUE    '454137 009417'.
               05  FILLER   PIC X(13)  VALUE    '454138 009736'.
               05  FILLER   PIC X(13)  VALUE    '454139 009754'.
               05  FILLER   PIC X(13)  VALUE    '454141 008760'.
               05  FILLER   PIC X(13)  VALUE    '454143 008106'.
               05  FILLER   PIC X(13)  VALUE    '454144 009754'.
               05  FILLER   PIC X(13)  VALUE    '454510 008106'.
               05  FILLER   PIC X(13)  VALUE    '454522 008106'.
               05  FILLER   PIC X(13)  VALUE    '454546 009754'.
               05  FILLER   PIC X(13)  VALUE    '454620 009754'.
               05  FILLER   PIC X(13)  VALUE    '454632 009754'.
               05  FILLER   PIC X(13)  VALUE    '454645 009754'.
               05  FILLER   PIC X(13)  VALUE    '454769 009754'.
               05  FILLER   PIC X(13)  VALUE    '454819 008106'.
               05  FILLER   PIC X(13)  VALUE    '454860 008760'.
               05  FILLER   PIC X(13)  VALUE    '454863 008106'.
               05  FILLER   PIC X(13)  VALUE    '454866 008224'.
               05  FILLER   PIC X(13)  VALUE    '454867 008760'.
               05  FILLER   PIC X(13)  VALUE    '454872 009754'.
               05  FILLER   PIC X(13)  VALUE    '454907 009754'.
               05  FILLER   PIC X(13)  VALUE    '454908 009417'.
               05  FILLER   PIC X(13)  VALUE    '454909 009754'.
               05  FILLER   PIC X(13)  VALUE    '454916 008538'.
               05  FILLER   PIC X(13)  VALUE    '454923 009417'.
               05  FILLER   PIC X(13)  VALUE    '454924 009754'.
               05  FILLER   PIC X(13)  VALUE    '454931 009754'.
               05  FILLER   PIC X(13)  VALUE    '454932 009736'.
               05  FILLER   PIC X(13)  VALUE    '457047 008643'.
               05  FILLER   PIC X(13)  VALUE    '46B051 009326'.
               05  FILLER   PIC X(13)  VALUE    '46S001 009255'.
               05  FILLER   PIC X(13)  VALUE    '46S003 009693'.
               05  FILLER   PIC X(13)  VALUE    '46S004 009095'.
               05  FILLER   PIC X(13)  VALUE    '46S006 009693'.
               05  FILLER   PIC X(13)  VALUE    '46S009 009693'.
               05  FILLER   PIC X(13)  VALUE    '46S013 009440'.
               05  FILLER   PIC X(13)  VALUE    '46S015 008822'.
               05  FILLER   PIC X(13)  VALUE    '46S021 009434'.
               05  FILLER   PIC X(13)  VALUE    '46S041 009095'.
               05  FILLER   PIC X(13)  VALUE    '46S042 009095'.
               05  FILLER   PIC X(13)  VALUE    '46S047 009693'.
               05  FILLER   PIC X(13)  VALUE    '46S051 009693'.
               05  FILLER   PIC X(13)  VALUE    '46T001 009255'.
               05  FILLER   PIC X(13)  VALUE    '46T003 009693'.
               05  FILLER   PIC X(13)  VALUE    '46T004 009095'.
               05  FILLER   PIC X(13)  VALUE    '46T005 009095'.
               05  FILLER   PIC X(13)  VALUE    '46T009 009693'.
               05  FILLER   PIC X(13)  VALUE    '46T010 009693'.
               05  FILLER   PIC X(13)  VALUE    '46T021 009434'.
               05  FILLER   PIC X(13)  VALUE    '46T041 009095'.
               05  FILLER   PIC X(13)  VALUE    '46T047 009693'.
               05  FILLER   PIC X(13)  VALUE    '46T051 009693'.
               05  FILLER   PIC X(13)  VALUE    '46U007 008738'.
               05  FILLER   PIC X(13)  VALUE    '46U011 008738'.
               05  FILLER   PIC X(13)  VALUE    '46U026 008738'.
               05  FILLER   PIC X(13)  VALUE    '46U030 008738'.
               05  FILLER   PIC X(13)  VALUE    '46Z308 008738'.
               05  FILLER   PIC X(13)  VALUE    '460001 009527'.
               05  FILLER   PIC X(13)  VALUE    '460003 009693'.
               05  FILLER   PIC X(13)  VALUE    '460004 009527'.
               05  FILLER   PIC X(13)  VALUE    '460005 009527'.
               05  FILLER   PIC X(13)  VALUE    '460006 009693'.
               05  FILLER   PIC X(13)  VALUE    '460007 008738'.
               05  FILLER   PIC X(13)  VALUE    '460009 009693'.
               05  FILLER   PIC X(13)  VALUE    '460010 009693'.
               05  FILLER   PIC X(13)  VALUE    '460011 008738'.
               05  FILLER   PIC X(13)  VALUE    '460013 009527'.
               05  FILLER   PIC X(13)  VALUE    '460014 009693'.
               05  FILLER   PIC X(13)  VALUE    '460015 009095'.
               05  FILLER   PIC X(13)  VALUE    '460017 009527'.
               05  FILLER   PIC X(13)  VALUE    '460019 008738'.
               05  FILLER   PIC X(13)  VALUE    '460021 009434'.
               05  FILLER   PIC X(13)  VALUE    '460023 009527'.
               05  FILLER   PIC X(13)  VALUE    '460026 009255'.
               05  FILLER   PIC X(13)  VALUE    '460030 008738'.
               05  FILLER   PIC X(13)  VALUE    '460039 009527'.
               05  FILLER   PIC X(13)  VALUE    '460041 009527'.
               05  FILLER   PIC X(13)  VALUE    '460042 009527'.
               05  FILLER   PIC X(13)  VALUE    '460043 009527'.
               05  FILLER   PIC X(13)  VALUE    '460044 009693'.
               05  FILLER   PIC X(13)  VALUE    '460047 009693'.
               05  FILLER   PIC X(13)  VALUE    '460049 009693'.
               05  FILLER   PIC X(13)  VALUE    '460051 009693'.
               05  FILLER   PIC X(13)  VALUE    '460052 009527'.
               05  FILLER   PIC X(13)  VALUE    '460054 008822'.
               05  FILLER   PIC X(13)  VALUE    '460057 009527'.
               05  FILLER   PIC X(13)  VALUE    '460058 009693'.
               05  FILLER   PIC X(13)  VALUE    '460060 009693'.
               05  FILLER   PIC X(13)  VALUE    '460061 009095'.
               05  FILLER   PIC X(13)  VALUE    '461500 009693'.
               05  FILLER   PIC X(13)  VALUE    '461501 009434'.
               05  FILLER   PIC X(13)  VALUE    '461503 009693'.
               05  FILLER   PIC X(13)  VALUE    '461504 008822'.
               05  FILLER   PIC X(13)  VALUE    '461510 008738'.
               05  FILLER   PIC X(13)  VALUE    '461511 009693'.
               05  FILLER   PIC X(13)  VALUE    '461512 009693'.
               05  FILLER   PIC X(13)  VALUE    '461514 009095'.
               05  FILLER   PIC X(13)  VALUE    '461516 009693'.
               05  FILLER   PIC X(13)  VALUE    '461517 009693'.
               05  FILLER   PIC X(13)  VALUE    '461518 008738'.
               05  FILLER   PIC X(13)  VALUE    '461519 009693'.
               05  FILLER   PIC X(13)  VALUE    '461521 008738'.
               05  FILLER   PIC X(13)  VALUE    '461522 009434'.
               05  FILLER   PIC X(13)  VALUE    '461524 009095'.
               05  FILLER   PIC X(13)  VALUE    '461526 009255'.
               05  FILLER   PIC X(13)  VALUE    '461527 009693'.
               05  FILLER   PIC X(13)  VALUE    '461528 009693'.
               05  FILLER   PIC X(13)  VALUE    '461529 009693'.
               05  FILLER   PIC X(13)  VALUE    '461530 008738'.
               05  FILLER   PIC X(13)  VALUE    '461531 009255'.
               05  FILLER   PIC X(13)  VALUE    '461534 009434'.
               05  FILLER   PIC X(13)  VALUE    '461535 009095'.
               05  FILLER   PIC X(13)  VALUE    '461536 009693'.
               05  FILLER   PIC X(13)  VALUE    '461537 009693'.
               05  FILLER   PIC X(13)  VALUE    '461538 009693'.
               05  FILLER   PIC X(13)  VALUE    '461540 009693'.
               05  FILLER   PIC X(13)  VALUE    '461541 009095'.
               05  FILLER   PIC X(13)  VALUE    '461542 009693'.
               05  FILLER   PIC X(13)  VALUE    '461543 009434'.
               05  FILLER   PIC X(13)  VALUE    '461544 008738'.
               05  FILLER   PIC X(13)  VALUE    '461545 009255'.
               05  FILLER   PIC X(13)  VALUE    '461547 009434'.
               05  FILLER   PIC X(13)  VALUE    '461548 009693'.
               05  FILLER   PIC X(13)  VALUE    '461549 009255'.
               05  FILLER   PIC X(13)  VALUE    '461550 008822'.
               05  FILLER   PIC X(13)  VALUE    '461552 009693'.
               05  FILLER   PIC X(13)  VALUE    '461553 008822'.
               05  FILLER   PIC X(13)  VALUE    '461554 009693'.
               05  FILLER   PIC X(13)  VALUE    '461556 009095'.
               05  FILLER   PIC X(13)  VALUE    '461557 008738'.
               05  FILLER   PIC X(13)  VALUE    '461560 008738'.
               05  FILLER   PIC X(13)  VALUE    '461562 009255'.
               05  FILLER   PIC X(13)  VALUE    '461563 009693'.
               05  FILLER   PIC X(13)  VALUE    '461564 009693'.
               05  FILLER   PIC X(13)  VALUE    '461566 009693'.
               05  FILLER   PIC X(13)  VALUE    '461567 009693'.
               05  FILLER   PIC X(13)  VALUE    '461568 009255'.
               05  FILLER   PIC X(13)  VALUE    '461571 008822'.
               05  FILLER   PIC X(13)  VALUE    '461572 009255'.
               05  FILLER   PIC X(13)  VALUE    '461573 009255'.
               05  FILLER   PIC X(13)  VALUE    '461574 009095'.
               05  FILLER   PIC X(13)  VALUE    '461576 009693'.
               05  FILLER   PIC X(13)  VALUE    '461578 009095'.
               05  FILLER   PIC X(13)  VALUE    '461579 009693'.
               05  FILLER   PIC X(13)  VALUE    '461581 009095'.
               05  FILLER   PIC X(13)  VALUE    '461582 009095'.
               05  FILLER   PIC X(13)  VALUE    '461583 009095'.
               05  FILLER   PIC X(13)  VALUE    '461584 009434'.
               05  FILLER   PIC X(13)  VALUE    '461585 009095'.
               05  FILLER   PIC X(13)  VALUE    '461586 009693'.
               05  FILLER   PIC X(13)  VALUE    '461587 009693'.
               05  FILLER   PIC X(13)  VALUE    '461588 009255'.
               05  FILLER   PIC X(13)  VALUE    '461589 009434'.
               05  FILLER   PIC X(13)  VALUE    '461590 009255'.
               05  FILLER   PIC X(13)  VALUE    '461591 009693'.
               05  FILLER   PIC X(13)  VALUE    '461592 009255'.
               05  FILLER   PIC X(13)  VALUE    '461593 009255'.
               05  FILLER   PIC X(13)  VALUE    '461594 009095'.
               05  FILLER   PIC X(13)  VALUE    '461595 009693'.
               05  FILLER   PIC X(13)  VALUE    '461596 009434'.
               05  FILLER   PIC X(13)  VALUE    '461597 008822'.
               05  FILLER   PIC X(13)  VALUE    '461598 009255'.
               05  FILLER   PIC X(13)  VALUE    '461599 009693'.
               05  FILLER   PIC X(13)  VALUE    '461600 009693'.
               05  FILLER   PIC X(13)  VALUE    '461601 009095'.
               05  FILLER   PIC X(13)  VALUE    '462004 009693'.
               05  FILLER   PIC X(13)  VALUE    '462005 009326'.
               05  FILLER   PIC X(13)  VALUE    '463025 009693'.
               05  FILLER   PIC X(13)  VALUE    '463027 009157'.
               05  FILLER   PIC X(13)  VALUE    '463301 009693'.
               05  FILLER   PIC X(13)  VALUE    '464009 009693'.
               05  FILLER   PIC X(13)  VALUE    '464012 009693'.
               05  FILLER   PIC X(13)  VALUE    '464013 009693'.
               05  FILLER   PIC X(13)  VALUE    '464014 009326'.
               05  FILLER   PIC X(13)  VALUE    '464015 009693'.
               05  FILLER   PIC X(13)  VALUE    '464505 009693'.
               05  FILLER   PIC X(13)  VALUE    '467250 009095'.
               05  FILLER   PIC X(13)  VALUE    '467251 009255'.
               05  FILLER   PIC X(13)  VALUE    '467257 009693'.
               05  FILLER   PIC X(13)  VALUE    '467312 009693'.
               05  FILLER   PIC X(13)  VALUE    '467313 009693'.
               05  FILLER   PIC X(13)  VALUE    '467314 009095'.
               05  FILLER   PIC X(13)  VALUE    '467315 009693'.
               05  FILLER   PIC X(13)  VALUE    '467316 009095'.
               05  FILLER   PIC X(13)  VALUE    '467317 009693'.
               05  FILLER   PIC X(13)  VALUE    '467318 009693'.
               05  FILLER   PIC X(13)  VALUE    '467319 009693'.
               05  FILLER   PIC X(13)  VALUE    '467320 009095'.
               05  FILLER   PIC X(13)  VALUE    '467321 009095'.
               05  FILLER   PIC X(13)  VALUE    '467322 009095'.
               05  FILLER   PIC X(13)  VALUE    '467323 009255'.
               05  FILLER   PIC X(13)  VALUE    '467324 009434'.
               05  FILLER   PIC X(13)  VALUE    '467325 009693'.
               05  FILLER   PIC X(13)  VALUE    '467326 009255'.
               05  FILLER   PIC X(13)  VALUE    '467327 009434'.
               05  FILLER   PIC X(13)  VALUE    '467329 009693'.
               05  FILLER   PIC X(13)  VALUE    '467330 009693'.
               05  FILLER   PIC X(13)  VALUE    '467331 009255'.
               05  FILLER   PIC X(13)  VALUE    '467332 009693'.
               05  FILLER   PIC X(13)  VALUE    '467333 009095'.
               05  FILLER   PIC X(13)  VALUE    '467334 009693'.
               05  FILLER   PIC X(13)  VALUE    '467335 009693'.
               05  FILLER   PIC X(13)  VALUE    '467336 009693'.
               05  FILLER   PIC X(13)  VALUE    '467337 009095'.
               05  FILLER   PIC X(13)  VALUE    '467338 008738'.
               05  FILLER   PIC X(13)  VALUE    '467339 009693'.
               05  FILLER   PIC X(13)  VALUE    '47S003 011574'.
               05  FILLER   PIC X(13)  VALUE    '47S018 009825'.
               05  FILLER   PIC X(13)  VALUE    '47T003 010175'.
               05  FILLER   PIC X(13)  VALUE    '470001 010474'.
               05  FILLER   PIC X(13)  VALUE    '470003 010175'.
               05  FILLER   PIC X(13)  VALUE    '470005 009825'.
               05  FILLER   PIC X(13)  VALUE    '470011 010219'.
               05  FILLER   PIC X(13)  VALUE    '470012 010560'.
               05  FILLER   PIC X(13)  VALUE    '470024 010175'.
               05  FILLER   PIC X(13)  VALUE    '471500 010175'.
               05  FILLER   PIC X(13)  VALUE    '471501 009825'.
               05  FILLER   PIC X(13)  VALUE    '471502 009825'.
               05  FILLER   PIC X(13)  VALUE    '471503 009825'.
               05  FILLER   PIC X(13)  VALUE    '471504 009825'.
               05  FILLER   PIC X(13)  VALUE    '471505 009825'.
               05  FILLER   PIC X(13)  VALUE    '471506 009825'.
               05  FILLER   PIC X(13)  VALUE    '471507 009825'.
               05  FILLER   PIC X(13)  VALUE    '471508 009825'.
               05  FILLER   PIC X(13)  VALUE    '471509 009825'.
               05  FILLER   PIC X(13)  VALUE    '471510 009825'.
               05  FILLER   PIC X(13)  VALUE    '474001 010219'.
               05  FILLER   PIC X(13)  VALUE    '477009 009825'.
               05  FILLER   PIC X(13)  VALUE    '477014 009825'.
               05  FILLER   PIC X(13)  VALUE    '477018 009825'.
               05  FILLER   PIC X(13)  VALUE    '49S002 007575'.
               05  FILLER   PIC X(13)  VALUE    '49S005 008886'.
               05  FILLER   PIC X(13)  VALUE    '49S007 008852'.
               05  FILLER   PIC X(13)  VALUE    '49S009 009097'.
               05  FILLER   PIC X(13)  VALUE    '49S018 009462'.
               05  FILLER   PIC X(13)  VALUE    '49S020 009065'.
               05  FILLER   PIC X(13)  VALUE    '49S021 008499'.
               05  FILLER   PIC X(13)  VALUE    '49S024 008411'.
               05  FILLER   PIC X(13)  VALUE    '49S032 009065'.
               05  FILLER   PIC X(13)  VALUE    '49S042 008295'.
               05  FILLER   PIC X(13)  VALUE    '49S043 009998'.
               05  FILLER   PIC X(13)  VALUE    '49S044 008852'.
               05  FILLER   PIC X(13)  VALUE    '49S045 009998'.
               05  FILLER   PIC X(13)  VALUE    '49S050 009998'.
               05  FILLER   PIC X(13)  VALUE    '49S057 008852'.
               05  FILLER   PIC X(13)  VALUE    '49S059 009065'.
               05  FILLER   PIC X(13)  VALUE    '49S063 009998'.
               05  FILLER   PIC X(13)  VALUE    '49S067 009065'.
               05  FILLER   PIC X(13)  VALUE    '49S073 009998'.
               05  FILLER   PIC X(13)  VALUE    '49S075 007575'.
               05  FILLER   PIC X(13)  VALUE    '49S097 007575'.
               05  FILLER   PIC X(13)  VALUE    '49S112 009065'.
               05  FILLER   PIC X(13)  VALUE    '49S118 009065'.
               05  FILLER   PIC X(13)  VALUE    '49S122 009998'.
               05  FILLER   PIC X(13)  VALUE    '49S126 007575'.
               05  FILLER   PIC X(13)  VALUE    '49S141 009998'.
               05  FILLER   PIC X(13)  VALUE    '49T001 007575'.
               05  FILLER   PIC X(13)  VALUE    '49T005 008886'.
               05  FILLER   PIC X(13)  VALUE    '49T007 008852'.
               05  FILLER   PIC X(13)  VALUE    '49T012 007575'.
               05  FILLER   PIC X(13)  VALUE    '49T017 008852'.
               05  FILLER   PIC X(13)  VALUE    '49T018 009462'.
               05  FILLER   PIC X(13)  VALUE    '49T021 008499'.
               05  FILLER   PIC X(13)  VALUE    '49T024 008411'.
               05  FILLER   PIC X(13)  VALUE    '49T032 009065'.
               05  FILLER   PIC X(13)  VALUE    '49T038 007575'.
               05  FILLER   PIC X(13)  VALUE    '49T048 008411'.
               05  FILLER   PIC X(13)  VALUE    '49T050 009998'.
               05  FILLER   PIC X(13)  VALUE    '49T057 008852'.
               05  FILLER   PIC X(13)  VALUE    '49T066 008852'.
               05  FILLER   PIC X(13)  VALUE    '49T075 007575'.
               05  FILLER   PIC X(13)  VALUE    '49T107 009998'.
               05  FILLER   PIC X(13)  VALUE    '49T112 009065'.
               05  FILLER   PIC X(13)  VALUE    '49T118 009065'.
               05  FILLER   PIC X(13)  VALUE    '49T122 009998'.
               05  FILLER   PIC X(13)  VALUE    '49U126 007575'.
               05  FILLER   PIC X(13)  VALUE    '490001 007575'.
               05  FILLER   PIC X(13)  VALUE    '490002 007575'.
               05  FILLER   PIC X(13)  VALUE    '490004 008969'.
               05  FILLER   PIC X(13)  VALUE    '490005 009998'.
               05  FILLER   PIC X(13)  VALUE    '490007 008852'.
               05  FILLER   PIC X(13)  VALUE    '490009 009097'.
               05  FILLER   PIC X(13)  VALUE    '490011 008852'.
               05  FILLER   PIC X(13)  VALUE    '490013 008361'.
               05  FILLER   PIC X(13)  VALUE    '490017 008852'.
               05  FILLER   PIC X(13)  VALUE    '490018 008969'.
               05  FILLER   PIC X(13)  VALUE    '490019 009998'.
               05  FILLER   PIC X(13)  VALUE    '490020 009065'.
               05  FILLER   PIC X(13)  VALUE    '490021 008969'.
               05  FILLER   PIC X(13)  VALUE    '490022 009998'.
               05  FILLER   PIC X(13)  VALUE    '490023 009998'.
               05  FILLER   PIC X(13)  VALUE    '490024 008411'.
               05  FILLER   PIC X(13)  VALUE    '490032 009065'.
               05  FILLER   PIC X(13)  VALUE    '490033 009998'.
               05  FILLER   PIC X(13)  VALUE    '490037 009142'.
               05  FILLER   PIC X(13)  VALUE    '490038 007575'.
               05  FILLER   PIC X(13)  VALUE    '490040 009998'.
               05  FILLER   PIC X(13)  VALUE    '490041 008852'.
               05  FILLER   PIC X(13)  VALUE    '490042 008295'.
               05  FILLER   PIC X(13)  VALUE    '490043 009998'.
               05  FILLER   PIC X(13)  VALUE    '490044 008852'.
               05  FILLER   PIC X(13)  VALUE    '490045 009998'.
               05  FILLER   PIC X(13)  VALUE    '490046 008852'.
               05  FILLER   PIC X(13)  VALUE    '490048 008411'.
               05  FILLER   PIC X(13)  VALUE    '490050 009998'.
               05  FILLER   PIC X(13)  VALUE    '490052 008852'.
               05  FILLER   PIC X(13)  VALUE    '490053 007575'.
               05  FILLER   PIC X(13)  VALUE    '490057 008852'.
               05  FILLER   PIC X(13)  VALUE    '490059 009065'.
               05  FILLER   PIC X(13)  VALUE    '490060 007575'.
               05  FILLER   PIC X(13)  VALUE    '490063 009998'.
               05  FILLER   PIC X(13)  VALUE    '490066 009065'.
               05  FILLER   PIC X(13)  VALUE    '490067 009065'.
               05  FILLER   PIC X(13)  VALUE    '490069 009065'.
               05  FILLER   PIC X(13)  VALUE    '490075 008310'.
               05  FILLER   PIC X(13)  VALUE    '490077 009097'.
               05  FILLER   PIC X(13)  VALUE    '490079 007575'.
               05  FILLER   PIC X(13)  VALUE    '490084 009065'.
               05  FILLER   PIC X(13)  VALUE    '490088 008499'.
               05  FILLER   PIC X(13)  VALUE    '490089 008411'.
               05  FILLER   PIC X(13)  VALUE    '490090 009065'.
               05  FILLER   PIC X(13)  VALUE    '490092 007575'.
               05  FILLER   PIC X(13)  VALUE    '490093 008852'.
               05  FILLER   PIC X(13)  VALUE    '490094 009065'.
               05  FILLER   PIC X(13)  VALUE    '490097 009065'.
               05  FILLER   PIC X(13)  VALUE    '490098 007575'.
               05  FILLER   PIC X(13)  VALUE    '490101 009998'.
               05  FILLER   PIC X(13)  VALUE    '490104 009065'.
               05  FILLER   PIC X(13)  VALUE    '490106 009300'.
               05  FILLER   PIC X(13)  VALUE    '490107 009998'.
               05  FILLER   PIC X(13)  VALUE    '490110 008498'.
               05  FILLER   PIC X(13)  VALUE    '490111 007575'.
               05  FILLER   PIC X(13)  VALUE    '490112 009065'.
               05  FILLER   PIC X(13)  VALUE    '490113 009998'.
               05  FILLER   PIC X(13)  VALUE    '490114 007575'.
               05  FILLER   PIC X(13)  VALUE    '490115 007575'.
               05  FILLER   PIC X(13)  VALUE    '490116 007575'.
               05  FILLER   PIC X(13)  VALUE    '490117 007575'.
               05  FILLER   PIC X(13)  VALUE    '490118 009065'.
               05  FILLER   PIC X(13)  VALUE    '490119 008852'.
               05  FILLER   PIC X(13)  VALUE    '490120 008852'.
               05  FILLER   PIC X(13)  VALUE    '490122 009998'.
               05  FILLER   PIC X(13)  VALUE    '490126 008310'.
               05  FILLER   PIC X(13)  VALUE    '490127 007575'.
               05  FILLER   PIC X(13)  VALUE    '490130 008852'.
               05  FILLER   PIC X(13)  VALUE    '490134 007575'.
               05  FILLER   PIC X(13)  VALUE    '490135 008411'.
               05  FILLER   PIC X(13)  VALUE    '490136 009065'.
               05  FILLER   PIC X(13)  VALUE    '490140 009998'.
               05  FILLER   PIC X(13)  VALUE    '490141 009998'.
               05  FILLER   PIC X(13)  VALUE    '490143 008852'.
               05  FILLER   PIC X(13)  VALUE    '490144 009998'.
               05  FILLER   PIC X(13)  VALUE    '490145 009998'.
               05  FILLER   PIC X(13)  VALUE    '491500 009998'.
               05  FILLER   PIC X(13)  VALUE    '491502 008852'.
               05  FILLER   PIC X(13)  VALUE    '491503 008852'.
               05  FILLER   PIC X(13)  VALUE    '491504 009097'.
               05  FILLER   PIC X(13)  VALUE    '491505 007575'.
               05  FILLER   PIC X(13)  VALUE    '491507 008295'.
               05  FILLER   PIC X(13)  VALUE    '491508 008886'.
               05  FILLER   PIC X(13)  VALUE    '491509 008852'.
               05  FILLER   PIC X(13)  VALUE    '491510 008411'.
               05  FILLER   PIC X(13)  VALUE    '491514 009065'.
               05  FILLER   PIC X(13)  VALUE    '491515 008411'.
               05  FILLER   PIC X(13)  VALUE    '491516 007575'.
               05  FILLER   PIC X(13)  VALUE    '491518 009998'.
               05  FILLER   PIC X(13)  VALUE    '491519 008499'.
               05  FILLER   PIC X(13)  VALUE    '491520 008411'.
               05  FILLER   PIC X(13)  VALUE    '491521 007575'.
               05  FILLER   PIC X(13)  VALUE    '491522 007575'.
               05  FILLER   PIC X(13)  VALUE    '491526 008852'.
               05  FILLER   PIC X(13)  VALUE    '491527 008411'.
               05  FILLER   PIC X(13)  VALUE    '491530 008852'.
               05  FILLER   PIC X(13)  VALUE    '491531 007575'.
               05  FILLER   PIC X(13)  VALUE    '491532 009065'.
               05  FILLER   PIC X(13)  VALUE    '491535 007575'.
               05  FILLER   PIC X(13)  VALUE    '491538 008813'.
               05  FILLER   PIC X(13)  VALUE    '491541 007575'.
               05  FILLER   PIC X(13)  VALUE    '491543 008852'.
               05  FILLER   PIC X(13)  VALUE    '491544 007575'.
               05  FILLER   PIC X(13)  VALUE    '491545 008852'.
               05  FILLER   PIC X(13)  VALUE    '491546 008852'.
               05  FILLER   PIC X(13)  VALUE    '491547 007575'.
               05  FILLER   PIC X(13)  VALUE    '491550 007575'.
               05  FILLER   PIC X(13)  VALUE    '491551 009998'.
               05  FILLER   PIC X(13)  VALUE    '491552 008499'.
               05  FILLER   PIC X(13)  VALUE    '491553 009998'.
               05  FILLER   PIC X(13)  VALUE    '491554 007575'.
               05  FILLER   PIC X(13)  VALUE    '491555 007575'.
               05  FILLER   PIC X(13)  VALUE    '491557 007575'.
               05  FILLER   PIC X(13)  VALUE    '491563 007575'.
               05  FILLER   PIC X(13)  VALUE    '491565 009998'.
               05  FILLER   PIC X(13)  VALUE    '491567 009065'.
               05  FILLER   PIC X(13)  VALUE    '491570 007575'.
               05  FILLER   PIC X(13)  VALUE    '491571 009998'.
               05  FILLER   PIC X(13)  VALUE    '491572 007575'.
               05  FILLER   PIC X(13)  VALUE    '491575 008852'.
               05  FILLER   PIC X(13)  VALUE    '491582 008411'.
               05  FILLER   PIC X(13)  VALUE    '491585 007575'.
               05  FILLER   PIC X(13)  VALUE    '491586 008295'.
               05  FILLER   PIC X(13)  VALUE    '491588 007575'.
               05  FILLER   PIC X(13)  VALUE    '491591 009998'.
               05  FILLER   PIC X(13)  VALUE    '491592 009998'.
               05  FILLER   PIC X(13)  VALUE    '491593 009097'.
               05  FILLER   PIC X(13)  VALUE    '491595 009065'.
               05  FILLER   PIC X(13)  VALUE    '491596 007101'.
               05  FILLER   PIC X(13)  VALUE    '491597 008499'.
               05  FILLER   PIC X(13)  VALUE    '491598 008852'.
               05  FILLER   PIC X(13)  VALUE    '491600 008852'.
               05  FILLER   PIC X(13)  VALUE    '491601 007101'.
               05  FILLER   PIC X(13)  VALUE    '491602 009065'.
               05  FILLER   PIC X(13)  VALUE    '491603 008852'.
               05  FILLER   PIC X(13)  VALUE    '491604 007575'.
               05  FILLER   PIC X(13)  VALUE    '491606 009065'.
               05  FILLER   PIC X(13)  VALUE    '491607 008852'.
               05  FILLER   PIC X(13)  VALUE    '491608 007575'.
               05  FILLER   PIC X(13)  VALUE    '491609 008852'.
               05  FILLER   PIC X(13)  VALUE    '492001 008852'.
               05  FILLER   PIC X(13)  VALUE    '492008 008852'.
               05  FILLER   PIC X(13)  VALUE    '492009 009065'.
               05  FILLER   PIC X(13)  VALUE    '492010 008499'.
               05  FILLER   PIC X(13)  VALUE    '492011 009097'.
               05  FILLER   PIC X(13)  VALUE    '493025 009065'.
               05  FILLER   PIC X(13)  VALUE    '493027 008852'.
               05  FILLER   PIC X(13)  VALUE    '493029 009097'.
               05  FILLER   PIC X(13)  VALUE    '493030 009065'.
               05  FILLER   PIC X(13)  VALUE    '493031 009065'.
               05  FILLER   PIC X(13)  VALUE    '493032 009998'.
               05  FILLER   PIC X(13)  VALUE    '493033 009998'.
               05  FILLER   PIC X(13)  VALUE    '493301 008852'.
               05  FILLER   PIC X(13)  VALUE    '493302 009065'.
               05  FILLER   PIC X(13)  VALUE    '494010 009998'.
               05  FILLER   PIC X(13)  VALUE    '494017 007575'.
               05  FILLER   PIC X(13)  VALUE    '494021 007575'.
               05  FILLER   PIC X(13)  VALUE    '494022 009065'.
               05  FILLER   PIC X(13)  VALUE    '494023 009998'.
               05  FILLER   PIC X(13)  VALUE    '494025 008852'.
               05  FILLER   PIC X(13)  VALUE    '494029 007575'.
               05  FILLER   PIC X(13)  VALUE    '494523 009998'.
               05  FILLER   PIC X(13)  VALUE    '494524 009998'.
               05  FILLER   PIC X(13)  VALUE    '494611 008886'.
               05  FILLER   PIC X(13)  VALUE    '497022 008411'.
               05  FILLER   PIC X(13)  VALUE    '497564 009065'.
               05  FILLER   PIC X(13)  VALUE    '497600 008852'.
               05  FILLER   PIC X(13)  VALUE    '497638 009998'.
               05  FILLER   PIC X(13)  VALUE    '497641 007575'.
               05  FILLER   PIC X(13)  VALUE    '497642 008295'.
               05  FILLER   PIC X(13)  VALUE    '497643 007575'.
               05  FILLER   PIC X(13)  VALUE    '497644 008852'.
               05  FILLER   PIC X(13)  VALUE    '497645 009998'.
               05  FILLER   PIC X(13)  VALUE    '497646 008813'.
               05  FILLER   PIC X(13)  VALUE    '497647 009998'.
               05  FILLER   PIC X(13)  VALUE    '497650 009998'.
               05  FILLER   PIC X(13)  VALUE    '497651 008852'.
               05  FILLER   PIC X(13)  VALUE    '497652 008411'.
               05  FILLER   PIC X(13)  VALUE    '497653 009065'.
               05  FILLER   PIC X(13)  VALUE    '497657 009998'.
               05  FILLER   PIC X(13)  VALUE    '497658 009998'.
               05  FILLER   PIC X(13)  VALUE    '497659 009998'.
               05  FILLER   PIC X(13)  VALUE    '497660 008852'.
               05  FILLER   PIC X(13)  VALUE    '497661 009998'.
               05  FILLER   PIC X(13)  VALUE    '497662 009998'.
               05  FILLER   PIC X(13)  VALUE    '497663 007101'.
               05  FILLER   PIC X(13)  VALUE    '497664 009998'.
               05  FILLER   PIC X(13)  VALUE    '497665 008499'.
               05  FILLER   PIC X(13)  VALUE    '497666 007575'.
               05  FILLER   PIC X(13)  VALUE    '497667 007575'.
               05  FILLER   PIC X(13)  VALUE    '497669 009998'.
               05  FILLER   PIC X(13)  VALUE    '497670 009998'.
               05  FILLER   PIC X(13)  VALUE    '497671 009998'.
               05  FILLER   PIC X(13)  VALUE    '497672 008852'.
               05  FILLER   PIC X(13)  VALUE    '497673 009998'.
               05  FILLER   PIC X(13)  VALUE    '497674 009998'.
               05  FILLER   PIC X(13)  VALUE    '497675 009998'.
               05  FILLER   PIC X(13)  VALUE    '497676 009998'.
               05  FILLER   PIC X(13)  VALUE    '497677 008852'.
               05  FILLER   PIC X(13)  VALUE    '497678 009998'.
               05  FILLER   PIC X(13)  VALUE    '497680 007575'.
               05  FILLER   PIC X(13)  VALUE    '497681 008852'.
               05  FILLER   PIC X(13)  VALUE    '497682 008852'.
               05  FILLER   PIC X(13)  VALUE    '497683 008852'.
               05  FILLER   PIC X(13)  VALUE    '497684 009065'.
               05  FILLER   PIC X(13)  VALUE    '497685 008886'.
               05  FILLER   PIC X(13)  VALUE    '497686 009998'.
               05  FILLER   PIC X(13)  VALUE    '497687 008852'.
               05  FILLER   PIC X(13)  VALUE    '497688 009998'.
               05  FILLER   PIC X(13)  VALUE    '497689 009998'.
               05  FILLER   PIC X(13)  VALUE    '497690 008852'.
               05  FILLER   PIC X(13)  VALUE    '497691 009998'.
               05  FILLER   PIC X(13)  VALUE    '497693 009998'.
               05  FILLER   PIC X(13)  VALUE    '497694 009998'.
               05  FILLER   PIC X(13)  VALUE    '497695 009065'.
               05  FILLER   PIC X(13)  VALUE    '497696 009998'.
               05  FILLER   PIC X(13)  VALUE    '497701 009998'.
               05  FILLER   PIC X(13)  VALUE    '50S001 011612'.
               05  FILLER   PIC X(13)  VALUE    '50S008 011612'.
               05  FILLER   PIC X(13)  VALUE    '50S015 011612'.
               05  FILLER   PIC X(13)  VALUE    '50S024 011415'.
               05  FILLER   PIC X(13)  VALUE    '50S025 011612'.
               05  FILLER   PIC X(13)  VALUE    '50S027 011612'.
               05  FILLER   PIC X(13)  VALUE    '50S030 012073'.
               05  FILLER   PIC X(13)  VALUE    '50S036 010314'.
               05  FILLER   PIC X(13)  VALUE    '50S037 010314'.
               05  FILLER   PIC X(13)  VALUE    '50S051 011612'.
               05  FILLER   PIC X(13)  VALUE    '50S054 011133'.
               05  FILLER   PIC X(13)  VALUE    '50S064 011612'.
               05  FILLER   PIC X(13)  VALUE    '50S084 011612'.
               05  FILLER   PIC X(13)  VALUE    '50S147 011612'.
               05  FILLER   PIC X(13)  VALUE    '50T001 011612'.
               05  FILLER   PIC X(13)  VALUE    '50T002 010389'.
               05  FILLER   PIC X(13)  VALUE    '50T008 011612'.
               05  FILLER   PIC X(13)  VALUE    '50T011 011612'.
               05  FILLER   PIC X(13)  VALUE    '50T012 010314'.
               05  FILLER   PIC X(13)  VALUE    '50T014 011612'.
               05  FILLER   PIC X(13)  VALUE    '50T015 011612'.
               05  FILLER   PIC X(13)  VALUE    '50T025 011612'.
               05  FILLER   PIC X(13)  VALUE    '50T050 011888'.
               05  FILLER   PIC X(13)  VALUE    '50T058 010427'.
               05  FILLER   PIC X(13)  VALUE    '50T064 011612'.
               05  FILLER   PIC X(13)  VALUE    '50T079 011687'.
               05  FILLER   PIC X(13)  VALUE    '50T108 011687'.
               05  FILLER   PIC X(13)  VALUE    '50T124 011612'.
               05  FILLER   PIC X(13)  VALUE    '50T148 010314'.
               05  FILLER   PIC X(13)  VALUE    '50U007 010314'.
               05  FILLER   PIC X(13)  VALUE    '500001 011612'.
               05  FILLER   PIC X(13)  VALUE    '500002 010389'.
               05  FILLER   PIC X(13)  VALUE    '500003 011493'.
               05  FILLER   PIC X(13)  VALUE    '500005 011612'.
               05  FILLER   PIC X(13)  VALUE    '500007 011493'.
               05  FILLER   PIC X(13)  VALUE    '500008 011612'.
               05  FILLER   PIC X(13)  VALUE    '500011 011612'.
               05  FILLER   PIC X(13)  VALUE    '500012 010314'.
               05  FILLER   PIC X(13)  VALUE    '500014 011612'.
               05  FILLER   PIC X(13)  VALUE    '500015 011612'.
               05  FILLER   PIC X(13)  VALUE    '500016 011493'.
               05  FILLER   PIC X(13)  VALUE    '500019 011687'.
               05  FILLER   PIC X(13)  VALUE    '500021 011687'.
               05  FILLER   PIC X(13)  VALUE    '500024 011687'.
               05  FILLER   PIC X(13)  VALUE    '500025 011612'.
               05  FILLER   PIC X(13)  VALUE    '500026 011612'.
               05  FILLER   PIC X(13)  VALUE    '500027 011612'.
               05  FILLER   PIC X(13)  VALUE    '500030 012073'.
               05  FILLER   PIC X(13)  VALUE    '500031 011309'.
               05  FILLER   PIC X(13)  VALUE    '500033 010314'.
               05  FILLER   PIC X(13)  VALUE    '500036 010314'.
               05  FILLER   PIC X(13)  VALUE    '500037 010314'.
               05  FILLER   PIC X(13)  VALUE    '500039 011687'.
               05  FILLER   PIC X(13)  VALUE    '500041 010314'.
               05  FILLER   PIC X(13)  VALUE    '500044 011133'.
               05  FILLER   PIC X(13)  VALUE    '500049 010389'.
               05  FILLER   PIC X(13)  VALUE    '500050 011888'.
               05  FILLER   PIC X(13)  VALUE    '500051 011612'.
               05  FILLER   PIC X(13)  VALUE    '500052 011612'.
               05  FILLER   PIC X(13)  VALUE    '500053 010427'.
               05  FILLER   PIC X(13)  VALUE    '500054 011133'.
               05  FILLER   PIC X(13)  VALUE    '500058 010427'.
               05  FILLER   PIC X(13)  VALUE    '500060 011612'.
               05  FILLER   PIC X(13)  VALUE    '500064 011612'.
               05  FILLER   PIC X(13)  VALUE    '500072 010368'.
               05  FILLER   PIC X(13)  VALUE    '500077 011133'.
               05  FILLER   PIC X(13)  VALUE    '500079 011687'.
               05  FILLER   PIC X(13)  VALUE    '500084 011612'.
               05  FILLER   PIC X(13)  VALUE    '500088 011687'.
               05  FILLER   PIC X(13)  VALUE    '500108 011687'.
               05  FILLER   PIC X(13)  VALUE    '500119 011133'.
               05  FILLER   PIC X(13)  VALUE    '500124 011612'.
               05  FILLER   PIC X(13)  VALUE    '500129 011687'.
               05  FILLER   PIC X(13)  VALUE    '500138 011612'.
               05  FILLER   PIC X(13)  VALUE    '500139 011687'.
               05  FILLER   PIC X(13)  VALUE    '500141 011612'.
               05  FILLER   PIC X(13)  VALUE    '500148 010314'.
               05  FILLER   PIC X(13)  VALUE    '500150 011888'.
               05  FILLER   PIC X(13)  VALUE    '500151 011687'.
               05  FILLER   PIC X(13)  VALUE    '500152 011612'.
               05  FILLER   PIC X(13)  VALUE    '500154 011612'.
               05  FILLER   PIC X(13)  VALUE    '501501 011888'.
               05  FILLER   PIC X(13)  VALUE    '501503 011133'.
               05  FILLER   PIC X(13)  VALUE    '501504 012095'.
               05  FILLER   PIC X(13)  VALUE    '501505 010314'.
               05  FILLER   PIC X(13)  VALUE    '501508 011687'.
               05  FILLER   PIC X(13)  VALUE    '501510 010427'.
               05  FILLER   PIC X(13)  VALUE    '501511 011415'.
               05  FILLER   PIC X(13)  VALUE    '501512 010314'.
               05  FILLER   PIC X(13)  VALUE    '501514 011612'.
               05  FILLER   PIC X(13)  VALUE    '501515 011612'.
               05  FILLER   PIC X(13)  VALUE    '501516 010314'.
               05  FILLER   PIC X(13)  VALUE    '501517 010867'.
               05  FILLER   PIC X(13)  VALUE    '501518 010314'.
               05  FILLER   PIC X(13)  VALUE    '501519 010314'.
               05  FILLER   PIC X(13)  VALUE    '501520 010314'.
               05  FILLER   PIC X(13)  VALUE    '501521 011612'.
               05  FILLER   PIC X(13)  VALUE    '501523 011612'.
               05  FILLER   PIC X(13)  VALUE    '501525 010314'.
               05  FILLER   PIC X(13)  VALUE    '501526 011687'.
               05  FILLER   PIC X(13)  VALUE    '501527 011612'.
               05  FILLER   PIC X(13)  VALUE    '501528 010314'.
               05  FILLER   PIC X(13)  VALUE    '501529 010314'.
               05  FILLER   PIC X(13)  VALUE    '501531 010314'.
               05  FILLER   PIC X(13)  VALUE    '501534 010314'.
               05  FILLER   PIC X(13)  VALUE    '501535 011133'.
               05  FILLER   PIC X(13)  VALUE    '501536 010314'.
               05  FILLER   PIC X(13)  VALUE    '501537 012073'.
               05  FILLER   PIC X(13)  VALUE    '501538 010314'.
               05  FILLER   PIC X(13)  VALUE    '501540 011612'.
               05  FILLER   PIC X(13)  VALUE    '502001 011612'.
               05  FILLER   PIC X(13)  VALUE    '502002 011612'.
               05  FILLER   PIC X(13)  VALUE    '503025 011133'.
               05  FILLER   PIC X(13)  VALUE    '503026 011687'.
               05  FILLER   PIC X(13)  VALUE    '503300 011612'.
               05  FILLER   PIC X(13)  VALUE    '503301 011687'.
               05  FILLER   PIC X(13)  VALUE    '504002 011612'.
               05  FILLER   PIC X(13)  VALUE    '504004 011133'.
               05  FILLER   PIC X(13)  VALUE    '504008 010427'.
               05  FILLER   PIC X(13)  VALUE    '504011 011612'.
               05  FILLER   PIC X(13)  VALUE    '504012 011612'.
               05  FILLER   PIC X(13)  VALUE    '504013 011888'.
               05  FILLER   PIC X(13)  VALUE    '504014 011133'.
               05  FILLER   PIC X(13)  VALUE    '507119 011133'.
               05  FILLER   PIC X(13)  VALUE    '507120 011612'.
               05  FILLER   PIC X(13)  VALUE    '51B022 008369'.
               05  FILLER   PIC X(13)  VALUE    '51S001 008252'.
               05  FILLER   PIC X(13)  VALUE    '51S007 008369'.
               05  FILLER   PIC X(13)  VALUE    '51S008 008873'.
               05  FILLER   PIC X(13)  VALUE    '51S022 008436'.
               05  FILLER   PIC X(13)  VALUE    '51S029 008436'.
               05  FILLER   PIC X(13)  VALUE    '51S030 007335'.
               05  FILLER   PIC X(13)  VALUE    '51S039 007335'.
               05  FILLER   PIC X(13)  VALUE    '51S046 007335'.
               05  FILLER   PIC X(13)  VALUE    '51S047 007622'.
               05  FILLER   PIC X(13)  VALUE    '51S058 007484'.
               05  FILLER   PIC X(13)  VALUE    '51S062 008003'.
               05  FILLER   PIC X(13)  VALUE    '51T022 008436'.
               05  FILLER   PIC X(13)  VALUE    '51T023 007677'.
               05  FILLER   PIC X(13)  VALUE    '51T048 007335'.
               05  FILLER   PIC X(13)  VALUE    '510001 008272'.
               05  FILLER   PIC X(13)  VALUE    '510002 008310'.
               05  FILLER   PIC X(13)  VALUE    '510006 008252'.
               05  FILLER   PIC X(13)  VALUE    '510007 008369'.
               05  FILLER   PIC X(13)  VALUE    '510008 009998'.
               05  FILLER   PIC X(13)  VALUE    '510012 007650'.
               05  FILLER   PIC X(13)  VALUE    '510013 007335'.
               05  FILLER   PIC X(13)  VALUE    '510022 008436'.
               05  FILLER   PIC X(13)  VALUE    '510023 008272'.
               05  FILLER   PIC X(13)  VALUE    '510024 008272'.
               05  FILLER   PIC X(13)  VALUE    '510029 008436'.
               05  FILLER   PIC X(13)  VALUE    '510030 007335'.
               05  FILLER   PIC X(13)  VALUE    '510031 008436'.
               05  FILLER   PIC X(13)  VALUE    '510033 007484'.
               05  FILLER   PIC X(13)  VALUE    '510038 007335'.
               05  FILLER   PIC X(13)  VALUE    '510039 007335'.
               05  FILLER   PIC X(13)  VALUE    '510046 007801'.
               05  FILLER   PIC X(13)  VALUE    '510047 008272'.
               05  FILLER   PIC X(13)  VALUE    '510048 007335'.
               05  FILLER   PIC X(13)  VALUE    '510050 008272'.
               05  FILLER   PIC X(13)  VALUE    '510055 008369'.
               05  FILLER   PIC X(13)  VALUE    '510058 007993'.
               05  FILLER   PIC X(13)  VALUE    '510059 008436'.
               05  FILLER   PIC X(13)  VALUE    '510062 008003'.
               05  FILLER   PIC X(13)  VALUE    '510070 008336'.
               05  FILLER   PIC X(13)  VALUE    '510071 007801'.
               05  FILLER   PIC X(13)  VALUE    '510072 007335'.
               05  FILLER   PIC X(13)  VALUE    '510077 007675'.
               05  FILLER   PIC X(13)  VALUE    '510082 007335'.
               05  FILLER   PIC X(13)  VALUE    '510085 008369'.
               05  FILLER   PIC X(13)  VALUE    '510086 007335'.
               05  FILLER   PIC X(13)  VALUE    '510091 008436'.
               05  FILLER   PIC X(13)  VALUE    '511500 008369'.
               05  FILLER   PIC X(13)  VALUE    '511501 008436'.
               05  FILLER   PIC X(13)  VALUE    '511502 007335'.
               05  FILLER   PIC X(13)  VALUE    '511504 008252'.
               05  FILLER   PIC X(13)  VALUE    '511506 007335'.
               05  FILLER   PIC X(13)  VALUE    '511507 008873'.
               05  FILLER   PIC X(13)  VALUE    '511509 007335'.
               05  FILLER   PIC X(13)  VALUE    '511510 007335'.
               05  FILLER   PIC X(13)  VALUE    '511511 008252'.
               05  FILLER   PIC X(13)  VALUE    '511514 007335'.
               05  FILLER   PIC X(13)  VALUE    '511516 007335'.
               05  FILLER   PIC X(13)  VALUE    '511517 007335'.
               05  FILLER   PIC X(13)  VALUE    '511519 007335'.
               05  FILLER   PIC X(13)  VALUE    '511521 008763'.
               05  FILLER   PIC X(13)  VALUE    '511522 007335'.
               05  FILLER   PIC X(13)  VALUE    '511523 008252'.
               05  FILLER   PIC X(13)  VALUE    '511524 007335'.
               05  FILLER   PIC X(13)  VALUE    '511525 007335'.
               05  FILLER   PIC X(13)  VALUE    '511526 007993'.
               05  FILLER   PIC X(13)  VALUE    '512002 008436'.
               05  FILLER   PIC X(13)  VALUE    '512003 008369'.
               05  FILLER   PIC X(13)  VALUE    '513025 007335'.
               05  FILLER   PIC X(13)  VALUE    '513028 008369'.
               05  FILLER   PIC X(13)  VALUE    '513030 008252'.
               05  FILLER   PIC X(13)  VALUE    '514604 008369'.
               05  FILLER   PIC X(13)  VALUE    '517135 007335'.
               05  FILLER   PIC X(13)  VALUE    '517136 007993'.
               05  FILLER   PIC X(13)  VALUE    '517137 007993'.
               05  FILLER   PIC X(13)  VALUE    '52S008 009734'.
               05  FILLER   PIC X(13)  VALUE    '52S009 009335'.
               05  FILLER   PIC X(13)  VALUE    '52S019 009221'.
               05  FILLER   PIC X(13)  VALUE    '52S030 009221'.
               05  FILLER   PIC X(13)  VALUE    '52S040 009734'.
               05  FILLER   PIC X(13)  VALUE    '52S051 009734'.
               05  FILLER   PIC X(13)  VALUE    '52S057 009725'.
               05  FILLER   PIC X(13)  VALUE    '52S064 009734'.
               05  FILLER   PIC X(13)  VALUE    '52S066 009416'.
               05  FILLER   PIC X(13)  VALUE    '52S083 010694'.
               05  FILLER   PIC X(13)  VALUE    '52S088 009294'.
               05  FILLER   PIC X(13)  VALUE    '52S089 010694'.
               05  FILLER   PIC X(13)  VALUE    '52S098 010694'.
               05  FILLER   PIC X(13)  VALUE    '52S103 009734'.
               05  FILLER   PIC X(13)  VALUE    '52S107 009221'.
               05  FILLER   PIC X(13)  VALUE    '52S116 009221'.
               05  FILLER   PIC X(13)  VALUE    '52S138 009734'.
               05  FILLER   PIC X(13)  VALUE    '52S178 009221'.
               05  FILLER   PIC X(13)  VALUE    '52T009 009335'.
               05  FILLER   PIC X(13)  VALUE    '52T013 009683'.
               05  FILLER   PIC X(13)  VALUE    '52T030 009221'.
               05  FILLER   PIC X(13)  VALUE    '52T035 009348'.
               05  FILLER   PIC X(13)  VALUE    '52T037 009221'.
               05  FILLER   PIC X(13)  VALUE    '52T045 009324'.
               05  FILLER   PIC X(13)  VALUE    '52T049 009221'.
               05  FILLER   PIC X(13)  VALUE    '52T075 009221'.
               05  FILLER   PIC X(13)  VALUE    '52T087 009416'.
               05  FILLER   PIC X(13)  VALUE    '52T088 009294'.
               05  FILLER   PIC X(13)  VALUE    '52T091 009221'.
               05  FILLER   PIC X(13)  VALUE    '52T096 009533'.
               05  FILLER   PIC X(13)  VALUE    '52T102 009517'.
               05  FILLER   PIC X(13)  VALUE    '52T103 009734'.
               05  FILLER   PIC X(13)  VALUE    '52T107 009221'.
               05  FILLER   PIC X(13)  VALUE    '52T136 009734'.
               05  FILLER   PIC X(13)  VALUE    '52T138 009734'.
               05  FILLER   PIC X(13)  VALUE    '52T139 009734'.
               05  FILLER   PIC X(13)  VALUE    '52T177 009734'.
               05  FILLER   PIC X(13)  VALUE    '52T206 009734'.
               05  FILLER   PIC X(13)  VALUE    '52Z357 009221'.
               05  FILLER   PIC X(13)  VALUE    '520002 009221'.
               05  FILLER   PIC X(13)  VALUE    '520004 010480'.
               05  FILLER   PIC X(13)  VALUE    '520008 009734'.
               05  FILLER   PIC X(13)  VALUE    '520009 009335'.
               05  FILLER   PIC X(13)  VALUE    '520011 009683'.
               05  FILLER   PIC X(13)  VALUE    '520013 010770'.
               05  FILLER   PIC X(13)  VALUE    '520017 009683'.
               05  FILLER   PIC X(13)  VALUE    '520019 009221'.
               05  FILLER   PIC X(13)  VALUE    '520021 010427'.
               05  FILLER   PIC X(13)  VALUE    '520027 009734'.
               05  FILLER   PIC X(13)  VALUE    '520028 010694'.
               05  FILLER   PIC X(13)  VALUE    '520030 009221'.
               05  FILLER   PIC X(13)  VALUE    '520033 009221'.
               05  FILLER   PIC X(13)  VALUE    '520034 009221'.
               05  FILLER   PIC X(13)  VALUE    '520035 009734'.
               05  FILLER   PIC X(13)  VALUE    '520037 009221'.
               05  FILLER   PIC X(13)  VALUE    '520038 009734'.
               05  FILLER   PIC X(13)  VALUE    '520041 010694'.
               05  FILLER   PIC X(13)  VALUE    '520044 009437'.
               05  FILLER   PIC X(13)  VALUE    '520045 009324'.
               05  FILLER   PIC X(13)  VALUE    '520048 009324'.
               05  FILLER   PIC X(13)  VALUE    '520049 009221'.
               05  FILLER   PIC X(13)  VALUE    '520051 010427'.
               05  FILLER   PIC X(13)  VALUE    '520057 010568'.
               05  FILLER   PIC X(13)  VALUE    '520059 009533'.
               05  FILLER   PIC X(13)  VALUE    '520062 009734'.
               05  FILLER   PIC X(13)  VALUE    '520063 009734'.
               05  FILLER   PIC X(13)  VALUE    '520066 009615'.
               05  FILLER   PIC X(13)  VALUE    '520070 010770'.
               05  FILLER   PIC X(13)  VALUE    '520071 009734'.
               05  FILLER   PIC X(13)  VALUE    '520075 009335'.
               05  FILLER   PIC X(13)  VALUE    '520076 009526'.
               05  FILLER   PIC X(13)  VALUE    '520078 009734'.
               05  FILLER   PIC X(13)  VALUE    '520083 010694'.
               05  FILLER   PIC X(13)  VALUE    '520087 009416'.
               05  FILLER   PIC X(13)  VALUE    '520088 009734'.
               05  FILLER   PIC X(13)  VALUE    '520089 010694'.
               05  FILLER   PIC X(13)  VALUE    '520091 009221'.
               05  FILLER   PIC X(13)  VALUE    '520095 010568'.
               05  FILLER   PIC X(13)  VALUE    '520096 010263'.
               05  FILLER   PIC X(13)  VALUE    '520097 009221'.
               05  FILLER   PIC X(13)  VALUE    '520098 010694'.
               05  FILLER   PIC X(13)  VALUE    '520100 010568'.
               05  FILLER   PIC X(13)  VALUE    '520102 010427'.
               05  FILLER   PIC X(13)  VALUE    '520103 009734'.
               05  FILLER   PIC X(13)  VALUE    '520107 009335'.
               05  FILLER   PIC X(13)  VALUE    '520109 009221'.
               05  FILLER   PIC X(13)  VALUE    '520113 009221'.
               05  FILLER   PIC X(13)  VALUE    '520116 009734'.
               05  FILLER   PIC X(13)  VALUE    '520136 009734'.
               05  FILLER   PIC X(13)  VALUE    '520138 010427'.
               05  FILLER   PIC X(13)  VALUE    '520139 009734'.
               05  FILLER   PIC X(13)  VALUE    '520160 009335'.
               05  FILLER   PIC X(13)  VALUE    '520177 010427'.
               05  FILLER   PIC X(13)  VALUE    '520189 010427'.
               05  FILLER   PIC X(13)  VALUE    '520193 009335'.
               05  FILLER   PIC X(13)  VALUE    '520194 009734'.
               05  FILLER   PIC X(13)  VALUE    '520195 009734'.
               05  FILLER   PIC X(13)  VALUE    '520196 009683'.
               05  FILLER   PIC X(13)  VALUE    '520198 009324'.
               05  FILLER   PIC X(13)  VALUE    '520202 009335'.
               05  FILLER   PIC X(13)  VALUE    '520204 009734'.
               05  FILLER   PIC X(13)  VALUE    '520205 009734'.
               05  FILLER   PIC X(13)  VALUE    '520206 009734'.
               05  FILLER   PIC X(13)  VALUE    '520207 009734'.
               05  FILLER   PIC X(13)  VALUE    '520208 010568'.
               05  FILLER   PIC X(13)  VALUE    '521502 010427'.
               05  FILLER   PIC X(13)  VALUE    '521503 009221'.
               05  FILLER   PIC X(13)  VALUE    '521504 009314'.
               05  FILLER   PIC X(13)  VALUE    '521505 010694'.
               05  FILLER   PIC X(13)  VALUE    '521507 009416'.
               05  FILLER   PIC X(13)  VALUE    '521508 009221'.
               05  FILLER   PIC X(13)  VALUE    '521509 009221'.
               05  FILLER   PIC X(13)  VALUE    '521512 009221'.
               05  FILLER   PIC X(13)  VALUE    '521513 009221'.
               05  FILLER   PIC X(13)  VALUE    '521514 009221'.
               05  FILLER   PIC X(13)  VALUE    '521516 009221'.
               05  FILLER   PIC X(13)  VALUE    '521517 009221'.
               05  FILLER   PIC X(13)  VALUE    '521518 009221'.
               05  FILLER   PIC X(13)  VALUE    '521519 009683'.
               05  FILLER   PIC X(13)  VALUE    '521521 011038'.
               05  FILLER   PIC X(13)  VALUE    '521522 009221'.
               05  FILLER   PIC X(13)  VALUE    '521523 009221'.
               05  FILLER   PIC X(13)  VALUE    '521524 009683'.
               05  FILLER   PIC X(13)  VALUE    '521525 009221'.
               05  FILLER   PIC X(13)  VALUE    '521526 009314'.
               05  FILLER   PIC X(13)  VALUE    '521527 009221'.
               05  FILLER   PIC X(13)  VALUE    '521528 009734'.
               05  FILLER   PIC X(13)  VALUE    '521531 009734'.
               05  FILLER   PIC X(13)  VALUE    '521532 009221'.
               05  FILLER   PIC X(13)  VALUE    '521536 009221'.
               05  FILLER   PIC X(13)  VALUE    '521537 009734'.
               05  FILLER   PIC X(13)  VALUE    '521539 009221'.
               05  FILLER   PIC X(13)  VALUE    '521540 009221'.
               05  FILLER   PIC X(13)  VALUE    '521542 009348'.
               05  FILLER   PIC X(13)  VALUE    '521544 009221'.
               05  FILLER   PIC X(13)  VALUE    '521547 009221'.
               05  FILLER   PIC X(13)  VALUE    '521549 010694'.
               05  FILLER   PIC X(13)  VALUE    '521550 009221'.
               05  FILLER   PIC X(13)  VALUE    '521555 009221'.
               05  FILLER   PIC X(13)  VALUE    '521557 009221'.
               05  FILLER   PIC X(13)  VALUE    '521558 009221'.
               05  FILLER   PIC X(13)  VALUE    '521559 009734'.
               05  FILLER   PIC X(13)  VALUE    '521561 009734'.
               05  FILLER   PIC X(13)  VALUE    '521563 009335'.
               05  FILLER   PIC X(13)  VALUE    '521567 009221'.
               05  FILLER   PIC X(13)  VALUE    '521568 010694'.
               05  FILLER   PIC X(13)  VALUE    '521569 009734'.
               05  FILLER   PIC X(13)  VALUE    '521570 009221'.
               05  FILLER   PIC X(13)  VALUE    '521571 009734'.
               05  FILLER   PIC X(13)  VALUE    '521572 009416'.
               05  FILLER   PIC X(13)  VALUE    '521573 009734'.
               05  FILLER   PIC X(13)  VALUE    '521574 009348'.
               05  FILLER   PIC X(13)  VALUE    '521576 009734'.
               05  FILLER   PIC X(13)  VALUE    '521577 009734'.
               05  FILLER   PIC X(13)  VALUE    '521578 009221'.
               05  FILLER   PIC X(13)  VALUE    '521579 009734'.
               05  FILLER   PIC X(13)  VALUE    '521580 009221'.
               05  FILLER   PIC X(13)  VALUE    '521582 009348'.
               05  FILLER   PIC X(13)  VALUE    '521583 009734'.
               05  FILLER   PIC X(13)  VALUE    '521585 009734'.
               05  FILLER   PIC X(13)  VALUE    '521586 009335'.
               05  FILLER   PIC X(13)  VALUE    '521587 009221'.
               05  FILLER   PIC X(13)  VALUE    '521588 009734'.
               05  FILLER   PIC X(13)  VALUE    '521589 009734'.
               05  FILLER   PIC X(13)  VALUE    '521590 009221'.
               05  FILLER   PIC X(13)  VALUE    '521591 010694'.
               05  FILLER   PIC X(13)  VALUE    '521592 010694'.
               05  FILLER   PIC X(13)  VALUE    '521593 009734'.
               05  FILLER   PIC X(13)  VALUE    '521594 009221'.
               05  FILLER   PIC X(13)  VALUE    '522004 009734'.
               05  FILLER   PIC X(13)  VALUE    '522005 009533'.
               05  FILLER   PIC X(13)  VALUE    '522006 009734'.
               05  FILLER   PIC X(13)  VALUE    '522007 009734'.
               05  FILLER   PIC X(13)  VALUE    '522008 010694'.
               05  FILLER   PIC X(13)  VALUE    '523025 009734'.
               05  FILLER   PIC X(13)  VALUE    '523027 009734'.
               05  FILLER   PIC X(13)  VALUE    '523300 009734'.
               05  FILLER   PIC X(13)  VALUE    '523302 009324'.
               05  FILLER   PIC X(13)  VALUE    '524000 009734'.
               05  FILLER   PIC X(13)  VALUE    '524001 009734'.
               05  FILLER   PIC X(13)  VALUE    '524014 009221'.
               05  FILLER   PIC X(13)  VALUE    '524017 009221'.
               05  FILLER   PIC X(13)  VALUE    '524041 009221'.
               05  FILLER   PIC X(13)  VALUE    '524500 011038'.
               05  FILLER   PIC X(13)  VALUE    '527135 009221'.
               05  FILLER   PIC X(13)  VALUE    '527137 011038'.
               05  FILLER   PIC X(13)  VALUE    '527156 009416'.
               05  FILLER   PIC X(13)  VALUE    '527219 009221'.
               05  FILLER   PIC X(13)  VALUE    '527249 009221'.
               05  FILLER   PIC X(13)  VALUE    '527268 010694'.
               05  FILLER   PIC X(13)  VALUE    '527304 009734'.
               05  FILLER   PIC X(13)  VALUE    '527305 009734'.
               05  FILLER   PIC X(13)  VALUE    '527306 009734'.
               05  FILLER   PIC X(13)  VALUE    '527307 009734'.
               05  FILLER   PIC X(13)  VALUE    '527308 009221'.
               05  FILLER   PIC X(13)  VALUE    '527309 009221'.
               05  FILLER   PIC X(13)  VALUE    '527310 009348'.
               05  FILLER   PIC X(13)  VALUE    '527311 010694'.
               05  FILLER   PIC X(13)  VALUE    '527312 009221'.
               05  FILLER   PIC X(13)  VALUE    '527313 009734'.
               05  FILLER   PIC X(13)  VALUE    '527314 009734'.
               05  FILLER   PIC X(13)  VALUE    '53S002 010000'.
               05  FILLER   PIC X(13)  VALUE    '53S014 010000'.
               05  FILLER   PIC X(13)  VALUE    '53S025 010000'.
               05  FILLER   PIC X(13)  VALUE    '53T014 010000'.
               05  FILLER   PIC X(13)  VALUE    '53U002 010000'.
               05  FILLER   PIC X(13)  VALUE    '53U006 010000'.
               05  FILLER   PIC X(13)  VALUE    '53U010 010000'.
               05  FILLER   PIC X(13)  VALUE    '53U015 010000'.
               05  FILLER   PIC X(13)  VALUE    '53U025 010000'.
               05  FILLER   PIC X(13)  VALUE    '530002 010000'.
               05  FILLER   PIC X(13)  VALUE    '530006 010000'.
               05  FILLER   PIC X(13)  VALUE    '530008 010000'.
               05  FILLER   PIC X(13)  VALUE    '530010 010000'.
               05  FILLER   PIC X(13)  VALUE    '530011 010000'.
               05  FILLER   PIC X(13)  VALUE    '530012 010000'.
               05  FILLER   PIC X(13)  VALUE    '530014 010000'.
               05  FILLER   PIC X(13)  VALUE    '530015 010000'.
               05  FILLER   PIC X(13)  VALUE    '530025 010000'.
               05  FILLER   PIC X(13)  VALUE    '530032 010000'.
               05  FILLER   PIC X(13)  VALUE    '530033 010000'.
               05  FILLER   PIC X(13)  VALUE    '530034 010000'.
               05  FILLER   PIC X(13)  VALUE    '531500 010000'.
               05  FILLER   PIC X(13)  VALUE    '531501 010000'.
               05  FILLER   PIC X(13)  VALUE    '531502 010000'.
               05  FILLER   PIC X(13)  VALUE    '531504 010000'.
               05  FILLER   PIC X(13)  VALUE    '531505 010000'.
               05  FILLER   PIC X(13)  VALUE    '531506 010000'.
               05  FILLER   PIC X(13)  VALUE    '531507 010000'.
               05  FILLER   PIC X(13)  VALUE    '531508 010000'.
               05  FILLER   PIC X(13)  VALUE    '531509 010000'.
               05  FILLER   PIC X(13)  VALUE    '531510 010000'.
               05  FILLER   PIC X(13)  VALUE    '531511 010000'.
               05  FILLER   PIC X(13)  VALUE    '531514 010000'.
               05  FILLER   PIC X(13)  VALUE    '531519 010000'.
               05  FILLER   PIC X(13)  VALUE    '531521 010000'.
               05  FILLER   PIC X(13)  VALUE    '531522 010000'.
               05  FILLER   PIC X(13)  VALUE    '531523 010000'.
               05  FILLER   PIC X(13)  VALUE    '533027 010000'.
               05  FILLER   PIC X(13)  VALUE    '537077 010000'.
               05  FILLER   PIC X(13)  VALUE    '537078 010000'.
               05  FILLER   PIC X(13)  VALUE    '537833 010000'.
               05  FILLER   PIC X(13)  VALUE    '537834 010000'.
               05  FILLER   PIC X(13)  VALUE    '551500 012827'.
               05  FILLER   PIC X(13)  VALUE    '551501 013285'.
               05  FILLER   PIC X(13)  VALUE    '551502 012827'.
               05  FILLER   PIC X(13)  VALUE    '551503 014349'.
               05  FILLER   PIC X(13)  VALUE    '551504 012500'.
               05  FILLER   PIC X(13)  VALUE    '551505 014349'.
               05  FILLER   PIC X(13)  VALUE    '551506 012827'.
               05  FILLER   PIC X(13)  VALUE    '551507 012827'.
               05  FILLER   PIC X(13)  VALUE    '551508 012500'.
               05  FILLER   PIC X(13)  VALUE    '551509 014349'.
               05  FILLER   PIC X(13)  VALUE    '551510 014349'.
               05  FILLER   PIC X(13)  VALUE    '551513 012500'.
               05  FILLER   PIC X(13)  VALUE    '551514 012500'.
               05  FILLER   PIC X(13)  VALUE    '551515 012500'.
               05  FILLER   PIC X(13)  VALUE    '551516 012827'.
               05  FILLER   PIC X(13)  VALUE    '551518 012827'.
               05  FILLER   PIC X(13)  VALUE    '551519 014349'.
               05  FILLER   PIC X(13)  VALUE    '551520 014349'.
               05  FILLER   PIC X(13)  VALUE    '551521 012827'.
               05  FILLER   PIC X(13)  VALUE    '551522 012500'.
               05  FILLER   PIC X(13)  VALUE    '551523 012827'.
               05  FILLER   PIC X(13)  VALUE    '551524 012827'.
               05  FILLER   PIC X(13)  VALUE    '551525 012827'.
               05  FILLER   PIC X(13)  VALUE    '551526 012827'.
               05  FILLER   PIC X(13)  VALUE    '551528 012827'.
               05  FILLER   PIC X(13)  VALUE    '551529 012827'.
               05  FILLER   PIC X(13)  VALUE    '551530 012827'.
               05  FILLER   PIC X(13)  VALUE    '551531 012827'.
               05  FILLER   PIC X(13)  VALUE    '551532 012827'.
               05  FILLER   PIC X(13)  VALUE    '551533 014349'.
               05  FILLER   PIC X(13)  VALUE    '551534 012827'.
               05  FILLER   PIC X(13)  VALUE    '551535 012827'.
               05  FILLER   PIC X(13)  VALUE    '551536 012827'.
               05  FILLER   PIC X(13)  VALUE    '551537 012827'.
               05  FILLER   PIC X(13)  VALUE    '551538 015862'.
               05  FILLER   PIC X(13)  VALUE    '551539 012500'.
               05  FILLER   PIC X(13)  VALUE    '551540 012500'.
               05  FILLER   PIC X(13)  VALUE    '551541 012500'.
               05  FILLER   PIC X(13)  VALUE    '551542 012827'.
               05  FILLER   PIC X(13)  VALUE    '551543 012827'.
               05  FILLER   PIC X(13)  VALUE    '551544 012500'.
               05  FILLER   PIC X(13)  VALUE    '551545 012500'.
               05  FILLER   PIC X(13)  VALUE    '551546 012500'.
               05  FILLER   PIC X(13)  VALUE    '551547 012827'.
               05  FILLER   PIC X(13)  VALUE    '551548 012500'.
               05  FILLER   PIC X(13)  VALUE    '551549 012827'.
               05  FILLER   PIC X(13)  VALUE    '551550 012500'.
               05  FILLER   PIC X(13)  VALUE    '551551 012500'.
               05  FILLER   PIC X(13)  VALUE    '551552 017827'.
               05  FILLER   PIC X(13)  VALUE    '551553 012827'.
               05  FILLER   PIC X(13)  VALUE    '551555 012500'.
               05  FILLER   PIC X(13)  VALUE    '551556 012827'.
               05  FILLER   PIC X(13)  VALUE    '551557 012500'.
               05  FILLER   PIC X(13)  VALUE    '551558 016900'.
               05  FILLER   PIC X(13)  VALUE    '551559 012827'.
               05  FILLER   PIC X(13)  VALUE    '551560 012500'.
               05  FILLER   PIC X(13)  VALUE    '551561 017827'.
               05  FILLER   PIC X(13)  VALUE    '551562 016900'.
               05  FILLER   PIC X(13)  VALUE    '551564 014349'.
               05  FILLER   PIC X(13)  VALUE    '551565 012827'.
               05  FILLER   PIC X(13)  VALUE    '551566 012827'.
               05  FILLER   PIC X(13)  VALUE    '551567 012827'.
               05  FILLER   PIC X(13)  VALUE    '551568 012827'.
               05  FILLER   PIC X(13)  VALUE    '551569 012827'.
               05  FILLER   PIC X(13)  VALUE    '551570 012500'.
               05  FILLER   PIC X(13)  VALUE    '551571 012500'.
               05  FILLER   PIC X(13)  VALUE    '551572 012827'.
               05  FILLER   PIC X(13)  VALUE    '551573 012827'.
               05  FILLER   PIC X(13)  VALUE    '551574 014349'.
               05  FILLER   PIC X(13)  VALUE    '551575 012827'.
               05  FILLER   PIC X(13)  VALUE    '551576 012827'.
               05  FILLER   PIC X(13)  VALUE    '551577 012827'.
               05  FILLER   PIC X(13)  VALUE    '551578 012827'.
               05  FILLER   PIC X(13)  VALUE    '551579 012827'.
               05  FILLER   PIC X(13)  VALUE    '551580 012827'.
               05  FILLER   PIC X(13)  VALUE    '551581 012827'.
               05  FILLER   PIC X(13)  VALUE    '551582 012827'.
               05  FILLER   PIC X(13)  VALUE    '551583 012827'.
               05  FILLER   PIC X(13)  VALUE    '551584 012827'.
               05  FILLER   PIC X(13)  VALUE    '551585 016900'.
               05  FILLER   PIC X(13)  VALUE    '551587 012827'.
               05  FILLER   PIC X(13)  VALUE    '551588 012500'.
               05  FILLER   PIC X(13)  VALUE    '551589 012827'.
               05  FILLER   PIC X(13)  VALUE    '551590 012827'.
               05  FILLER   PIC X(13)  VALUE    '551591 012827'.
               05  FILLER   PIC X(13)  VALUE    '551592 012827'.
               05  FILLER   PIC X(13)  VALUE    '551593 012500'.
               05  FILLER   PIC X(13)  VALUE    '551594 014349'.
               05  FILLER   PIC X(13)  VALUE    '551595 012827'.
               05  FILLER   PIC X(13)  VALUE    '551596 014349'.
               05  FILLER   PIC X(13)  VALUE    '551597 012827'.
               05  FILLER   PIC X(13)  VALUE    '551598 012827'.
               05  FILLER   PIC X(13)  VALUE    '551599 012827'.
               05  FILLER   PIC X(13)  VALUE    '551600 012827'.
               05  FILLER   PIC X(13)  VALUE    '551601 012827'.
               05  FILLER   PIC X(13)  VALUE    '551602 012500'.
               05  FILLER   PIC X(13)  VALUE    '551603 012500'.
               05  FILLER   PIC X(13)  VALUE    '551604 012805'.
               05  FILLER   PIC X(13)  VALUE    '551605 012827'.
               05  FILLER   PIC X(13)  VALUE    '551606 016900'.
               05  FILLER   PIC X(13)  VALUE    '551607 012827'.
               05  FILLER   PIC X(13)  VALUE    '551608 012827'.
               05  FILLER   PIC X(13)  VALUE    '551609 012827'.
               05  FILLER   PIC X(13)  VALUE    '551610 012827'.
               05  FILLER   PIC X(13)  VALUE    '551611 012827'.
               05  FILLER   PIC X(13)  VALUE    '551612 012500'.
               05  FILLER   PIC X(13)  VALUE    '551613 012827'.
               05  FILLER   PIC X(13)  VALUE    '551614 012827'.
               05  FILLER   PIC X(13)  VALUE    '551615 012500'.
               05  FILLER   PIC X(13)  VALUE    '551616 012827'.
               05  FILLER   PIC X(13)  VALUE    '551617 012827'.
               05  FILLER   PIC X(13)  VALUE    '551618 012827'.
               05  FILLER   PIC X(13)  VALUE    '551619 012827'.
               05  FILLER   PIC X(13)  VALUE    '551620 012827'.
               05  FILLER   PIC X(13)  VALUE    '551621 012500'.
               05  FILLER   PIC X(13)  VALUE    '551622 012827'.
               05  FILLER   PIC X(13)  VALUE    '551623 012500'.
               05  FILLER   PIC X(13)  VALUE    '551624 012827'.
               05  FILLER   PIC X(13)  VALUE    '551625 012827'.
               05  FILLER   PIC X(13)  VALUE    '551626 012827'.
               05  FILLER   PIC X(13)  VALUE    '551627 014349'.
               05  FILLER   PIC X(13)  VALUE    '551628 012827'.
               05  FILLER   PIC X(13)  VALUE    '551629 017251'.
               05  FILLER   PIC X(13)  VALUE    '551630 012500'.
               05  FILLER   PIC X(13)  VALUE    '551631 012827'.
               05  FILLER   PIC X(13)  VALUE    '551632 012500'.
               05  FILLER   PIC X(13)  VALUE    '551633 012500'.
               05  FILLER   PIC X(13)  VALUE    '551634 012500'.
               05  FILLER   PIC X(13)  VALUE    '551635 014349'.
               05  FILLER   PIC X(13)  VALUE    '551636 012827'.
               05  FILLER   PIC X(13)  VALUE    '551637 012827'.
               05  FILLER   PIC X(13)  VALUE    '551638 012827'.
               05  FILLER   PIC X(13)  VALUE    '551639 012827'.
               05  FILLER   PIC X(13)  VALUE    '551640 012827'.
               05  FILLER   PIC X(13)  VALUE    '551641 016900'.
               05  FILLER   PIC X(13)  VALUE    '551642 012827'.
               05  FILLER   PIC X(13)  VALUE    '551643 012827'.
               05  FILLER   PIC X(13)  VALUE    '551644 012827'.
               05  FILLER   PIC X(13)  VALUE    '551645 012827'.
               05  FILLER   PIC X(13)  VALUE    '551646 012827'.
               05  FILLER   PIC X(13)  VALUE    '551647 012500'.
               05  FILLER   PIC X(13)  VALUE    '551648 012827'.
               05  FILLER   PIC X(13)  VALUE    '551649 012827'.
               05  FILLER   PIC X(13)  VALUE    '551650 015862'.
               05  FILLER   PIC X(13)  VALUE    '551651 012500'.
               05  FILLER   PIC X(13)  VALUE    '551652 012500'.
               05  FILLER   PIC X(13)  VALUE    '551653 012500'.
               05  FILLER   PIC X(13)  VALUE    '551654 015862'.
               05  FILLER   PIC X(13)  VALUE    '551655 012827'.
               05  FILLER   PIC X(13)  VALUE    '551656 012827'.
               05  FILLER   PIC X(13)  VALUE    '551657 012827'.
               05  FILLER   PIC X(13)  VALUE    '551658 012500'.
               05  FILLER   PIC X(13)  VALUE    '551659 012827'.
               05  FILLER   PIC X(13)  VALUE    '551660 016900'.
               05  FILLER   PIC X(13)  VALUE    '551661 017827'.
               05  FILLER   PIC X(13)  VALUE    '551662 012827'.
               05  FILLER   PIC X(13)  VALUE    '551664 012827'.
               05  FILLER   PIC X(13)  VALUE    '551665 012827'.
               05  FILLER   PIC X(13)  VALUE    '551666 012500'.
               05  FILLER   PIC X(13)  VALUE    '551667 012827'.
               05  FILLER   PIC X(13)  VALUE    '551668 012827'.
               05  FILLER   PIC X(13)  VALUE    '551669 016900'.
               05  FILLER   PIC X(13)  VALUE    '551670 012500'.
               05  FILLER   PIC X(13)  VALUE    '551671 012827'.
               05  FILLER   PIC X(13)  VALUE    '551672 012827'.
               05  FILLER   PIC X(13)  VALUE    '551673 012500'.
               05  FILLER   PIC X(13)  VALUE    '551674 012827'.
               05  FILLER   PIC X(13)  VALUE    '551675 012827'.
               05  FILLER   PIC X(13)  VALUE    '551676 012827'.
               05  FILLER   PIC X(13)  VALUE    '551677 012827'.
               05  FILLER   PIC X(13)  VALUE    '551678 012827'.
               05  FILLER   PIC X(13)  VALUE    '551679 012827'.
               05  FILLER   PIC X(13)  VALUE    '551680 012827'.
               05  FILLER   PIC X(13)  VALUE    '551681 015862'.
               05  FILLER   PIC X(13)  VALUE    '551682 014349'.
               05  FILLER   PIC X(13)  VALUE    '551683 012827'.
               05  FILLER   PIC X(13)  VALUE    '551684 012827'.
               05  FILLER   PIC X(13)  VALUE    '551685 012500'.
               05  FILLER   PIC X(13)  VALUE    '551686 012500'.
               05  FILLER   PIC X(13)  VALUE    '551687 012827'.
               05  FILLER   PIC X(13)  VALUE    '551688 012827'.
               05  FILLER   PIC X(13)  VALUE    '551689 012500'.
               05  FILLER   PIC X(13)  VALUE    '551690 012827'.
               05  FILLER   PIC X(13)  VALUE    '551691 012500'.
               05  FILLER   PIC X(13)  VALUE    '551692 012500'.
               05  FILLER   PIC X(13)  VALUE    '551693 012500'.
               05  FILLER   PIC X(13)  VALUE    '551694 012827'.
               05  FILLER   PIC X(13)  VALUE    '551695 012827'.
               05  FILLER   PIC X(13)  VALUE    '551696 012827'.
               05  FILLER   PIC X(13)  VALUE    '551697 012500'.
               05  FILLER   PIC X(13)  VALUE    '551698 012827'.
               05  FILLER   PIC X(13)  VALUE    '551699 012500'.
               05  FILLER   PIC X(13)  VALUE    '551700 012827'.
               05  FILLER   PIC X(13)  VALUE    '551701 012500'.
               05  FILLER   PIC X(13)  VALUE    '551702 012500'.
               05  FILLER   PIC X(13)  VALUE    '551703 012500'.
               05  FILLER   PIC X(13)  VALUE    '551704 016900'.
               05  FILLER   PIC X(13)  VALUE    '551705 012500'.
               05  FILLER   PIC X(13)  VALUE    '551706 012827'.
               05  FILLER   PIC X(13)  VALUE    '551707 012827'.
               05  FILLER   PIC X(13)  VALUE    '551708 012827'.
               05  FILLER   PIC X(13)  VALUE    '551709 012827'.
               05  FILLER   PIC X(13)  VALUE    '551711 012500'.
               05  FILLER   PIC X(13)  VALUE    '551712 012827'.
               05  FILLER   PIC X(13)  VALUE    '551716 012827'.
               05  FILLER   PIC X(13)  VALUE    '640001 012595'.
               05  FILLER   PIC X(13)  VALUE    '651500 012595'.
               05  FILLER   PIC X(13)  VALUE    '651501 012595'.
               05  FILLER   PIC X(13)  VALUE    '660001 012595'.
               05  FILLER   PIC X(13)  VALUE    '67B062 009681'.
               05  FILLER   PIC X(13)  VALUE    '67S010 009736'.
               05  FILLER   PIC X(13)  VALUE    '67S093 009754'.
               05  FILLER   PIC X(13)  VALUE    '67T055 008538'.
               05  FILLER   PIC X(13)  VALUE    '67U004 008106'.
               05  FILLER   PIC X(13)  VALUE    '670002 009736'.
               05  FILLER   PIC X(13)  VALUE    '670004 008106'.
               05  FILLER   PIC X(13)  VALUE    '670005 009754'.
               05  FILLER   PIC X(13)  VALUE    '670006 009417'.
               05  FILLER   PIC X(13)  VALUE    '670008 009754'.
               05  FILLER   PIC X(13)  VALUE    '670010 009736'.
               05  FILLER   PIC X(13)  VALUE    '670012 009754'.
               05  FILLER   PIC X(13)  VALUE    '670019 009754'.
               05  FILLER   PIC X(13)  VALUE    '670023 009736'.
               05  FILLER   PIC X(13)  VALUE    '670024 009754'.
               05  FILLER   PIC X(13)  VALUE    '670025 009736'.
               05  FILLER   PIC X(13)  VALUE    '670029 009754'.
               05  FILLER   PIC X(13)  VALUE    '670031 009754'.
               05  FILLER   PIC X(13)  VALUE    '670034 009417'.
               05  FILLER   PIC X(13)  VALUE    '670041 009417'.
               05  FILLER   PIC X(13)  VALUE    '670043 009417'.
               05  FILLER   PIC X(13)  VALUE    '670044 009736'.
               05  FILLER   PIC X(13)  VALUE    '670045 009736'.
               05  FILLER   PIC X(13)  VALUE    '670046 009736'.
               05  FILLER   PIC X(13)  VALUE    '670047 008106'.
               05  FILLER   PIC X(13)  VALUE    '670049 009736'.
               05  FILLER   PIC X(13)  VALUE    '670050 008597'.
               05  FILLER   PIC X(13)  VALUE    '670053 009754'.
               05  FILLER   PIC X(13)  VALUE    '670054 008538'.
               05  FILLER   PIC X(13)  VALUE    '670055 008538'.
               05  FILLER   PIC X(13)  VALUE    '670056 009417'.
               05  FILLER   PIC X(13)  VALUE    '670058 009754'.
               05  FILLER   PIC X(13)  VALUE    '670059 009754'.
               05  FILLER   PIC X(13)  VALUE    '670060 009736'.
               05  FILLER   PIC X(13)  VALUE    '670061 009170'.
               05  FILLER   PIC X(13)  VALUE    '670062 009736'.
               05  FILLER   PIC X(13)  VALUE    '670066 008969'.
               05  FILLER   PIC X(13)  VALUE    '670067 009736'.
               05  FILLER   PIC X(13)  VALUE    '670068 009736'.
               05  FILLER   PIC X(13)  VALUE    '670069 009736'.
               05  FILLER   PIC X(13)  VALUE    '670071 009736'.
               05  FILLER   PIC X(13)  VALUE    '670072 009754'.
               05  FILLER   PIC X(13)  VALUE    '670073 009736'.
               05  FILLER   PIC X(13)  VALUE    '670075 009754'.
               05  FILLER   PIC X(13)  VALUE    '670076 009736'.
               05  FILLER   PIC X(13)  VALUE    '670077 009754'.
               05  FILLER   PIC X(13)  VALUE    '670078 008538'.
               05  FILLER   PIC X(13)  VALUE    '670079 009417'.
               05  FILLER   PIC X(13)  VALUE    '670080 009701'.
               05  FILLER   PIC X(13)  VALUE    '670082 009736'.
               05  FILLER   PIC X(13)  VALUE    '670083 009736'.
               05  FILLER   PIC X(13)  VALUE    '670085 009736'.
               05  FILLER   PIC X(13)  VALUE    '670087 009417'.
               05  FILLER   PIC X(13)  VALUE    '670088 008491'.
               05  FILLER   PIC X(13)  VALUE    '670089 008106'.
               05  FILLER   PIC X(13)  VALUE    '670090 009736'.
               05  FILLER   PIC X(13)  VALUE    '670091 008927'.
               05  FILLER   PIC X(13)  VALUE    '670092 009736'.
               05  FILLER   PIC X(13)  VALUE    '670093 009754'.
               05  FILLER   PIC X(13)  VALUE    '670094 009250'.
               05  FILLER   PIC X(13)  VALUE    '670095 009754'.
               05  FILLER   PIC X(13)  VALUE    '670096 009754'.
               05  FILLER   PIC X(13)  VALUE    '670097 009736'.
               05  FILLER   PIC X(13)  VALUE    '670098 008672'.
               05  FILLER   PIC X(13)  VALUE    '670099 009754'.
               05  FILLER   PIC X(13)  VALUE    '670100 009736'.
               05  FILLER   PIC X(13)  VALUE    '670101 009736'.
               05  FILLER   PIC X(13)  VALUE    '670102 009754'.
               05  FILLER   PIC X(13)  VALUE    '670103 009736'.
               05  FILLER   PIC X(13)  VALUE    '670106 009754'.
               05  FILLER   PIC X(13)  VALUE    '670107 009736'.
               05  FILLER   PIC X(13)  VALUE    '670108 008289'.
               05  FILLER   PIC X(13)  VALUE    '670109 009754'.
               05  FILLER   PIC X(13)  VALUE    '670110 009736'.
               05  FILLER   PIC X(13)  VALUE    '670111 008969'.
               05  FILLER   PIC X(13)  VALUE    '670112 008538'.
               05  FILLER   PIC X(13)  VALUE    '670114 008106'.
               05  FILLER   PIC X(13)  VALUE    '670115 009754'.
               05  FILLER   PIC X(13)  VALUE    '670116 009681'.
               05  FILLER   PIC X(13)  VALUE    '670117 009736'.
               05  FILLER   PIC X(13)  VALUE    '670118 009754'.
               05  FILLER   PIC X(13)  VALUE    '670119 009754'.
               05  FILLER   PIC X(13)  VALUE    '670120 008106'.
               05  FILLER   PIC X(13)  VALUE    '670121 009681'.
               05  FILLER   PIC X(13)  VALUE    '670122 009754'.
               05  FILLER   PIC X(13)  VALUE    '670123 009754'.
               05  FILLER   PIC X(13)  VALUE    '670124 008106'.
               05  FILLER   PIC X(13)  VALUE    '670125 008538'.
               05  FILLER   PIC X(13)  VALUE    '670127 008106'.
               05  FILLER   PIC X(13)  VALUE    '670128 009417'.
               05  FILLER   PIC X(13)  VALUE    '671505 009592'.
               05  FILLER   PIC X(13)  VALUE    '671542 008224'.
               05  FILLER   PIC X(13)  VALUE    '671550 008538'.
               05  FILLER   PIC X(13)  VALUE    '671577 009754'.
               05  FILLER   PIC X(13)  VALUE    '671591 008106'.
               05  FILLER   PIC X(13)  VALUE    '671592 008106'.
               05  FILLER   PIC X(13)  VALUE    '671594 009592'.
               05  FILLER   PIC X(13)  VALUE    '671596 009754'.
               05  FILLER   PIC X(13)  VALUE    '671597 009736'.
               05  FILLER   PIC X(13)  VALUE    '671599 008106'.
               05  FILLER   PIC X(13)  VALUE    '671600 009754'.
               05  FILLER   PIC X(13)  VALUE    '671603 009736'.
               05  FILLER   PIC X(13)  VALUE    '671604 008106'.
               05  FILLER   PIC X(13)  VALUE    '671605 008106'.
               05  FILLER   PIC X(13)  VALUE    '671606 009736'.
               05  FILLER   PIC X(13)  VALUE    '671607 009170'.
               05  FILLER   PIC X(13)  VALUE    '671608 009170'.
               05  FILLER   PIC X(13)  VALUE    '671609 008106'.
               05  FILLER   PIC X(13)  VALUE    '671610 008597'.
               05  FILLER   PIC X(13)  VALUE    '671611 009736'.
               05  FILLER   PIC X(13)  VALUE    '671612 008538'.
               05  FILLER   PIC X(13)  VALUE    '671613 009736'.
               05  FILLER   PIC X(13)  VALUE    '671614 008106'.
               05  FILLER   PIC X(13)  VALUE    '671617 009754'.
               05  FILLER   PIC X(13)  VALUE    '671618 008106'.
               05  FILLER   PIC X(13)  VALUE    '671619 009754'.
               05  FILLER   PIC X(13)  VALUE    '671621 009170'.
               05  FILLER   PIC X(13)  VALUE    '671622 009736'.
               05  FILLER   PIC X(13)  VALUE    '671623 009592'.
               05  FILLER   PIC X(13)  VALUE    '671624 008538'.
               05  FILLER   PIC X(13)  VALUE    '671626 009754'.
               05  FILLER   PIC X(13)  VALUE    '671627 009736'.
               05  FILLER   PIC X(13)  VALUE    '671628 009417'.
               05  FILLER   PIC X(13)  VALUE    '671629 008760'.
               05  FILLER   PIC X(13)  VALUE    '671630 009417'.
               05  FILLER   PIC X(13)  VALUE    '671631 009417'.
               05  FILLER   PIC X(13)  VALUE    '671632 009736'.
               05  FILLER   PIC X(13)  VALUE    '671633 009736'.
               05  FILLER   PIC X(13)  VALUE    '671634 008224'.
               05  FILLER   PIC X(13)  VALUE    '671635 009754'.
               05  FILLER   PIC X(13)  VALUE    '671636 008106'.
               05  FILLER   PIC X(13)  VALUE    '671637 008878'.
               05  FILLER   PIC X(13)  VALUE    '671638 008106'.
               05  FILLER   PIC X(13)  VALUE    '671640 008538'.
               05  FILLER   PIC X(13)  VALUE    '671641 008760'.
               05  FILLER   PIC X(13)  VALUE    '671642 008224'.
               05  FILLER   PIC X(13)  VALUE    '671643 008224'.
               05  FILLER   PIC X(13)  VALUE    '671644 009754'.
               05  FILLER   PIC X(13)  VALUE    '671645 009754'.
               05  FILLER   PIC X(13)  VALUE    '671646 008803'.
               05  FILLER   PIC X(13)  VALUE    '671647 008878'.
               05  FILLER   PIC X(13)  VALUE    '671649 009754'.
               05  FILLER   PIC X(13)  VALUE    '671650 008538'.
               05  FILLER   PIC X(13)  VALUE    '671651 009592'.
               05  FILLER   PIC X(13)  VALUE    '671652 008106'.
               05  FILLER   PIC X(13)  VALUE    '671653 009754'.
               05  FILLER   PIC X(13)  VALUE    '671654 009170'.
               05  FILLER   PIC X(13)  VALUE    '671655 009417'.
               05  FILLER   PIC X(13)  VALUE    '671656 008878'.
               05  FILLER   PIC X(13)  VALUE    '671657 008224'.
               05  FILLER   PIC X(13)  VALUE    '671658 009736'.
               05  FILLER   PIC X(13)  VALUE    '671659 008224'.
               05  FILLER   PIC X(13)  VALUE    '671660 009754'.
               05  FILLER   PIC X(13)  VALUE    '671661 009754'.
               05  FILLER   PIC X(13)  VALUE    '671663 009754'.
               05  FILLER   PIC X(13)  VALUE    '671664 009754'.
               05  FILLER   PIC X(13)  VALUE    '671666 008106'.
               05  FILLER   PIC X(13)  VALUE    '671667 008597'.
               05  FILLER   PIC X(13)  VALUE    '671668 009592'.
               05  FILLER   PIC X(13)  VALUE    '671669 008538'.
               05  FILLER   PIC X(13)  VALUE    '671670 008106'.
               05  FILLER   PIC X(13)  VALUE    '671671 008224'.
               05  FILLER   PIC X(13)  VALUE    '671672 009754'.
               05  FILLER   PIC X(13)  VALUE    '671673 008106'.
               05  FILLER   PIC X(13)  VALUE    '671674 009736'.
               05  FILLER   PIC X(13)  VALUE    '671675 009736'.
               05  FILLER   PIC X(13)  VALUE    '671676 008538'.
               05  FILLER   PIC X(13)  VALUE    '671678 008106'.
               05  FILLER   PIC X(13)  VALUE    '671679 008491'.
               05  FILLER   PIC X(13)  VALUE    '671680 009754'.
               05  FILLER   PIC X(13)  VALUE    '671681 009754'.
               05  FILLER   PIC X(13)  VALUE    '671682 009754'.
               05  FILLER   PIC X(13)  VALUE    '671683 009736'.
               05  FILLER   PIC X(13)  VALUE    '671684 009754'.
               05  FILLER   PIC X(13)  VALUE    '671685 009754'.
               05  FILLER   PIC X(13)  VALUE    '671686 009754'.
               05  FILLER   PIC X(13)  VALUE    '671687 008224'.
               05  FILLER   PIC X(13)  VALUE    '671689 008106'.
               05  FILLER   PIC X(13)  VALUE    '671690 008106'.
               05  FILLER   PIC X(13)  VALUE    '671691 009754'.
               05  FILLER   PIC X(13)  VALUE    '671692 009754'.
               05  FILLER   PIC X(13)  VALUE    '671693 009754'.
               05  FILLER   PIC X(13)  VALUE    '671694 008106'.
               05  FILLER   PIC X(13)  VALUE    '671695 008106'.
               05  FILLER   PIC X(13)  VALUE    '671697 008597'.
               05  FILLER   PIC X(13)  VALUE    '671698 009736'.
               05  FILLER   PIC X(13)  VALUE    '671699 009592'.
               05  FILLER   PIC X(13)  VALUE    '671700 008538'.
               05  FILLER   PIC X(13)  VALUE    '671701 008878'.
               05  FILLER   PIC X(13)  VALUE    '671702 008106'.
               05  FILLER   PIC X(13)  VALUE    '671703 009754'.
               05  FILLER   PIC X(13)  VALUE    '671704 009754'.
               05  FILLER   PIC X(13)  VALUE    '671706 009754'.
               05  FILLER   PIC X(13)  VALUE    '671707 009736'.
               05  FILLER   PIC X(13)  VALUE    '671708 009754'.
               05  FILLER   PIC X(13)  VALUE    '671711 009754'.
               05  FILLER   PIC X(13)  VALUE    '671712 009592'.
               05  FILLER   PIC X(13)  VALUE    '671713 009417'.
               05  FILLER   PIC X(13)  VALUE    '671714 009417'.
               05  FILLER   PIC X(13)  VALUE    '671715 008878'.
               05  FILLER   PIC X(13)  VALUE    '671716 008106'.
               05  FILLER   PIC X(13)  VALUE    '671717 009754'.
               05  FILLER   PIC X(13)  VALUE    '671718 009592'.
               05  FILLER   PIC X(13)  VALUE    '671719 009754'.
               05  FILLER   PIC X(13)  VALUE    '671721 008538'.
               05  FILLER   PIC X(13)  VALUE    '671722 009754'.
               05  FILLER   PIC X(13)  VALUE    '671723 009736'.
               05  FILLER   PIC X(13)  VALUE    '671724 009754'.
               05  FILLER   PIC X(13)  VALUE    '671725 009754'.
               05  FILLER   PIC X(13)  VALUE    '671727 009592'.
               05  FILLER   PIC X(13)  VALUE    '671728 008106'.
               05  FILLER   PIC X(13)  VALUE    '671729 008106'.
               05  FILLER   PIC X(13)  VALUE    '671730 008106'.
               05  FILLER   PIC X(13)  VALUE    '671731 009736'.
               05  FILLER   PIC X(13)  VALUE    '671732 008106'.
               05  FILLER   PIC X(13)  VALUE    '671733 009736'.
               05  FILLER   PIC X(13)  VALUE    '671734 009736'.
               05  FILLER   PIC X(13)  VALUE    '671735 009754'.
               05  FILLER   PIC X(13)  VALUE    '671736 009736'.
               05  FILLER   PIC X(13)  VALUE    '671737 009754'.
               05  FILLER   PIC X(13)  VALUE    '671738 008491'.
               05  FILLER   PIC X(13)  VALUE    '671739 008538'.
               05  FILLER   PIC X(13)  VALUE    '671740 008106'.
               05  FILLER   PIC X(13)  VALUE    '671741 009754'.
               05  FILLER   PIC X(13)  VALUE    '671742 009592'.
               05  FILLER   PIC X(13)  VALUE    '671743 008224'.
               05  FILLER   PIC X(13)  VALUE    '671745 009754'.
               05  FILLER   PIC X(13)  VALUE    '671746 008538'.
               05  FILLER   PIC X(13)  VALUE    '671747 008538'.
               05  FILLER   PIC X(13)  VALUE    '671748 008106'.
               05  FILLER   PIC X(13)  VALUE    '671749 008106'.
               05  FILLER   PIC X(13)  VALUE    '671750 008538'.
               05  FILLER   PIC X(13)  VALUE    '671751 009736'.
               05  FILLER   PIC X(13)  VALUE    '671752 009417'.
               05  FILLER   PIC X(13)  VALUE    '671754 009736'.
               05  FILLER   PIC X(13)  VALUE    '671757 009754'.
               05  FILLER   PIC X(13)  VALUE    '673025 009736'.
               05  FILLER   PIC X(13)  VALUE    '673029 009736'.
               05  FILLER   PIC X(13)  VALUE    '673031 009736'.
               05  FILLER   PIC X(13)  VALUE    '673032 009417'.
               05  FILLER   PIC X(13)  VALUE    '673034 009754'.
               05  FILLER   PIC X(13)  VALUE    '673035 009681'.
               05  FILLER   PIC X(13)  VALUE    '673036 009736'.
               05  FILLER   PIC X(13)  VALUE    '673038 009754'.
               05  FILLER   PIC X(13)  VALUE    '673039 008247'.
               05  FILLER   PIC X(13)  VALUE    '673040 008538'.
               05  FILLER   PIC X(13)  VALUE    '673042 009754'.
               05  FILLER   PIC X(13)  VALUE    '673043 009736'.
               05  FILLER   PIC X(13)  VALUE    '673044 009681'.
               05  FILLER   PIC X(13)  VALUE    '673045 009736'.
               05  FILLER   PIC X(13)  VALUE    '673046 009736'.
               05  FILLER   PIC X(13)  VALUE    '673049 008672'.
               05  FILLER   PIC X(13)  VALUE    '673050 009754'.
               05  FILLER   PIC X(13)  VALUE    '673051 009754'.
               05  FILLER   PIC X(13)  VALUE    '673052 009754'.
               05  FILLER   PIC X(13)  VALUE    '673054 009417'.
               05  FILLER   PIC X(13)  VALUE    '673055 009736'.
               05  FILLER   PIC X(13)  VALUE    '673057 009417'.
               05  FILLER   PIC X(13)  VALUE    '673058 009417'.
               05  FILLER   PIC X(13)  VALUE    '673061 009754'.
               05  FILLER   PIC X(13)  VALUE    '673063 008597'.
               05  FILLER   PIC X(13)  VALUE    '673064 009736'.
               05  FILLER   PIC X(13)  VALUE    '673067 009170'.
               05  FILLER   PIC X(13)  VALUE    '673068 009754'.
               05  FILLER   PIC X(13)  VALUE    '673069 009417'.
               05  FILLER   PIC X(13)  VALUE    '679324 009736'.
               05  FILLER   PIC X(13)  VALUE    '679579 008224'.
               05  FILLER   PIC X(13)  VALUE    '679724 009736'.
               05  FILLER   PIC X(13)  VALUE    '679786 009754'.
               05  FILLER   PIC X(13)  VALUE    '679795 008224'.
               05  FILLER   PIC X(13)  VALUE    '684600 009198'.
               05  FILLER   PIC X(13)  VALUE    '684601 009198'.
               05  FILLER   PIC X(13)  VALUE    '684602 009198'.
               05  FILLER   PIC X(13)  VALUE    '684603 009198'.
               05  FILLER   PIC X(13)  VALUE    '684614 008942'.
               05  FILLER   PIC X(13)  VALUE    '684615 009044'.
               05  FILLER   PIC X(13)  VALUE    '684616 009565'.
               05  FILLER   PIC X(13)  VALUE    '684617 008942'.
               05  FILLER   PIC X(13)  VALUE    '684618 008128'.
               05  FILLER   PIC X(13)  VALUE    '684619 009198'.
               05  FILLER   PIC X(13)  VALUE    '684878 008128'.
               05  FILLER   PIC X(13)  VALUE    '684880 008128'.
               05  FILLER   PIC X(13)  VALUE    '684883 008128'.
               05  FILLER   PIC X(13)  VALUE    '743110 009754'.
               05  FILLER   PIC X(13)  VALUE    '743111 009754'.
               05  FILLER   PIC X(13)  VALUE    '743121 008538'.
               05  FILLER   PIC X(13)  VALUE    '743123 009754'.
               05  FILLER   PIC X(13)  VALUE    '743138 009754'.
               05  FILLER   PIC X(13)  VALUE    '743139 008106'.
               05  FILLER   PIC X(13)  VALUE    '743142 009736'.
               05  FILLER   PIC X(13)  VALUE    '743143 009736'.
               05  FILLER   PIC X(13)  VALUE    '743146 008993'.
               05  FILLER   PIC X(13)  VALUE    '743150 009736'.
               05  FILLER   PIC X(13)  VALUE    '743151 009736'.
               05  FILLER   PIC X(13)  VALUE    '743162 008643'.
               05  FILLER   PIC X(13)  VALUE    '743167 009754'.
               05  FILLER   PIC X(13)  VALUE    '743168 009754'.
               05  FILLER   PIC X(13)  VALUE    '743170 009754'.
               05  FILLER   PIC X(13)  VALUE    '743171 009736'.
               05  FILLER   PIC X(13)  VALUE    '743172 008106'.
               05  FILLER   PIC X(13)  VALUE    '743173 009417'.
               05  FILLER   PIC X(13)  VALUE    '743174 008106'.
               05  FILLER   PIC X(13)  VALUE    '743175 008918'.
               05  FILLER   PIC X(13)  VALUE    '743177 009736'.
               05  FILLER   PIC X(13)  VALUE    '743180 009736'.
               05  FILLER   PIC X(13)  VALUE    '743181 009736'.
               05  FILLER   PIC X(13)  VALUE    '743184 009754'.
               05  FILLER   PIC X(13)  VALUE    '743185 009736'.
               05  FILLER   PIC X(13)  VALUE    '743187 009736'.
               05  FILLER   PIC X(13)  VALUE    '743188 009736'.
               05  FILLER   PIC X(13)  VALUE    '743189 009736'.
               05  FILLER   PIC X(13)  VALUE    '743190 009754'.
               05  FILLER   PIC X(13)  VALUE    '743191 009736'.
               05  FILLER   PIC X(13)  VALUE    '743193 009736'.
               05  FILLER   PIC X(13)  VALUE    '743194 009754'.
               05  FILLER   PIC X(13)  VALUE    '743196 009754'.
               05  FILLER   PIC X(13)  VALUE    '743197 008244'.
               05  FILLER   PIC X(13)  VALUE    '743198 009754'.
               05  FILLER   PIC X(13)  VALUE    '743199 009754'.
               05  FILLER   PIC X(13)  VALUE    '747000 009754'.
               05  FILLER   PIC X(13)  VALUE    '747001 009754'.
               05  FILLER   PIC X(13)  VALUE    '747004 009736'.
               05  FILLER   PIC X(13)  VALUE    '747005 009736'.
               05  FILLER   PIC X(13)  VALUE    '747006 008106'.
               05  FILLER   PIC X(13)  VALUE    '747008 009754'.
               05  FILLER   PIC X(13)  VALUE    '747009 009754'.
               05  FILLER   PIC X(13)  VALUE    '747010 009754'.
               05  FILLER   PIC X(13)  VALUE    '747011 009754'.
               05  FILLER   PIC X(13)  VALUE    '747012 009754'.
               05  FILLER   PIC X(13)  VALUE    '747014 009754'.
               05  FILLER   PIC X(13)  VALUE    '747015 008538'.
               05  FILLER   PIC X(13)  VALUE    '747017 009754'.
               05  FILLER   PIC X(13)  VALUE    '747018 009754'.
               05  FILLER   PIC X(13)  VALUE    '747019 009754'.
               05  FILLER   PIC X(13)  VALUE    '747020 008491'.
               05  FILLER   PIC X(13)  VALUE    '747021 008538'.
               05  FILLER   PIC X(13)  VALUE    '747022 009417'.
               05  FILLER   PIC X(13)  VALUE    '747023 008106'.
               05  FILLER   PIC X(13)  VALUE    '747024 008538'.
               05  FILLER   PIC X(13)  VALUE    '747026 009736'.
               05  FILLER   PIC X(13)  VALUE    '747028 008106'.
               05  FILLER   PIC X(13)  VALUE    '747029 008224'.
               05  FILLER   PIC X(13)  VALUE    '747031 009754'.
               05  FILLER   PIC X(13)  VALUE    '747034 008106'.
               05  FILLER   PIC X(13)  VALUE    '747036 009754'.
               05  FILLER   PIC X(13)  VALUE    '747038 008106'.
               05  FILLER   PIC X(13)  VALUE    '747040 009736'.
               05  FILLER   PIC X(13)  VALUE    '747041 009736'.
               05  FILLER   PIC X(13)  VALUE    '747042 009736'.
               05  FILLER   PIC X(13)  VALUE    '747044 009754'.
               05  FILLER   PIC X(13)  VALUE    '747045 008106'.
               05  FILLER   PIC X(13)  VALUE    '747047 008106'.
               05  FILLER   PIC X(13)  VALUE    '747049 009736'.
               05  FILLER   PIC X(13)  VALUE    '747050 009736'.
               05  FILLER   PIC X(13)  VALUE    '747051 009736'.
               05  FILLER   PIC X(13)  VALUE    '747052 009736'.
               05  FILLER   PIC X(13)  VALUE    '747054 009754'.
               05  FILLER   PIC X(13)  VALUE    '747055 009754'.
               05  FILLER   PIC X(13)  VALUE    '747056 008106'.
               05  FILLER   PIC X(13)  VALUE    '747057 009754'.
               05  FILLER   PIC X(13)  VALUE    '747058 009754'.
               05  FILLER   PIC X(13)  VALUE    '747059 008224'.
               05  FILLER   PIC X(13)  VALUE    '747060 008224'.
               05  FILLER   PIC X(13)  VALUE    '747061 009754'.
               05  FILLER   PIC X(13)  VALUE    '747062 009736'.
               05  FILLER   PIC X(13)  VALUE    '747063 009736'.
               05  FILLER   PIC X(13)  VALUE    '747065 008538'.
               05  FILLER   PIC X(13)  VALUE    '747066 009754'.
               05  FILLER   PIC X(13)  VALUE    '747067 009754'.
               05  FILLER   PIC X(13)  VALUE    '747068 009754'.
               05  FILLER   PIC X(13)  VALUE    '747070 009736'.
               05  FILLER   PIC X(13)  VALUE    '747072 009736'.
               05  FILLER   PIC X(13)  VALUE    '747075 009754'.
               05  FILLER   PIC X(13)  VALUE    '747078 008760'.
               05  FILLER   PIC X(13)  VALUE    '747079 008538'.
               05  FILLER   PIC X(13)  VALUE    '747080 008491'.
               05  FILLER   PIC X(13)  VALUE    '747081 009417'.
               05  FILLER   PIC X(13)  VALUE    '747082 009417'.
               05  FILLER   PIC X(13)  VALUE    '747084 009754'.
               05  FILLER   PIC X(13)  VALUE    '747085 009754'.
               05  FILLER   PIC X(13)  VALUE    '747086 009754'.
               05  FILLER   PIC X(13)  VALUE    '747088 009736'.
               05  FILLER   PIC X(13)  VALUE    '747090 009736'.
               05  FILLER   PIC X(13)  VALUE    '747091 009754'.
               05  FILLER   PIC X(13)  VALUE    '747252 008106'.
               05  FILLER   PIC X(13)  VALUE    '747405 009736'.
           02  PREV-ADJ-DATA2 REDEFINES PREV-ADJ-DATA.
               05  PREV-TAB OCCURS 11372 TIMES
                            ASCENDING KEY IS PREV-PROV
                            INDEXED BY PREV-IDX.
                   10  PREV-DATA-TAB.
                       15  PREV-PROV        PIC X(06).
                       15  FILLER           PIC X(01).
                       15  PREV-WI          PIC 9(02)V9(04).
