000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.           PPDRV147.
000300*AUTHOR.             DDS TEAM.
000400*                        CMS.
000500*REMARKS.  - CALLS THE PPCAL__ MODULES
000600*          - FINDS  WAGE-INDEX RECORD FOR
000700*            GIVEN BILL TO BE PASSED TO PPCAL__ MODULES.
000800 DATE-COMPILED.
000900****************************************************************
001000*   THE RESPONSIBILITY FOR INSTALLING, MODIFYING, TESTING,     *
001100*   MAINTAINING, AND VERIFYING THE ACCURACY OF THIS PROGRAM    *
001200*   IS THAT OF THE USER.                                       *
001300*                  *  *  *  *  *  *  *  *                      *
001400*   ONCE GROUPED THE PROSPECTIVE PAYMENT SUBROUTINE IS CALLED  *
001500*   TO CALCULATE THE TOTAL PAYMENT PRIOR TO DEDUCTIBLE,        *
001600*   CO-INSURANCE, AND CASES WHERE MEDICARE IS SECONDARY PAYOR. *
001700*   THE PROGRAM WILL:                                          *
001800*       1. FIND THE WAGE INDEX  TO CALCULATE PPS.              *
001900*       2. EDIT THE BILL INFORMATION PASSED TO IT.             *
002000*       3. PASS BACK RETURN CODES.                             *
002100*       4. CALCULATE WHEN APPLICABLE                           *
002200*          A. THE COVERED DAYS UTILIZATION.                    *
002300*          B. THE HOSPITAL SPECIFIC PART OF PAYMENT.           *
002400*          C. THE FEDERAL  SPECIFIC PART OF PAYMENT            *
002500*          D. THE OUTLIER PORTION (COST).                      *
002600*          E. THE NUMBER OF OUTLIER DAYS.                      *
002700*          F. TOTAL PAYMENT (B + C + D  ABOVE).                *
002800*          G. DISPROPORTIONATE SHARE ADJUSTMENT                *
002900*          H. INDIRECT TEACH ADJUSTMENT.                       *
003000*                  *  *  *  *  *  *  *  *                      *
003100*   THIS SUBROUTINE CALCULATES THE PROVIDER SPECIFIC           *
003200*   ELEMENTS ON A PROVIDER BREAK, THEREFORE IT WILL RUN FASTER *
003300*   WHEN BILLS ARE BATCHED BY PROVIDER.                        *
003400*                  *  *  *  *  *  *  *  *                      *
003500*   CHANGE LOG.                                                *
003600*   PRICER 2                                                   *
003700*    07/07/83 - COST OF LIVING ADJUSTMENTS TO NON-LABOR COSTS  *
003800*               FOR ALASKA AND HAWAII ADDED.                   *
003900*    07/07/83 - PERDIEM PAYMENT UP TO AVERAGE LENGTH OF STAY   *
004000*               FOR TRANSFERRING HOSPITAL ADDED.               *
004100*    07/10/83 - REVIEW CODES TO DETERMINE OPTIONS FOR          *
004200*               CALCULATING PROSPECTIVE PAYMENT ADDED.         *
004300*    07/18/83 - COST OUTLIER CALCULATIONS ADDED.               *
004400*    07/18/83 - INDIRECT TEACH ADJUSTMENT COMPONENT OF THE     *
004500*               PAYMENT CALCULATION  ADDED.                    *
004600*   PRICER 3                                                   *
004700*    08/11/83 - CHANGE MSAX-TABLE FROM BINARY TO DISPLAY TO    *
004800*               CORRECT BINARY SEARCH PROBLEM.                 *
004900*    08/11/83 - CHANCE INDIRECT TEACH ADJUSTMENT CALCULATION*
005000*               TO EXCLUDE HOSPITAL SPECIFIC PART.             *
005100*    08/11/83 - HARD CODED FED PARAMETERS NOW APPENDED TO RATE *
005200*               FILE, AND LOADED WITH OTHER DRIVING FILES.     *
005300*    08/12/83 - RETURN CODE 60 AFFECTING COST OUTLIER CALC     *
005400*    08/18/83 - REMOVE THE FORCED REVIEW-CODE FOR A DISCHARGE  *
005500*               STATUS 02. PERDIEM CALC NOW CONTROLLED BY      *
005600*               A REVIEW CODE OF 03 ONLY.                      *
005700*    08/18/83 - PERDIEM PAYMENT NOW POSSIBLE FOR SAME DAY      *
005800*               TRANSFER AND 0 DAYS COVERAGE.                  *
005900*    08/18/83 - CALCULATE UTILIZATION BASED ON COVERED DAYS,   *
006000*               RETURNING REGULAR COVERED DAYS USED AND        *
006100*               ELECTED LIFETIME RESERVE DAYS USED.            *
006200*    08/18/83 - LINKAGE CHANGES:                               *
006300*                A) REMOVE DISCHARGE STATUS                    *
006400*                B) ADD COVERED DAYS                           *
006500*                C) ADD LIFETIME RESERVE DAYS                  *
006600*                D) CHANGE COVERED DAYS TO LOS                 *
006700*                E) RETURN REGULAR COVERED DAYS USED           *
006800*                F) RETURN LIFETIME RESERVE DAYS USED          *
006900*   PRICER 3.1                                                 *
007000*    09/10/83 - REFERRAL CENTER CONSIDERATIONS ADDED           *
007100*               USE RURAL WAGE INDEX AND URBAN LABOR AND       *
007200*               NON-LABOR RATES.                               *
007300*    10/04/83 - INDIAN HEALTH SERVICE SPECIAL WAGE INDEXES     *
007400*               FOR ALASKA AND THE LOWER 48 STATES.            *
007500*                  *  *  *  *  *  *  *  *                      *
007600*    01/03/84 - REVISIONS TO PPS REGULATIONS IN THE FEDERAL    *
007700*               REGISTER DATED 01/03/84 TO BECOME EFFECTIVE    *
007800*               02/03/84.                                      *
007900*    01/12/84 - PROVISIONS TO HANDLE SECOND SET OF RATES.      *
008000*               RATES NOW BILL-DATE SPECIFIC.                  *
008100*             - PRICER VERSION CODE ADDED TO RETURNED ITEMS.   *
008200*    01/13/84 - TRANSFER FOR DRG'S 385 AND 456 GET FULL PPS    *
008300*               RATE.                                          *
008400*             - OUTLIER PAYMENTS FOR DISCHARGES AFTER 02/03/84 *
008500*               NEW CALCULATION.                               *
008600*    01/24/84 - CHANGE TO HSP CALCULATION, UPDATING FACTOR     *
008700*               NOW ACTIVE AND APPLIED BY PRICER. THIS CHANGE  *
008800*               REQUIRES THE FI TO REPLACE THE TARGET AMOUNT   *
008900*               IN THE PROV-FILE WITH THE CMI-ADJ-CPD. NEW CALC*
009000*               IS  (COST-PER-DISCHARGE / CMI).                *
009100*             - FOR A NEW FACILITY WHERE CMI-ADJ-CPD CANNOT BE *
009200*               CALCULATED CMI-ADJ-CPD = 00000.00. THIS WILL   *
009300*               RESULT IN A PRICE THAT IS 100% FEDERAL (FSP).  *
009400*    01/25/84 - MULTIPLE WAGE INDEXES DRIVEN BY EFFECTIVE DATE *
009500*               NOW HANDLED. AS NEW WI BECOMES EFFECTIVE, THE  *
009600*               DATE AND NEW WI MUST BE ADDED TO THE MSAX-FILE.*
009700*               MSAX-RECORD NOW 100 BYTES.                     *
009800*   PRICER 3.2                                                 *
009900*    02/10/84 - NEW FILE (PRUP) OF SPECIAL PROVIDER HSP        *
010000*               UPDATING FACTORS DRIVEN BY EFFECTIVE DATE      *
010100*               ADDED. ONLY SPECIAL UPDATING FACTORS FOR       *
010200*               PROVIDERS ALREADY ON THE PROV-FILE WILL BE     *
010300*               LOADED AND USED.                               *
010400*   PRICER 4.0                                                 *
010500*    02/28/84 - CHANGE TO THE FSP-AMOUNT OF THE PRICE TO       *
010600*               INCLUDE NATIONAL AND REGIONAL VARIABLES AND    *
010700*               TO USE THE APPROPRIATE YEAR BLEND PERCENTAGES  *
010800*    05/24/84 - MSAX-FILE FORMAT. THE FILE WAS CHANGES FROM    *
010900*               A HORIZONTAL TO A VERTICAL FORMAT WITH ONLY    *
011000*               ONE WAGE-INDEX PER RECORD, NOW 80 CHARACTERS.  *
011100*               SPECIAL WAGE INDEXES FOR ALASKAN AND LOWER48   *
011200*               INDIAN HOSPITALS NOW IN THIS FILE.             *
011300*               THIS ALLOWS A VARIABLE NUMBER OF WAGE-INDEXES  *
011400*               PER MSA. THE SORT SEQUENCE MUST BE MAINTAINED  *
011500*               AS STATE/MSA, EFFECTIVE-DATE ASCENDING.        *
011600*    05/24/84 - DRG-TABLE NOW OCCURS 3 TIMES. NO CHANGES TO    *
011700*               THE DRGX-FILE FORMAT AT THIS TIME.             *
011800*    06/25/84 - MODIFY THE OUTLIER PORTION OF THE PRICE FOR    *
011900*               NEW HOSPITALS THAT USE 100% OF THE FEDERAL     *
012000*               RATES. OUTLIER NOW 100% NOT FSP-PCT FOR THESE  *
012100*               NEW HOSPITALS ONLY.                            *
012200*    07/12/84 - LOS EDIT RELAXED. LENGTH OF STAY MAY NOW BE    *
012300*               LESS THAN COVERED DAYS. THE UTILIZATIONS       *
012400*               CALCULATED BY PRICER ARE FOR PRICING AND       *
012500*               INFORMATION PURPOSES ONLY. IT IS STILL THE     *
012600*               RESPONSIBILITY OF THE INTERMEDIARY TO DETERMINE*
012700*               ACTUAL UTILIZATIONS EXTERNAL TO THE PRICER.    *
012800*    07/26/84 - REDESIGNATED-RURAL HOSPITALS RECEIVE A BLEND   *
012900*               OF RURAL AND URBAN LABOR AND NLABOR RATES. THE *
013000*               BLEND IS 2/3 OF THE DIFFERENCE ADDED TO THE    *
013100*               RURAL RATES FOR THE FIRST TRANSITION YEAR, AND *
013200*               1/3 THE DIFFERENCE FOR THE SECOND YEAR.        *
013300*    07/26/84 - SOLE COMMUNITY PROVIDERS WILL NOW STAY ON THE  *
013400*               FIRST YEAR OF THE BLEND.                       *
013500*                    75% HSP  - - HOSPITAL SPECIFIC PORTION    *
013600*                    25% FSP  - - FEDERAL  SPECIFIC PORTION    *
013700*                   100% REG  - - REGIONAL RATES               *
013800*                   000% NAT  - - NATIONAL RATES               *
013900*    07/18/84 - PRUP-FILE ELIMINATED. SPECIAL UPDATING         *
014000*               FACTORS (PRUP) NOW ADDED TO THE PROV FILE.     *
014100*    07/18/84 - MAJOR CHANGES TO THE PROVIDER FILE RECORD      *
014200*               LAYOUT. THE PROV FILE IS NOW A VERTICAL FILE   *
014300*               WITH PROVIDER-NO, PROV-EFFECTIVE-DATE SORT     *
014400*               KEYS. WHENEVER A CHANGE TO THE PROV FILE IS    *
014500*               NECESSARY, DUPLICATE THE LAST PROV RECORD,     *
014600*               MAKE THE NECESSARY CHANGES, AND CHANGE THE     *
014700*               EFFECTIVE DATE FOR THE NEW PROV RECORD. IT WILL*
014800*               THEN BE NECESSARY TO CARRY ALL PROV RECORDS    *
014900*               FOR THAT HOSPITAL ON THE FILE.                 *
015000*    08/29/84 - PRICER NOW HAS 4 INTERFACE OPTIONS.            *
015100*                 (1) THE STANDARD INTERFACE WITH NO INVOKING  *
015200*                     PROGRAM CHANGES NECESSARY.               *
015300*                 (2) THE 'M' OPTION REQUIRES INVOKING PROGRAM *
015400*                     CHANGES TO THE 'CALL' STATEMENT. THIS    *
015500*                     OPTION PASSES BACK ADDITIONAL VARIABLES  *
015600*                     USED IN PRICING THE BILL.                *
015700*                 (3) THE 'P' OPTION REQUIRES INVOKING PROGRAM *
015800*                     CHANGES TO THE 'CALL' STATEMENT. THIS    *
015900*                     OPTION PASSES BACK ADDITIONAL VARIABLES  *
016000*                     USED IN PRICING THE BILL. THE PROVIDER   *
016100*                     RECORD USED FOR THIS BILL MUST BE PASSES *
016200*                     TO PRICER ALONG WITH THE BILL INFO.      *
016300*                 (4) THE 'A' OPTION REQUIRES INVOKING PROGRAM *
016400*                     CHANGES TO THE 'CALL' STATEMENT. THIS    *
016500*                     OPTION PASSES BACK ADDITIONAL VARIABLES  *
016600*                     USED IN PRICING THE BILL. THE PROVIDER   *
016700*                     RECORD USED FOR THIS BILL MUST BE PASSES *
016800*                     TO PRICER ALONG WITH THE BILL INFO.      *
016900*                     THE FIRST TIME PRICER IS CALLED, ALL     *
017000*                     TABLES MUST BE PASSED BY THE INVOKING    *
017100*                     PROGRAM. THIS IS THE ONLINE COMPATIBLE   *
017200*                     INTERFACE THAT ELIMINATES THE NEED FOR   *
017300*                     PRICER TO DO I/O.                        *
017400*                NOTE: SEE THE FIRST 5 PROCEDURE DIVISION      *
017500*                     PARAGRAPHS FOR THE ACTUAL 'CALL'         *
017600*                     STATEMENT  NEEDED FOR EACH OPTION.       *
017700*    09/06/84 - TRANSFER BILLS WITH DATE OF DISCHARGE AFTER    *
017800*               09/30/84 NOW POTENTIALLY ELIGEABLE AS A COST   *
017900*               OUTLIER. TWO NEW REVIEW CODES TO SUPPORT       *
018000*               TRANSFERS ADDED.                               *
018100*                     REVIEW CODE 05 = PAY TRANSFER WITH       *
018200*                                      COST OUTLIER APPROVED.  *
018300*                     REVIEW CODE 06 = PAY TRANSFER WITH       *
018400*                                      COST OUTLIER DENIED.    *
018500*   PRICER 4.1                                                 *
018600*    11/20/84 - NEW PROVIDER TYPE CODE ADDED TO THE PROV       *
018700*               RECORD. PROVIDER-TYPE '11' NOW SOLE-COMMUNITY  *
018800*               AND REFERRAL CENTER.                           *
018900*    11/20/84 - PPS BLEND YEAR FIELD 1 THRU 4 ADDED TO THE     *
019000*               PROV RECORD. ONLY CODE THIS FIELD IF YOU WANT  *
019100*               TO FORCE THE PPS BLEND YEAR. IT IS CURRENTLY   *
019200*               NEEDED FOR 52-53 WEEK PROVIDERS WHOSE FYE      *
019300*               ALWAYS ENDS ON THE SAME DAY OF THE WEEK.       *
019400*   PRICER 4.3                                                 *
019500*    10/03/85 - CHANGE TO THE BLEND-TABLE TO SUPPRESS THE      *
019600*               THIRD PPS YEAR BLEND PERCENTAGES FROM GOING    *
019700*               INTO EFFECT ON 10/01/85. FOR BILLS WITH        *
019800*               DISCHARGE DATES ON OR AFTER 10/01/85, ALL      *
019900*               PRICING VARIABLES FROM FED FY-1985 REMAIN IN   *
020000*               EFFECT UNTIL FURTHER NOTICE.                   *
020100*    01/14/86 - FOR NEW PROVIDERS WITH 100% FEDERAL SPECIFIC   *
020200*               BLEND, CHANGE INDIRECT-TEACH CALCULATION       *
020300*               TO CORRECT AN ERROR.                           *
020400*   PRICER 5.0                                                 *
020500*    07/25/85 - EXPAND THE DRG-TABLE FROM 468 DRGS TO 471.     *
020600*    07/25/85 - EXPAND DRG-WT FIELD IN DRG-TABLE TO ACCOMODATE *
020700*               DRG RELATIVE WEIGHTS > 9.9999. NEW PICTURE IS  *
020800*               9(02)V9(04) COMP SYNC.                         *
020900*    07/25/85 - REVIEW CODE 00 CHANGED TO NOW ATTEMPT DAY AND  *
021000*               COST OUTLIER CALCULATIONS. A PPS-RTC RETURN    *
021100*               CODE OF 01 (DAY OUTLIER) OR 02 (COST OUTLIER)  *
021200*               SHOULD NOW BE SENT TO THE PRO FOR POST REVIEW. *
021300*   PRICER 5.1                                                 *
021400*    03/27/86 - CHANGE ALL EFFECTIVE DATES FROM OCT. 1 1985 TO *
021500*               MAY. 1,1986. IMPLEMENTATION OF FY86 REGULATION *
021600*               DELAYED UNTIL MAY. 1, 1986 DUE TO FREEZE.      *
021700*    04/03/86 - HSP, FSP, REG, NAT BLEND CHANGES;              *
021800*    ALL AREAS OTHER THAN OREGON                               *
021900*     PPS-BLEND-YR  BLEND-PERIOD  HSP%       FED%              *
022000*          1         1-12 MONTHS   75         25               *
022100*          2        13-31 MONTHS   50         50               *
022200*          3        32-36 MONTHS   45         55               *
022300*          4        37-48 MONTHS   25         75               *
022400*          5        49->  MONTHS    0        100               *
022500*                                                              *
022600*         FROM   -   TO           REG%      NAT%               *
022700*       10/01/83 - 09/30/84       100         0                *
022800*       10/01/84 - 09/30/86        75        25                *
022900*       10/01/86 - 09/30/87        50        50                *
023000*       10/01/87 - >                0       100                *
023100*    OREGON ONLY:                                              *
023200*     PPS-BLEND-YR  BLEND PERIOD  HSP%       FED%              *
023300*          1         1-12 MONTHS   75         25               *
023400*          2        13-31 MONTHS   50         50               *
023500*          3        32-36 MONTHS   25         75               *
023600*          4        37-48 MONTHS    0        100               *
023700*          5        49->  MONTHS    0        100               *
023800*                                                              *
023900*         FROM   -   TO           REG%      NAT%               *
024000*       10/01/83 - 09/30/84       100         0                *
024100*       10/01/84 - 04/30/86        75        25                *
024200*       05/01/86 - 09/30/86        50        50                *
024300*       10/01/86 - >                0       100                *
024400*    04/03/86 - A 1/2 PERCENT INCREASE TO THE HSP ADDED FOR    *
024500*               BILLS IN BLEND PERIOD 3 (HSP%=.45) AND BEYOND. *
024600*               THE 1/2 PERCENT INCREASE TO THE FSP HAS BEEN   *
024700*               ADDED TO THE RATES. THE 1/2 PERCENT INCREASE   *
024800*               TO THE HSP HAS BEEN ADDED TO THE UPDATE FACTOR.*
024900*    04/03/86 - NEW CALCULATION FOR INDIRECT TEACH             *
025000*               ADJUSTMENT.                                    *
025100*                 10/01/83 - 04/31/86                          *
025200*                         ITA=(INTERN-BED-RATIO * 1.1590)      *
025300*                 05/01/86 - 09/30/88                          *
025400*                         ITA= 2.0 * ((1 + INTERN-BED-RATIO)   *
025500*                              ** .405  - 1)                   *
025600*                 10/01/88 - -->                               *
025700*                         ITA= 1.5 * ((1 + INTERN-BED-RATIO)   *
025800*                              ** .5795 - 1)                   *
025900*    04/03/86 - INTERFACE CHANGE. THE PPS-DATA-TO-MAIN FIELD   *
026000*               IN THE LINKAGE SECTION HAS BEEN EXPANDED BY 8  *
026100*               BYTES TO ACCOMODATE THE DISPROPORTIONATE SHARE *
026200*               ADJUSTMENT NOW CALCULATED BY PPSSUB AND PASSED *
026300*               BACK TO THE CALLING PROGRAM.                   *
026400*    04/03/86 - PROVIDER SPECIFIC FILE CHANGES. TWO NEW FIELDS *
026500*               HAVE BEEN ADDED TO THIS RECORD, BED SIZE AND   *
026600*               DISPROPORTIONATE SHARE PERCENTAGE. THE DSP % IS*
026700*               COMPUTED BY THE INTERNEDIARY AND ADDED TO THE  *
026800*               RECORD. FOR DISPROPORTIONATE SHARE HOSPITALS   *
026900*               A NEW PROVIDER SPECIFIC RECORD WITH THE DSP %  *
027000*               FIELD ADDED AND AN EFFECTIVE DATE OF '860501'  *
027100*               IS REQUIRED.                                   *
027200*    04/16/86 - THE DISPROPORTIONATE SHARE AMOUNT HAS BEEN     *
027300*               ADDED TO THE TOTAL PRICE. THE CALC NOW IS:     *
027400*                   PPS-TOTAL-PAYMENT = PPS-HSP-PART +         *
027500*                                       PPS-FSP-PART +         *
027600*                                       PPS-OUTLIER-PART +     *
027700*                                       PPS-DSH-ADJ.           *
027800*   PRICER 6.0                                                 *
027900*    05/22/86 - THE PROVIDER NUMBER FIELDS IN BOTH PPSMAIN     *
028000*               AND PPSSUB HAVE BEEN CHANGED FROM NUMERIC TO   *
028100*               ALPHANUMERIC.                                  *
028200*    07/07/86 - FIELD PPS-DRG-WT IN THE LINKAGE SECTION        *
028300*               EXPANDED BY 1 BYTE - PICTURE NOW 9(02)V9(04).  *
028400*    07/07/86 - FIELD PROV-RECORD-FROM-MAIN IN THE LINKAGE     *
028500*               SECTION EXPADED BY 31 BYTES - PIC NOW X(80).   *
028600*    07/07/86 - FY-REC NO LONGER IN THE RATE FILE. IT IS NOW   *
028700*               HARD CODED IN THE WORKING STORAGE SECTION.     *
028800*    07/10/86 - TWO NEW DRG'S (472 AND 473) ADDED TO THE DRGX  *
028900*               TABLE.*                                        *
029000*    07/14/86 - NEW COST OUTLIER CALCULATION. COST OUTLIER NOW *
029100*               STANDARDIZED FOR INDIRECT TEACH AND            *
029200*               DISPROPORTIONATE SHARE ADJUSTMENTS.            *
029300*    09/04/86 - NEW RATES, UPDATE-FACTORS, OUTLIER CRITERIA    *
029400*               DRG WEIGHTS, AND NEW WAGE INDEXES ADDED FOR    *
029500*               FY87. USERS OF PRICER OPTION 'A' BE ADVISED    *
029600*               THAT THE LINKAGE SECTION FOR THESE TABLES HAS  *
029700*               BEEN EXPANDED.                                 *
029800*   PRICER 6.1                                                 *
029900*    11/15/86 - P-BED-SIZE VARIABLE ON THE PROVIDER SPECIFIC   *
030000*               FILE MOVED TO POS 50-54 TO CONFORM TO          *
030100*               DOCUMENTATION. THIS VARIABLE IS NOT CURRENTLY  *
030200*               USED BY PRICER.                                *
030300*   PRICER 6.3                                                 *
030400*    11/15/86 - CHANGES TO SUPPORT PUERTO RICO UNDER PPS AS OF *
030500*               10/01/87 INCORPORATED. INCLUDING WAGE-INDEXES  *
030600*               AND SPECIAL RATES FOR PUERTO RICO.             *
030700*             *********************************                *
030800*                     *** PPCAL880  ***                        *
030900*   PRICER 7.0                                                 *
031000*    08/20/87 - NEW RATES, UPDATE-FACTORS, OUTLIER CRITERIA    *
031100*               DRG WEIGHTS, AND NEW WAGE INDEXES ADDED FOR    *
031200*               FY88. USERS OF PRICER OPTION 'A' BE ADVISED    *
031300*               THAT THE LINKAGE SECTION FOR THESE TABLES HAS  *
031400*               BEEN EXPANDED.                                 *
031500*    09/18/87 - RATE FILE ELIMINATED. RATES, UPDATE FACTORS    *
031600*               AND FISCAL-YEAR VARIABLES NOW HARD CODED IN    *
031700*               WORKING-STORAGE.                               *
031800*    09/23/87 - RATES CHANGES TO REFLECT 0% RATE-OF-INCREASE,  *
031900*               HSP-NAT BLEND FROZEN AT FY87 PERCENTS,         *
032000*               REG-NAT BLEND FROZEN AT FY87 PERCENTS,         *
032100*   PRICER 7.1                                                 *
032200*    11/24/87 - NEW RATES, UPDATE-FACTORS, EFFECTIVE 11/21/87. *
032300*             - ROLL THE HSP BLEND RATE FORWARD TO 100%        *
032400*               FEDERAL 51 DAYS AFTER THE HOSPITAL FY88 COST   *
032500*               REPORTING YEAR BEGINS.                         *
032600*             - REG-NAT BLEND IS NOW 100 NATIONAL FOR DISCHARGES
032700*               ON OR AFTER 11/21/87.                          *
032800*   PRICER 7.2                                                 *
032900*    01/13/88 - LARGE URBAN INDICATOR ADDED TO THE MSAX FILE.  *
033000*    02/08/88 - NEW RATE TABLE STARTED FOR LARGE URBAN, OTHER  *
033100*    10/13/88 - URBAN AND RURAL RATES EFFECTIVE ON OR AFTER    *
033200*               04/01/88. REGIONAL FLOOR OF 85% NATIONAL AND   *
033300*               15% REGION WHEN REG RATE > NAT RATE.           *
033400*             - EFFECTIVE 04/01/88 BURN DRG OUTLIERS REIMBURSED*
033500*               AT 90%.                                        *
033600*             *********************************                *
033700*                     *** PPCAL890  ***                        *
033800*   PRICER 8.0                                                 *
033900*    09/23/88 - NEW RATES FOR LURBAN, OURBAN, RURAL AREAS ADDED*
034000*    09/23/88 - NEW UPDATE FACTORS LURBAN, OURBAN, RURAL       *
034100*    09/23/88 - INDIRECT TEACH CALC FOR 10/01/88               *
034200*               ITA = 1.89 * ((1 + INTERN-BED-RATIO)           *
034300*                     ** .405 -1)                              *
034400*    09/23/88 - DRG TABLES NOW MEMORY RESIDENT. LINKAGE ADDRESS*
034500*               STILL NEEDED. CHECK INTERFACES.                *
034600*    09/24/88 - THE PROVIDER SPECIFIC FILE (PROV) RECORDS HAVE *
034700*               BEEN EXPANDED FROM 80 TO 160 CHARACTERS.       *
034800*               ALL PROV RECORDS THAT USE PRICER V8.0 MUST     *
034900*               BE EXPANDED TO 160 CHARACTERS.                 *
035000*               CHECK LINKAGE INTERFACE VARIABLES.             *
035100*    09/25/88 - HOSPITAL SPECIFIC COST TO CHARGE RATIO (P-CCR) *
035200*               ADDED TO THE PROVIDER SPECIFIC RECORD IN       *
035300*               POS 59-63. PIC 9(01)V9(03). THE CCR MUST BE    *
035400*               ADDED TO THE PROV FILE FOR DISCHARGES ON OR    *
035500*               AFTER 11/01/88.                                *
035600*    09/25/88 - NEW OUTLIER POLICY IMPLEMENTED FOR DISCHARGES  *
035700*               ON OR AFTER 11/01/88. OUTLIER PAYMENTS WILL BE *
035800*               THE GREATER OF DAY OUTLIERS @60% OR COST       *
035900*               OUTLIERS @75% OR BURN DRG OUTLIERS @90%.       *
036000*    09/26/88 - NEW WAGE INDEX BASED ON A BLEND OF 1982 AND    *
036100*               1984 HCFA WAGE SURVEY DATA HAS BEEN ADDED.     *
036200*               A NEW MSA ADDED FOR DECATUR ALABAMA '2030'.    *
036300*    09/28/88 - EFFECTIVE FOR DISCHARGES ON OR AFTER 10/01/88  *
036400*               THE INDIRECT MEDICAL EDUCATION PAYMENT WILL BE *
036500*               INCLUDED IN THE TOTAL PRICE.                   *
036600*             *********************************                *
036700*                     *** PPCAL900  ***                        *
036800*   PRICER 9.0                                                 *
036900*    08/30/89 - FY90 DRG TABLE ADDED.                          *
037000*    08/30/89 - NEW RATES FOR LURBAN, OURBAN, RURAL AREAS ADDED*
037100*    08/31/89 - NEW UPDATE FACTORS LURBAN, OURBAN, RURAL       *
037200*    08/31/89 - NEW REVIEW CODE ADDED. REVIEW CODE 07 WILL PAY *
037300*               STANDARD PAYMENT, DENY COST OUTLIERS, AND PAY  *
037400*               DAY OUTLIERS WHEN APPLICABLE.                  *
037500*    08/31/89 - NEW DAY AND COST OUTLIER TRIM POINTS FOR FY90. *
037600*               DAYS=28, COSTS=34,000.                         *
037700*    08/31/89 - BURN OUTLIERS - DAY @ 60% COST @ 90%.        . *
037800*               EFFECTIVE 10/01/89.                            *
037900*   PRICER 9.1                                                 *
038000*    12/13/89 - NEW RATES FOR LURBAN, OURBAN, RURAL AREAS ADDED*
038100*             - NEW UPDATE FACTORS LURBAN, OURBAN, RURAL       *
038200*               THESE RATES AND UPDATES REQUIRED FOR DISCHARGES*
038300*               ON OR AFTER 01/01/90.                          *
038400*   PRICER 9.2                                                 *
038500*    03/15/90 - OBRA 89 CHANGES EFFECTIVE 04/01/90.            *
038600*             - NEW RATES FOR LURBAN, OURBAN, RURAL AREAS ADDED*
038700*             - REBASED SOLE COMMUNITY HOSPITALS AND MEDICARE  *
038800*               DEPENDENT RURAL HOSPITALS NOW HAVE NEW METHOD  *
038900*               OF REIMBURSEMENT BASED ON FEDERAL RATE.        *
039000*             - NEW PROVIDER TYPE CODES ON PROVIDER SPECIFIC   *
039100*               14 = MDH-REBASED-FY90                          *
039200*               15 = MDH-RRC-REBASED-FY90                      *
039300*               16 = SCH-REBASED-FY90                          *
039400*               17 = SCH-RRC-REBASED-FY90                      *
039500*    06/22/90 - CHG TO SCH + MDH CALC TO DRG WEIGHT IT.        *
039600*                  *  *  *  *  *  *  *  *                      *
039700*             *********************************                *
039800*                     *** PPCAL910  ***                        *
039900*   PRICER 10.0                                                *
040000*    09/11/90 - CHANGES TO PPS EFFECTIVE 10/01/90              *
040100*             - NEW DRG RELATIVE WEIGHTS FOR FY91 ADDED.       *
040200*             - NEW RATES                                      *
040300*             - FY90 WAGE INDEX REMAINS IN EFFECT TEMPORARILY  *
040400*               MSA 9360 ADDED FOR YUMA ARIZONA.               *
040500*             - LABOR/NON-LABOR SPLIT CHANGED                  *
040600*             - NOW:   .7140 & .2860                           *
040700*             - REGIONAL FLOOR PROVISION EXTENDED.             *
040800*             - NEW DRGS 478 - 490 ADDED                       *
040900*             - NEW UPDATE AND OUTLIER FACTORS FOR SCH & MDH   *
041000*   PRICER 10.1                                                *
041100*    10/21/90 - CHANGES TO PPS EFFECTIVE 10/21/90              *
041200*             - NEW RATES                                      *
041300*   PRICER 10.2                                                *
041400*    01/01/91 - CHANGES TO PPS EFFECTIVE 01/01/91              *
041500*             - NEW RATES                                      *
041600*             - NEW WAGE INDEXES                               *
041700*             - NEW UPDATE AND OUTLIER FACTORS FOR SCH & MDH   *
041800*                                                              *
041900*             *********************************                *
042000*                     *** PPCAL920  ***                        *
042100*   10/01/91  - ADDED GROUPER VERSION 9.0                      *
042200*             - CAPITAL FOR ADD-ON PAYMENT                     *
042300*             - CALCULATES OPERATING AND CAPITAL DSH           *
042400*             - NEW RECORD LAYOUT FOR PROVIDER SPECIFIC FILE   *
042500*             - NEW RECORD LAYOUT FOR WAGE INDEX FILE          *
042600*             - NEW CAPITAL VARIABLES                          *
042700*             - NEW RATES                                      *
042800*             - NEW WAGE INDEXES                               *
042900*             - NEW RTC 65 AND 98                              *
043000*             *********************************                *
043100*                     *** PPCAL891  ***                        *
043200*                     *** PPCAL901  ***                        *
043300*                     *** PPCAL911  ***                        *
043400*                     *** PPCAL921  ***                        *
043500*                     *** PPCAL930  ***                        *
043600*   10/01/92  - ADDED GROUPER VERSION 10.0                     *
043700*             - ENLARGED CHARGES CLAIMED FIELD ON BILLED       *
043800*                 INPUT RECORD TO PROCESS MILLION DOLLAR INPUT *
043900*             - ENLARGED H-OPER-DSH TO 9(01)V9(04)             *
044000*             - ENLARGED H-CAPI-DSH TO 9(01)V9(04)             *
044100*             - CORRECTED RTC FROM 00 TO 05 ON OUTLIER PAYMENT *
044200*                INDICATING THAT CLAIM WAS PAID FOR OPER/CAPI  *
044300*                PAY-PERDIEM-DAYS OR PAY-XFER-WITH-COST        *
044400*             - VALID CENSUS-DIV IS 1 THRU 9  OR PUERTO RICO   *
044500*        - NEW FIELDS ADDED TO PPSOUT FILE                     *
044600*             - CAPI2-PAY-CODE = TYPE OF CAPITAL PAYMENT       *
044700*                METHODOLOGY, A,B,OR C USED TO PAY THIS BILL   *
044800*             - CAPI2-B-FSP = FEDERAL AMT THAT WOULD BE PAID   *
044900*                IF PROV WAS B-HOLD-HARMLESS 100% FED RATE     *
045000*             - CAPI2-B-OUTLIER = OUTLIER AMT THAT WOULD BE    *
045100*                PAID IF PROV WAS B-HOLD-HARMLESS 100% FED RATE*
045200*             - REVIEW CODES DELETE - 01, 02, 04, 05.          *
045300*             - RETURN CODES DELETE - 04, 59, 60, 63, 64.      *
045400*             - RETURN CODE ADDED - 66.                        *
045500*   PPCAL901  - LIVER TRANSPLANT - DRG 480 - PAYMENT           *
045600*   PPCAL930  - CHANGED      LOGIC;     10/05/92               *
045700*               083450  IF HOLD-FY-BEGIN-DATE < 921001         *
045800*               083460     MOVE .10 TO H-CAPI-PAYCDE-PCT1      *
045900*               083470     MOVE .90 TO H-CAPI-PAYCDE-PCT2      *
046000*               083480  ELSE                                   *
046100*   PPCAL930  - CHANGED      LOGIC;    11/18/92                *
046200*               086050  IF B-LOS = 0                           *
046300*               086060     IF B-REVIEW-CODE NOT = 03 AND       *
046400*               086070                      NOT = 06           *
046500*               086100        DELETE THIS LINE                 *
046600*               086200        DELETE THIS LINE                 *
046700*   PPCAL930  - CHANGED      LOGIC;    05/11/93                *
046800*               113650  COMPUTE H-CAPI2-B-FSP-PART             *
046900*               113660    = H-CAPI-FSP-PART * H-DSCHG-FRCTN.   *
047000*               136100        DELETE THIS LINE                 *
047100*               136200        DELETE THIS LINE                 *
047200*               136300        DELETE THIS LINE                 *
047300*               136400        DELETE THIS LINE                 *
047400*               136500        DELETE THIS LINE                 *
047500*               136600        DELETE THIS LINE                 *
047600*   PPCAL930  - CHANGED      LOGIC;    05/20/93                *
047700*               171010  IF W-SIZE = 'R'                        *
047800*               171020     IF (PROVIDER-TYPE = '07')           *
047900*               171030      AND H-WK-OPER-DSH > .2999          *
048000*               171040      AND P-BED-SIZE > 100               *
048100*               171050      AND P-BED-SIZE < 500               *
048200*               171060    COMPUTE H-OPER-DSH ROUNDED =         *
048300*               171070       (H-WK-OPER-DSH - .3) * .6 + .04.  *
048400*               CHANGED LOGIC;                                 *
048500*               171200    IF (P-PROVIDER-TYPE = '11' OR '17')  *
048600*   PRICER 94.0                                                *
048700*   PPCAL922  - CHANGED                                        *
048800*               CHGED DSH CALC FOR PROVIDER-TYPE 07            *
048900*   PPCAL931  - CHANGED                                        *
049000*               CHGED DSH CALC FOR PROVIDER-TYPE 07            *
049100*   PPCAL940  - ADDED DRG'S 493 AND 494                        *
049200*             - ADDED PROVIDER-TYPE 19 AND 20 IN DSH CALC      *
049300*             - CHGED CAPITAL HSP CALC TO INCLUDE .9784 IN CALC*
049400*             - OPERATING-HSP NO LONGER PAID                   *
049500*                   ONLY ADDITIONAL-HSP IS PAID                *
049600*             - CHGED ADDITIONAL CALC HSP                      *
049700*   PRICER 95.0 FISCAL YEAR 95                                 *
049800*             - ADDED PROVIDER-TYPE 21 AND 22 -                *
049900*               21 = ESSENTIAL ACCESS COMMUNITY HOSPITAL       *
050000*               22 = ESSENTIAL ACCESS COMMUNITY HOSPITAL       *
050100*                    REFERRAL CENTER                           *
050200*             - DELETED PROVIDER-TYPE 01 AND 11                *
050300*   PPCAL950  - ADDED DRG 495                                  *
050400*   PRICER 96.0 FISCAL YEAR 96                                 *
050500*             - DELETE PROVIDER-TYPE 19 AND 20                 *
050600*             - ADD 1 TO B-LOS FOR PERDIEM CASES  FOR OUTLIERS *
050700*   PRICER 97.0 FISCAL YEAR 97                                 *
050800*             - NEW RATES FOR 97                               *
050900*             - REGIONAL FLOOR EXPIRED 100196                  *
051000*             - NEW DRG TABLE FOR 97                           *
051100*             - NEW RATE TABLE FOR 97                          *
051200*   PRICER 98.0 FISCAL YEAR 98                                 *
051300*             - DAY OUTLIER EXPIRED AS OF 10/0197              *
051400*             - PUERTO RICO WILL BLEND ITS REGION WAGE INDEX   *
051500*             -   WITH THE NATIONAL WAGE INDEX                 *
051600*             -  PR'S WILL HAVE TWO TYPES OF MSA CODES         *
051700*             -       NATIONAL MSA CODE - EX: 7440             *
051800*             -       REGIONAL MSA CODE - EX: 744*             *
051900*             -            - ASTERISK IN LAST POSTION          *
052000*             - DRG TABLE INCREASED TO 503                     *
052100*             - DRG'S NO LONGER VALID   214,215,221,222        *
052200*             - NEW RATE TABLE FOR 98                          *
052300*             - THE FOLLOWING STATES WAIVER STATUS             *
052400*             - MSA'S -- FLOOR ON AREA WAGE INDEX              *
052500*             -     MSA 6020 AND STATE = 36                    *
052600*             -         USE MSA '  36' TO LOOKUP WAGE INDEX    *
052700*             -     MSA 6020 AND STATE = 51                    *
052800*             -         USE MSA '  51' TO LOOKUP WAGE INDEX    *
052900*             -     MSA 9000 AND STATE = 36                    *
053000*             -         USE MSA '  36' TO LOOKUP WAGE INDEX    *
053100*             -     MSA 9000 AND STATE = 51                    *
053200*             -         USE MSA '  51' TO LOOKUP WAGE INDEX    *
053300*             - ADDED NEW RTC 67                               *
053400*             -    COST OUTLIER WITH LOS > COVERED DAYS        *
053500*             - DELETE RTC 66   NO LONGER PAYING DAY OUTLIERS  *
053600*           INFORMATIONAL                                      *
053700*             -  22  MASSACHUSETTES - FYB ON OR AFTER 10/01/85 *
053800*             -  33  MNEW YORK -    - FYB ON OR AFTER 01/01/86 *
053900*             -  40  PUERTO RICO  SVCS RENDERED AFTER 09/30/86 *
054000*             -  31  NEW JERSEY     - FYB ON OR AFTER 01/01/89 *
054100*             -  21  MARYLAND       - REMAINS ON WAIVER        *
054200*             -  65  GUAM           - REMAINS ON WAIVER        *
054300*   PRICER 99.0 FISCAL YEAR 99                                 *
054400*             - MILLENNIUM COMPLIENT RELEASE                   *
054500*             - INPUT BILL RECORD                              *
054600*             -     RECORD REFORMATTED                         *
054700*             -     RECORD LENGTH CHANGED FROM 50 TO 70 BYTES  *
054800*             - INPUT PSF  RECORD                              *
054900*             -     RECORD REFORMATTED                         *
055000*             -     RECORD LENGTH STAYED THE SAME AT 240 BYTES *
055100*             - INPUT MSA  RECORD                              *
055200*             -     RECORD REFORMATTED                         *
055300*             -     RECORD LENGTH STAYED THE SAME AT 80  BYTES *
055400*             - WILL CONVERT FROM NEW PSF FORMAT BACK          *
055500*                 TO OLD PSF FORMAT FOR PPCAL__ MODULES        *
055600*                 PRIOR TO PPCAL990                            *
055700*             - NEW MSA FILE FORMAT - ADDED CENTURY            *
055800*             - DRG TABLE INCREASED TO 511                     *
055900*             - DRG 109 IS VALID FOR 1999 PPCAL                *
056000*             - DRG'S NO LONGER VALID   214,215,221,222        *
056100*             - DRG'S NO LONGER VALID   438,456,457,458        *
056200*             - DRG'S NO LONGER VALID   459,460,469,470        *
056300*             - DRG'S NO LONGER VALID   472,474                *
056400*             - NEW REVIEW CODE  = 09 WITH THE FOLLOWING       *
056500*             -  DRG'S 014 113 236 263 264 429 483 209 210 211 *
056600*             - NEW REVIEW CODE = 11 WITH NO COST FOR FOLLOWING*
056700*             -  DRG'S 014 113 236 263 264 429 483 209 210 211 *
056800*   PRICER 99.1 INCLUDED CALCULATION FOR COST OUTLIER THRESHOLD*
056900*               ALSO UPDATED PPCAL981 TO PPCAL982              *
057000*   PRICER 99.2 EFFECTIVE DATE TO THESE CHANGES IS 19990301    *
057100*               CHANGE TO RATE TABLE AND BUDGET NEUTRALITY     *
057200*               FACTOR                                         *
057300*               CHANGE TO STANDARD FEDERAL PAYMENT RATE        *
057400*               CHANGE TO MSAX FILE FOR WAGE INDEXES           *
057500*   PRICER 98.3 INCLUDED INDIAN SERVICES FOR CAPITAL           *
057600*               STARTING ON JAN 1 1998                         *
057700*   PRICER 99.3 INCLUDED INDIAN SERVICES FOR CAPITAL           *
057800*   PRICER2000  EFFECTIVE DATE TO THESE CHANGES IS 19991001    *
057900*             - INCLUDED INDIAN SERVICES FOR CAPITAL           *
058000*             - NEW MSA FILE                                   *
058100*             - NEW DRG TABLE                                  *
058200*             - NEW RATE TABLE                                 *
058300*             - PROVIDER 180056 WILL GET .8303 WAGE INDEX      *
058400*   PPDRV001    CHANGES MADE TO PROVIDERS WAGE INDEX VALUES    *
058500*   PRICER2001                                                 *
058600*   VERSION 0   EFFECTIVE DATE TO THESE CHANGES IS 20001001    *
058700*             - NEW MSA FILE                                   *
058800*             - NEW DRG TABLE                                  *
058900*             - NEW RATE TABLE                                 *
059000*   PRICER2001                                                 *
059100*   VERSION 1   EFFECTIVE DATE TO THESE CHANGES IS 20001201    *
059200*             - NEW MSA FILE                                   *
059300*   PRICER2001  PPDRV012                                       *
059400*   VERSION 2   EFFECTIVE DATE TO THESE CHANGES IS 20010401    *
059500*             - NEW LABOR AND NON-LABOR RATES                  *
059600*             - NEW THRESHOLD RATES                            *
059700*             - NEW RATE FOR OPERATING IME                     *
059800*             - NEW BUDGET NUTR RATE                           *
059900*             - NEW RATES FOR SCH AND EACH                     *
060000*             - NEW DSH CALCULATIONS                           *
060100*   PRICER2002  PPDRV020                                       *
060200*   VERSION 0   EFFECTIVE DATE TO THESE CHANGES IS 20011001    *
060300*             - NEW LABOR AND NON-LABOR RATES                  *
060400*             - NEW THRESHOLD RATES                            *
060500*             - NEW RATE FOR OPERATING IME                     *
060600*             - NEW BUDGET NUTR RATE                           *
060700*             - NEW RATES FOR SCH AND EACH                     *
060800*             - NEW DSH CALCULATIONS                           *
060900*               CHANGES MADE TO PROVIDERS WAGE INDEX VALUES    *
061000*                      FOR FY 2001 NEW LUGAR HOSPITALS         *
061100*             - NO LONGER  PAID CAPITAL HSP                    *
061200*             - NO LONGER  PAID PRE-CAPITAL THRESHOLD          *
061300*             - PAYING 100% FEDERAL  FOR FULLY PROSPECTIVE     *
061400*             - PAYING BLEND FOR ADDITION HSP                  *
061500*             - INCREASED DRGS TO 523                          *
061600*   VERSION 0   DATE CHANGE MADE=20011201   RETRO = 20011001   *
061700*               MODIFIED PPDRV020,  ADDED MSA CHANGE TO FLOOR  *
061800*               2300-2002-FLOOR-MSA PARAGRAGH                  *
061900*               MSA  1303 AND 14                               *
062000*   VERSION 0   EFFECTIVE DATE TO THESE CHANGES IS 20011201    *
062100*             - REVISIONS TO THE WAGE INDEX FOR THE FOLLOWING  *
062200*   MSAX021   - MSA 1123, 3810, 4890, 5600, 5660, 7080, 7520   *
062300*   PRICER2002  PPDRV021   APRIL RELEASE                       *
062400*   VERSION 1   EFFECTIVE DATE TO THESE CHANGES IS 20020101    *
062500*       (HMO)   REMOVED THE DME FOR THE PASS THRU TOTAL (HMO)  *
062600*                    CALL TO NEW PPCAL PROGRAM  PPCAL021       *
062700*   PRICER2003  PPDRV030   OCT RELEASE FOR FY 2003             *
062800*             - NEW LABOR AND NON-LABOR RATES                  *
062900*             - NEW THRESHOLD RATES                            *
063000*             - NEW BUDGET NUTR RATE                           *
063100*             - INCREASED DRG'S TO 527                         *
063200*   PRICER2003  PPDRV032                                       *
063300*   VERSION 2   RELEASE EFFECTIVE JUN 1. 2003                  *
063400*             - ADDED NEW TECH PAYMENT PROCESS  (XIGRIS)       *
063500*             - INCREASED INPUT BILL RECORD>70 TO 125 BYTES    *
063600*             - INCREASED OUTPUT RECORD FROM 476 TO 550 BYTES  *
063700*             - NEW LABOR AND NON-LABOR RATES                  *
063800*             - NEW THRESHOLD RATES                            *
063900*             - NEW BUDGET NUTR RATE                           *
064000*   PRICER2004  PPDRV040                                       *
064100*               RELEASE EFFECTIVE OCT 1. 2003                  *
064200*             - NEW LABOR AND NON-LABOR RATES                  *
064300*             - NEW THRESHOLD RATES                            *
064400*             - NEW BUDGET NUTR RATE                           *
064500*             - POST-ACUTE CARE TRANSFER POLICY EXPANDED       *
064600*                    ADDING MORE DRG'S                         *
064700*             - ONE ADDITIONAL NEW TECHNOLOGY (INFUSION)       *
064800*             - RETURN TO SEPARATING LARGE URBAN AND OTHER     *
064900*                      URBAN STANDARDIZED AMOUNTS              *
065000*   PRICER2004  PPDRV041                                       *
065100*               RELEASE EFFECTIVE NOV 1. 2003                  *
065200*             - NEW LABOR AND NON-LABOR RATES                  *
065300*             -   NOV 1 THROUGH MARCH 31                       *
065400*   PRICER2004  PPDRV046                                       *
065500*               RELEASE EFFECTIVE APR 1. 2004                  *
065600*             - NEW LABOR AND NON-LABOR RATES                  *
065700*             - NEW RATE FOR OPER IME                          *
065800*             - NEW PUERTO RICO BLEND                          *
065900*   PRICER2005  PPDRV050                                       *
066000*               RELEASE EFFECTIVE OCT 1. 2004                  *
066100*             - NEW LABOR AND NON-LABOR RATES                  *
066200*             - NEW RATE FOR OPER IME                          *
066300*             - ADDED NEW CBSA FILE                            *
066400*             - UPDATED THE DRG CODES                          *
066500*             - DROP DRG 483                                   *
066600*             - ADDED DRG      541,542,543                     *
066700*             - DELETE XIGRIS ADD-ON                           *
066800*             - ADDED NEW TECH OP-1 IMPLANT ADD-ON             *
066900*             - ADDED NEW TECH CRT-D ADD-ON                    *
067000*             - DSH ADJ FOR URBAN TO RURAL PROVIDERS           *
067100*   PRICER2005  PPDRV051                                       *
067200*               RELEASE EFFECTIVE APR 1. 2005                  *
067300*               CHGED THE NEW TECH CODES FOR OP-1              *
067400*                - DROPPED 8108 AND 8105                       *
067500*               UPDATED 401 LIST                               *
067600*               UPDATED DSH ADJ PROVIDER LIST                  *
067700*               UPDATED FLOOR                                  *
067800*               ADDED PTYPE CODE 15 MDH-RRC                    *
067900*                - SEC 402 MMA TO PPCAL052 AND PPCAL047        *
068000*   PRICER2006  PPDRV060                                       *
068100*               RELEASE EFFECTIVE OCT 1. 2005                  *
068200*               UPDATE 401 LIST                                *
068300*               DROPPED O-1 AND CRT-D CASES                    *
068400*               ADDED NEUROSTIMULATOR AND GRAFT CASES          *
068500*   PRICER2006  PPDRV061 RELEASE ON OCTOBER 17TH 2005          *
068600*               RELEASE EFFECTIVE OCT 1. 2005                  *
068700*               CORRECTED DRG 233                              *
068800*   PRICER2006  PPDRV062 PPOPN062                              *
068900*               RELEASE EFFECTIVE JAN 1. 2006                  *
069000*               ADDED NEW OPN FOR I/O                          *
069100*               CONVERTED TO CICS                              *
069200*               NO LOGIC CHANGES OTHER THEN CICS CONVERSION    *
069300*   PRICER2006  PPDRV063 PPCAL063                              *
069400*               CHANGE  EFFECTIVE JAN 1. 2006                  *
069500*               CHANGE MADE 04/05/2006                         *
069600*               DEL PROVIDER 150051 FROM 401 LOGIC             *
069700*   PRICER2007  PPDRV071                                       *
069800*               RELEASE EFFECTIVE OCT 1. 2006                  *
069900*               INCREASED DRGS TO 579                          *
070000*   PRICER2007  PPDRV072                                       *
070100*               CHANGED FAC-SPEC-RATE FORMULA IN 3450 PARG     *
070200*                 IN PPCAL072                                  *
070300*   PRICER2007  PPDRV074                                       *
070400*               EXCLUDE CBSA 27860 EFFECTIVE 11/03/06          *
070500*                 FROM FLOOR 2007 SECTION. PRICING ALLOWS NEW  *
070600*                 TECHNICAL ADD ON.                            *
070700*   PRICER2008  PPDRV080                                       *
070800*               EXCLUDE CBSA 27860 EFFECTIVE 11/03/06          *
070900*                 FROM FLOOR 2008 SECTION. PRICING ALLOWS      *
071000*                 TECHNICAL ADD ON.                            *
071100*   PRICER2008  PPDRV083                                       *
071200*               EXCLUDE CBSA 27860 EFFECTIVE 11/03/06          *
071300*                 FROM FLOOR 2008 SECTION. PRICING ALLOWS      *
071400*                 TECHNICAL ADD ON.                            *
071500*   PRICER2008  PPDRV085                                       *
071600*               EXCLUDE CBSA 27860 EFFECTIVE 11/03/06          *
071700*                 FROM FLOOR 2008 SECTION. PRICING ALLOWS      *
071800*                 TECHNICAL ADD ON.                            *
071900*   PRICER2009  PPDRV091                                       *
072000*                       FLOOR 2009 SECTION AND 401 HOSPITALS   *
072100*                 FOR 2009                                     *
072200*   PRICER2009  PPDRV092                                       *
072300*                   SAME AS PPDRV091. JUS VERSION CHANGE       *
072400*   PRICER2009  PPDRV095                                       *
072500*                   REVISED FLOOR LOGIC                        *
072600*                  PER POLICY, WE REMOVED THE .5 MULTIPLER
072700*   PRICER2009  PPDRV096                                       *
072800*                   REVISED FLOOR LOGIC                        *
072900*                  PER POLICY, WE REMOVED THE .5 MULTIPLER
073000****************************************************************
073100*   PRICER2014  PPDRV147                                       *
073200*                   REVISED FLOOR LOGIC                        *
073300*                  PER POLICY, WE REMOVED THE .5 MULTIPLER
073400****************************************************************
073500 ENVIRONMENT DIVISION.
073600 CONFIGURATION SECTION.
073700 SOURCE-COMPUTER.            IBM-370.
073800 OBJECT-COMPUTER.            IBM-370.
073900 INPUT-OUTPUT SECTION.
074000 FILE-CONTROL.
074100 DATA DIVISION.
074200 FILE SECTION.
074300
074400 WORKING-STORAGE SECTION.
074500 77  W-STORAGE-REF                  PIC X(48)  VALUE
074600     'P P D R I V E R - W O R K I N G   S T O R A G E'.
074700
074800 01  DRV-VERSION                    PIC X(05) VALUE 'D14.6'.
074900 01  PPCAL884                       PIC X(08) VALUE 'PPCAL884'.
075000 01  PPCAL894                       PIC X(08) VALUE 'PPCAL894'.
075100 01  PPCAL905                       PIC X(08) VALUE 'PPCAL905'.
075200 01  PPCAL915                       PIC X(08) VALUE 'PPCAL915'.
075300 01  PPCAL926                       PIC X(08) VALUE 'PPCAL926'.
075400 01  PPCAL935                       PIC X(08) VALUE 'PPCAL935'.
075500 01  PPCAL944                       PIC X(08) VALUE 'PPCAL944'.
075600 01  PPCAL954                       PIC X(08) VALUE 'PPCAL954'.
075700 01  PPCAL964                       PIC X(08) VALUE 'PPCAL964'.
075800 01  PPCAL974                       PIC X(08) VALUE 'PPCAL974'.
075900 01  PPCAL987                       PIC X(08) VALUE 'PPCAL987'.
076000 01  PPCAL998                       PIC X(08) VALUE 'PPCAL998'.
076100 01  PPCAL006                       PIC X(08) VALUE 'PPCAL006'.
076200 01  PPCAL017                       PIC X(08) VALUE 'PPCAL017'.
076300 01  PPCAL026                       PIC X(08) VALUE 'PPCAL026'.
076400 01  PPCAL038                       PIC X(08) VALUE 'PPCAL038'.
076500 01  PPCAL04D                       PIC X(08) VALUE 'PPCAL04D'.
076600 01  PPCAL058                       PIC X(08) VALUE 'PPCAL058'.
076700 01  PPCAL069                       PIC X(08) VALUE 'PPCAL069'.
076800 01  PPCAL07B                       PIC X(08) VALUE 'PPCAL07B'.
076900 01  PPCAL08D                       PIC X(08) VALUE 'PPCAL08D'.
077000 01  PPCAL09D                       PIC X(08) VALUE 'PPCAL09D'.
077100 01  PPCAL10O                       PIC X(08) VALUE 'PPCAL10O'.
077200 01  PPCAL10P                       PIC X(08) VALUE 'PPCAL10P'.
077300 01  PPCAL118                       PIC X(08) VALUE 'PPCAL118'.
077400 01  PPCAL124                       PIC X(08) VALUE 'PPCAL124'.
077500 01  PPCAL134                       PIC X(08) VALUE 'PPCAL134'.
077600 01  PPCAL147                       PIC X(08) VALUE 'PPCAL147'.
077700
077800 01  TABLES-LOADED-SW               PIC 9(01) VALUE 0.
077900 01  EOF-SW                         PIC 9(01) VALUE 0.
078000
078100 01  HOLD-PROV-MSAX.
078200         10  H-MSAX-PROV-BLANK   PIC X(2).
078300         10  H-MSAX-PROV-STATE.
078400             15  FILLER          PIC X.
078500             15  H-MSAX-LAST-POS PIC X.
078600
078700 01  HOLD-PROV-CBSA.
078800         10  H-CBSA-PROV-BLANK      PIC X(3).
078900         10  H-CBSA-PROV-STATE.
079000             15  FILLER             PIC X.
079100             15  H-CBSA-LAST-POS    PIC X.
079200
079300************************************************************
079400**    OLD PROVIDER RECORD FORMAT
079500************************************************************
079600 01  W-PROV-OLD-HOLD.
079700     02  W-PROV-OLDREC-HOLD1.
079800         05  W-P-PROVIDER-NO.
079900             10  W-P-STATE                PIC 9(02).
080000             10  FILLER                 PIC X(04).
080100         05  W-P-EFF-DATE.
080200             10  W-P-EFF-YY               PIC 9(02).
080300             10  W-P-EFF-MM               PIC 9(02).
080400             10  W-P-EFF-DD               PIC 9(02).
080500         05  W-P-WAIVER-CODE              PIC X(01).
080600         05  W-P-PROVIDER-TYPE            PIC X(02).
080700         05  W-P-CURRENT-CENSUS-DIV       PIC X(01).
080800         05  W-P-PPS-BLEND-YR-IND         PIC X(01).
080900         05  W-P-MSA-X.
081000             10  W-P-RURAL                PIC X(04).
081100         05  W-P-MSA-9 REDEFINES W-P-MSA-X  PIC 9(04).
081200         05  W-P-FISCAL-YEAR-END.
081300             10  W-P-MM                   PIC 9(02).
081400             10  W-P-DD                   PIC 9(02).
081500             10  W-P-YY                   PIC 9(02).
081600         05  W-P-VARIABLES.
081700             10  W-P-FAC-SPEC-RATE        PIC  X(07).
081800             10  W-P-COLA                 PIC  X(04).
081900             10  W-P-INTERN-RATIO         PIC  X(05).
082000             10  W-PRUP-UPDT-FACTOR       PIC  X(06).
082100             10  W-P-BED-SIZE             PIC  X(05).
082200             10  W-P-DSH-PERCENT          PIC  V9(04).
082300             10  W-P-CCR                  PIC  X(04).
082400             10  W-P-CMI                  PIC  X(05).
082500             10  FILLER                 PIC  X(01).
082600             10  W-P-REPORT-DATE.
082700                 15  W-P-REPORT-DT-MM     PIC 99.
082800                 15  W-P-REPORT-DT-DD     PIC 99.
082900                 15  W-P-REPORT-DT-YY     PIC 99.
083000             10  FILLER                 PIC  X(01).
083100             10  W-P-INTER-NO             PIC  X(05).
083200     02  W-PROV-OLDREC-HOLD2.
083300         05  W-P-FY-BEGIN-DATE.
083400             10  W-P-FY-BEG-DT-MM         PIC 99.
083500             10  W-P-FY-BEG-DT-DD         PIC 99.
083600             10  W-P-FY-BEG-DT-YY         PIC 99.
083700         05  W-P-PASS-AMT-CAPITAL         PIC X(6).
083800         05  W-P-PASS-AMT-DIR-MED-ED      PIC X(6).
083900         05  W-P-PASS-AMT-ORGAN-ACQ       PIC X(6).
084000         05  W-P-PASS-AMT-PLUS-MISC       PIC X(6).
084100         05  W-P-SSI-RATIO                PIC X(4).
084200         05  W-P-MEDICAID-RATIO           PIC X(4).
084300         05  W-P-TERMINATION-DATE.
084400             10  W-P-TERM-DT-YY           PIC 99.
084500             10  W-P-TERM-DT-MM           PIC 99.
084600             10  W-P-TERM-DT-DD           PIC 99.
084700         05  W-P-WAGE-INDEX-LOC-MSA       PIC X(4).
084800         05  W-P-CHG-CODE-INDEX           PIC X.
084900         05  W-P-STAND-AMT-LOC-MSA.
085000             10  W-P-RURAL-1ST.
085100                 15  W-P-STAND-RURAL      PIC XX.
085200             10  W-P-RURAL-2ND            PIC XX.
085300         05  W-P-SOL-COM-DEP-HOSP-YR      PIC XX.
085400         05  W-P-LUGAR                    PIC X.
085500         05  W-P-TEMP-RELIEF-IND          PIC X.
085600         05  FILLER                       PIC X(23).
085700     02  W-PROV-OLDREC-HOLD3.
085800         05  W-P-CAPI-PPS-PAY-CODE        PIC X.
085900         05  W-P-CAPI-HOSP-SPEC-RATE      PIC X(6).
086000         05  W-P-CAPI-OLD-HARM-RATE       PIC X(6).
086100         05  W-P-CAPI-NEW-HARM-RATIO      PIC X(5).
086200         05  W-P-CAPI-CSTCHG-RATIO        PIC X(04).
086300         05  W-P-CAPI-NEW-HOSP            PIC X.
086400         05  W-P-CAPI-IME                 PIC X(05).
086500         05  W-P-CAPI-EXCEPTIONS          PIC X(6).
086600         05  P-HVBP-HRR-DATA.
086700             15  P-VAL-BASED-PURCH-PARTIPNT PIC X.
086800             15  P-VAL-BASED-PURCH-ADJUST   PIC 9V9(11).
086900             15  P-HOSP-READMISSION-REDUCTN PIC X.
087000             15  P-HOSP-HRR-ADJUSTMT        PIC 9V9(4).
087100         05  P-MODEL1-BUNDLE-DATA.
087200             15  P-MODEL1-BUNDLE-DISPRCNT   PIC V999.
087300             15  P-HAC-REDUC-IND            PIC X.
087400             15  P-UNCOMP-CARE-AMOUNT       PIC 9(07)V99.
087500             15  P-EHR-REDUC-IND            PIC X.
087600         05  FILLER                         PIC X(09).
087700
087800***************************************************************
087900**    NEW PROVIDER RECORD FORMAT
088000***************************************************************
088100 01  W-PROV-NEW-HOLD.
088200     02  W-PROV-NEWREC-HOLD1.
088300         05  W-P-NEW-NPI10.
088400             10  W-P-NEW-NPI8           PIC X(08).
088500             10  W-P-NEW-NPI-FILLER     PIC X(02).
088600         05  W-P-NEW-PROVIDER-OSCAR-NO.
088700             10  W-P-NEW-STATE            PIC X(02).
088800             10  FILLER                 PIC X(04).
088900         05  W-P-NEW-DATE-DATA.
089000             10  W-P-NEW-EFF-DATE.
089100                 15  W-P-NEW-EFF-DT-CC    PIC 9(02).
089200                 15  W-P-NEW-EFF-DT-YY    PIC 9(02).
089300                 15  W-P-NEW-EFF-DT-MM    PIC 9(02).
089400                 15  W-P-NEW-EFF-DT-DD    PIC 9(02).
089500             10  W-P-NEW-FY-BEGIN-DATE.
089600                 15  W-P-NEW-FY-BEG-DT-CC PIC 9(02).
089700                 15  W-P-NEW-FY-BEG-DT-YY PIC 9(02).
089800                 15  W-P-NEW-FY-BEG-DT-MM PIC 9(02).
089900                 15  W-P-NEW-FY-BEG-DT-DD PIC 9(02).
090000             10  W-P-NEW-REPORT-DATE.
090100                 15  W-P-NEW-REPORT-DT-CC PIC 9(02).
090200                 15  W-P-NEW-REPORT-DT-YY PIC 9(02).
090300                 15  W-P-NEW-REPORT-DT-MM PIC 9(02).
090400                 15  W-P-NEW-REPORT-DT-DD PIC 9(02).
090500             10  W-P-NEW-TERMINATION-DATE.
090600                 15  W-P-NEW-TERM-DT-CC   PIC 9(02).
090700                 15  W-P-NEW-TERM-DT-YY   PIC 9(02).
090800                 15  W-P-NEW-TERM-DT-MM   PIC 9(02).
090900                 15  W-P-NEW-TERM-DT-DD   PIC 9(02).
091000         05  W-P-NEW-WAIVER-CODE          PIC X(01).
091100             88  W-P-NEW-WAIVER-STATE       VALUE 'Y'.
091200         05  W-P-NEW-INTER-NO             PIC X(05).
091300         05  W-P-NEW-PROVIDER-TYPE        PIC X(02).
091400         05  W-P-NEW-CURRENT-CENSUS-DIV   PIC X(01).
091500         05  W-P-NEW-MSA-DATA.
091600             10  W-P-NEW-CHG-CODE-INDEX    PIC X.
091700             10  W-P-NEW-GEO-LOC-MSA        PIC X(04) JUST RIGHT.
091800             10  W-P-NEW-WAGE-INDEX-LOC-MSA PIC X(04) JUST RIGHT.
091900             10  W-P-NEW-STAND-AMT-LOC-MSA  PIC X(04) JUST RIGHT.
092000             10  W-P-NEW-STAND-AMT-LOC-MSA9
092100       REDEFINES W-P-NEW-STAND-AMT-LOC-MSA.
092200                 15  W-P-NEW-RURAL-1ST.
092300                     20  W-P-NEW-STAND-RURAL  PIC XX.
092400                 15  W-P-NEW-RURAL-2ND        PIC XX.
092500         05  W-P-NEW-SOL-COM-DEP-HOSP-YR PIC XX.
092600         05  W-P-NEW-LUGAR               PIC X.
092700         05  W-P-NEW-TEMP-RELIEF-IND     PIC X.
092800         05  W-P-NEW-FED-PPS-BLEND-IND   PIC X.
092900         05  FILLER                      PIC X(05).
093000     02  W-PROV-NEWREC-HOLD2.
093100         05  W-P-NEW-VARIABLES.
093200             10  W-P-NEW-FAC-SPEC-RATE     PIC  X(07).
093300             10  W-P-NEW-COLA              PIC  X(04).
093400             10  W-P-NEW-INTERN-RATIO      PIC  X(05).
093500             10  W-P-NEW-BED-SIZE          PIC  X(05).
093600             10  W-P-NEW-CCR               PIC  X(04).
093700             10  W-P-NEW-CMI               PIC  X(05).
093800             10  W-P-NEW-SSI-RATIO         PIC  X(04).
093900             10  W-P-NEW-MEDICAID-RATIO    PIC  X(04).
094000             10  W-P-NEW-PPS-BLEND-YR-IND  PIC  X(01).
094100             10  W-P-NEW-PRUP-UPDTE-FACTOR PIC  9(01)V9(05).
094200             10  W-P-NEW-DSH-PERCENT       PIC  V9(04).
094300             10  W-P-NEW-FYE-DATE.
094400                 15  W-P-NEW-FYE-CC        PIC 99.
094500                 15  W-P-NEW-FYE-YY        PIC 99.
094600                 15  W-P-NEW-FYE-MM        PIC 99.
094700                 15  W-P-NEW-FYE-DD        PIC 99.
094800         05  W-P-NEW-CBSA-DATA.
094900             10  W-P-NEW-CBSA-SPEC-PAY-IND   PIC X.
095000             10  W-P-NEW-CBSA-HOSP-QUAL-IND  PIC X.
095100             10  W-P-NEW-CBSA-GEO-LOC        PIC X(05) JUST RIGHT.
095200             10  W-P-NEW-CBSA-RECLASS-LOC    PIC X(05) JUST RIGHT.
095300             10  W-P-NEW-CBSA-STAND-AMT-LOC  PIC X(05) JUST RIGHT.
095400             10  W-P-NEW-CBSA-STAND-AMT-LOC9
095500       REDEFINES W-P-NEW-CBSA-STAND-AMT-LOC.
095600                 15  W-P-NEW-CBSA-RURAL-1ST.
095700                     20  W-P-NEW-CBSA-STAND-RURAL PIC 999.
095800                 15  W-P-NEW-CBSA-RURAL-2ND       PIC 99.
095900             10  W-P-NEW-CBSA-SPEC-WAGE-INDEX     PIC 9(02)V9(04).
096000     02  W-PROV-NEWREC-HOLD3.
096100         05  W-P-NEW-PASS-AMT-DATA.
096200             10  W-P-NEW-PASS-AMT-CAPITAL    PIC X(06).
096300             10  W-P-NEW-PASS-AMT-DIR-MED-ED PIC X(06).
096400             10  W-P-NEW-PASS-AMT-ORGAN-ACQ  PIC X(06).
096500             10  W-P-NEW-PASS-AMT-PLUS-MISC  PIC X(06).
096600         05  W-P-NEW-CAPI-DATA.
096700             15  W-P-NEW-CAPI-PPS-PAY-CODE   PIC X.
096800             15  W-P-NEW-CAPI-HOSP-SPEC-RATE PIC X(6).
096900             15  W-P-NEW-CAPI-OLD-HARM-RATE  PIC X(6).
097000             15  W-P-NEW-CAPI-NEW-HARM-RATIO PIC X(5).
097100             15  W-P-NEW-CAPI-CSTCHG-RATIO   PIC X(04).
097200             15  W-P-NEW-CAPI-NEW-HOSP       PIC X.
097300             15  W-P-NEW-CAPI-IME            PIC X(05).
097400             15  W-P-NEW-CAPI-EXCEPTIONS     PIC X(6).
097500         05  P-HVBP-HRR-DATA.
097600             15  W-P-NEW-VAL-BASED-PURCH-PARTIP   PIC X.
097700             15  W-P-NEW-VAL-BASED-PURCH-ADJUST   PIC 9V9(11).
097800             15  W-P-NEW-HOSP-READMISSION-REDU    PIC X.
097900             15  W-P-NEW-HOSP-HRR-ADJUSTMT        PIC 9V9(4).
098000         05  P-MODEL1-BUNDLE-DATA.
098100             15  W-P-MODEL1-BUNDLE-DISPRCNT   PIC V999.
098200             15  W-P-HAC-REDUC-IND            PIC X.
098300             15  W-P-UNCOMP-CARE-AMOUNT       PIC 9(07)V99.
098400             15  W-P-EHR-REDUC-IND            PIC X.
098500         05  FILLER                           PIC X(09).
098600
098700***************************************************************
098800*      THIS IS THE WAGE-INDEX RECORD THAT WILL BE PASSED TO   *
098900*      THE PPCAL001 PROGRAM THRU PPCAL047 FOR PROCESSING
099000*      MSAX TABLE
099100***************************************************************
099200 01  WAGE-NEW-INDEX-RECORD.
099300     05  W-NEW-MSA               PIC 9(4).
099400     05  W-NEW-SIZE              PIC X(01).
099500         88  NEW-LARGE-URBAN       VALUE 'L'.
099600         88  NEW-OTHER-URBAN       VALUE 'O'.
099700         88  NEW-ALL-RURAL         VALUE 'R'.
099800     05  W-NEW-EFF-DATE.
099900          10  W-NEW-EFF-DATE-CC   PIC 9(2).
100000          10  W-NEW-EFF-DATE-YMD.
100100              15  W-NEW-EFF-DATE-YY   PIC 9(2).
100200              15  W-NEW-EFF-DATE-MM   PIC 9(2).
100300              15  W-NEW-EFF-DATE-DD   PIC 9(2).
100400     05  FILLER              PIC X.
100500     05  W-NEW-INDEX-RECORD      PIC S9(02)V9(04).
100600     05  W-NEW-PR-INDEX-RECORD   PIC S9(02)V9(04).
100700
100800***************************************************************
100900*      THIS IS THE WAGE-INDEX RECORD THAT WILL BE PASSED TO   *
101000*      THE PPCAL052 PROGRAM AND AFTER FOR PROCESSING
101100*      CBSA TABLE
101200***************************************************************
101300 01  WAGE-NEW-CBSA-INDEX-RECORD.
101400     05  W-NEW-CBSA               PIC 9(5).
101500     05  W-NEW-CBSA-X  REDEFINES W-NEW-CBSA     PIC X(05).
101600     05  W-NEW-CBSA-SIZE              PIC X(01).
101700         88  NEW-CBSA-LARGE-URBAN       VALUE 'L'.
101800         88  NEW-CBSA-OTHER-URBAN       VALUE 'O'.
101900         88  NEW-CBSA-ALL-RURAL         VALUE 'R'.
102000     05  W-NEW-CBSA-EFF-DATE.
102100          10  W-NEW-CBSA-EFF-DATE-CC   PIC 9(2).
102200          10  W-NEW-CBSA-EFF-DATE-YMD.
102300              15  W-NEW-CBSA-EFF-DATE-YY   PIC 9(2).
102400              15  W-NEW-CBSA-EFF-DATE-MM   PIC 9(2).
102500              15  W-NEW-CBSA-EFF-DATE-DD   PIC 9(2).
102600     05  FILLER                      PIC X.
102700     05  W-NEW-CBSA-WI               PIC S9(02)V9(04).
102800     05  W-NEW-CBSA-PR-WI            PIC S9(02)V9(04).
102900
103000***************************************************************
103100*      NON-MILLINNIUM                                         *
103200*      THIS IS THE WAGE-INDEX RECORD THAT WILL BE PASSED TO   *
103300*      PPCAL983 PROGRAM  AND PRIOR YEARS FOR PROCESSING       *
103400***************************************************************
103500 01  WAGE-INDEX-RECORD.
103600     05  W-MSA               PIC 9(4).
103700     05  W-SIZE              PIC X(01).
103800         88  LARGE-URBAN       VALUE 'L'.
103900         88  OTHER-URBAN       VALUE 'O'.
104000         88  ALL-RURAL         VALUE 'R'.
104100     05  W-EFF-DATE          PIC 9(6).
104200     05  FILLER              PIC X.
104300     05  W-INDEX-RECORD      PIC S9(02)V9(04).
104400     05  W-PR-INDEX-RECORD   PIC S9(02)V9(04).
104500
104600**************************************************************
104700*      MILLINNIUM COMPATIBLE                                 *
104800*      THIS IS THE PROV-RECORD THAT WILL BE PASSED TO        *
104900*      THE PPCAL001 PROGRAM AND AFTER FOR PROCESSING         *
105000*      IN THE NEW FORMAT                                     *
105100**************************************************************
105200 01  PROV-NEW-HOLD.
105300     02  PROV-NEWREC-HOLD1.
105400         05  P-NEW-NPI10.
105500             10  P-NEW-NPI8             PIC X(08).
105600             10  P-NEW-NPI-FILLER       PIC X(02).
105700         05  P-NEW-PROVIDER-NO.
105800             10  P-NEW-STATE            PIC 9(02).
105900             10  FILLER                 PIC X(04).
106000         05  P-NEW-DATE-DATA.
106100             10  P-NEW-EFF-DATE.
106200                 15  P-NEW-EFF-DT-CC    PIC 9(02).
106300                 15  P-NEW-EFF-DT-YY    PIC 9(02).
106400                 15  P-NEW-EFF-DT-MM    PIC 9(02).
106500                 15  P-NEW-EFF-DT-DD    PIC 9(02).
106600             10  P-NEW-FY-BEGIN-DATE.
106700                 15  P-NEW-FY-BEG-DT-CC PIC 9(02).
106800                 15  P-NEW-FY-BEG-DT-YY PIC 9(02).
106900                 15  P-NEW-FY-BEG-DT-MM PIC 9(02).
107000                 15  P-NEW-FY-BEG-DT-DD PIC 9(02).
107100             10  P-NEW-REPORT-DATE.
107200                 15  P-NEW-REPORT-DT-CC PIC 9(02).
107300                 15  P-NEW-REPORT-DT-YY PIC 9(02).
107400                 15  P-NEW-REPORT-DT-MM PIC 9(02).
107500                 15  P-NEW-REPORT-DT-DD PIC 9(02).
107600             10  P-NEW-TERMINATION-DATE.
107700                 15  P-NEW-TERM-DT-CC   PIC 9(02).
107800                 15  P-NEW-TERM-DT-YY   PIC 9(02).
107900                 15  P-NEW-TERM-DT-MM   PIC 9(02).
108000                 15  P-NEW-TERM-DT-DD   PIC 9(02).
108100         05  P-NEW-WAIVER-CODE          PIC X(01).
108200             88  P-NEW-WAIVER-STATE       VALUE 'Y'.
108300         05  P-NEW-INTER-NO             PIC 9(05).
108400         05  P-NEW-PROVIDER-TYPE        PIC X(02).
108500             88  P-N-SOLE-COMMUNITY-PROV    VALUE '01' '11'.
108600             88  P-N-REFERRAL-CENTER        VALUE '07' '11'
108700                                                  '15' '17'
108800                                                  '22'.
108900             88  P-N-INDIAN-HEALTH-SERVICE  VALUE '08'.
109000             88  P-N-REDESIGNATED-RURAL-YR1 VALUE '09'.
109100             88  P-N-REDESIGNATED-RURAL-YR2 VALUE '10'.
109200             88  P-N-SOLE-COM-REF-CENT      VALUE '11'.
109300             88  P-N-MDH-REBASED-FY90       VALUE '14' '15'.
109400             88  P-N-MDH-RRC-REBASED-FY90   VALUE '15'.
109500             88  P-N-SCH-REBASED-FY90       VALUE '16' '17'.
109600             88  P-N-SCH-RRC-REBASED-FY90   VALUE '17'.
109700             88  P-N-MEDICAL-ASSIST-FACIL   VALUE '18'.
109800             88  P-N-EACH                   VALUE '21' '22'.
109900             88  P-N-EACH-REFERRAL-CENTER   VALUE '22'.
110000             88  P-N-NHCMQ-II-SNF           VALUE '32'.
110100             88  P-N-NHCMQ-III-SNF          VALUE '33'.
110200         05  P-NEW-CURRENT-CENSUS-DIV   PIC 9(01).
110300             88  P-N-NEW-ENGLAND            VALUE  1.
110400             88  P-N-MIDDLE-ATLANTIC        VALUE  2.
110500             88  P-N-SOUTH-ATLANTIC         VALUE  3.
110600             88  P-N-EAST-NORTH-CENTRAL     VALUE  4.
110700             88  P-N-EAST-SOUTH-CENTRAL     VALUE  5.
110800             88  P-N-WEST-NORTH-CENTRAL     VALUE  6.
110900             88  P-N-WEST-SOUTH-CENTRAL     VALUE  7.
111000             88  P-N-MOUNTAIN               VALUE  8.
111100             88  P-N-PACIFIC                VALUE  9.
111200         05  P-NEW-CURRENT-DIV   REDEFINES
111300                    P-NEW-CURRENT-CENSUS-DIV   PIC 9(01).
111400             88  P-N-VALID-CENSUS-DIV    VALUE 1 THRU 9.
111500         05  P-NEW-MSA-DATA.
111600             10  P-NEW-CHG-CODE-INDEX       PIC X.
111700             10  P-NEW-GEO-LOC-MSAX         PIC X(04) JUST RIGHT.
111800             10  P-NEW-GEO-LOC-MSA9   REDEFINES
111900                             P-NEW-GEO-LOC-MSAX  PIC 9(04).
112000             10  P-NEW-GEO-LOC-MSA-AST REDEFINES
112100                             P-NEW-GEO-LOC-MSA9.
112200                 15  P-NEW-GEO-MSA-1ST    PIC X.
112300                 15  P-NEW-GEO-MSA-2ND    PIC X.
112400                 15  P-NEW-GEO-MSA-3RD    PIC X.
112500                 15  P-NEW-GEO-MSA-4TH    PIC X.
112600             10  P-NEW-WAGE-INDEX-LOC-MSA   PIC X(04) JUST RIGHT.
112700             10  P-NEW-STAND-AMT-LOC-MSA    PIC X(04) JUST RIGHT.
112800             10  P-NEW-STAND-AMT-LOC-MSA9
112900       REDEFINES P-NEW-STAND-AMT-LOC-MSA.
113000                 15  P-NEW-RURAL-1ST.
113100                     20  P-NEW-STAND-RURAL  PIC XX.
113200                         88  P-NEW-STD-RURAL-CHECK VALUE '  '.
113300                 15  P-NEW-RURAL-2ND        PIC XX.
113400         05  P-NEW-SOL-COM-DEP-HOSP-YR PIC XX.
113500                 88  P-NEW-SCH-YRBLANK    VALUE   '  '.
113600                 88  P-NEW-SCH-YR82       VALUE   '82'.
113700                 88  P-NEW-SCH-YR87       VALUE   '87'.
113800         05  P-NEW-LUGAR                    PIC X.
113900         05  P-NEW-TEMP-RELIEF-IND          PIC X.
114000             88  P-NEW-LOW-VOL25PCT     VALUE 'Y'.
114100***          Y = LOW VOLUME PERCENTAGE  25 % ADD ON
114200         05  P-NEW-FED-PPS-BLEND-IND        PIC X.
114300         05  FILLER                         PIC X(05).
114400     02  PROV-NEWREC-HOLD2.
114500         05  P-NEW-VARIABLES.
114600             10  P-NEW-CMI-ADJ-CPD       PIC  9(05)V9(02).
114700             10  P-NEW-COLA              PIC  9(01)V9(03).
114800             10  P-NEW-INTERN-RATIO      PIC  9(01)V9(04).
114900             10  P-NEW-BED-SIZE          PIC  9(05).
115000             10  P-NEW-CCR               PIC  9(01)V9(03).
115100             10  P-NEW-CMI               PIC  9(01)V9(04).
115200             10  P-NEW-SSI-RATIO         PIC  V9(04).
115300             10  P-NEW-MEDICAID-RATIO    PIC  V9(04).
115400             10  P-NEW-PPS-BLEND-YR-IND  PIC  X(01).
115500             10  P-NEW-PRUP-UPDTE-FACTOR PIC  9(01)V9(05).
115600             10  P-NEW-DSH-PERCENT       PIC  V9(04).
115700             10  P-NEW-FYE-DATE.
115800                 15  P-NEW-FYE-CC        PIC 99.
115900                 15  P-NEW-FYE-YY        PIC 99.
116000                 15  P-NEW-FYE-MM        PIC 99.
116100                 15  P-NEW-FYE-DD        PIC 99.
116200         05  P-NEW-CBSA-DATA.
116300             10  P-NEW-CBSA-SPEC-PAY-IND    PIC X.
116400                 88  P-NEW-CBSA-WI-GEO        VALUE 'N'.
116500                 88  P-NEW-CBSA-WI-RECLASS    VALUE 'Y'.
116600                 88  P-NEW-CBSA-WI-SPECIAL    VALUE '1' '2'.
116700***                  1 = ANYTHING OR HOLD HARMLESS WITH SPEC WI
116800***                  2 = RECLASS WITH SPEC WI
116900             10  P-NEW-CBSA-HOSP-QUAL-IND  PIC X.
117000                 88  P-NEW-CBSA-HOSP-QUAL-MET   VALUE '1'.
117100                 88  P-NEW-CBSA-HOSP-QUAL-25PER VALUE '2'.
117200                 88  P-NEW-CBSA-HOSP-QUAL-BOTH  VALUE '3'.
117300             10  P-NEW-CBSA-GEO-LOC        PIC X(05) JUST RIGHT.
117400             10  P-NEW-CBSA-GEO-LOC9  REDEFINES
117500                             P-NEW-CBSA-GEO-LOC  PIC 9(05).
117600             10  P-NEW-CBSA-GEO-LOC-AST REDEFINES
117700                             P-NEW-CBSA-GEO-LOC9.
117800                 15  P-NEW-CBSA-GEO-1ST    PIC X.
117900                 15  P-NEW-CBSA-GEO-2ND    PIC X.
118000                 15  P-NEW-CBSA-GEO-3RD    PIC X.
118100                 15  P-NEW-CBSA-GEO-4TH    PIC X.
118200                 15  P-NEW-CBSA-GEO-5TH    PIC X.
118300             10  P-NEW-CBSA-RECLASS-LOC    PIC X(05) JUST RIGHT.
118400             10  P-NEW-CBSA-STAND-AMT-LOC  PIC X(05) JUST RIGHT.
118500             10  P-NEW-CBSA-STAND-AMT-LOC-MSA9
118600       REDEFINES P-NEW-CBSA-STAND-AMT-LOC.
118700               15  P-NEW-CBSA-RURAL-1ST.
118800                   20  P-NEW-CBSA-STAND-RURAL  PIC XXX.
118900                      88  P-NEW-CBSA-STD-RURAL-CHECK VALUE '   '.
119000               15  P-NEW-CBSA-RURAL-2ND    PIC XX.
119100             10  P-NEW-CBSA-SPEC-WI          PIC 9(02)V9(04).
119200             10  P-NEW-CBSA-SPEC-WI-N  REDEFINES
119300                 P-NEW-CBSA-SPEC-WI          PIC 9(06).
119400     02  PROV-NEWREC-HOLD3.
119500         05  P-NEW-PASS-AMT-DATA.
119600             10  P-NEW-PASS-AMT-CAPITAL    PIC 9(04)V99.
119700             10  P-NEW-PASS-AMT-DIR-MED-ED PIC 9(04)V99.
119800             10  P-NEW-PASS-AMT-ORGAN-ACQ  PIC 9(04)V99.
119900             10  P-NEW-PASS-AMT-PLUS-MISC  PIC 9(04)V99.
120000         05  P-NEW-CAPI-DATA.
120100             15  P-NEW-CAPI-PPS-PAY-CODE   PIC X.
120200             15  P-NEW-CAPI-HOSP-SPEC-RATE PIC 9(04)V99.
120300             15  P-NEW-CAPI-OLD-HARM-RATE  PIC 9(04)V99.
120400             15  P-NEW-CAPI-NEW-HARM-RATIO PIC 9(01)V9999.
120500             15  P-NEW-CAPI-CSTCHG-RATIO   PIC 9V999.
120600             15  P-NEW-CAPI-NEW-HOSP       PIC X.
120700             15  P-NEW-CAPI-IME            PIC 9V9999.
120800             15  P-NEW-CAPI-EXCEPTIONS     PIC 9(04)V99.
120900         05  P-NEW-HVBP-HRR-DATA.
121000             15  P-NEW-VAL-BASED-PURCH-PARTIPNT PIC X.
121100             15  P-NEW-VAL-BASED-PURCH-ADJUST   PIC 9V9(11).
121200             15  P-NEW-HOSP-READMISSION-REDU    PIC X.
121300             15  P-NEW-HOSP-HRR-ADJUSTMT        PIC 9V9(4).
121400         05  P-MODEL1-BUNDLE-DATA.
121500             15  P-MODEL1-BUNDLE-DISPRCNT   PIC V999.
121600             15  P-HAC-REDUC-IND            PIC X.
121700             15  P-UNCOMP-CARE-AMOUNT       PIC 9(07)V99.
121800             15  P-EHR-REDUC-IND            PIC X.
121900         05  FILLER                         PIC X(09).
122000*
122100**************************************************************
122200*      THIS IS THE PROV-RECORD THAT WILL BE PASSED TO        *
122300*      THE PPCAL984 PROGRAM AND PRIOR PPCAL MODULES          *
122400*      FOR PROCESSING --- OLD PSF FORMAT                     *
122500**************************************************************
122600 01  PROV-HOLD.
122700     02  PROV-REC-HOLD1.
122800         05  P-PROVIDER-NO.
122900             10  P-STATE                PIC 9(02).
123000             10  FILLER                 PIC X(04).
123100         05  P-EFF-DATE.
123200             10  P-EFF-YY               PIC 9(02).
123300             10  P-EFF-MM               PIC 9(02).
123400             10  P-EFF-DD               PIC 9(02).
123500         05  P-WAIVER-CODE              PIC X(01).
123600             88  WAIVER-STATE           VALUE 'Y'.
123700         05  P-PROVIDER-TYPE            PIC X(02).
123800             88  SOLE-COMMUNITY-PROV    VALUE '01' '11'.
123900             88  REFERRAL-CENTER        VALUE '07' '11' '15' '17'.
124000             88  INDIAN-HEALTH-SERVICE  VALUE '08'.
124100             88  REDESIGNATED-RURAL-YR1 VALUE '09'.
124200             88  REDESIGNATED-RURAL-YR2 VALUE '10'.
124300             88  SOLE-COM-REF-CENT      VALUE '11'.
124400             88  MDH-REBASED-FY90       VALUE '14' '15'.
124500             88  MDH-RRC-REBASED-FY90   VALUE '15'.
124600             88  SCH-REBASED-FY90       VALUE '16' '17'.
124700             88  SCH-RRC-REBASED-FY90   VALUE '17'.
124800             88  MEDICAL-ASSIST-FACIL   VALUE '18'.
124900             88  EACH                   VALUE '21'.
125000             88  EACH-REF-CTR           VALUE '22'.
125100         05  P-CURRENT-CENSUS-DIV       PIC 9(01).
125200             88  NEW-ENGLAND            VALUE  1.
125300             88  MIDDLE-ATLANTIC        VALUE  2.
125400             88  SOUTH-ATLANTIC         VALUE  3.
125500             88  EAST-NORTH-CENTRAL     VALUE  4.
125600             88  EAST-SOUTH-CENTRAL     VALUE  5.
125700             88  WEST-NORTH-CENTRAL     VALUE  6.
125800             88  WEST-SOUTH-CENTRAL     VALUE  7.
125900             88  MOUNTAIN               VALUE  8.
126000             88  PACIFIC                VALUE  9.
126100         05  P-PPS-BLEND-YEAR           PIC 9(01).
126200             88  VALID-PPS-BLEND-YEAR   VALUE 0 THRU 9.
126300         05  P-MSA-X.
126400             10  P-RURAL                PIC X(04).
126500                 88  RURAL              VALUE   '9999'.
126600         05  P-MSA-9 REDEFINES P-MSA-X  PIC 9(04).
126700         05  P-FISCAL-YEAR-END.
126800             10  P-MM                   PIC 9(02).
126900             10  P-DD                   PIC 9(02).
127000             10  P-YY                   PIC 9(02).
127100         05  P-VARIABLES.
127200             10  P-CMI-ADJ-CPD          PIC S9(05)V9(02).
127300             10  P-COLA                 PIC S9(01)V9(03).
127400             10  P-INTERN-RATIO         PIC S9(01)V9(04).
127500             10  PRUP-UPDT-FACTOR       PIC S9(01)V9(05).
127600             10  P-BED-SIZE             PIC  9(05).
127700             10  P-DSH-PERCENT          PIC V9(04).
127800             10  P-CCR                  PIC  9(01)V9(03).
127900             10  P-CMI                  PIC  9(01)V9(04).
128000             10  FILLER                 PIC  9(01).
128100             10  P-REPORT-DATE          PIC  9(06).
128200             10  FILLER                 PIC  9(01).
128300             10  P-INTER-NO             PIC  9(05).
128400     02  PROV-REC-HOLD2.
128500         05  P-FY-BEGIN-DATE            PIC 9(6).
128600         05  P-PASS-AMT-CAPITAL         PIC 9(4)V99.
128700         05  P-PASS-AMT-DIR-MED-ED      PIC 9(4)V99.
128800         05  P-PASS-AMT-ORGAN-ACQ       PIC 9(4)V99.
128900         05  P-PASS-AMT-PLUS-MISC       PIC 9(4)V99.
129000         05  P-SSI-RATIO                PIC V9(4).
129100         05  P-MEDICAID-RATIO           PIC V9(4).
129200         05  P-TERMINATION-DATE         PIC X(6).
129300         05  P-WAGE-INDEX-LOC-MSA       PIC X(4).
129400         05  P-CHG-CODE-INDEX           PIC X.
129500         05  P-STAND-AMT-LOC-MSA.
129600             10  P-RURAL-1ST.
129700                 88  P-RURAL-CHECK        VALUE '  '.
129800                 15  P-STAND-RURAL      PIC XX.
129900             10  P-RURAL-2ND            PIC XX.
130000         05  P-CAPI-SOL-HOSP-RATE       PIC XX.
130100         05  P-LUGAR                    PIC X.
130200         05  P-TEMP-RELIEF-IND          PIC X.
130300         05  FILLER                     PIC X(23).
130400     02  PROV-REC-HOLD3.
130500         05  P-CAPI-PPS-PAY-CODE        PIC X.
130600         05  P-CAPI-HOSP-SPEC-RATE      PIC 9(4)V99.
130700         05  P-CAPI-OLD-HARM-RATE       PIC 9(4)V99.
130800         05  P-CAPI-NEW-HARM-RATIO      PIC 9(1)V9999.
130900         05  P-CAPI-CSTCHG-RATIO        PIC 9V999.
131000         05  P-CAPI-NEW-HOSP            PIC X.
131100         05  P-CAPI-IME                 PIC 9V9999.
131200         05  P-CAPI-EXCEPTIONS          PIC 9(4)V99.
131300         05  P-HVBP-HRR-DATA.
131400             15  P-VAL-BASED-PURCH-PARTIPNT PIC X.
131500             15  P-VAL-BASED-PURCH-ADJUST   PIC 9V9(11).
131600             15  P-HOSP-READMISSION-REDU    PIC X.
131700             15  P-HOSP-HRR-ADJUSTMT        PIC 9V9(4).
131800         05  FILLER                         PIC X(04).
131900
132000**************************************************************
132100*  OLD BILL FORMAT                                           *
132200*      THIS IS THE BILL-RECORD THAT WILL BE PASSED TO        *
132300*      THE PPCAL983 PROGRAM AND PRIOR PPCAL MODULES          *
132400*      FOR PROCESSING --- OLD BILL FORMAT                    *
132500**************************************************************
132600 01  BILL-DATA.
132700         10  B-PROVIDER-NO          PIC X(06).
132800         10  B-REVIEW-CODE          PIC 9(02).
132900             88  VALID-REVIEW-CODE     VALUE 00 THRU 08.
133000             88  PAY-WITH-OUTLIER      VALUE 00 07.
133100             88  PAY-DAYS-OUTLIER      VALUE 01.
133200             88  PAY-COST-OUTLIER      VALUE 02.
133300             88  PAY-PERDIEM-DAYS      VALUE 03.
133400             88  PAY-AVG-STAY-ONLY     VALUE 04.
133500             88  PAY-XFER-WITH-COST    VALUE 05.
133600             88  PAY-XFER-NO-COST      VALUE 06.
133700             88  PAY-WITHOUT-COST      VALUE 07.
133800             88  PAY-DRG-480           VALUE 08.
133900         10  B-DRG                  PIC 9(03).
134000         10  B-LOS                  PIC 9(03).
134100         10  B-COVERED-DAYS         PIC 9(03).
134200         10  B-LTR-DAYS             PIC 9(02).
134300         10  B-DISCHARGE-DATE.
134400             15  B-DISCHG-MM        PIC 9(02).
134500             15  B-DISCHG-DD        PIC 9(02).
134600             15  B-DISCHG-YY        PIC 9(02).
134700         10  B-CHARGES-CLAIMED      PIC 9(07)V9(02).
134800
134900 LINKAGE SECTION.
135000
135100***************************************************************
135200*  NEW BILL FORMAT    MILLINNIUM COMPATIBLE                  *
135300*      THIS IS THE BILL-RECORD THAT WILL BE PASSED TO        *
135400*      THE PPCAL001 PROGRAM AND AFTER FOR PROCESSING         *
135500*      IN THE NEW FORMAT                                     *
135600**************************************************************
135700 01  BILL-NEW-DATA.
135800         10  B-N-NPI10.
135900            15  B-N-NPI8              PIC X(08).
136000            15  B-N-NPI-FILLER        PIC X(02).
136100         10  B-N-PROVIDER-NO          PIC X(06).
136200         10  B-N-REVIEW-CODE          PIC 9(02).
136300             88  N-VALID-REVIEW-CODE    VALUE 00 THRU 09 11.
136400             88  N-PAY-WITH-OUTLIER     VALUE 00 07.
136500             88  N-PAY-DAYS-OUTLIER     VALUE 01.
136600             88  N-PAY-COST-OUTLIER     VALUE 02.
136700             88  N-PAY-PERDIEM-DAYS     VALUE 03.
136800             88  N-PAY-AVG-STAY-ONLY    VALUE 04.
136900             88  N-PAY-XFER-WITH-COST   VALUE 05.
137000             88  N-PAY-XFER-NO-COST     VALUE 06.
137100             88  N-PAY-WITHOUT-COST     VALUE 07.
137200             88  N-PAY-DRG-480          VALUE 08.
137300             88  N-PAY-XFER-SPEC-DRG    VALUE 09 11.
137400             88  N-PAY-XFER-SPEC-DRG-NO-COST VALUE 11.
137500         10  B-N-DRG                  PIC 9(03).
137600         10  B-N-LOS                  PIC 9(03).
137700         10  B-N-COVERED-DAYS         PIC 9(03).
137800         10  B-N-LTR-DAYS             PIC 9(02).
137900         10  B-N-DISCHARGE-DATE.
138000             15  B-N-DISCHG-CC        PIC 9(02).
138100             15  B-N-DISCHG-YY        PIC 9(02).
138200             15  B-N-DISCHG-MM        PIC 9(02).
138300             15  B-N-DISCHG-DD        PIC 9(02).
138400         10  B-N-CHARGES-CLAIMED      PIC 9(07)V9(02).
138500         10  B-N-PRIN-PROC-CODE       PIC X(07).
138600         10  B-N-OTHER-PROC-CODE1     PIC X(07).
138700         10  B-N-OTHER-PROC-CODE2     PIC X(07).
138800         10  B-N-OTHER-PROC-CODE3     PIC X(07).
138900         10  B-N-OTHER-PROC-CODE4     PIC X(07).
139000         10  B-N-OTHER-PROC-CODE5     PIC X(07).
139100         10  B-N-OTHER-PROC-CODE6    PIC X(07).
139200         10  B-N-OTHER-PROC-CODE7    PIC X(07).
139300         10  B-N-OTHER-PROC-CODE8    PIC X(07).
139400         10  B-N-OTHER-PROC-CODE9    PIC X(07).
139500         10  B-N-OTHER-PROC-CODE10   PIC X(07).
139600         10  B-N-OTHER-PROC-CODE11   PIC X(07).
139700         10  B-N-OTHER-PROC-CODE12   PIC X(07).
139800         10  B-N-OTHER-PROC-CODE13   PIC X(07).
139900         10  B-N-OTHER-PROC-CODE14   PIC X(07).
140000         10  B-N-OTHER-PROC-CODE15   PIC X(07).
140100         10  B-N-OTHER-PROC-CODE16   PIC X(07).
140200         10  B-N-OTHER-PROC-CODE17   PIC X(07).
140300         10  B-N-OTHER-PROC-CODE18   PIC X(07).
140400         10  B-N-OTHER-PROC-CODE19   PIC X(07).
140500         10  B-N-OTHER-PROC-CODE20   PIC X(07).
140600         10  B-N-OTHER-PROC-CODE21   PIC X(07).
140700         10  B-N-OTHER-PROC-CODE22   PIC X(07).
140800         10  B-N-OTHER-PROC-CODE23   PIC X(07).
140900         10  B-N-OTHER-PROC-CODE24   PIC X(07).
141000         10  B-N-OTHER-DIAG-CODE1   PIC X(07).
141100         10  B-N-OTHER-DIAG-CODE2   PIC X(07).
141200         10  B-N-OTHER-DIAG-CODE3   PIC X(07).
141300         10  B-N-OTHER-DIAG-CODE4   PIC X(07).
141400         10  B-N-OTHER-DIAG-CODE5   PIC X(07).
141500         10  B-N-OTHER-DIAG-CODE6   PIC X(07).
141600         10  B-N-OTHER-DIAG-CODE7   PIC X(07).
141700         10  B-N-OTHER-DIAG-CODE8   PIC X(07).
141800         10  B-N-OTHER-DIAG-CODE9   PIC X(07).
141900         10  B-N-OTHER-DIAG-CODE10  PIC X(07).
142000         10  B-N-OTHER-DIAG-CODE11  PIC X(07).
142100         10  B-N-OTHER-DIAG-CODE12  PIC X(07).
142200         10  B-N-OTHER-DIAG-CODE13  PIC X(07).
142300         10  B-N-OTHER-DIAG-CODE14  PIC X(07).
142400         10  B-N-OTHER-DIAG-CODE15  PIC X(07).
142500         10  B-N-OTHER-DIAG-CODE16  PIC X(07).
142600         10  B-N-OTHER-DIAG-CODE17  PIC X(07).
142700         10  B-N-OTHER-DIAG-CODE18  PIC X(07).
142800         10  B-N-OTHER-DIAG-CODE19  PIC X(07).
142900         10  B-N-OTHER-DIAG-CODE20  PIC X(07).
143000         10  B-N-OTHER-DIAG-CODE21  PIC X(07).
143100         10  B-N-OTHER-DIAG-CODE22  PIC X(07).
143200         10  B-N-OTHER-DIAG-CODE23  PIC X(07).
143300         10  B-N-OTHER-DIAG-CODE24  PIC X(07).
143400         10  B-N-OTHER-DIAG-CODE25  PIC X(07).
143500         10  B-N-DEMO-DATA.
143600             15  B-N-DEMO-CODE1        PIC X(02).
143700             15  B-N-DEMO-CODE2        PIC X(02).
143800             15  B-N-DEMO-CODE3        PIC X(02).
143900             15  B-N-DEMO-CODE4        PIC X(02).
144000         10  B-N-NDC-DATA.
144100             15  B-N-NDC-NUMBER        PIC X(11).
144200         10  FILLER                     PIC X(73).
144300
144400
144500 01  PPS-DATA.
144600         10  PPS-RTC                PIC 9(02).
144700         10  PPS-WAGE-INDX          PIC 9(02)V9(04).
144800         10  PPS-OUTLIER-DAYS       PIC 9(03).
144900         10  PPS-AVG-LOS            PIC 9(02)V9(01).
145000         10  PPS-DAYS-CUTOFF        PIC 9(02)V9(01).
145100         10  PPS-OPER-IME-ADJ       PIC 9(06)V9(02).
145200         10  PPS-TOTAL-PAYMENT      PIC 9(07)V9(02).
145300         10  PPS-OPER-HSP-PART      PIC 9(06)V9(02).
145400         10  PPS-OPER-FSP-PART      PIC 9(06)V9(02).
145500         10  PPS-OPER-OUTLIER-PART  PIC 9(07)V9(02).
145600         10  PPS-REG-DAYS-USED      PIC 9(03).
145700         10  PPS-LTR-DAYS-USED      PIC 9(02).
145800         10  PPS-OPER-DSH-ADJ       PIC 9(06)V9(02).
145900         10  PPS-CALC-VERS          PIC 9(05).
146000
146100 01  PRICER-OPT-VERS-SW.
146200     02  PRICER-OPTION-SW               PIC X(01).
146300         88  ALL-TABLES-PASSED          VALUE 'A'.
146400         88  PROV-RECORD-PASSED         VALUE 'P'.
146500         88  ADDITIONAL-VARIABLES       VALUE 'M'.
146600     02  PPS-VERSIONS.
146700         10  PPDRV-VERSION              PIC X(05).
146800
146900 01  PPS-ADDITIONAL-VARIABLES.
147000     02  PPS-OPERATION-VARIABLES.
147100         05  PPS-HSP-PCT                PIC 9(01)V9(02).
147200         05  PPS-FSP-PCT                PIC 9(01)V9(02).
147300         05  PPS-NAT-PCT                PIC 9(01)V9(02).
147400         05  PPS-REG-PCT                PIC 9(01)V9(02).
147500         05  PPS-CMI-ADJ-CPD            PIC 9(05)V9(02).
147600         05  PPS-UPDATE-FACTOR          PIC 9(01)V9(05).
147700         05  PPS-DRG-WT                 PIC 9(02)V9(04).
147800         05  PPS-NAT-LABOR              PIC 9(05)V9(02).
147900         05  PPS-NAT-NLABOR             PIC 9(05)V9(02).
148000         05  PPS-REG-LABOR              PIC 9(05)V9(02).
148100         05  PPS-REG-NLABOR             PIC 9(05)V9(02).
148200         05  PPS-OPER-COLA              PIC 9(01)V9(03).
148300         05  PPS-INTERN-RATIO           PIC 9(01)V9(04).
148400         05  PPS-OPER-OUTLIER           PIC 9(07)V9(09).
148500         05  PPS-OPER-BILL-COSTS        PIC 9(07)V9(09).
148600         05  PPS-OPER-DOLLAR-THRESHOLD  PIC 9(07)V9(09).
148700         05  PPS-DSCHG-FRCTN            PIC 9(1)V9999.
148800         05  PPS-DRG-WT-FRCTN           PIC 9(2)V9999.
148900         05  PPS-CAPITAL-VARIABLES.
149000             10  PPS-CAPI-TOTAL-PAY         PIC S9(07)V9(02).
149100             10  PPS-CAPI-HSP               PIC S9(07)V9(02).
149200             10  PPS-CAPI-FSP               PIC S9(07)V9(02).
149300             10  PPS-CAPI-OUTLIER           PIC S9(07)V9(02).
149400             10  PPS-CAPI-OLD-HARM          PIC S9(07)V9(02).
149500             10  PPS-CAPI-DSH-ADJ           PIC S9(07)V9(02).
149600             10  PPS-CAPI-IME-ADJ           PIC S9(07)V9(02).
149700             10  PPS-CAPI-EXCEPTIONS        PIC S9(07)V9(02).
149800         05  PPS-CAPITAL2-VARIABLES.
149900             10  PPS-CAPI2-PAY-CODE          PIC X(1).
150000             10  PPS-CAPI2-B-FSP             PIC S9(07)V9(02).
150100             10  PPS-CAPI2-B-OUTLIER         PIC S9(07)V9(02).
150200         05  PPS-OTHER-VARIABLES.
150300             10  PPS-NON-TEMP-RELIEF-PAYMENT PIC 9(07)V9(02).
150400             10  PPS-NEW-TECH-PAY-ADD-ON     PIC 9(07)V9(02).
150500             10  PPS-LOW-VOL-PAYMENT         PIC 9(07)V9(02).
150600         05  PPS-HVBP-HRR-DATA.
150700             10  PPS-VAL-BASED-PURCH-PARTIPNT PIC X.
150800             10  PPS-VAL-BASED-PURCH-ADJUST   PIC 9V9(11).
150900             10  PPS-HOSP-READMISS-REDUCTN    PIC X.
151000             10  PPS-HOSP-HRR-ADJUSTMT        PIC 9V9(4).
151100         05  PPS-OPERATNG-DATA.
151200             10  PPS-MODEL1-BUNDLE-DISPRCNT  PIC V999.
151300             10  PPS-OPER-BASE-DRG-PAY       PIC 9(08)V99.
151400             10  PPS-OPER-HSP-AMT            PIC 9(08)V99.
151500        10  PPS-PC-VARIABLES.
151600             15  PPS-OPER-DSH                PIC 9(01)V9(04).
151700             15  PPS-CAPI-DSH                PIC 9(01)V9(04).
151800             15  PPS-CAPI-HSP-PCT            PIC 9(01)V9(02).
151900             15  PPS-CAPI-FSP-PCT            PIC 9(01)V9(04).
152000             15  PPS-ARITH-ALOS              PIC 9(02)V9(01).
152100             15  PPS-PR-WAGE-INDEX           PIC 9(02)V9(04).
152200             15  PPS-TRANSFER-ADJ            PIC 9(01)V9(04).
152300             15  PPS-PC-HMO-FLAG             PIC X(01).
152400             15  PPS-PC-COT-FLAG             PIC X(01).
152500             15  PPS-OPER-HSP-PART2          PIC 9(07)V9(02).
152600             15  PPS-BUNDLE-ADJUST-AMT       PIC S9(07)V99.
152700        10  PPS-ADDITIONAL-PAY-INFO-DATA.
152800             15  PPS-UNCOMP-CARE-AMOUNT         PIC S9(07)V9(02).
152900             15  PPS-BUNDLE-ADJUST-AMT          PIC S9(07)V9(02).
153000             15  PPS-VAL-BASED-PURCH-ADJUST-AMT PIC S9(07)V9(02).
153100             15  PPS-READMIS-ADJUST-AMT         PIC S9(07)V9(02).
153200        10  PPS-ADDITIONAL-PAY-INFO-DATA2.
153300             15  PPS-HAC-PROG-REDUC-IND         PIC X.
153400             15  PPS-EHR-PROG-REDUC-IND         PIC X.
153500             15  PPS-EHR-ADJUST-AMT             PIC S9(07)V9(02).
153600             15  PPS-STNDRD-VALUE               PIC S9(07)V9(02).
153700             15  PPS-FLX6-PAYMENT               PIC S9(07)V9(02).
153800             15  PPS-FLX7-PAYMENT               PIC S9(07)V9(02).
153900        10  PPS-FILLER                          PIC X(0906).
154000*******************************************************
154100
154200 01  PROV-RECORD.
154300     05  PROV-RECORD1               PIC X(80).
154400     05  PROV-RECORD2               PIC X(80).
154500     05  PROV-RECORD3               PIC X(100).
154600
154700
154800 01  MSAX-WI-TABLE.
154900     05  M-MSAX-DATA                OCCURS 7000
155000                                    INDEXED BY MU1 MU2 MU3.
155100         10  M-MSAX-MSA             PIC X(4).
155200         10  M-MSAX-SIZE            PIC X(01).
155300         10  M-MSAX-EFF-DATE        PIC X(08).
155400         10  M-MSAX-WAGE-INDX1      PIC S9(02)V9(04).
155500         10  M-MSAX-WAGE-INDX2      PIC S9(02)V9(04).
155600
155700 01  CBSA-WI-TABLE.
155800     05  T-CBSA-DATA                  OCCURS 5000
155900                                    INDEXED BY MA1 MA2 MA3.
156000         10  T-CBSA                   PIC X(5).
156100         10  T-CBSA-SIZE              PIC X(01).
156200         10  T-CBSA-EFF-DATE          PIC X(08).
156300         10  T-CBSA-WAGE-INDX1        PIC S9(02)V9(04).
156400         10  T-CBSA-WAGE-INDX2        PIC S9(02)V9(04).
156500
156600*****************************************************************
156700 PROCEDURE DIVISION  USING BILL-NEW-DATA
156800                           PPS-DATA
156900                           PRICER-OPT-VERS-SW
157000                           PPS-ADDITIONAL-VARIABLES
157100                           PROV-RECORD
157200                           MSAX-WI-TABLE
157300                           CBSA-WI-TABLE.
157400
157500*****************************************************************
157600*    PROCESSING:
157700*        A. THIS MODULE WILL CALL THE PPCAL MODULES.
157800*        B. THE PROV-RECORD AND WAGE-INDEX-RECORD ASSOCIATED WITH
157900*           EACH BILL WILL BE PASSED TO THE PPCAL PROGRAMS.
158000*****************************************************************
158100
158200     MOVE DRV-VERSION TO PPDRV-VERSION.
158300
158400     MOVE ALL '0' TO PPS-DATA.
158500     MOVE ZEROES  TO W-PR-INDEX-RECORD
158600                     W-NEW-INDEX-RECORD
158700                     W-NEW-PR-INDEX-RECORD
158800                     W-NEW-CBSA-PR-WI.
158900
159000
159100     MOVE PROV-RECORD TO PROV-NEW-HOLD.
159200
159300*****************************************************************
159400
159500***     RTC = 98 >> A BILL OLDER THEN 20021001
159600***
159700***   THIS NEXT STATEMENT WILL ONLY ALLOW
159800***      THE LATEST 5 YEARS TO PROCESS
159900***
160000
160100***  IF B-N-DISCHARGE-DATE < 20021001
160200***          MOVE ALL '0' TO  PPS-ADDITIONAL-VARIABLES
160300***          MOVE 98 TO PPS-RTC
160400***          GOBACK.
160500***
160600*****************************************************************
160700
160800 0030-GET-WAGE-INDEX.
160900***  GET THE WAGE-INDEX
161000
161100     IF B-N-DISCHARGE-DATE > 19990930 AND
161200        B-N-DISCHARGE-DATE < 20001001
161300      IF (P-NEW-CHG-CODE-INDEX = 'Y' AND
161400          P-NEW-GEO-LOC-MSAX = P-NEW-WAGE-INDEX-LOC-MSA)
161500          AND (P-NEW-GEO-LOC-MSAX NOT = '1600' AND NOT = '3285'
161600                            AND   NOT = '5600' AND NOT = '1520'
161700                            AND   NOT = '1640' AND NOT = '0240'
161800                            AND   NOT = '3360' AND NOT = '1123')
161900          MOVE ALL '0' TO PPS-ADDITIONAL-VARIABLES
162000          MOVE 52 TO PPS-RTC
162100          GOBACK.
162200
162300     IF P-NEW-EFF-DATE < 20041001
162400        IF '*' = P-NEW-GEO-MSA-1ST OR
162500                 P-NEW-GEO-MSA-2ND OR
162600                 P-NEW-GEO-MSA-3RD OR
162700                 P-NEW-GEO-MSA-4TH
162800         MOVE ALL '0' TO PPS-ADDITIONAL-VARIABLES
162900         MOVE 52 TO PPS-RTC
163000         GOBACK.
163100
163200     IF P-NEW-EFF-DATE < 20041001 AND
163300        B-N-DISCHARGE-DATE > 20040930
163400        MOVE 52 TO PPS-RTC
163500        GOBACK.
163600
163700     IF P-NEW-EFF-DATE > 20040930
163800        IF '*' = P-NEW-CBSA-GEO-1ST OR
163900                 P-NEW-CBSA-GEO-2ND OR
164000                 P-NEW-CBSA-GEO-3RD OR
164100                 P-NEW-CBSA-GEO-4TH OR
164200                 P-NEW-CBSA-GEO-5TH
164300         MOVE ALL '0' TO PPS-ADDITIONAL-VARIABLES
164400         MOVE 52 TO PPS-RTC
164500         GOBACK.
164600
164700     IF P-NEW-EFF-DATE < 20041001
164800        IF (P-NEW-WAGE-INDEX-LOC-MSA = '    ' OR
164900            P-NEW-WAGE-INDEX-LOC-MSA = '0000')
165000            MOVE P-NEW-GEO-LOC-MSA9 TO P-NEW-WAGE-INDEX-LOC-MSA.
165100     IF P-NEW-EFF-DATE < 20041001
165200        IF (P-NEW-STAND-AMT-LOC-MSA = '    ' OR
165300            P-NEW-STAND-AMT-LOC-MSA = '0000')
165400            MOVE P-NEW-GEO-LOC-MSA9 TO P-NEW-STAND-AMT-LOC-MSA.
165500
165600     IF P-NEW-EFF-DATE > 20040930
165700        IF (P-NEW-CBSA-RECLASS-LOC = '     ' OR
165800            P-NEW-CBSA-RECLASS-LOC = '00000')
165900            MOVE P-NEW-CBSA-GEO-LOC9 TO P-NEW-CBSA-RECLASS-LOC.
166000     IF P-NEW-EFF-DATE > 20040930
166100        IF (P-NEW-CBSA-STAND-AMT-LOC = '     ' OR
166200            P-NEW-CBSA-STAND-AMT-LOC = '00000')
166300            MOVE P-NEW-CBSA-GEO-LOC9 TO P-NEW-CBSA-STAND-AMT-LOC.
166400
166500     IF P-NEW-EFF-DATE < 20041001
166600        PERFORM 0500-GET-MSA THRU 0500-EXIT
166700     ELSE
166800        PERFORM 0550-GET-CBSA THRU 0550-EXIT.
166900
167000***     RTC = 52  --  WAGE-INDEX NOT FOUND
167100     IF PPS-RTC = 52
167200          MOVE ALL '0' TO  PPS-ADDITIONAL-VARIABLES
167300          GOBACK.
167400
167500*****************************************************************
167600**            FY 2014 "HEALTH REFORM"                       *****
167700**          THIS NEXT CALL WILL PROCESS 2014 BILLS  WITH
167800**              A DISCHARGE DATE ON OR AFTER 20131001
167900*****************************************************************
168000     IF B-N-DISCHARGE-DATE
168100              > 20130930
168200         CALL  PPCAL147 USING BILL-NEW-DATA
168300                              PPS-DATA
168400                              PRICER-OPT-VERS-SW
168500                              PPS-ADDITIONAL-VARIABLES
168600                              PROV-NEW-HOLD
168700                              WAGE-NEW-CBSA-INDEX-RECORD
168800         GOBACK.
168900*****************************************************************
169000*****************************************************************
169100*****************************************************************
169200**            FY 2013 "HEALTH REFORM"                       *****
169300**          THIS NEXT CALL WILL PROCESS 2011 BILLS  WITH
169400**              A DISCHARGE DATE ON OR AFTER 20121001
169500*****************************************************************
169600     IF B-N-DISCHARGE-DATE
169700              > 20120930
169800         CALL  PPCAL134 USING BILL-NEW-DATA
169900                              PPS-DATA
170000                              PRICER-OPT-VERS-SW
170100                              PPS-ADDITIONAL-VARIABLES
170200                              PROV-NEW-HOLD
170300                              WAGE-NEW-CBSA-INDEX-RECORD
170400         GOBACK.
170500*****************************************************************
170600*****************************************************************
170700*****************************************************************
170800**            FY 2012 "HEALTH REFORM"                       *****
170900**          THIS NEXT CALL WILL PROCESS 2011 BILLS  WITH
171000**              A DISCHARGE DATE ON OR AFTER 20111001
171100*****************************************************************
171200     IF B-N-DISCHARGE-DATE
171300              > 20110930
171400         CALL  PPCAL124 USING BILL-NEW-DATA
171500                              PPS-DATA
171600                              PRICER-OPT-VERS-SW
171700                              PPS-ADDITIONAL-VARIABLES
171800                              PROV-NEW-HOLD
171900                              WAGE-NEW-CBSA-INDEX-RECORD
172000         GOBACK.
172100*****************************************************************
172200*****************************************************************
172300**            FY 2011 "HEALTH REFORM"                       *****
172400**          THIS NEXT CALL WILL PROCESS 2011 BILLS  WITH
172500**              A DISCHARGE DATE ON OR AFTER 20101001
172600*****************************************************************
172700     IF B-N-DISCHARGE-DATE
172800              > 20100930
172900         CALL  PPCAL118 USING BILL-NEW-DATA
173000                              PPS-DATA
173100                              PRICER-OPT-VERS-SW
173200                              PPS-ADDITIONAL-VARIABLES
173300                              PROV-NEW-HOLD
173400                              WAGE-NEW-CBSA-INDEX-RECORD
173500         GOBACK.
173600*****************************************************************
173700*****************************************************************
173800**            FY 2010 "HEALTH REFORM"                       *****
173900**          THIS NEXT CALL WILL PROCESS 2010 BILLS  WITH
174000**              A DISCHARGE DATE ON OR AFTER 20100401
174100*****************************************************************
174200     IF B-N-DISCHARGE-DATE
174300              > 20100331
174400         CALL  PPCAL10P USING BILL-NEW-DATA
174500                              PPS-DATA
174600                              PRICER-OPT-VERS-SW
174700                              PPS-ADDITIONAL-VARIABLES
174800                              PROV-NEW-HOLD
174900                              WAGE-NEW-CBSA-INDEX-RECORD
175000         GOBACK.
175100*****************************************************************
175200*****************************************************************
175300**          THIS NEXT CALL WILL PROCESS 2010 BILLS  WITH
175400**        A DISCHARGE DATE ON OR AFTER 20091001 TO 4/01/2010
175500*****************************************************************
175600     IF B-N-DISCHARGE-DATE
175700              > 20090930
175800         CALL  PPCAL10O USING BILL-NEW-DATA
175900                              PPS-DATA
176000                              PRICER-OPT-VERS-SW
176100                              PPS-ADDITIONAL-VARIABLES
176200                              PROV-NEW-HOLD
176300                              WAGE-NEW-CBSA-INDEX-RECORD
176400         GOBACK.
176500*****************************************************************
176600*****************************************************************
176700**          THIS NEXT CALL WILL PROCESS 2009 BILLS  WITH
176800**              A DISCHARGE DATE ON OR AFTER 20081001
176900*****************************************************************
177000     IF B-N-DISCHARGE-DATE
177100              > 20080930
177200         CALL  PPCAL09D USING BILL-NEW-DATA
177300                              PPS-DATA
177400                              PRICER-OPT-VERS-SW
177500                              PPS-ADDITIONAL-VARIABLES
177600                              PROV-NEW-HOLD
177700                              WAGE-NEW-CBSA-INDEX-RECORD
177800         GOBACK.
177900*****************************************************************
178000*****************************************************************
178100**          THIS NEXT CALL WILL PROCESS 2008 BILLS  WITH
178200**              A DISCHARGE DATE ON OR AFTER 20071001
178300*****************************************************************
178400     IF B-N-DISCHARGE-DATE
178500              > 20070930
178600         CALL  PPCAL08D USING BILL-NEW-DATA
178700                              PPS-DATA
178800                              PRICER-OPT-VERS-SW
178900                              PPS-ADDITIONAL-VARIABLES
179000                              PROV-NEW-HOLD
179100                              WAGE-NEW-CBSA-INDEX-RECORD
179200         GOBACK.
179300*****************************************************************
179400*****************************************************************
179500**          THIS NEXT CALL WILL PROCESS 2007 BILLS  WITH
179600**              A DISCHARGE DATE ON OR AFTER 20061001
179700*****************************************************************
179800     IF B-N-DISCHARGE-DATE
179900              > 20060930
180000         CALL  PPCAL07B USING BILL-NEW-DATA
180100                              PPS-DATA
180200                              PRICER-OPT-VERS-SW
180300                              PPS-ADDITIONAL-VARIABLES
180400                              PROV-NEW-HOLD
180500                              WAGE-NEW-CBSA-INDEX-RECORD
180600         GOBACK.
180700*****************************************************************
180800*****************************************************************
180900**          THIS NEXT CALL WILL PROCESS 2006 BILLS  WITH
181000**              A DISCHARGE DATE ON OR AFTER 20051001
181100*****************************************************************
181200     IF B-N-DISCHARGE-DATE
181300              > 20050930
181400         CALL  PPCAL069 USING BILL-NEW-DATA
181500                              PPS-DATA
181600                              PRICER-OPT-VERS-SW
181700                              PPS-ADDITIONAL-VARIABLES
181800                              PROV-NEW-HOLD
181900                              WAGE-NEW-CBSA-INDEX-RECORD
182000         GOBACK.
182100*****************************************************************
182200*****************************************************************
182300*****************************************************************
182400*****************************************************************
182500**          THIS NEXT CALL WILL PROCESS 2005 BILLS  WITH
182600**              A DISCHARGE DATE ON OR AFTER 20041001
182700*****************************************************************
182800     IF B-N-DISCHARGE-DATE
182900              > 20040930
183000         CALL  PPCAL058 USING BILL-NEW-DATA
183100                              PPS-DATA
183200                              PRICER-OPT-VERS-SW
183300                              PPS-ADDITIONAL-VARIABLES
183400                              PROV-NEW-HOLD
183500                              WAGE-NEW-CBSA-INDEX-RECORD
183600         GOBACK.
183700*****************************************************************
183800*****************************************************************
183900*****************************************************************
184000**          THIS NEXT CALL WILL PROCESS 2004 BILLS  WITH
184100**              A DISCHARGE DATE ON OR AFTER 20031001
184200*****************************************************************
184300     IF B-N-DISCHARGE-DATE
184400              > 20030930
184500         CALL  PPCAL04D USING BILL-NEW-DATA
184600                              PPS-DATA
184700                              PRICER-OPT-VERS-SW
184800                              PPS-ADDITIONAL-VARIABLES
184900                              PROV-NEW-HOLD
185000                              WAGE-NEW-INDEX-RECORD
185100         GOBACK.
185200*****************************************************************
185300*****************************************************************
185400*****************************************************************
185500**          THIS NEXT CALL WILL PROCESS 2003 BILLS  WITH
185600**              A DISCHARGE DATE ON OR AFTER 20021001
185700*****************************************************************
185800     IF B-N-DISCHARGE-DATE
185900              > 20020930
186000         CALL  PPCAL038 USING BILL-NEW-DATA
186100                              PPS-DATA
186200                              PRICER-OPT-VERS-SW
186300                              PPS-ADDITIONAL-VARIABLES
186400                              PROV-NEW-HOLD
186500                              WAGE-NEW-INDEX-RECORD
186600         GOBACK.
186700*****************************************************************
186800*****************************************************************
186900*****************************************************************
187000**          THIS NEXT CALL WILL PROCESS 2002 BILLS  WITH
187100**              A DISCHARGE DATE ON OR AFTER 20011001
187200*****************************************************************
187300     IF B-N-DISCHARGE-DATE
187400              > 20010930
187500         CALL  PPCAL026 USING BILL-NEW-DATA
187600                              PPS-DATA
187700                              PRICER-OPT-VERS-SW
187800                              PPS-ADDITIONAL-VARIABLES
187900                              PROV-NEW-HOLD
188000                              WAGE-NEW-INDEX-RECORD
188100         GOBACK.
188200*****************************************************************
188300*****************************************************************
188400*****************************************************************
188500**          THIS NEXT CALL WILL PROCESS 2001 BILLS  WITH
188600**              A DISCHARGE DATE ON OR AFTER 20001001
188700*****************************************************************
188800     IF B-N-DISCHARGE-DATE
188900              > 20000930
189000         CALL  PPCAL017 USING BILL-NEW-DATA
189100                              PPS-DATA
189200                              PRICER-OPT-VERS-SW
189300                              PPS-ADDITIONAL-VARIABLES
189400                              PROV-NEW-HOLD
189500                              WAGE-NEW-INDEX-RECORD
189600         GOBACK.
189700*****************************************************************
189800*****************************************************************
189900*****************************************************************
190000**          THIS NEXT CALL WILL PROCESS 2000 BILLS  WITH
190100**              A DISCHARGE DATE ON OR AFTER 19991001
190200*****************************************************************
190300     IF B-N-DISCHARGE-DATE
190400              > 19990930
190500         CALL  PPCAL006 USING BILL-NEW-DATA
190600                              PPS-DATA
190700                              PRICER-OPT-VERS-SW
190800                              PPS-ADDITIONAL-VARIABLES
190900                              PROV-NEW-HOLD
191000                              WAGE-NEW-INDEX-RECORD
191100         GOBACK.
191200*****************************************************************
191300*****************************************************************
191400**          THIS NEXT CALL WILL PROCESS 1999 BILLS  WITH
191500**              A DISCHARGE DATE ON OR AFTER 19981001
191600*****************************************************************
191700     IF B-N-DISCHARGE-DATE
191800              > 19980930
191900         CALL  PPCAL998 USING BILL-NEW-DATA
192000                              PPS-DATA
192100                              PRICER-OPT-VERS-SW
192200                              PPS-ADDITIONAL-VARIABLES
192300                              PROV-NEW-HOLD
192400                              WAGE-NEW-INDEX-RECORD
192500         GOBACK.
192600*****************************************************************
192700*****************************************************************
192800**   MOVE NEW DATA FORMAT INTO OLD DATA FORMAT
192900**   TO PROCESS BEFORE 19981001 NON-MILLENNNIUM STANDARD
193000*****************************************************************
193100     MOVE ALL '9' TO W-PROV-NEW-HOLD.
193200     MOVE PROV-NEW-HOLD TO W-PROV-NEW-HOLD.
193300     PERFORM 2400-CONVERT-PSF.
193400     MOVE W-PROV-OLD-HOLD TO PROV-HOLD.
193500
193600     MOVE W-NEW-MSA             TO W-MSA.
193700     MOVE W-NEW-SIZE            TO W-SIZE.
193800     MOVE W-NEW-EFF-DATE-YMD    TO W-EFF-DATE.
193900     MOVE W-NEW-INDEX-RECORD    TO W-INDEX-RECORD.
194000     MOVE W-NEW-PR-INDEX-RECORD TO W-PR-INDEX-RECORD.
194100
194200     MOVE B-N-PROVIDER-NO  TO B-PROVIDER-NO.
194300     MOVE B-N-REVIEW-CODE  TO B-REVIEW-CODE.
194400     MOVE B-N-DRG          TO B-DRG.
194500     MOVE B-N-LOS          TO B-LOS.
194600     MOVE B-N-COVERED-DAYS TO B-COVERED-DAYS.
194700     MOVE B-N-LTR-DAYS     TO B-LTR-DAYS.
194800     MOVE B-N-DISCHG-YY    TO B-DISCHG-YY.
194900     MOVE B-N-DISCHG-MM    TO B-DISCHG-MM.
195000     MOVE B-N-DISCHG-DD    TO B-DISCHG-DD.
195100     MOVE B-N-CHARGES-CLAIMED TO B-CHARGES-CLAIMED.
195200
195300*****************************************************************
195400**          THIS NEXT CALL WILL PROCESS 1998 BILLS  WITH
195500**              A DISCHARGE DATE ON OR AFTER 19971001
195600*****************************************************************
195700     IF B-N-DISCHARGE-DATE
195800              > 19970930
195900         CALL  PPCAL987 USING BILL-DATA
196000                              PPS-DATA
196100                              PRICER-OPT-VERS-SW
196200                              PPS-ADDITIONAL-VARIABLES
196300                              PROV-HOLD
196400                              WAGE-INDEX-RECORD
196500         GOBACK.
196600*****************************************************************
196700*****************************************************************
196800**          THIS NEXT CALL WILL PROCESS 1997 BILLS  WITH
196900**              A DISCHARGE DATE ON OR AFTER 19961001
197000*****************************************************************
197100     IF B-N-DISCHARGE-DATE
197200              > 19960930
197300         CALL  PPCAL974 USING BILL-DATA
197400                              PPS-DATA
197500                              PRICER-OPT-VERS-SW
197600                              PPS-ADDITIONAL-VARIABLES
197700                              PROV-HOLD
197800                              WAGE-INDEX-RECORD
197900         GOBACK.
198000*****************************************************************
198100*****************************************************************
198200**          THIS NEXT CALL WILL PROCESS 1996 BILLS  WITH
198300**              A DISCHARGE DATE ON OR AFTER 19951001
198400*****************************************************************
198500     IF B-N-DISCHARGE-DATE
198600              > 19950930
198700         CALL  PPCAL964 USING BILL-DATA
198800                              PPS-DATA
198900                              PRICER-OPT-VERS-SW
199000                              PPS-ADDITIONAL-VARIABLES
199100                              PROV-HOLD
199200                              WAGE-INDEX-RECORD
199300         GOBACK.
199400*****************************************************************
199500*****************************************************************
199600**          THIS NEXT CALL WILL PROCESS 1995 BILLS  WITH
199700**              A DISCHARGE DATE ON OR AFTER 19941001
199800*****************************************************************
199900     IF B-N-DISCHARGE-DATE
200000              > 19940930
200100         CALL  PPCAL954 USING BILL-DATA
200200                              PPS-DATA
200300                              PRICER-OPT-VERS-SW
200400                              PPS-ADDITIONAL-VARIABLES
200500                              PROV-HOLD
200600                              WAGE-INDEX-RECORD
200700         GOBACK.
200800*****************************************************************
200900*****************************************************************
201000**          THIS NEXT CALL WILL PROCESS 1994 BILLS  WITH
201100**              A DISCHARGE DATE ON OR AFTER 19931001
201200*****************************************************************
201300     IF B-N-DISCHARGE-DATE
201400              > 19930930
201500         CALL  PPCAL944 USING BILL-DATA
201600                              PPS-DATA
201700                              PRICER-OPT-VERS-SW
201800                              PPS-ADDITIONAL-VARIABLES
201900                              PROV-HOLD
202000                              WAGE-INDEX-RECORD
202100         GOBACK.
202200*****************************************************************
202300*****************************************************************
202400**          THIS NEXT CALL WILL PROCESS 1993 BILLS  WITH
202500**              A DISCHARGE DATE ON OR AFTER 19921001
202600*****************************************************************
202700     IF B-N-DISCHARGE-DATE
202800              > 19920930
202900         CALL  PPCAL935 USING BILL-DATA
203000                              PPS-DATA
203100                              PRICER-OPT-VERS-SW
203200                              PPS-ADDITIONAL-VARIABLES
203300                              PROV-HOLD
203400                              WAGE-INDEX-RECORD
203500         GOBACK.
203600*****************************************************************
203700*****************************************************************
203800**          THIS NEXT CALL WILL PROCESS 1992 BILLS  WITH
203900**              A DISCHARGE DATE ON OR AFTER 19911001
204000*****************************************************************
204100     IF B-N-DISCHARGE-DATE
204200              > 19910930
204300         CALL  PPCAL926 USING BILL-DATA
204400                              PPS-DATA
204500                              PRICER-OPT-VERS-SW
204600                              PPS-ADDITIONAL-VARIABLES
204700                              PROV-HOLD
204800                              WAGE-INDEX-RECORD
204900         GOBACK.
205000*****************************************************************
205100*****************************************************************
205200**          THIS NEXT CALL WILL PROCESS 1991 BILLS  WITH
205300**              A DISCHARGE DATE ON OR AFTER 19901001
205400*****************************************************************
205500     IF B-N-DISCHARGE-DATE
205600              > 19900930
205700         CALL  PPCAL915 USING BILL-DATA
205800                              PPS-DATA
205900                              PRICER-OPT-VERS-SW
206000                              PPS-ADDITIONAL-VARIABLES
206100                              PROV-HOLD
206200                              WAGE-INDEX-RECORD
206300         GOBACK.
206400*****************************************************************
206500*****************************************************************
206600**          THIS NEXT CALL WILL PROCESS 1990 BILLS  WITH
206700**              A DISCHARGE DATE ON OR AFTER 19891001
206800*****************************************************************
206900     IF B-N-DISCHARGE-DATE
207000              > 19890930
207100         CALL  PPCAL905 USING BILL-DATA
207200                              PPS-DATA
207300                              PRICER-OPT-VERS-SW
207400                              PPS-ADDITIONAL-VARIABLES
207500                              PROV-HOLD
207600                              WAGE-INDEX-RECORD
207700         GOBACK.
207800*****************************************************************
207900*****************************************************************
208000**          THIS NEXT CALL WILL PROCESS 1989 BILLS  WITH
208100**              A DISCHARGE DATE ON OR AFTER 19881001
208200*****************************************************************
208300     IF B-N-DISCHARGE-DATE
208400              > 19880930
208500         CALL  PPCAL894 USING BILL-DATA
208600                              PPS-DATA
208700                              PRICER-OPT-VERS-SW
208800                              PPS-ADDITIONAL-VARIABLES
208900                              PROV-HOLD
209000                              WAGE-INDEX-RECORD
209100         GOBACK.
209200*****************************************************************
209300*****************************************************************
209400**          THIS NEXT CALL WILL PROCESS 1988 BILLS  WITH
209500**              A DISCHARGE DATE ON OR AFTER 19871001
209600*****************************************************************
209700     IF B-N-DISCHARGE-DATE
209800              > 19870930
209900         CALL  PPCAL884 USING BILL-DATA
210000                              PPS-DATA
210100                              PRICER-OPT-VERS-SW
210200                              PPS-ADDITIONAL-VARIABLES
210300                              PROV-HOLD
210400                              WAGE-INDEX-RECORD
210500         GOBACK.
210600*****************************************************************
210700*****************************************************************
210800     MOVE 98 TO PPS-RTC.
210900     GOBACK.
211000
211100 0100-GET-MSA.
211200     SET MU1 TO 1.
211300
211400     SEARCH M-MSAX-DATA VARYING MU1
211500     AT END
211600          MOVE 999999 TO P-PROVIDER-NO
211700          MOVE 52     TO PPS-RTC
211800          GO TO 0100-EXIT
211900     WHEN M-MSAX-MSA (MU1) = HOLD-PROV-MSAX
212000          SET MU2 TO MU1.
212100
212200 0100-EXIT.  EXIT.
212300
212400 0150-GET-CBSA.
212500     SET MA1 TO 1.
212600
212700     SEARCH T-CBSA-DATA VARYING MA1
212800     AT END
212900          MOVE 999999 TO P-PROVIDER-NO
213000          MOVE 52     TO PPS-RTC
213100          GO TO 0150-EXIT
213200     WHEN T-CBSA  (MA1) = HOLD-PROV-CBSA
213300          SET MA2 TO MA1.
213400
213500 0150-EXIT.  EXIT.
213600
213700 0200-N-GET-MSAPR.
213800
213900     IF P-NEW-CHG-CODE-INDEX = 'Y'
214000        MOVE P-NEW-WAGE-INDEX-LOC-MSA TO HOLD-PROV-MSAX
214100     ELSE
214200        MOVE P-NEW-GEO-LOC-MSAX TO HOLD-PROV-MSAX.
214300
214400     MOVE '*' TO H-MSAX-LAST-POS.
214500     PERFORM 0100-GET-MSA THRU 0100-EXIT.
214600
214700     IF PPS-RTC = 00
214800      PERFORM 0300-N-GET-PR-WAGE-INDX
214900           THRU 0300-N-EXIT VARYING MU2
215000           FROM MU1 BY 1 UNTIL
215100           M-MSAX-MSA (MU2) NOT = HOLD-PROV-MSAX.
215200
215300 0200-N-EXIT.  EXIT.
215400
215500 0250-N-GET-CBSA-PR.
215600
215700     IF P-NEW-CBSA-SPEC-PAY-IND = 'Y'
215800        MOVE P-NEW-CBSA-RECLASS-LOC TO HOLD-PROV-CBSA
215900     ELSE
216000        MOVE P-NEW-CBSA-GEO-LOC TO HOLD-PROV-CBSA.
216100
216200     MOVE '*' TO H-CBSA-LAST-POS.
216300     PERFORM 0150-GET-CBSA THRU 0150-EXIT.
216400
216500     IF PPS-RTC = 00
216600      PERFORM 0350-N-GET-PR-WAGE-INDX
216700           THRU 0350-EXIT VARYING MA2
216800           FROM MA1 BY 1 UNTIL
216900           T-CBSA (MA2) NOT = HOLD-PROV-CBSA.
217000
217100 0250-EXIT.  EXIT.
217200
217300 0300-N-GET-PR-WAGE-INDX.
217400
217500     IF  B-N-DISCHARGE-DATE NOT < M-MSAX-EFF-DATE (MU2)
217600         MOVE M-MSAX-WAGE-INDX1 (MU2) TO W-NEW-PR-INDEX-RECORD
217700         IF P-NEW-CHG-CODE-INDEX  = 'Y'
217800            MOVE M-MSAX-WAGE-INDX2 (MU2)
217900                                     TO W-NEW-PR-INDEX-RECORD.
218000
218100 0300-N-EXIT.  EXIT.
218200
218300 0350-N-GET-PR-WAGE-INDX.
218400
218500     IF  B-N-DISCHARGE-DATE NOT < T-CBSA-EFF-DATE (MA2)
218600         MOVE T-CBSA-WAGE-INDX1 (MA2)
218700                              TO W-NEW-CBSA-PR-WI
218800         IF P-NEW-CBSA-SPEC-PAY-IND =  'Y'
218900             MOVE T-CBSA-WAGE-INDX2 (MA2)
219000                              TO W-NEW-CBSA-PR-WI.
219100
219200 0350-EXIT.  EXIT.
219300
219400 0500-GET-MSA.
219500        IF P-NEW-CHG-CODE-INDEX = 'Y'
219600           MOVE P-NEW-WAGE-INDEX-LOC-MSA TO HOLD-PROV-MSAX
219700        ELSE
219800           MOVE P-NEW-GEO-LOC-MSA9 TO HOLD-PROV-MSAX.
219900
220000**1998***********************************************************
220100     IF B-N-DISCHARGE-DATE > 19970930 AND
220200        B-N-DISCHARGE-DATE < 19981001
220300        PERFORM 2300-1998-FLOOR-MSA THRU 2300-1998-EXIT.
220400
220500**1999***********************************************************
220600     IF B-N-DISCHARGE-DATE > 19980930 AND
220700        B-N-DISCHARGE-DATE < 19991001
220800        PERFORM 2300-1999-FLOOR-MSA THRU 2300-1999-EXIT.
220900
221000**2000***********************************************************
221100     IF B-N-DISCHARGE-DATE > 19990930 AND
221200        B-N-DISCHARGE-DATE < 20001001
221300        PERFORM 2300-2000-FLOOR-MSA THRU 2300-2000-EXIT.
221400
221500**2001***********************************************************
221600     IF B-N-DISCHARGE-DATE > 20000930 AND
221700        B-N-DISCHARGE-DATE < 20011001
221800        PERFORM 2300-2001-FLOOR-MSA THRU 2300-2001-EXIT.
221900
222000**2002***********************************************************
222100     IF B-N-DISCHARGE-DATE > 20010930 AND
222200        B-N-DISCHARGE-DATE < 20021001
222300        PERFORM 2300-2002-FLOOR-MSA THRU 2300-2002-EXIT.
222400
222500     IF B-N-DISCHARGE-DATE > 20010930 AND
222600        B-N-DISCHARGE-DATE < 20021001
222700          PERFORM 2700-2002-WI-401-HOSPITAL THRU 2700-2002-EXIT.
222800
222900**2003***********************************************************
223000     IF B-N-DISCHARGE-DATE > 20020930 AND
223100        B-N-DISCHARGE-DATE < 20031001
223200          PERFORM 2700-2003-WI-401-HOSPITAL THRU 2700-2003-EXIT.
223300
223400     IF B-N-DISCHARGE-DATE > 20020930 AND
223500        B-N-DISCHARGE-DATE < 20031001
223600        PERFORM 2300-2003-FLOOR-MSA THRU 2300-2003-EXIT.
223700
223800**2004***********************************************************
223900     IF B-N-DISCHARGE-DATE > 20030930 AND
224000        B-N-DISCHARGE-DATE < 20041001
224100          PERFORM 2700-2004-WI-401-HOSPITAL THRU 2700-2004-EXIT.
224200
224300     IF B-N-DISCHARGE-DATE > 20030930 AND
224400        B-N-DISCHARGE-DATE < 20041001
224500        PERFORM 2300-2004-FLOOR-MSA THRU 2300-2004-EXIT.
224600
224700*****************************************************************
224800     PERFORM 0100-GET-MSA THRU 0100-EXIT.
224900
225000***     RTC = 52  --  MSA NOT FOUND
225100     IF PPS-RTC = 52    GOBACK.
225200
225300     IF PPS-RTC = 00
225400        PERFORM 0600-N-GET-WAGE-INDX
225500           THRU 0600-N-EXIT VARYING MU2
225600           FROM MU1 BY 1 UNTIL
225700           M-MSAX-MSA (MU2) NOT = HOLD-PROV-MSAX.
225800
225900     IF P-N-INDIAN-HEALTH-SERVICE
226000             MOVE 00 TO PPS-RTC
226100             PERFORM 0800-N-GET-INDIAN-WI THRU 0800-N-EXIT.
226200
226300***     RTC = 52  --  WAGE-INDEX NOT FOUND
226400     IF PPS-RTC = 52    GOBACK.
226500
226600**2000***********************************************************
226700     IF B-N-DISCHARGE-DATE > 19990930 AND
226800        B-N-DISCHARGE-DATE < 20001001
226900          PERFORM 2500-2000-WI-LUGER THRU 2500-2000-EXIT.
227000
227100**2001***********************************************************
227200     IF B-N-DISCHARGE-DATE > 20000930 AND
227300        B-N-DISCHARGE-DATE < 20011001
227400          PERFORM 2500-2001-WI-LUGER THRU 2500-2001-EXIT.
227500
227600**2003***********************************************************
227700     IF B-N-DISCHARGE-DATE > 20020930 AND
227800        B-N-DISCHARGE-DATE < 20031001
227900          PERFORM 2500-2003-WI-LUGER THRU 2500-2003-EXIT.
228000
228100**2004***********************************************************
228200     IF B-N-DISCHARGE-DATE > 20031231 AND
228300        B-N-DISCHARGE-DATE < 20041001
228400        PERFORM 2300-2004-RECLASS152 THRU 2300-2004-RECLASS-EXIT.
228500
228600*****************************************************************
228700     IF W-NEW-INDEX-RECORD = 00.0000
228800        MOVE 52 TO PPS-RTC.
228900
229000***  GET THE WAGE-SIZE
229100
229200     MOVE P-NEW-STAND-AMT-LOC-MSA TO HOLD-PROV-MSAX.
229300
229400     PERFORM 0100-GET-MSA THRU 0100-EXIT.
229500
229600     IF PPS-RTC = 00
229700         PERFORM 0700-N-GET-WAGE-SIZE
229800           THRU 0700-N-EXIT VARYING MU2
229900           FROM MU1 BY 1 UNTIL
230000           M-MSAX-MSA (MU2) NOT = HOLD-PROV-MSAX.
230100
230200     IF P-NEW-STATE = 40
230300        IF B-N-DISCHARGE-DATE > 19970930
230400              PERFORM 0200-N-GET-MSAPR THRU 0200-N-EXIT.
230500
230600***     RTC = 52  --  PR-WAGE-INDEX NOT FOUND
230700     IF PPS-RTC = 52
230800          MOVE ALL '0' TO  PPS-ADDITIONAL-VARIABLES
230900          GOBACK.
231000
231100 0500-EXIT.  EXIT.
231200
231300 0550-GET-CBSA.
231400**2005*  OCT 1, 2004 CBSA REPLACED MSA
231500
231600     IF P-NEW-EFF-DATE < 20041001
231700        MOVE ALL '0' TO PPS-ADDITIONAL-VARIABLES
231800        MOVE 52 TO PPS-RTC
231900        GOBACK.
232000
232100     IF P-NEW-CBSA-WI-RECLASS
232200        MOVE P-NEW-CBSA-RECLASS-LOC TO HOLD-PROV-CBSA
232300     ELSE
232400        MOVE P-NEW-CBSA-GEO-LOC TO HOLD-PROV-CBSA.
232500
232600     IF (P-NEW-CBSA-WI-SPECIAL AND
232700         P-NEW-CBSA-SPEC-WI-N NOT NUMERIC)
232800        MOVE 52 TO PPS-RTC
232900        GOBACK.
233000
233100     IF (P-NEW-CBSA-WI-SPECIAL AND
233200         P-NEW-CBSA-SPEC-WI-N = ZEROES)
233300        MOVE 52 TO PPS-RTC
233400        GOBACK.
233500
233600     IF P-NEW-CBSA-WI-SPECIAL
233700        MOVE 'SPEC*'            TO W-NEW-CBSA-X
233800        MOVE P-NEW-EFF-DATE     TO W-NEW-CBSA-EFF-DATE
233900        MOVE P-NEW-CBSA-SPEC-WI TO W-NEW-CBSA-WI
234000        GO TO 0550-BYPASS.
234100
234200**2005***********************************************************
234300     IF B-N-DISCHARGE-DATE > 20040930 AND
234400        B-N-DISCHARGE-DATE < 20050401
234500          PERFORM 2700-2005-WI-401-HOSPITAL THRU 2700-2005-EXIT.
234600
234700     IF B-N-DISCHARGE-DATE > 20050331 AND
234800        B-N-DISCHARGE-DATE < 20051001
234900          PERFORM 2750-2005-WI-401-HOSPITAL THRU 2750-2005-EXIT.
235000
235100     IF B-N-DISCHARGE-DATE > 20040930 AND
235200        B-N-DISCHARGE-DATE < 20051001
235300        PERFORM 2300-2005-FLOOR-CBSA THRU 2300-2005-EXIT.
235400
235500**2006***********************************************************
235600
235700     IF B-N-DISCHARGE-DATE > 20050930 AND
235800        B-N-DISCHARGE-DATE < 20061001
235900          PERFORM 2800-2006-WI-401-HOSPITAL THRU 2800-2006-EXIT.
236000
236100     IF B-N-DISCHARGE-DATE > 20050930 AND
236200        B-N-DISCHARGE-DATE < 20061001
236300        PERFORM 2300-2006-FLOOR-CBSA THRU 2300-2006-EXIT.
236400
236500**2007***********************************************************
236600
236700     IF B-N-DISCHARGE-DATE > 20060930 AND
236800        B-N-DISCHARGE-DATE < 20071001
236900          PERFORM 2800-2007-WI-401-HOSPITAL THRU 2800-2007-EXIT.
237000
237100     IF B-N-DISCHARGE-DATE > 20060930 AND
237200        B-N-DISCHARGE-DATE < 20071001
237300        PERFORM 2300-2007-FLOOR-CBSA THRU 2300-2007-EXIT.
237400
237500*****************************************************************
237600**2008***********************************************************
237700
237800     IF B-N-DISCHARGE-DATE > 20070930 AND
237900        B-N-DISCHARGE-DATE < 20081001
238000          PERFORM 2800-2008-WI-401-HOSPITAL THRU 2800-2008-EXIT.
238100
238200     IF B-N-DISCHARGE-DATE > 20070930 AND
238300        B-N-DISCHARGE-DATE < 20081001
238400        PERFORM 2300-2008-FLOOR-CBSA THRU 2300-2008-EXIT.
238500
238600*****************************************************************
238700**2009***********************************************************
238800
238900     IF B-N-DISCHARGE-DATE > 20080930 AND
239000        B-N-DISCHARGE-DATE < 20091001
239100          PERFORM 2800-2009-WI-401-HOSPITAL THRU 2800-2009-EXIT.
239200
239300     IF B-N-DISCHARGE-DATE > 20080930 AND
239400        B-N-DISCHARGE-DATE < 20091001
239500        PERFORM 2300-2009-FLOOR-CBSA THRU 2300-2009-EXIT.
239600
239700*****************************************************************
239800**2010***********************************************************
239900
240000     IF B-N-DISCHARGE-DATE > 20090930 AND
240100        B-N-DISCHARGE-DATE < 20101001
240200          PERFORM 2800-2010-WI-401-HOSPITAL THRU 2800-2010-EXIT.
240300
240400     IF B-N-DISCHARGE-DATE > 20090930 AND
240500        B-N-DISCHARGE-DATE < 20101001
240600        PERFORM 2300-2010-FLOOR-CBSA THRU 2300-2010-EXIT.
240700
240800*****************************************************************
240900**2011***********************************************************
241000
241100     IF B-N-DISCHARGE-DATE > 20100930 AND
241200        B-N-DISCHARGE-DATE < 20111001
241300          PERFORM 2800-2011-WI-401-HOSPITAL THRU 2800-2011-EXIT.
241400
241500     IF B-N-DISCHARGE-DATE > 20100930 AND
241600        B-N-DISCHARGE-DATE < 20111001
241700        PERFORM 2300-2011-FLOOR-CBSA THRU 2300-2011-EXIT.
241800
241900**2012***********************************************************
242000
242100     IF B-N-DISCHARGE-DATE > 20110930 AND
242200        B-N-DISCHARGE-DATE < 20121001
242300          PERFORM 2800-2012-WI-401-HOSPITAL THRU 2800-2012-EXIT.
242400
242500     IF B-N-DISCHARGE-DATE > 20110930 AND
242600        B-N-DISCHARGE-DATE < 20121001
242700        PERFORM 2300-2012-FLOOR-CBSA THRU 2300-2012-EXIT.
242800
242900*****************************************************************
243000**2013***********************************************************
243100
243200     IF B-N-DISCHARGE-DATE > 20120930 AND
243300        B-N-DISCHARGE-DATE < 20131001
243400          PERFORM 2800-2013-WI-401-HOSPITAL THRU 2800-2013-EXIT.
243500
243600     IF B-N-DISCHARGE-DATE > 20120930 AND
243700        B-N-DISCHARGE-DATE < 20131001
243800        PERFORM 2300-2013-FLOOR-CBSA THRU 2300-2013-EXIT.
243900
244000**2014***********************************************************
244100
244200     IF B-N-DISCHARGE-DATE > 20130930
244300          PERFORM 2800-2014-WI-401-HOSPITAL THRU 2800-2014-EXIT.
244400
244500     IF B-N-DISCHARGE-DATE > 20130930
244600        PERFORM 2300-2014-FLOOR-CBSA THRU 2300-2014-EXIT.
244700
244800
244900*****************************************************************
245000     PERFORM 0150-GET-CBSA THRU 0150-EXIT.
245100
245200     IF PPS-RTC = 52 GOBACK.
245300
245400***     GET CBSA WAGE INDEX - BASED ON DISCHARGE DATE
245500
245600     IF PPS-RTC = 00
245700        PERFORM 0650-N-GET-CBSA-WAGE-INDX
245800         THRU   0650-N-EXIT VARYING MA2
245900                FROM MA1 BY 1 UNTIL
246000                T-CBSA (MA2) NOT = HOLD-PROV-CBSA.
246100
246200     IF P-N-INDIAN-HEALTH-SERVICE
246300        MOVE 00 TO PPS-RTC
246400        PERFORM 0850-N-GET-CBSA-INDIAN-WI THRU 0850-EXIT.
246500
246600     IF PPS-RTC = 52 GOBACK.
246700
246800 0550-BYPASS.
246900
247000     IF W-NEW-CBSA-WI NOT NUMERIC
247100        MOVE 0 TO W-NEW-CBSA-WI.
247200
247300     IF W-NEW-CBSA-WI = 00.0000
247400        MOVE 52 TO PPS-RTC
247500        GOBACK.
247600
247700***   GET CBSA WAGE SIZE  - BASED ON DISCHARGE DATE
247800
247900     MOVE P-NEW-CBSA-STAND-AMT-LOC TO HOLD-PROV-CBSA.
248000
248100     PERFORM 0150-GET-CBSA THRU 0150-EXIT.
248200
248300     IF PPS-RTC = 52 GOBACK.
248400
248500     IF PPS-RTC = 00
248600        PERFORM 0750-GET-CBSA-SIZE
248700           THRU 0750-EXIT VARYING MA2
248800           FROM MA1 BY 1 UNTIL
248900           T-CBSA (MA2) NOT = HOLD-PROV-CBSA.
249000
249100     IF P-NEW-STATE = 40
249200        PERFORM 0250-N-GET-CBSA-PR THRU 0250-EXIT.
249300
249400***     RTC = 52  --  PR-WAGE-INDEX NOT FOUND
249500     IF PPS-RTC = 52
249600          MOVE ALL '0' TO  PPS-ADDITIONAL-VARIABLES
249700          GOBACK.
249800
249900 0550-EXIT.  EXIT.
250000
250100 0600-N-GET-WAGE-INDX.
250200
250300     IF  B-N-DISCHARGE-DATE NOT < M-MSAX-EFF-DATE (MU2)
250400         MOVE M-MSAX-MSA        (MU2) TO W-NEW-MSA
250500         MOVE M-MSAX-EFF-DATE   (MU2) TO W-NEW-EFF-DATE
250600         MOVE M-MSAX-WAGE-INDX1 (MU2) TO W-NEW-INDEX-RECORD
250700         IF P-NEW-CHG-CODE-INDEX  = 'Y'
250800            MOVE M-MSAX-WAGE-INDX2 (MU2) TO W-NEW-INDEX-RECORD.
250900
251000 0600-N-EXIT.  EXIT.
251100
251200 0650-N-GET-CBSA-WAGE-INDX.
251300
251400     IF  B-N-DISCHARGE-DATE NOT < T-CBSA-EFF-DATE (MA2)
251500         MOVE T-CBSA            (MA2) TO W-NEW-CBSA-X
251600         MOVE T-CBSA-EFF-DATE   (MA2) TO W-NEW-CBSA-EFF-DATE
251700         MOVE T-CBSA-WAGE-INDX1 (MA2) TO W-NEW-CBSA-WI
251800         IF P-NEW-CBSA-WI-RECLASS
251900            MOVE T-CBSA-WAGE-INDX2 (MA2) TO W-NEW-CBSA-WI.
252000
252100 0650-N-EXIT.  EXIT.
252200
252300 0700-N-GET-WAGE-SIZE.
252400
252500     IF  B-N-DISCHARGE-DATE NOT < M-MSAX-EFF-DATE (MU2)
252600         IF  P-NEW-STD-RURAL-CHECK
252700             MOVE 'R' TO W-NEW-SIZE
252800         ELSE
252900         IF  M-MSAX-SIZE (MU2) = 'L'
253000             MOVE 'L' TO W-NEW-SIZE
253100         ELSE
253200             MOVE 'O' TO W-NEW-SIZE.
253300 0700-N-EXIT.  EXIT.
253400
253500 0750-GET-CBSA-SIZE.
253600
253700     IF  B-N-DISCHARGE-DATE NOT < T-CBSA-EFF-DATE (MA2)
253800         IF  P-NEW-CBSA-STD-RURAL-CHECK
253900             MOVE 'R' TO W-NEW-CBSA-SIZE
254000         ELSE
254100         IF  T-CBSA-SIZE (MA2) = 'L'
254200             MOVE 'L' TO W-NEW-CBSA-SIZE
254300         ELSE
254400             MOVE 'O' TO W-NEW-CBSA-SIZE.
254500 0750-EXIT.  EXIT.
254600
254700 0800-N-GET-INDIAN-WI.
254800     IF  P-NEW-STATE = 02
254900             MOVE 98 TO H-MSAX-PROV-STATE
255000     ELSE
255100             MOVE 99 TO H-MSAX-PROV-STATE.
255200
255300     MOVE   '  '  TO H-MSAX-PROV-BLANK.
255400
255500     PERFORM 0100-GET-MSA THRU 0100-EXIT.
255600
255700     IF PPS-RTC = 00
255800        PERFORM 0600-N-GET-WAGE-INDX
255900            THRU 0600-N-EXIT VARYING MU2
256000            FROM MU1 BY 1 UNTIL
256100            M-MSAX-MSA (MU2) NOT = HOLD-PROV-MSAX.
256200
256300 0800-N-EXIT.  EXIT.
256400
256500 0850-N-GET-CBSA-INDIAN-WI.
256600     IF  P-NEW-STATE = 02
256700             MOVE 98 TO H-CBSA-PROV-STATE
256800     ELSE
256900             MOVE 99 TO H-CBSA-PROV-STATE.
257000
257100     MOVE  '   '  TO H-CBSA-PROV-BLANK.
257200
257300     PERFORM 0150-GET-CBSA THRU 0150-EXIT.
257400
257500     IF PPS-RTC = 00
257600        PERFORM 0650-N-GET-CBSA-WAGE-INDX
257700            THRU 0650-N-EXIT VARYING MA2
257800            FROM MA1 BY 1 UNTIL
257900            T-CBSA (MA2) NOT = HOLD-PROV-CBSA.
258000
258100 0850-EXIT.  EXIT.
258200
258300
258400 2300-1998-FLOOR-MSA.
258500
258600        IF HOLD-PROV-MSAX = '6020'
258700           AND P-NEW-STATE = 36
258800               MOVE '  36' TO HOLD-PROV-MSAX.
258900
259000        IF HOLD-PROV-MSAX = '9000'
259100           AND P-NEW-STATE = 36
259200                MOVE '  36' TO HOLD-PROV-MSAX.
259300
259400
259500 2300-1998-EXIT.  EXIT.
259600
259700 2300-1999-FLOOR-MSA.
259800
259900        IF HOLD-PROV-MSAX = '6020'
260000           AND P-NEW-STATE = 36
260100               MOVE '  36' TO HOLD-PROV-MSAX.
260200
260300        IF HOLD-PROV-MSAX = '9000'
260400           AND P-NEW-STATE = 36
260500                MOVE '  36' TO HOLD-PROV-MSAX.
260600
260700        IF HOLD-PROV-MSAX = '8080'
260800           AND P-NEW-STATE = 36
260900               MOVE '  36' TO HOLD-PROV-MSAX.
261000
261100        IF HOLD-PROV-MSAX = '1900'
261200           AND P-NEW-STATE = 21
261300               MOVE '  21' TO HOLD-PROV-MSAX.
261400
261500        IF HOLD-PROV-MSAX = '6340'
261600           AND P-NEW-CHG-CODE-INDEX = 'Y'
261700           AND P-NEW-STATE = 53
261800               MOVE '  53' TO HOLD-PROV-MSAX.
261900
262000 2300-1999-EXIT. EXIT.
262100
262200 2300-2000-FLOOR-MSA.
262300
262400        IF HOLD-PROV-MSAX = '6020'
262500           AND P-NEW-STATE = 36
262600               MOVE '  36' TO HOLD-PROV-MSAX.
262700
262800        IF HOLD-PROV-MSAX = '9000'
262900           AND P-NEW-STATE = 36
263000                MOVE '  36' TO HOLD-PROV-MSAX.
263100
263200        IF HOLD-PROV-MSAX = '8080'
263300           AND P-NEW-STATE = 36
263400               MOVE '  36' TO HOLD-PROV-MSAX.
263500
263600        IF HOLD-PROV-MSAX = '2440'
263700           AND P-NEW-STATE = 15
263800               MOVE '  15' TO HOLD-PROV-MSAX.
263900
264000        IF HOLD-PROV-MSAX = '2520'
264100           AND P-NEW-CHG-CODE-INDEX = 'Y'
264200           AND P-NEW-STATE = 24
264300               MOVE '  24' TO HOLD-PROV-MSAX.
264400
264500        IF HOLD-PROV-MSAX = '1123'
264600           AND P-NEW-STATE = 22
264700               MOVE '  22' TO HOLD-PROV-MSAX.
264800
264900 2300-2000-EXIT. EXIT.
265000
265100 2300-2001-FLOOR-MSA.
265200
265300        IF HOLD-PROV-MSAX = '1900'
265400           AND P-NEW-STATE = 21
265500               MOVE '  21' TO HOLD-PROV-MSAX.
265600
265700        IF HOLD-PROV-MSAX = '6020'
265800           AND P-NEW-STATE = 36
265900               MOVE '  36' TO HOLD-PROV-MSAX.
266000
266100        IF HOLD-PROV-MSAX = '8080'
266200           AND P-NEW-STATE = 36
266300               MOVE '  36' TO HOLD-PROV-MSAX.
266400
266500        IF HOLD-PROV-MSAX = '1123'
266600           AND P-NEW-STATE = 22
266700               MOVE '  22' TO HOLD-PROV-MSAX.
266800
266900        IF HOLD-PROV-MSAX = '2440'
267000           AND P-NEW-STATE = 15
267100               MOVE '  15' TO HOLD-PROV-MSAX.
267200
267300        IF HOLD-PROV-MSAX = '9000'
267400           AND P-NEW-STATE = 36
267500                MOVE '  36' TO HOLD-PROV-MSAX.
267600
267700        IF HOLD-PROV-MSAX = '9000'
267800           AND P-NEW-STATE = 51
267900                MOVE '  51' TO HOLD-PROV-MSAX.
268000
268100 2300-2001-EXIT. EXIT.
268200
268300 2300-2002-FLOOR-MSA.
268400
268500        IF HOLD-PROV-MSAX = '1123'
268600           AND P-NEW-STATE = 22
268700               MOVE '  22' TO HOLD-PROV-MSAX.
268800
268900        IF HOLD-PROV-MSAX = '1900'
269000           AND P-NEW-STATE = 21
269100               MOVE '  21' TO HOLD-PROV-MSAX.
269200
269300        IF HOLD-PROV-MSAX = '2440'
269400           AND P-NEW-STATE = 15
269500               MOVE '  15' TO HOLD-PROV-MSAX.
269600
269700        IF HOLD-PROV-MSAX = '6020'
269800           AND P-NEW-STATE = 36
269900               MOVE '  36' TO HOLD-PROV-MSAX.
270000
270100        IF HOLD-PROV-MSAX = '8080'
270200           AND P-NEW-STATE = 36
270300               MOVE '  36' TO HOLD-PROV-MSAX.
270400
270500        IF HOLD-PROV-MSAX = '9000'
270600           AND P-NEW-STATE = 36
270700                MOVE '  36' TO HOLD-PROV-MSAX.
270800
270900        IF HOLD-PROV-MSAX = '1303'
271000           AND P-NEW-CHG-CODE-INDEX = 'Y'
271100           AND P-NEW-STATE = 47
271200               MOVE 'N' TO P-NEW-CHG-CODE-INDEX
271300               MOVE '  47' TO HOLD-PROV-MSAX.
271400
271500        IF HOLD-PROV-MSAX = '  14'
271600           AND P-NEW-CHG-CODE-INDEX = 'Y'
271700           AND P-NEW-STATE = 16
271800               MOVE 'N' TO P-NEW-CHG-CODE-INDEX
271900               MOVE '  16' TO HOLD-PROV-MSAX.
272000
272100 2300-2002-EXIT. EXIT.
272200
272300 2300-2003-FLOOR-MSA.
272400
272500        IF HOLD-PROV-MSAX = '  14'
272600           AND P-NEW-CHG-CODE-INDEX = 'Y'
272700           AND P-NEW-STATE = 16
272800               MOVE 'N' TO P-NEW-CHG-CODE-INDEX
272900               MOVE '  16' TO HOLD-PROV-MSAX.
273000
273100        IF HOLD-PROV-MSAX = '1123'
273200           AND P-NEW-STATE = 22
273300               MOVE '  22' TO HOLD-PROV-MSAX.
273400
273500        IF HOLD-PROV-MSAX = '1800'
273600           AND P-NEW-CHG-CODE-INDEX = 'Y'
273700           AND P-NEW-STATE = 11
273800               MOVE 'N' TO P-NEW-CHG-CODE-INDEX
273900               MOVE '  11' TO HOLD-PROV-MSAX.
274000
274100        IF HOLD-PROV-MSAX = '1900'
274200           AND P-NEW-STATE = 21
274300               MOVE '  21' TO HOLD-PROV-MSAX.
274400
274500        IF HOLD-PROV-MSAX = '2440'
274600           AND P-NEW-STATE = 15
274700               MOVE '  15' TO HOLD-PROV-MSAX.
274800
274900        IF HOLD-PROV-MSAX = '3660'
275000           AND P-NEW-CHG-CODE-INDEX = 'Y'
275100           AND P-NEW-STATE = 49
275200               MOVE 'N' TO P-NEW-CHG-CODE-INDEX
275300               MOVE '  49' TO HOLD-PROV-MSAX.
275400
275500        IF HOLD-PROV-MSAX = '3660'
275600           AND P-NEW-STATE = 49
275700               MOVE '  49' TO HOLD-PROV-MSAX.
275800
275900        IF HOLD-PROV-MSAX = '3700'
276000           AND P-NEW-CHG-CODE-INDEX = 'Y'
276100           AND P-NEW-STATE = 26
276200               MOVE 'N' TO P-NEW-CHG-CODE-INDEX
276300               MOVE '  26' TO HOLD-PROV-MSAX.
276400
276500        IF HOLD-PROV-MSAX = '6020'
276600           AND P-NEW-STATE = 36
276700               MOVE '  36' TO HOLD-PROV-MSAX.
276800
276900        IF HOLD-PROV-MSAX = '9000'
277000           AND P-NEW-STATE = 36
277100                MOVE '  36' TO HOLD-PROV-MSAX.
277200
277300 2300-2003-EXIT. EXIT.
277400
277500 2300-2004-FLOOR-MSA.
277600
277700        IF HOLD-PROV-MSAX = '  14'
277800           AND P-NEW-CHG-CODE-INDEX = 'Y'
277900           AND P-NEW-STATE = 16
278000               MOVE 'N' TO P-NEW-CHG-CODE-INDEX
278100               MOVE '  16' TO HOLD-PROV-MSAX.
278200
278300        IF HOLD-PROV-MSAX = '0200'
278400           AND P-NEW-CHG-CODE-INDEX = 'Y'
278500           AND P-NEW-STATE = 06
278600               MOVE 'N' TO P-NEW-CHG-CODE-INDEX
278700               MOVE '  06' TO HOLD-PROV-MSAX.
278800
278900        IF HOLD-PROV-MSAX = '1480'
279000           AND P-NEW-CHG-CODE-INDEX = 'Y'
279100           AND P-NEW-STATE = 36
279200               MOVE 'N' TO P-NEW-CHG-CODE-INDEX
279300               MOVE '  36' TO HOLD-PROV-MSAX.
279400
279500        IF HOLD-PROV-MSAX = '1900'
279600           AND P-NEW-STATE = 21
279700               MOVE '  21' TO HOLD-PROV-MSAX.
279800
279900        IF HOLD-PROV-MSAX = '2440'
280000           AND P-NEW-STATE = 15
280100               MOVE '  15' TO HOLD-PROV-MSAX.
280200
280300        IF HOLD-PROV-MSAX = '2985'
280400           AND P-NEW-STATE = 24
280500               MOVE '  24' TO HOLD-PROV-MSAX.
280600
280700        IF HOLD-PROV-MSAX = '3660'
280800           AND P-NEW-CHG-CODE-INDEX = 'Y'
280900           AND P-NEW-STATE = 49
281000               MOVE 'N' TO P-NEW-CHG-CODE-INDEX
281100               MOVE '  49' TO HOLD-PROV-MSAX.
281200
281300        IF HOLD-PROV-MSAX = '3660'
281400           AND P-NEW-STATE = 49
281500               MOVE '  49' TO HOLD-PROV-MSAX.
281600
281700        IF HOLD-PROV-MSAX = '3700'
281800           AND P-NEW-CHG-CODE-INDEX = 'Y'
281900           AND P-NEW-STATE = 26
282000               MOVE 'N' TO P-NEW-CHG-CODE-INDEX
282100               MOVE '  26' TO HOLD-PROV-MSAX.
282200
282300        IF HOLD-PROV-MSAX = '6020'
282400           AND P-NEW-STATE = 36
282500               MOVE '  36' TO HOLD-PROV-MSAX.
282600
282700        IF HOLD-PROV-MSAX = '6740'
282800           AND P-NEW-CHG-CODE-INDEX = 'Y'
282900           AND P-NEW-STATE = 50
283000               MOVE 'N' TO P-NEW-CHG-CODE-INDEX
283100               MOVE '  50' TO HOLD-PROV-MSAX.
283200
283300        IF HOLD-PROV-MSAX = '7720'
283400           AND P-NEW-CHG-CODE-INDEX = 'Y'
283500           AND P-NEW-STATE = 28
283600               MOVE 'N' TO P-NEW-CHG-CODE-INDEX
283700               MOVE '  28' TO HOLD-PROV-MSAX.
283800
283900        IF HOLD-PROV-MSAX = '8080'
284000           AND P-NEW-STATE = 36
284100                MOVE '  36' TO HOLD-PROV-MSAX.
284200
284300        IF HOLD-PROV-MSAX = '9000'
284400           AND P-NEW-STATE = 36
284500                MOVE '  36' TO HOLD-PROV-MSAX.
284600
284700 2300-2004-EXIT. EXIT.
284800 2300-2004-RECLASS152.
284900
285000       IF (P-NEW-PROVIDER-NO = '330001' OR '330126' OR
285100                               '330135' OR '330205' OR
285200                               '330209' OR '330264')
285300          AND (P-NEW-WAGE-INDEX-LOC-MSA = '5600'
285400          AND  P-NEW-CHG-CODE-INDEX = 'Y')
285500               MOVE 1.3892 TO W-NEW-INDEX-RECORD.
285600
285700       IF (P-NEW-PROVIDER-NO = '470003')
285800          AND (P-NEW-WAGE-INDEX-LOC-MSA = '1123'
285900          AND  P-NEW-CHG-CODE-INDEX = 'Y')
286000               MOVE 1.1120 TO W-NEW-INDEX-RECORD.
286100
286200 2300-2004-RECLASS-EXIT. EXIT.
286300
286400 2300-2005-FLOOR-CBSA.
286500
286600        IF HOLD-PROV-CBSA = '10900'
286700           AND P-NEW-STATE = 31
286800               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
286900               MOVE '   31' TO HOLD-PROV-CBSA.
287000
287100        IF HOLD-PROV-CBSA = '16620'
287200           AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
287300           AND P-NEW-STATE = 36
287400               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
287500               MOVE '   36' TO HOLD-PROV-CBSA.
287600
287700        IF HOLD-PROV-CBSA = '19060'
287800           AND P-NEW-STATE = 21
287900               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
288000               MOVE '   21' TO HOLD-PROV-CBSA.
288100
288200        IF HOLD-PROV-CBSA = '21780'
288300           AND P-NEW-STATE = 15
288400               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
288500               MOVE '   15' TO HOLD-PROV-CBSA.
288600
288700        IF HOLD-PROV-CBSA = '22020'
288800           AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
288900           AND P-NEW-STATE = 24
289000               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
289100               MOVE '   24' TO HOLD-PROV-CBSA.
289200
289300        IF HOLD-PROV-CBSA = '22020'
289400           AND P-NEW-STATE = 24
289500               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
289600               MOVE '   24' TO HOLD-PROV-CBSA.
289700
289800        IF HOLD-PROV-CBSA = '24220'
289900           AND P-NEW-STATE = 24
290000               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
290100               MOVE '   24' TO HOLD-PROV-CBSA.
290200
290300        IF HOLD-PROV-CBSA = '25540'
290400           AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
290500           AND P-NEW-STATE = 07
290600               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
290700               MOVE '   07' TO HOLD-PROV-CBSA.
290800
290900        IF HOLD-PROV-CBSA = '29100'
291000           AND P-NEW-STATE = 52
291100               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
291200               MOVE '   52' TO HOLD-PROV-CBSA.
291300
291400        IF HOLD-PROV-CBSA = '30300'
291500           AND P-NEW-STATE = 50
291600               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
291700               MOVE '   50' TO HOLD-PROV-CBSA.
291800
291900        IF HOLD-PROV-CBSA = '37620'
292000           AND P-NEW-STATE = 36
292100               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
292200               MOVE '   36' TO HOLD-PROV-CBSA.
292300
292400        IF HOLD-PROV-CBSA = '48260'
292500           AND P-NEW-STATE = 36
292600               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
292700               MOVE '   36' TO HOLD-PROV-CBSA.
292800
292900        IF HOLD-PROV-CBSA = '48540'
293000           AND P-NEW-STATE = 36
293100               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
293200               MOVE '   36' TO HOLD-PROV-CBSA.
293300
293400        IF HOLD-PROV-CBSA = '48864'
293500           AND P-NEW-STATE = 31
293600               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
293700               MOVE '   31' TO HOLD-PROV-CBSA.
293800
293900        IF HOLD-PROV-CBSA = '48864'
294000           AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
294100           AND P-NEW-STATE = 31
294200               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
294300               MOVE '   31' TO HOLD-PROV-CBSA.
294400
294500        IF B-N-DISCHARGE-DATE > 20041231
294600           IF HOLD-PROV-CBSA = '39900'
294700              AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
294800              AND P-NEW-STATE = 05
294900                  MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
295000                  MOVE '   05' TO HOLD-PROV-CBSA.
295100
295200        IF B-N-DISCHARGE-DATE < 20050101
295300           IF (HOLD-PROV-CBSA = '28420'
295400               AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
295500               AND P-NEW-STATE = 50)
295600                  MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
295700                  MOVE '   50' TO HOLD-PROV-CBSA.
295800
295900 2300-2005-EXIT. EXIT.
296000
296100
296200 2300-2006-FLOOR-CBSA.
296300
296400        IF HOLD-PROV-CBSA = '   10'
296500           AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
296600           AND P-NEW-STATE = 10
296700               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
296800               MOVE '   10' TO HOLD-PROV-CBSA.
296900
297000        IF HOLD-PROV-CBSA = '   50'
297100           AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
297200           AND P-NEW-STATE = 50
297300               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
297400               MOVE '   50' TO HOLD-PROV-CBSA.
297500
297600        IF HOLD-PROV-CBSA = '10900'
297700           AND P-NEW-STATE = 31
297800               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
297900               MOVE '   31' TO HOLD-PROV-CBSA.
298000
298100        IF HOLD-PROV-CBSA = '15764'
298200           AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
298300           AND P-NEW-STATE = 30
298400               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
298500               MOVE '   30' TO HOLD-PROV-CBSA.
298600
298700        IF HOLD-PROV-CBSA = '16620'
298800           AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
298900           AND P-NEW-STATE = 36
299000               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
299100               MOVE '   36' TO HOLD-PROV-CBSA.
299200
299300        IF HOLD-PROV-CBSA = '19060'
299400           AND P-NEW-STATE = 21
299500               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
299600               MOVE '   21' TO HOLD-PROV-CBSA.
299700
299800        IF HOLD-PROV-CBSA = '22020'
299900           AND P-NEW-STATE = 24
300000               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
300100               MOVE '   24' TO HOLD-PROV-CBSA.
300200
300300        IF HOLD-PROV-CBSA = '24220'
300400           AND P-NEW-STATE = 24
300500               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
300600               MOVE '   24' TO HOLD-PROV-CBSA.
300700
300800        IF HOLD-PROV-CBSA = '24580'
300900           AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
301000           AND P-NEW-STATE = 52
301100               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
301200               MOVE '   52' TO HOLD-PROV-CBSA.
301300
301400        IF HOLD-PROV-CBSA = '25540'
301500           AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
301600           AND P-NEW-STATE = 07
301700               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
301800               MOVE '   07' TO HOLD-PROV-CBSA.
301900
302000        IF HOLD-PROV-CBSA = '30300'
302100           AND P-NEW-STATE = 50
302200               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
302300               MOVE '   50' TO HOLD-PROV-CBSA.
302400
302500        IF HOLD-PROV-CBSA = '37620'
302600           AND P-NEW-STATE = 36
302700               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
302800               MOVE '   36' TO HOLD-PROV-CBSA.
302900
303000        IF HOLD-PROV-CBSA = '39900'
303100           AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
303200           AND P-NEW-STATE = 05
303300               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
303400               MOVE '   05' TO HOLD-PROV-CBSA.
303500
303600        IF HOLD-PROV-CBSA = '48260'
303700           AND P-NEW-STATE = 36
303800               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
303900               MOVE '   36' TO HOLD-PROV-CBSA.
304000
304100        IF HOLD-PROV-CBSA = '48540'
304200           AND P-NEW-STATE = 36
304300               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
304400               MOVE '   36' TO HOLD-PROV-CBSA.
304500
304600        IF HOLD-PROV-CBSA = '48540'
304700           AND P-NEW-STATE = 51
304800               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
304900               MOVE '   51' TO HOLD-PROV-CBSA.
305000
305100        IF HOLD-PROV-CBSA = '48864'
305200           AND P-NEW-STATE = 31
305300               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
305400               MOVE '   31' TO HOLD-PROV-CBSA.
305500
305600        IF HOLD-PROV-CBSA = '49660'
305700           AND P-NEW-STATE = 36
305800               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
305900               MOVE '   36' TO HOLD-PROV-CBSA.
306000
306100 2300-2006-EXIT. EXIT.
306200
306300 2300-2007-FLOOR-CBSA.
306400
306500        IF HOLD-PROV-CBSA = '   10'
306600           AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
306700           AND P-NEW-STATE = 10
306800               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
306900               MOVE '   10' TO HOLD-PROV-CBSA.
307000
307100        IF HOLD-PROV-CBSA = '   14'
307200           AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
307300           AND P-NEW-STATE = 14
307400               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
307500               MOVE '   14' TO HOLD-PROV-CBSA.
307600
307700        IF HOLD-PROV-CBSA = '   26'
307800           AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
307900           AND P-NEW-STATE = 26
308000               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
308100               MOVE '   26' TO HOLD-PROV-CBSA.
308200
308300        IF HOLD-PROV-CBSA = '   50'
308400           AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
308500           AND P-NEW-STATE = 50
308600               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
308700               MOVE '   50' TO HOLD-PROV-CBSA.
308800
308900        IF HOLD-PROV-CBSA = '10900'
309000           AND P-NEW-STATE = 31
309100               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
309200               MOVE '   31' TO HOLD-PROV-CBSA.
309300
309400        IF HOLD-PROV-CBSA = '19060'
309500           AND P-NEW-STATE = 21
309600               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
309700               MOVE '   21' TO HOLD-PROV-CBSA.
309800
309900        IF HOLD-PROV-CBSA = '22020'
310000           AND P-NEW-STATE = 24
310100               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
310200               MOVE '   24' TO HOLD-PROV-CBSA.
310300
310400        IF HOLD-PROV-CBSA = '24220'
310500           AND P-NEW-STATE = 24
310600               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
310700               MOVE '   24' TO HOLD-PROV-CBSA.
310800
310900        IF HOLD-PROV-CBSA = '24580'
311000           AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
311100           AND P-NEW-STATE = 52
311200               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
311300               MOVE '   52' TO HOLD-PROV-CBSA.
311400
311500        IF HOLD-PROV-CBSA = '25540'
311600           AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
311700           AND P-NEW-STATE = 07
311800               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
311900               MOVE '   07' TO HOLD-PROV-CBSA.
312000
312100        IF HOLD-PROV-CBSA = '26580'
312200           AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
312300           AND P-NEW-STATE = 36
312400               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
312500               MOVE '   36' TO HOLD-PROV-CBSA.
312600
312700        IF B-N-DISCHARGE-DATE < 20061103
312800           IF (HOLD-PROV-CBSA = '27860'
312900               AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
313000               AND P-NEW-STATE = 26)
313100                   MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
313200                   MOVE '   26' TO HOLD-PROV-CBSA.
313300
313400        IF HOLD-PROV-CBSA = '29100'
313500           AND P-NEW-STATE = 52
313600               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
313700               MOVE '   52' TO HOLD-PROV-CBSA.
313800
313900        IF HOLD-PROV-CBSA = '30300'
314000           AND P-NEW-STATE = 50
314100               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
314200               MOVE '   50' TO HOLD-PROV-CBSA.
314300
314400        IF HOLD-PROV-CBSA = '37620'
314500           AND P-NEW-STATE = 36
314600               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
314700               MOVE '   36' TO HOLD-PROV-CBSA.
314800
314900        IF HOLD-PROV-CBSA = '37964'
315000           AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
315100           AND P-NEW-STATE = 31
315200               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
315300               MOVE '   31' TO HOLD-PROV-CBSA.
315400
315500        IF HOLD-PROV-CBSA = '38300'
315600           AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
315700           AND P-NEW-STATE = 36
315800               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
315900               MOVE '   36' TO HOLD-PROV-CBSA.
316000
316100        IF HOLD-PROV-CBSA = '39300'
316200           AND P-NEW-STATE = 22
316300               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
316400               MOVE '   22' TO HOLD-PROV-CBSA.
316500
316600        IF HOLD-PROV-CBSA = '39300'
316700           AND P-NEW-STATE = 41
316800               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
316900               MOVE '   41' TO HOLD-PROV-CBSA.
317000
317100        IF HOLD-PROV-CBSA = '45500'
317200           AND P-NEW-STATE = 45
317300               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
317400               MOVE '   45' TO HOLD-PROV-CBSA.
317500
317600        IF HOLD-PROV-CBSA = '48260'
317700           AND P-NEW-STATE = 36
317800               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
317900               MOVE '   36' TO HOLD-PROV-CBSA.
318000
318100        IF HOLD-PROV-CBSA = '48540'
318200           AND P-NEW-STATE = 36
318300               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
318400               MOVE '   36' TO HOLD-PROV-CBSA.
318500
318600        IF HOLD-PROV-CBSA = '48540'
318700           AND P-NEW-STATE = 51
318800               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
318900               MOVE '   51' TO HOLD-PROV-CBSA.
319000
319100        IF HOLD-PROV-CBSA = '48864'
319200           AND P-NEW-STATE = 31
319300               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
319400               MOVE '   31' TO HOLD-PROV-CBSA.
319500
319600
319700 2300-2007-EXIT. EXIT.
319800
319900 2300-2008-FLOOR-CBSA.
320000
320100        IF HOLD-PROV-CBSA = '   39'
320200           AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
320300           AND P-NEW-STATE = 33
320400               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
320500               MOVE '   33' TO HOLD-PROV-CBSA.
320600
320700        IF HOLD-PROV-CBSA = '   39'
320800           AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
320900           AND P-NEW-STATE = 39
321000               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
321100               MOVE '   39' TO HOLD-PROV-CBSA.
321200
321300        IF HOLD-PROV-CBSA = '10900'
321400           AND P-NEW-STATE = 31
321500               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
321600               MOVE '   31' TO HOLD-PROV-CBSA.
321700
321800        IF HOLD-PROV-CBSA = '19060'
321900           AND P-NEW-STATE = 21
322000               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
322100               MOVE '   21' TO HOLD-PROV-CBSA.
322200
322300        IF HOLD-PROV-CBSA = '21780'
322400           AND P-NEW-STATE = 15
322500               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
322600               MOVE '   15' TO HOLD-PROV-CBSA.
322700
322800        IF HOLD-PROV-CBSA = '21780'
322900           AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
323000           AND P-NEW-STATE = 15
323100               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
323200               MOVE '   15' TO HOLD-PROV-CBSA.
323300
323400        IF HOLD-PROV-CBSA = '22020'
323500           AND P-NEW-STATE = 24
323600               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
323700               MOVE '   24' TO HOLD-PROV-CBSA.
323800
323900        IF HOLD-PROV-CBSA = '24220'
324000           AND P-NEW-STATE = 24
324100               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
324200               MOVE '   24' TO HOLD-PROV-CBSA.
324300
324400        IF HOLD-PROV-CBSA = '24580'
324500           AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
324600           AND P-NEW-STATE = 52
324700               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
324800               MOVE '   52' TO HOLD-PROV-CBSA.
324900
325000        IF HOLD-PROV-CBSA = '25540'
325100           AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
325200           AND P-NEW-STATE = 07
325300               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
325400               MOVE '   07' TO HOLD-PROV-CBSA.
325500
325600        IF HOLD-PROV-CBSA = '28420'
325700           AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
325800           AND P-NEW-STATE = 50
325900               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
326000               MOVE '   50' TO HOLD-PROV-CBSA.
326100
326200        IF HOLD-PROV-CBSA = '28700'
326300           AND P-NEW-STATE = 44
326400               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
326500               MOVE '   44' TO HOLD-PROV-CBSA.
326600
326700        IF HOLD-PROV-CBSA = '28700'
326800           AND P-NEW-STATE = 49
326900               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
327000               MOVE '   49' TO HOLD-PROV-CBSA.
327100
327200        IF HOLD-PROV-CBSA = '30300'
327300           AND P-NEW-STATE = 50
327400               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
327500               MOVE '   50' TO HOLD-PROV-CBSA.
327600
327700        IF HOLD-PROV-CBSA = '35084'
327800           AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
327900           AND P-NEW-STATE = 31
328000               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
328100               MOVE '   31' TO HOLD-PROV-CBSA.
328200
328300        IF HOLD-PROV-CBSA = '37620'
328400           AND P-NEW-STATE = 36
328500               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
328600               MOVE '   36' TO HOLD-PROV-CBSA.
328700
328800        IF HOLD-PROV-CBSA = '37964'
328900           AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
329000           AND P-NEW-STATE = 31
329100               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
329200               MOVE '   31' TO HOLD-PROV-CBSA.
329300
329400        IF HOLD-PROV-CBSA = '38300'
329500           AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
329600           AND P-NEW-STATE = 36
329700               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
329800               MOVE '   36' TO HOLD-PROV-CBSA.
329900
330000        IF HOLD-PROV-CBSA = '45500'
330100           AND P-NEW-STATE = 45
330200               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
330300               MOVE '   45' TO HOLD-PROV-CBSA.
330400
330500        IF HOLD-PROV-CBSA = '48260'
330600           AND P-NEW-STATE = 36
330700               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
330800               MOVE '   36' TO HOLD-PROV-CBSA.
330900
331000        IF HOLD-PROV-CBSA = '48540'
331100           AND P-NEW-STATE = 36
331200               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
331300               MOVE '   36' TO HOLD-PROV-CBSA.
331400
331500        IF HOLD-PROV-CBSA = '48540'
331600           AND P-NEW-STATE = 51
331700               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
331800               MOVE '   51' TO HOLD-PROV-CBSA.
331900
332000        IF HOLD-PROV-CBSA = '48864'
332100           AND P-NEW-STATE = 31
332200               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
332300               MOVE '   31' TO HOLD-PROV-CBSA.
332400
332500        IF HOLD-PROV-CBSA = '48864'
332600           AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
332700           AND P-NEW-STATE = 31
332800               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
332900               MOVE '   31' TO HOLD-PROV-CBSA.
333000
333100
333200 2300-2008-EXIT. EXIT.
333300
333400**************YEARCHANGE 2009.3 **********************      *****
333500
333600 2300-2009-FLOOR-CBSA.
333700
333800        IF HOLD-PROV-CBSA = '   04'
333900           AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
334000           AND P-NEW-STATE = 04
334100               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
334200               MOVE '   04' TO HOLD-PROV-CBSA.
334300
334400        IF HOLD-PROV-CBSA = '   04'
334500           AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
334600           AND P-NEW-STATE = 19
334700               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
334800               MOVE '   19' TO HOLD-PROV-CBSA.
334900
335000        IF HOLD-PROV-CBSA = '   14'
335100           AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
335200           AND P-NEW-STATE = 14
335300               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
335400               MOVE '   14' TO HOLD-PROV-CBSA.
335500
335600        IF HOLD-PROV-CBSA = '   14'
335700           AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
335800           AND P-NEW-STATE = 26
335900               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
336000               MOVE '   26' TO HOLD-PROV-CBSA.
336100
336200        IF HOLD-PROV-CBSA = '10900'
336300           AND P-NEW-STATE = 31
336400               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
336500               MOVE '   31' TO HOLD-PROV-CBSA.
336600
336700        IF HOLD-PROV-CBSA = '19340'
336800           AND P-NEW-STATE = 16
336900               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
337000               MOVE '   16' TO HOLD-PROV-CBSA.
337100
337200        IF HOLD-PROV-CBSA = '21780'
337300           AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
337400           AND P-NEW-STATE = 15
337500               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
337600               MOVE '   15' TO HOLD-PROV-CBSA.
337700
337800        IF HOLD-PROV-CBSA = '22020'
337900           AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
338000           AND P-NEW-STATE = 43
338100               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
338200               MOVE '   43' TO HOLD-PROV-CBSA.
338300
338400        IF HOLD-PROV-CBSA = '22900'
338500           AND P-NEW-STATE = 37
338600               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
338700               MOVE '   37' TO HOLD-PROV-CBSA.
338800
338900        IF HOLD-PROV-CBSA = '24580'
339000           AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
339100           AND P-NEW-STATE = 52
339200               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
339300               MOVE '   52' TO HOLD-PROV-CBSA.
339400
339500        IF HOLD-PROV-CBSA = '25540'
339600           AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
339700           AND P-NEW-STATE = 07
339800               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
339900               MOVE '   07' TO HOLD-PROV-CBSA.
340000
340100        IF HOLD-PROV-CBSA = '28420'
340200           AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
340300           AND P-NEW-STATE = 50
340400               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
340500               MOVE '   50' TO HOLD-PROV-CBSA.
340600
340700        IF HOLD-PROV-CBSA = '28700'
340800           AND P-NEW-STATE = 44
340900               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
341000               MOVE '   44' TO HOLD-PROV-CBSA.
341100
341200        IF HOLD-PROV-CBSA = '28700'
341300           AND P-NEW-STATE = 49
341400               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
341500               MOVE '   49' TO HOLD-PROV-CBSA.
341600
341700        IF HOLD-PROV-CBSA = '28700'
341800           AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
341900           AND P-NEW-STATE = 18
342000               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
342100               MOVE '   18' TO HOLD-PROV-CBSA.
342200
342300        IF HOLD-PROV-CBSA = '28700'
342400           AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
342500           AND P-NEW-STATE = 44
342600               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
342700               MOVE '   44' TO HOLD-PROV-CBSA.
342800
342900        IF HOLD-PROV-CBSA = '28940'
343000           AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
343100           AND P-NEW-STATE = 18
343200               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
343300               MOVE '   18' TO HOLD-PROV-CBSA.
343400
343500        IF HOLD-PROV-CBSA = '28940'
343600           AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
343700           AND P-NEW-STATE = 44
343800               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
343900               MOVE '   44' TO HOLD-PROV-CBSA.
344000
344100        IF HOLD-PROV-CBSA = '34820'
344200           AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
344300           AND P-NEW-STATE = 34
344400               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
344500               MOVE '   34' TO HOLD-PROV-CBSA.
344600
344700        IF HOLD-PROV-CBSA = '34820'
344800           AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
344900           AND P-NEW-STATE = 42
345000               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
345100               MOVE '   42' TO HOLD-PROV-CBSA.
345200
345300        IF HOLD-PROV-CBSA = '37620'
345400           AND P-NEW-STATE = 36
345500               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
345600               MOVE '   36' TO HOLD-PROV-CBSA.
345700
345800        IF HOLD-PROV-CBSA = '37964'
345900           AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
346000           AND P-NEW-STATE = 31
346100               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
346200               MOVE '   31' TO HOLD-PROV-CBSA.
346300
346400        IF HOLD-PROV-CBSA = '38340'
346500           AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
346600           AND P-NEW-STATE = 47
346700               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
346800               MOVE '   47' TO HOLD-PROV-CBSA.
346900
347000        IF HOLD-PROV-CBSA = '41620'
347100           AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
347200           AND P-NEW-STATE = 29
347300               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
347400               MOVE '   29' TO HOLD-PROV-CBSA.
347500
347600        IF HOLD-PROV-CBSA = '43580'
347700           AND P-NEW-STATE = 16
347800               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
347900               MOVE '   16' TO HOLD-PROV-CBSA.
348000
348100        IF HOLD-PROV-CBSA = '48540'
348200           AND P-NEW-STATE = 36
348300               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
348400               MOVE '   36' TO HOLD-PROV-CBSA.
348500
348600        IF HOLD-PROV-CBSA = '48540'
348700           AND P-NEW-STATE = 51
348800               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
348900               MOVE '   51' TO HOLD-PROV-CBSA.
349000
349100        IF HOLD-PROV-CBSA = '48864'
349200           AND P-NEW-STATE = 31
349300               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
349400               MOVE '   31' TO HOLD-PROV-CBSA.
349500
349600        IF HOLD-PROV-CBSA = '48864'
349700           AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
349800           AND P-NEW-STATE = 31
349900               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
350000               MOVE '   31' TO HOLD-PROV-CBSA.
350100
350200        IF HOLD-PROV-CBSA = '19060'
350300           AND P-NEW-STATE = 21
350400               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
350500               MOVE '   21' TO HOLD-PROV-CBSA.
350600
350700        IF HOLD-PROV-CBSA = '19060'
350800           AND P-NEW-STATE = 51
350900               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
351000               MOVE '   51' TO HOLD-PROV-CBSA.
351100
351200        IF HOLD-PROV-CBSA = '22020'
351300           AND P-NEW-STATE = 24
351400               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
351500               MOVE '   24' TO HOLD-PROV-CBSA.
351600
351700        IF HOLD-PROV-CBSA = '24220'
351800           AND P-NEW-STATE = 24
351900               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
352000               MOVE '   24' TO HOLD-PROV-CBSA.
352100
352200        IF HOLD-PROV-CBSA = '30300'
352300           AND P-NEW-STATE = 50
352400               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
352500               MOVE '   50' TO HOLD-PROV-CBSA.
352600
352700        IF HOLD-PROV-CBSA = '48260'
352800           AND P-NEW-STATE = 36
352900               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
353000               MOVE '   36' TO HOLD-PROV-CBSA.
353100
353200
353300
353400**************YEARCHANGE 2009.3 **********************      *****
353500
353600 2300-2009-EXIT. EXIT.
353700
353800**************YEARCHANGE 2010.0 **********************      *****
353900
354000 2300-2010-FLOOR-CBSA.
354100
354200        IF HOLD-PROV-CBSA = '   33'
354300          AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
354400          AND P-NEW-STATE = 33
354500               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
354600               MOVE '   33' TO HOLD-PROV-CBSA.
354700
354800        IF HOLD-PROV-CBSA = '   30'
354900          AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
355000          AND P-NEW-STATE = 30
355100               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
355200               MOVE '   30' TO HOLD-PROV-CBSA.
355300
355400        IF HOLD-PROV-CBSA = '   33'
355500          AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
355600          AND P-NEW-STATE = 30
355700               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
355800               MOVE '   30' TO HOLD-PROV-CBSA.
355900
356000        IF HOLD-PROV-CBSA = '10900'
356100           AND P-NEW-STATE = 31
356200               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
356300               MOVE '   31' TO HOLD-PROV-CBSA.
356400
356500        IF HOLD-PROV-CBSA = '19340'
356600           AND P-NEW-STATE = 16
356700               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
356800               MOVE '   16' TO HOLD-PROV-CBSA.
356900
357000        IF HOLD-PROV-CBSA = '19340'
357100           AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
357200           AND P-NEW-STATE = 16
357300               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
357400               MOVE '   16' TO HOLD-PROV-CBSA.
357500
357600        IF HOLD-PROV-CBSA = '21780'
357700           AND P-NEW-STATE = 15
357800               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
357900               MOVE '   15' TO HOLD-PROV-CBSA.
358000
358100        IF HOLD-PROV-CBSA = '21780'
358200           AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
358300           AND P-NEW-STATE = 15
358400               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
358500               MOVE '   15' TO HOLD-PROV-CBSA.
358600
358700        IF HOLD-PROV-CBSA = '25180'
358800           AND P-NEW-STATE = 21
358900               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
359000               MOVE '   21' TO HOLD-PROV-CBSA.
359100
359200        IF HOLD-PROV-CBSA = '25540'
359300           AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
359400           AND P-NEW-STATE = 07
359500               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
359600               MOVE '   07' TO HOLD-PROV-CBSA.
359700
359800        IF HOLD-PROV-CBSA = '28420'
359900           AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
360000           AND P-NEW-STATE = 50
360100               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
360200               MOVE '   50' TO HOLD-PROV-CBSA.
360300
360400        IF HOLD-PROV-CBSA = '28940'
360500           AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
360600           AND P-NEW-STATE = 18
360700               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
360800               MOVE '   18' TO HOLD-PROV-CBSA.
360900
361000        IF HOLD-PROV-CBSA = '28940'
361100           AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
361200           AND P-NEW-STATE = 44
361300               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
361400               MOVE '   44' TO HOLD-PROV-CBSA.
361500
361600        IF HOLD-PROV-CBSA = '35084'
361700           AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
361800           AND P-NEW-STATE = 31
361900               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
362000               MOVE '   31' TO HOLD-PROV-CBSA.
362100
362200        IF HOLD-PROV-CBSA = '37620'
362300           AND P-NEW-STATE = 36
362400               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
362500               MOVE '   36' TO HOLD-PROV-CBSA.
362600
362700        IF HOLD-PROV-CBSA = '37964'
362800           AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
362900           AND P-NEW-STATE = 31
363000               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
363100               MOVE '   31' TO HOLD-PROV-CBSA.
363200
363300        IF HOLD-PROV-CBSA = '48540'
363400           AND P-NEW-STATE = 36
363500               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
363600               MOVE '   36' TO HOLD-PROV-CBSA.
363700
363800        IF HOLD-PROV-CBSA = '48540'
363900           AND P-NEW-STATE = 51
364000               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
364100               MOVE '   51' TO HOLD-PROV-CBSA.
364200
364300        IF HOLD-PROV-CBSA = '48864'
364400           AND P-NEW-STATE = 31
364500               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
364600               MOVE '   31' TO HOLD-PROV-CBSA.
364700
364800        IF HOLD-PROV-CBSA = '48864'
364900           AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
365000           AND P-NEW-STATE = 31
365100               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
365200               MOVE '   31' TO HOLD-PROV-CBSA.
365300
365400        IF HOLD-PROV-CBSA = '49660'
365500           AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
365600           AND P-NEW-STATE = 36
365700               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
365800               MOVE '   36' TO HOLD-PROV-CBSA.
365900
366000        IF HOLD-PROV-CBSA = '19060'
366100           AND P-NEW-STATE = 21
366200               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
366300               MOVE '   21' TO HOLD-PROV-CBSA.
366400
366500        IF HOLD-PROV-CBSA = '22020'
366600           AND P-NEW-STATE = 24
366700               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
366800               MOVE '   24' TO HOLD-PROV-CBSA.
366900
367000        IF HOLD-PROV-CBSA = '24220'
367100           AND P-NEW-STATE = 24
367200               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
367300               MOVE '   24' TO HOLD-PROV-CBSA.
367400
367500        IF HOLD-PROV-CBSA = '30300'
367600           AND P-NEW-STATE = 50
367700               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
367800               MOVE '   50' TO HOLD-PROV-CBSA.
367900
368000        IF HOLD-PROV-CBSA = '35084'
368100           AND P-NEW-STATE = 31
368200               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
368300               MOVE '   31' TO HOLD-PROV-CBSA.
368400
368500        IF HOLD-PROV-CBSA = '48260'
368600           AND P-NEW-STATE = 36
368700               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
368800               MOVE '   36' TO HOLD-PROV-CBSA.
368900
369000        IF HOLD-PROV-CBSA = '48260'
369100           AND P-NEW-STATE = 51
369200               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
369300               MOVE '   51' TO HOLD-PROV-CBSA.
369400
369500
369600
369700**************YEARCHANGE 2010.0 **********************      *****
369800
369900 2300-2010-EXIT. EXIT.
370000
370100
370200**************YEARCHANGE 2011.0 **********************      *****
370300
370400 2300-2011-FLOOR-CBSA.
370500
370600        IF HOLD-PROV-CBSA = '   45'
370700          AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
370800          AND P-NEW-STATE = 45
370900               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
371000               MOVE '   45' TO HOLD-PROV-CBSA.
371100
371200        IF HOLD-PROV-CBSA = '   37'
371300          AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
371400          AND P-NEW-STATE = 37
371500               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
371600               MOVE '   37' TO HOLD-PROV-CBSA.
371700
371800        IF HOLD-PROV-CBSA = '10900'
371900           AND P-NEW-STATE = 31
372000               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
372100               MOVE '   31' TO HOLD-PROV-CBSA.
372200
372300        IF HOLD-PROV-CBSA = '21500'
372400          AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
372500           AND P-NEW-STATE = 33
372600               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
372700               MOVE '   33' TO HOLD-PROV-CBSA.
372800
372900        IF HOLD-PROV-CBSA = '21500'
373000          AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
373100           AND P-NEW-STATE = 39
373200               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
373300               MOVE '   39' TO HOLD-PROV-CBSA.
373400
373500        IF HOLD-PROV-CBSA = '21780'
373600           AND P-NEW-STATE = 15
373700               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
373800               MOVE '   15' TO HOLD-PROV-CBSA.
373900
374000        IF HOLD-PROV-CBSA = '22900'
374100           AND P-NEW-STATE = 37
374200               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
374300               MOVE '   37' TO HOLD-PROV-CBSA.
374400
374500        IF HOLD-PROV-CBSA = '24540'
374600           AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
374700           AND P-NEW-STATE = 53
374800               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
374900               MOVE '   53' TO HOLD-PROV-CBSA.
375000
375100        IF HOLD-PROV-CBSA = '25540'
375200           AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
375300           AND P-NEW-STATE = 07
375400               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
375500               MOVE '   07' TO HOLD-PROV-CBSA.
375600
375700        IF HOLD-PROV-CBSA = '28700'
375800           AND P-NEW-STATE = 44
375900               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
376000               MOVE '   44' TO HOLD-PROV-CBSA.
376100
376200        IF HOLD-PROV-CBSA = '28700'
376300           AND P-NEW-STATE = 49
376400               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
376500               MOVE '   49' TO HOLD-PROV-CBSA.
376600
376700        IF HOLD-PROV-CBSA = '28940'
376800           AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
376900           AND P-NEW-STATE = 18
377000               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
377100               MOVE '   18' TO HOLD-PROV-CBSA.
377200
377300        IF HOLD-PROV-CBSA = '28940'
377400           AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
377500           AND P-NEW-STATE = 44
377600               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
377700               MOVE '   44' TO HOLD-PROV-CBSA.
377800
377900        IF HOLD-PROV-CBSA = '37620'
378000           AND P-NEW-STATE = 36
378100               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
378200               MOVE '   36' TO HOLD-PROV-CBSA.
378300
378400        IF HOLD-PROV-CBSA = '37620'
378500           AND P-NEW-STATE = 51
378600               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
378700               MOVE '   51' TO HOLD-PROV-CBSA.
378800
378900        IF HOLD-PROV-CBSA = '37964'
379000           AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
379100           AND P-NEW-STATE = 31
379200               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
379300               MOVE '   31' TO HOLD-PROV-CBSA.
379400
379500        IF HOLD-PROV-CBSA = '38300'
379600           AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
379700           AND P-NEW-STATE = 36
379800               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
379900               MOVE '   36' TO HOLD-PROV-CBSA.
380000
380100        IF HOLD-PROV-CBSA = '38300'
380200           AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
380300           AND P-NEW-STATE = 39
380400               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
380500               MOVE '   39' TO HOLD-PROV-CBSA.
380600
380700        IF HOLD-PROV-CBSA = '43580'
380800           AND P-NEW-STATE = 43
380900               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
381000               MOVE '   43' TO HOLD-PROV-CBSA.
381100
381200        IF HOLD-PROV-CBSA = '48540'
381300           AND P-NEW-STATE = 36
381400               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
381500               MOVE '   36' TO HOLD-PROV-CBSA.
381600
381700        IF HOLD-PROV-CBSA = '48540'
381800           AND P-NEW-STATE = 51
381900               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
382000               MOVE '   51' TO HOLD-PROV-CBSA.
382100
382200        IF HOLD-PROV-CBSA = '48864'
382300           AND P-NEW-STATE = 31
382400               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
382500               MOVE '   31' TO HOLD-PROV-CBSA.
382600
382700        IF HOLD-PROV-CBSA = '17300'
382800           AND P-NEW-STATE = 18
382900               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
383000               MOVE '   18' TO HOLD-PROV-CBSA.
383100
383200        IF HOLD-PROV-CBSA = '17300'
383300           AND P-NEW-STATE = 44
383400               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
383500               MOVE '   44' TO HOLD-PROV-CBSA.
383600
383700        IF HOLD-PROV-CBSA = '19060'
383800           AND P-NEW-STATE = 21
383900               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
384000               MOVE '   21' TO HOLD-PROV-CBSA.
384100
384200        IF HOLD-PROV-CBSA = '22020'
384300           AND P-NEW-STATE = 24
384400               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
384500               MOVE '   24' TO HOLD-PROV-CBSA.
384600
384700        IF HOLD-PROV-CBSA = '22020'
384800           AND P-NEW-STATE = 35
384900               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
385000               MOVE '   35' TO HOLD-PROV-CBSA.
385100
385200        IF HOLD-PROV-CBSA = '24220'
385300           AND P-NEW-STATE = 24
385400               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
385500               MOVE '   24' TO HOLD-PROV-CBSA.
385600
385700        IF HOLD-PROV-CBSA = '24220'
385800           AND P-NEW-STATE = 35
385900               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
386000               MOVE '   35' TO HOLD-PROV-CBSA.
386100
386200        IF HOLD-PROV-CBSA = '30300'
386300           AND P-NEW-STATE = 50
386400               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
386500               MOVE '   50' TO HOLD-PROV-CBSA.
386600
386700        IF HOLD-PROV-CBSA = '44600'
386800           AND P-NEW-STATE = 36
386900               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
387000               MOVE '   36' TO HOLD-PROV-CBSA.
387100
387200        IF HOLD-PROV-CBSA = '44600'
387300           AND P-NEW-STATE = 51
387400               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
387500               MOVE '   51' TO HOLD-PROV-CBSA.
387600
387700        IF HOLD-PROV-CBSA = '45500'
387800           AND P-NEW-STATE = 45
387900               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
388000               MOVE '   45' TO HOLD-PROV-CBSA.
388100
388200
388300**************YEARCHANGE 2011.0 **********************      *****
388400
388500 2300-2011-EXIT. EXIT.
388600
388700**************YEARCHANGE 2012.0 **********************      *****
388800
388900 2300-2012-FLOOR-CBSA.
389000
389100**************YEARCHANGE 2012.0 ******************************
389200
389300        IF HOLD-PROV-CBSA = '   30'
389400          AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
389500          AND P-NEW-STATE = 30
389600               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
389700               MOVE '   30' TO HOLD-PROV-CBSA.
389800
389900        IF HOLD-PROV-CBSA = '   39'
390000          AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
390100          AND P-NEW-STATE = 39
390200               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
390300               MOVE '   39' TO HOLD-PROV-CBSA.
390400
390500        IF HOLD-PROV-CBSA = '   39'
390600          AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
390700          AND P-NEW-STATE = 33
390800               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
390900               MOVE '   33' TO HOLD-PROV-CBSA.
391000
391100        IF HOLD-PROV-CBSA = '10900'
391200           AND P-NEW-STATE = 31
391300               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
391400               MOVE '   31' TO HOLD-PROV-CBSA.
391500
391600        IF HOLD-PROV-CBSA = '14484'
391700           AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
391800           AND P-NEW-STATE = 22
391900               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
392000               MOVE '   22' TO HOLD-PROV-CBSA.
392100
392200        IF HOLD-PROV-CBSA = '16020'
392300           AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
392400           AND P-NEW-STATE = 14
392500               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
392600               MOVE '   14' TO HOLD-PROV-CBSA.
392700
392800        IF HOLD-PROV-CBSA = '21500'
392900          AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
393000           AND P-NEW-STATE = 33
393100               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
393200               MOVE '   33' TO HOLD-PROV-CBSA.
393300
393400        IF HOLD-PROV-CBSA = '21500'
393500          AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
393600           AND P-NEW-STATE = 39
393700               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
393800               MOVE '   39' TO HOLD-PROV-CBSA.
393900
394000        IF HOLD-PROV-CBSA = '22900'
394100           AND P-NEW-STATE = 37
394200               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
394300               MOVE '   37' TO HOLD-PROV-CBSA.
394400
394500        IF HOLD-PROV-CBSA = '25180'
394600           AND P-NEW-STATE = 21
394700               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
394800               MOVE '   21' TO HOLD-PROV-CBSA.
394900
395000        IF HOLD-PROV-CBSA = '25540'
395100           AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
395200           AND P-NEW-STATE = 07
395300               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
395400               MOVE '   07' TO HOLD-PROV-CBSA.
395500
395600        IF HOLD-PROV-CBSA = '25540'
395700           AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
395800           AND P-NEW-STATE = 22
395900               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
396000               MOVE '   22' TO HOLD-PROV-CBSA.
396100
396200        IF HOLD-PROV-CBSA = '26820'
396300           AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
396400           AND P-NEW-STATE = 53
396500               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
396600               MOVE '   53' TO HOLD-PROV-CBSA.
396700
396800        IF HOLD-PROV-CBSA = '28700'
396900           AND P-NEW-STATE = 44
397000               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
397100               MOVE '   44' TO HOLD-PROV-CBSA.
397200
397300        IF HOLD-PROV-CBSA = '28700'
397400           AND P-NEW-STATE = 49
397500               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
397600               MOVE '   49' TO HOLD-PROV-CBSA.
397700
397800        IF HOLD-PROV-CBSA = '28700'
397900           AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
398000           AND P-NEW-STATE = 18
398100               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
398200               MOVE '   18' TO HOLD-PROV-CBSA.
398300
398400        IF HOLD-PROV-CBSA = '28700'
398500           AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
398600           AND P-NEW-STATE = 44
398700               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
398800               MOVE '   44' TO HOLD-PROV-CBSA.
398900
399000        IF HOLD-PROV-CBSA = '28940'
399100           AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
399200           AND P-NEW-STATE = 18
399300               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
399400               MOVE '   18' TO HOLD-PROV-CBSA.
399500
399600        IF HOLD-PROV-CBSA = '35084'
399700           AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
399800           AND P-NEW-STATE = 31
399900               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
400000               MOVE '   31' TO HOLD-PROV-CBSA.
400100
400200        IF HOLD-PROV-CBSA = '37620'
400300           AND P-NEW-STATE = 36
400400               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
400500               MOVE '   36' TO HOLD-PROV-CBSA.
400600
400700        IF HOLD-PROV-CBSA = '37964'
400800           AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
400900           AND P-NEW-STATE = 31
401000               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
401100               MOVE '   31' TO HOLD-PROV-CBSA.
401200
401300        IF HOLD-PROV-CBSA = '43580'
401400           AND P-NEW-STATE = 43
401500               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
401600               MOVE '   43' TO HOLD-PROV-CBSA.
401700
401800        IF HOLD-PROV-CBSA = '44600'
401900           AND P-NEW-STATE = 36
402000               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
402100               MOVE '   36' TO HOLD-PROV-CBSA.
402200
402300        IF HOLD-PROV-CBSA = '44600'
402400           AND P-NEW-STATE = 51
402500               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
402600               MOVE '   51' TO HOLD-PROV-CBSA.
402700
402800        IF HOLD-PROV-CBSA = '48540'
402900           AND P-NEW-STATE = 36
403000               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
403100               MOVE '   36' TO HOLD-PROV-CBSA.
403200
403300        IF HOLD-PROV-CBSA = '48540'
403400           AND P-NEW-STATE = 51
403500               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
403600               MOVE '   51' TO HOLD-PROV-CBSA.
403700
403800        IF HOLD-PROV-CBSA = '48864'
403900           AND P-NEW-STATE = 31
404000               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
404100               MOVE '   31' TO HOLD-PROV-CBSA.
404200
404300        IF HOLD-PROV-CBSA = '49660'
404400           AND P-NEW-STATE = 36
404500               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
404600               MOVE '   36' TO HOLD-PROV-CBSA.
404700
404800        IF HOLD-PROV-CBSA = '49660'
404900           AND P-NEW-STATE = 39
405000               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
405100               MOVE '   39' TO HOLD-PROV-CBSA.
405200
405300        IF HOLD-PROV-CBSA = '19060'
405400           AND P-NEW-STATE = 21
405500               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
405600               MOVE '   21' TO HOLD-PROV-CBSA.
405700
405800        IF HOLD-PROV-CBSA = '22020'
405900           AND P-NEW-STATE = 24
406000               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
406100               MOVE '   24' TO HOLD-PROV-CBSA.
406200
406300        IF HOLD-PROV-CBSA = '22020'
406400           AND P-NEW-STATE = 35
406500               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
406600               MOVE '   35' TO HOLD-PROV-CBSA.
406700
406800        IF HOLD-PROV-CBSA = '24220'
406900           AND P-NEW-STATE = 24
407000               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
407100               MOVE '   24' TO HOLD-PROV-CBSA.
407200
407300        IF HOLD-PROV-CBSA = '24220'
407400           AND P-NEW-STATE = 35
407500               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
407600               MOVE '   35' TO HOLD-PROV-CBSA.
407700
407800        IF HOLD-PROV-CBSA = '30300'
407900           AND P-NEW-STATE = 50
408000               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
408100               MOVE '   50' TO HOLD-PROV-CBSA.
408200
408300        IF HOLD-PROV-CBSA = '30860'
408400           AND P-NEW-STATE = 46
408500               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
408600               MOVE '   46' TO HOLD-PROV-CBSA.
408700
408800        IF HOLD-PROV-CBSA = '35084'
408900           AND P-NEW-STATE = 31
409000               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
409100               MOVE '   31' TO HOLD-PROV-CBSA.
409200
409300        IF HOLD-PROV-CBSA = '39300'
409400           AND P-NEW-STATE = 22
409500               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
409600               MOVE '   22' TO HOLD-PROV-CBSA.
409700
409800        IF HOLD-PROV-CBSA = '45500'
409900           AND P-NEW-STATE = 45
410000               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
410100               MOVE '   45' TO HOLD-PROV-CBSA.
410200
410300**************YEARCHANGE 2012.0 ******************************
410400
410500 2300-2012-EXIT. EXIT.
410600
410700**************YEARCHANGE 2013.0 **********************      *****
410800
410900 2300-2013-FLOOR-CBSA.
411000
411100**************YEARCHANGE 2013.0 ******************************
411200
411300        IF HOLD-PROV-CBSA = '10900'
411400           AND P-NEW-STATE = 31
411500               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
411600               MOVE '   31' TO HOLD-PROV-CBSA.
411700
411800        IF HOLD-PROV-CBSA = '14484'
411900           AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
412000           AND P-NEW-STATE = 22
412100               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
412200               MOVE '   22' TO HOLD-PROV-CBSA.
412300
412400        IF HOLD-PROV-CBSA = '16020'
412500           AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
412600           AND P-NEW-STATE = 14
412700               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
412800               MOVE '   14' TO HOLD-PROV-CBSA.
412900
413000        IF HOLD-PROV-CBSA = '21500'
413100          AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
413200           AND P-NEW-STATE = 33
413300               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
413400               MOVE '   33' TO HOLD-PROV-CBSA.
413500
413600        IF HOLD-PROV-CBSA = '21500'
413700          AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
413800           AND P-NEW-STATE = 39
413900               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
414000               MOVE '   39' TO HOLD-PROV-CBSA.
414100
414200        IF HOLD-PROV-CBSA = '21780'
414300          AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
414400           AND P-NEW-STATE = 15
414500               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
414600               MOVE '   15' TO HOLD-PROV-CBSA.
414700
414800        IF HOLD-PROV-CBSA = '24580'
414900          AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
415000           AND P-NEW-STATE = 52
415100               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
415200               MOVE '   52' TO HOLD-PROV-CBSA.
415300
415400        IF HOLD-PROV-CBSA = '25540'
415500           AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
415600           AND P-NEW-STATE = 07
415700               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
415800               MOVE '   07' TO HOLD-PROV-CBSA.
415900
416000        IF HOLD-PROV-CBSA = '25540'
416100           AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
416200           AND P-NEW-STATE = 22
416300               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
416400               MOVE '   22' TO HOLD-PROV-CBSA.
416500
416600        IF HOLD-PROV-CBSA = '26820'
416700           AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
416800           AND P-NEW-STATE = 53
416900               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
417000               MOVE '   53' TO HOLD-PROV-CBSA.
417100
417200        IF HOLD-PROV-CBSA = '27900'
417300           AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
417400           AND P-NEW-STATE = 17
417500               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
417600               MOVE '   17' TO HOLD-PROV-CBSA.
417700
417800        IF HOLD-PROV-CBSA = '28700'
417900           AND P-NEW-STATE = 44
418000               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
418100               MOVE '   44' TO HOLD-PROV-CBSA.
418200
418300        IF HOLD-PROV-CBSA = '28700'
418400           AND P-NEW-STATE = 49
418500               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
418600               MOVE '   49' TO HOLD-PROV-CBSA.
418700
418800        IF HOLD-PROV-CBSA = '28700'
418900           AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
419000           AND P-NEW-STATE = 18
419100               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
419200               MOVE '   18' TO HOLD-PROV-CBSA.
419300
419400        IF HOLD-PROV-CBSA = '28700'
419500           AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
419600           AND P-NEW-STATE = 44
419700               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
419800               MOVE '   44' TO HOLD-PROV-CBSA.
419900
420000        IF HOLD-PROV-CBSA = '28940'
420100           AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
420200           AND P-NEW-STATE = 18
420300               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
420400               MOVE '   18' TO HOLD-PROV-CBSA.
420500
420600        IF HOLD-PROV-CBSA = '35084'
420700           AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
420800           AND P-NEW-STATE = 31
420900               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
421000               MOVE '   31' TO HOLD-PROV-CBSA.
421100
421200        IF HOLD-PROV-CBSA = '37620'
421300           AND P-NEW-STATE = 36
421400               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
421500               MOVE '   36' TO HOLD-PROV-CBSA.
421600
421700        IF HOLD-PROV-CBSA = '37964'
421800           AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
421900           AND P-NEW-STATE = 31
422000               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
422100               MOVE '   31' TO HOLD-PROV-CBSA.
422200
422300        IF HOLD-PROV-CBSA = '38300'
422400           AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
422500           AND P-NEW-STATE = 36
422600               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
422700               MOVE '   36' TO HOLD-PROV-CBSA.
422800
422900        IF HOLD-PROV-CBSA = '43580'
423000           AND P-NEW-STATE = 43
423100               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
423200               MOVE '   43' TO HOLD-PROV-CBSA.
423300
423400        IF HOLD-PROV-CBSA = '48540'
423500           AND P-NEW-STATE = 36
423600               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
423700               MOVE '   36' TO HOLD-PROV-CBSA.
423800
423900        IF HOLD-PROV-CBSA = '48540'
424000           AND P-NEW-STATE = 51
424100               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
424200               MOVE '   51' TO HOLD-PROV-CBSA.
424300
424400        IF HOLD-PROV-CBSA = '48864'
424500           AND P-NEW-STATE = 31
424600               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
424700               MOVE '   31' TO HOLD-PROV-CBSA.
424800
424900        IF HOLD-PROV-CBSA = '49660'
425000           AND P-NEW-STATE = 36
425100               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
425200               MOVE '   36' TO HOLD-PROV-CBSA.
425300
425400        IF HOLD-PROV-CBSA = '49660'
425500           AND P-NEW-STATE = 39
425600               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
425700               MOVE '   39' TO HOLD-PROV-CBSA.
425800
425900        IF HOLD-PROV-CBSA = '22020'
426000           AND P-NEW-STATE = 24
426100               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
426200               MOVE '   24' TO HOLD-PROV-CBSA.
426300
426400        IF HOLD-PROV-CBSA = '22020'
426500           AND P-NEW-STATE = 35
426600               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
426700               MOVE '   35' TO HOLD-PROV-CBSA.
426800
426900        IF HOLD-PROV-CBSA = '24220'
427000           AND P-NEW-STATE = 24
427100               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
427200               MOVE '   24' TO HOLD-PROV-CBSA.
427300
427400        IF HOLD-PROV-CBSA = '24220'
427500           AND P-NEW-STATE = 35
427600               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
427700               MOVE '   35' TO HOLD-PROV-CBSA.
427800
427900        IF HOLD-PROV-CBSA = '30300'
428000           AND P-NEW-STATE = 50
428100               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
428200               MOVE '   50' TO HOLD-PROV-CBSA.
428300
428400        IF HOLD-PROV-CBSA = '39300'
428500           AND P-NEW-STATE = 22
428600               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
428700               MOVE '   22' TO HOLD-PROV-CBSA.
428800
428900        IF HOLD-PROV-CBSA = '39300'
429000           AND P-NEW-STATE = 41
429100               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
429200               MOVE '   41' TO HOLD-PROV-CBSA.
429300
429400        IF HOLD-PROV-CBSA = '44600'
429500           AND P-NEW-STATE = 36
429600               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
429700               MOVE '   36' TO HOLD-PROV-CBSA.
429800
429900
430000**************YEARCHANGE 2013.0 ******************************
430100
430200 2300-2013-EXIT. EXIT.
430300
430400
430500 2300-2014-FLOOR-CBSA.
430600
430700**************YEARCHANGE 2014.0 ******************************
430800
430900        IF HOLD-PROV-CBSA = '   07'
431000           AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
431100           AND P-NEW-STATE = 07
431200               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
431300               MOVE '   07' TO HOLD-PROV-CBSA.
431400
431500        IF HOLD-PROV-CBSA = '   36'
431600           AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
431700           AND P-NEW-STATE = 36
431800               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
431900               MOVE '   36' TO HOLD-PROV-CBSA.
432000
432100        IF HOLD-PROV-CBSA = '10900'
432200           AND P-NEW-STATE = 31
432300               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
432400               MOVE '   31' TO HOLD-PROV-CBSA.
432500
432600        IF HOLD-PROV-CBSA = '14484'
432700           AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
432800           AND P-NEW-STATE = 22
432900               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
433000               MOVE '   22' TO HOLD-PROV-CBSA.
433100
433200        IF HOLD-PROV-CBSA = '17300'
433300           AND P-NEW-STATE = 18
433400               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
433500               MOVE '   18' TO HOLD-PROV-CBSA.
433600
433700        IF HOLD-PROV-CBSA = '22900'
433800           AND P-NEW-STATE = 37
433900               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
434000               MOVE '   37' TO HOLD-PROV-CBSA.
434100
434200        IF HOLD-PROV-CBSA = '25540'
434300          AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
434400           AND P-NEW-STATE = 07
434500               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
434600               MOVE '   07' TO HOLD-PROV-CBSA.
434700
434800        IF HOLD-PROV-CBSA = '25540'
434900          AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
435000           AND P-NEW-STATE = 22
435100               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
435200               MOVE '   22' TO HOLD-PROV-CBSA.
435300
435400        IF HOLD-PROV-CBSA = '26820'
435500           AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
435600           AND P-NEW-STATE = 53
435700               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
435800               MOVE '   53' TO HOLD-PROV-CBSA.
435900
436000        IF HOLD-PROV-CBSA = '27180'
436100           AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
436200           AND P-NEW-STATE = 25
436300               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
436400               MOVE '   25' TO HOLD-PROV-CBSA.
436500
436600        IF HOLD-PROV-CBSA = '28700'
436700           AND P-NEW-STATE = 44
436800               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
436900               MOVE '   44' TO HOLD-PROV-CBSA.
437000
437100        IF HOLD-PROV-CBSA = '28700'
437200           AND P-NEW-STATE = 49
437300               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
437400               MOVE '   49' TO HOLD-PROV-CBSA.
437500
437600        IF HOLD-PROV-CBSA = '35644'
437700           AND P-NEW-CBSA-SPEC-PAY-IND  = 'Y'
437800           AND P-NEW-STATE = 07
437900               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
438000               MOVE '   07' TO HOLD-PROV-CBSA.
438100
438200        IF HOLD-PROV-CBSA = '37620'
438300           AND P-NEW-STATE = 36
438400               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
438500               MOVE '   36' TO HOLD-PROV-CBSA.
438600
438700        IF HOLD-PROV-CBSA = '43580'
438800           AND P-NEW-STATE = 43
438900               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
439000               MOVE '   43' TO HOLD-PROV-CBSA.
439100
439200        IF HOLD-PROV-CBSA = '48540'
439300           AND P-NEW-STATE = 36
439400               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
439500               MOVE '   36' TO HOLD-PROV-CBSA.
439600
439700        IF HOLD-PROV-CBSA = '48540'
439800           AND P-NEW-STATE = 51
439900               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
440000               MOVE '   51' TO HOLD-PROV-CBSA.
440100
440200        IF HOLD-PROV-CBSA = '48864'
440300           AND P-NEW-STATE = 31
440400               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
440500               MOVE '   31' TO HOLD-PROV-CBSA.
440600
440700        IF HOLD-PROV-CBSA = '49660'
440800           AND P-NEW-STATE = 36
440900               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
441000               MOVE '   36' TO HOLD-PROV-CBSA.
441100
441200        IF HOLD-PROV-CBSA = '49660'
441300           AND P-NEW-STATE = 39
441400               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
441500               MOVE '   39' TO HOLD-PROV-CBSA.
441600
441700        IF HOLD-PROV-CBSA = '19060'
441800           AND P-NEW-STATE = 21
441900               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
442000               MOVE '   21' TO HOLD-PROV-CBSA.
442100
442200        IF HOLD-PROV-CBSA = '22020'
442300           AND P-NEW-STATE = 24
442400               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
442500               MOVE '   24' TO HOLD-PROV-CBSA.
442600
442700        IF HOLD-PROV-CBSA = '22020'
442800           AND P-NEW-STATE = 35
442900               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
443000               MOVE '   35' TO HOLD-PROV-CBSA.
443100
443200        IF HOLD-PROV-CBSA = '24220'
443300           AND P-NEW-STATE = 24
443400               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
443500               MOVE '   24' TO HOLD-PROV-CBSA.
443600
443700        IF HOLD-PROV-CBSA = '24220'
443800           AND P-NEW-STATE = 35
443900               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
444000               MOVE '   35' TO HOLD-PROV-CBSA.
444100
444200        IF HOLD-PROV-CBSA = '30300'
444300           AND P-NEW-STATE = 50
444400               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
444500               MOVE '   50' TO HOLD-PROV-CBSA.
444600
444700        IF HOLD-PROV-CBSA = '39300'
444800           AND P-NEW-STATE = 22
444900               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
445000               MOVE '   22' TO HOLD-PROV-CBSA.
445100
445200        IF HOLD-PROV-CBSA = '39300'
445300           AND P-NEW-STATE = 41
445400               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
445500               MOVE '   41' TO HOLD-PROV-CBSA.
445600
445700        IF HOLD-PROV-CBSA = '44600'
445800           AND P-NEW-STATE = 36
445900               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
446000               MOVE '   36' TO HOLD-PROV-CBSA.
446100
446200        IF HOLD-PROV-CBSA = '45500'
446300           AND P-NEW-STATE = 45
446400               MOVE 'N' TO P-NEW-CBSA-SPEC-PAY-IND
446500               MOVE '   45' TO HOLD-PROV-CBSA.
446600
446700
446800**************YEARCHANGE 2014.0 ******************************
446900
447000 2300-2014-EXIT. EXIT.
447100
447200 2400-CONVERT-PSF.
447300***************************************************************
447400*              CONVERSION FOR MILLENNIUM                      *
447500*    CONVERTS TO PSF FROM NEW FORMAT TO OLD FORMAT            *
447600*    THIS OLD PSF FORMAT IS PROCESSED IN NON-MILLENNIUN       *
447700*    PPS PROGRAMS                                             *
447800***************************************************************
447900     MOVE SPACES TO W-PROV-OLD-HOLD.
448000     MOVE  W-P-NEW-PROVIDER-OSCAR-NO TO W-P-PROVIDER-NO.
448100
448200     IF W-P-NEW-EFF-DATE < 0 OR
448300        W-P-NEW-EFF-DATE = '00000000'
448400        MOVE ZEROES TO W-P-EFF-DATE
448500     ELSE
448600        MOVE  W-P-NEW-EFF-DT-YY        TO W-P-EFF-YY
448700        MOVE  W-P-NEW-EFF-DT-MM        TO W-P-EFF-MM
448800        MOVE  W-P-NEW-EFF-DT-DD        TO W-P-EFF-DD.
448900     MOVE  W-P-NEW-WAIVER-CODE   TO W-P-WAIVER-CODE.
449000     MOVE  W-P-NEW-PROVIDER-TYPE TO W-P-PROVIDER-TYPE.
449100     MOVE  W-P-NEW-CURRENT-CENSUS-DIV
449200                               TO W-P-CURRENT-CENSUS-DIV.
449300     MOVE  W-P-NEW-GEO-LOC-MSA   TO W-P-MSA-X.
449400     MOVE  W-P-NEW-FAC-SPEC-RATE TO W-P-FAC-SPEC-RATE.
449500     MOVE  W-P-NEW-COLA          TO W-P-COLA.
449600     MOVE  W-P-NEW-INTERN-RATIO  TO W-P-INTERN-RATIO.
449700     MOVE  W-P-NEW-BED-SIZE      TO W-P-BED-SIZE.
449800     MOVE  W-P-NEW-CCR           TO W-P-CCR.
449900     MOVE  W-P-NEW-CMI           TO W-P-CMI.
450000
450100     IF W-P-NEW-REPORT-DATE < 0 OR
450200        W-P-NEW-REPORT-DATE = '00000000'
450300        MOVE ZEROES TO W-P-REPORT-DATE
450400     ELSE
450500        MOVE  W-P-NEW-REPORT-DT-YY  TO W-P-REPORT-DT-YY
450600        MOVE  W-P-NEW-REPORT-DT-MM  TO W-P-REPORT-DT-MM
450700        MOVE  W-P-NEW-REPORT-DT-DD  TO W-P-REPORT-DT-DD.
450800
450900     MOVE  W-P-NEW-INTER-NO      TO W-P-INTER-NO.
451000
451100     IF W-P-NEW-FY-BEGIN-DATE < 0  OR
451200        W-P-NEW-FY-BEGIN-DATE = '00000000'
451300        MOVE ZEROES TO W-P-FY-BEGIN-DATE
451400     ELSE
451500        MOVE  W-P-NEW-FY-BEG-DT-YY  TO W-P-FY-BEG-DT-YY
451600        MOVE  W-P-NEW-FY-BEG-DT-MM  TO W-P-FY-BEG-DT-MM
451700        MOVE  W-P-NEW-FY-BEG-DT-DD  TO W-P-FY-BEG-DT-DD.
451800
451900     MOVE W-P-NEW-PASS-AMT-CAPITAL    TO W-P-PASS-AMT-CAPITAL.
452000     MOVE W-P-NEW-PASS-AMT-DIR-MED-ED TO W-P-PASS-AMT-DIR-MED-ED.
452100     MOVE W-P-NEW-PASS-AMT-ORGAN-ACQ  TO W-P-PASS-AMT-ORGAN-ACQ.
452200     MOVE W-P-NEW-PASS-AMT-PLUS-MISC  TO W-P-PASS-AMT-PLUS-MISC.
452300     MOVE W-P-NEW-SSI-RATIO           TO W-P-SSI-RATIO.
452400     MOVE W-P-NEW-MEDICAID-RATIO      TO W-P-MEDICAID-RATIO.
452500
452600     IF W-P-NEW-TERMINATION-DATE < 0  OR
452700        W-P-NEW-TERMINATION-DATE = '00000000'
452800        MOVE ZEROES TO W-P-TERMINATION-DATE
452900     ELSE
453000        MOVE  W-P-NEW-TERM-DT-YY    TO W-P-TERM-DT-YY
453100        MOVE  W-P-NEW-TERM-DT-MM    TO W-P-TERM-DT-MM
453200        MOVE  W-P-NEW-TERM-DT-DD    TO W-P-TERM-DT-DD.
453300
453400     IF P-NEW-FYE-DATE  NOT NUMERIC
453500        MOVE ZEROES TO W-P-FISCAL-YEAR-END.
453600
453700     IF P-NEW-FYE-DATE               < 0  OR
453800        P-NEW-FYE-DATE               = '00000000'
453900        MOVE ZEROES TO W-P-FISCAL-YEAR-END
454000     ELSE
454100        MOVE  W-P-NEW-FYE-YY       TO W-P-YY
454200        MOVE  W-P-NEW-FYE-MM       TO W-P-MM
454300        MOVE  W-P-NEW-FYE-DD       TO W-P-DD.
454400
454500     MOVE W-P-NEW-WAGE-INDEX-LOC-MSA  TO W-P-WAGE-INDEX-LOC-MSA.
454600     MOVE W-P-NEW-CHG-CODE-INDEX      TO W-P-CHG-CODE-INDEX.
454700     MOVE W-P-NEW-STAND-AMT-LOC-MSA   TO W-P-STAND-AMT-LOC-MSA.
454800     MOVE W-P-NEW-SOL-COM-DEP-HOSP-YR TO W-P-SOL-COM-DEP-HOSP-YR.
454900     MOVE W-P-NEW-LUGAR               TO W-P-LUGAR.
455000     MOVE W-P-NEW-TEMP-RELIEF-IND     TO W-P-TEMP-RELIEF-IND.
455100     MOVE W-P-NEW-CAPI-PPS-PAY-CODE   TO W-P-CAPI-PPS-PAY-CODE.
455200     MOVE W-P-NEW-CAPI-HOSP-SPEC-RATE TO W-P-CAPI-HOSP-SPEC-RATE.
455300     MOVE W-P-NEW-CAPI-OLD-HARM-RATE  TO W-P-CAPI-OLD-HARM-RATE.
455400     MOVE W-P-NEW-CAPI-NEW-HARM-RATIO TO W-P-CAPI-NEW-HARM-RATIO.
455500     MOVE W-P-NEW-CAPI-CSTCHG-RATIO   TO W-P-CAPI-CSTCHG-RATIO.
455600     MOVE W-P-NEW-CAPI-NEW-HOSP       TO W-P-CAPI-NEW-HOSP.
455700     MOVE W-P-NEW-CAPI-IME            TO W-P-CAPI-IME.
455800     MOVE W-P-NEW-CAPI-EXCEPTIONS     TO W-P-CAPI-EXCEPTIONS.
455900 2400-EXIT.   EXIT.
456000
456100 2500-2000-WI-LUGER.
456200***************************************************************
456300****    FOR FY 2000 NEW LUGAR HOSPITALS ONLY                  *
456400***************************************************************
456500
456600     IF (P-NEW-PROVIDER-NO = '140012' OR '150002' OR '150004' OR
456700                             '150008' OR '150034' OR '150090' OR
456800                             '150125' OR '150126' OR '150132')
456900            AND (P-NEW-STAND-AMT-LOC-MSA = '1600'
457000            AND P-NEW-WAGE-INDEX-LOC-MSA = '1600'
457100            AND P-NEW-CHG-CODE-INDEX  = 'Y')
457200          MOVE 01.0750 TO W-NEW-INDEX-RECORD.
457300
457400     IF (P-NEW-PROVIDER-NO = '250078')
457500            AND (P-NEW-STAND-AMT-LOC-MSA = '3285'
457600            AND P-NEW-WAGE-INDEX-LOC-MSA = '3285'
457700            AND P-NEW-CHG-CODE-INDEX  = 'Y')
457800          MOVE 00.7634 TO W-NEW-INDEX-RECORD.
457900
458000     IF (P-NEW-PROVIDER-NO = '330001' OR '330126' OR '330135' OR
458100                             '330205' OR '330209' OR '330264')
458200            AND (P-NEW-STAND-AMT-LOC-MSA = '5600'
458300            AND P-NEW-WAGE-INDEX-LOC-MSA = '5600'
458400            AND P-NEW-CHG-CODE-INDEX  = 'Y')
458500          MOVE 01.4342 TO W-NEW-INDEX-RECORD.
458600
458700     IF (P-NEW-PROVIDER-NO = '340039' OR '340129' OR '340144')
458800            AND (P-NEW-STAND-AMT-LOC-MSA = '1520'
458900            AND P-NEW-WAGE-INDEX-LOC-MSA = '1520'
459000            AND P-NEW-CHG-CODE-INDEX  = 'Y')
459100          MOVE 00.9434 TO W-NEW-INDEX-RECORD.
459200
459300     IF (P-NEW-PROVIDER-NO = '360046' OR '360056' OR '360076' OR
459400                             '360132')
459500            AND (P-NEW-STAND-AMT-LOC-MSA = '1640'
459600            AND P-NEW-WAGE-INDEX-LOC-MSA = '1640'
459700            AND P-NEW-CHG-CODE-INDEX  = 'Y')
459800          MOVE 00.9419 TO W-NEW-INDEX-RECORD.
459900
460000     IF (P-NEW-PROVIDER-NO = '390019' OR '390049' OR '390162' OR
460100                             '390194' OR '390197' OR '390263')
460200            AND (P-NEW-STAND-AMT-LOC-MSA = '0240'
460300            AND P-NEW-WAGE-INDEX-LOC-MSA = '0240'
460400            AND P-NEW-CHG-CODE-INDEX  = 'Y')
460500          MOVE 01.0228 TO W-NEW-INDEX-RECORD.
460600
460700     IF (P-NEW-PROVIDER-NO = '450065' OR '450072' OR '450591')
460800            AND (P-NEW-STAND-AMT-LOC-MSA = '3360'
460900            AND P-NEW-WAGE-INDEX-LOC-MSA = '3360'
461000            AND P-NEW-CHG-CODE-INDEX  = 'Y')
461100          MOVE 00.9388 TO W-NEW-INDEX-RECORD.
461200
461300     IF (P-NEW-PROVIDER-NO = '470003')
461400            AND (P-NEW-STAND-AMT-LOC-MSA = '1123'
461500            AND P-NEW-WAGE-INDEX-LOC-MSA = '1123'
461600            AND P-NEW-CHG-CODE-INDEX  = 'Y')
461700          MOVE 01.1359 TO W-NEW-INDEX-RECORD.
461800
461900 2500-2000-EXIT.   EXIT.
462000
462100 2500-2001-WI-LUGER.
462200***************************************************************
462300****    FOR FY 2001 NEW LUGAR HOSPITALS ONLY                  *
462400***************************************************************
462500     IF (P-NEW-PROVIDER-NO = '010043')
462600            AND (P-NEW-STAND-AMT-LOC-MSA = '1000'
462700            AND P-NEW-WAGE-INDEX-LOC-MSA = '1000'
462800            AND P-NEW-CHG-CODE-INDEX  = 'Y')
462900          MOVE 00.8490 TO W-NEW-INDEX-RECORD.
463000
463100     IF (P-NEW-PROVIDER-NO = '010072' OR '010101')
463200            AND (P-NEW-STAND-AMT-LOC-MSA = '0450'
463300            AND P-NEW-WAGE-INDEX-LOC-MSA = '0450'
463400            AND P-NEW-CHG-CODE-INDEX  = 'Y')
463500          MOVE 00.7871 TO W-NEW-INDEX-RECORD.
463600
463700     IF (P-NEW-PROVIDER-NO = '100098')
463800            AND (P-NEW-STAND-AMT-LOC-MSA = '8960'
463900            AND P-NEW-WAGE-INDEX-LOC-MSA = '8960'
464000            AND P-NEW-CHG-CODE-INDEX  = 'Y')
464100          MOVE 00.9615 TO W-NEW-INDEX-RECORD.
464200
464300     IF (P-NEW-PROVIDER-NO = '100232')
464400            AND (P-NEW-STAND-AMT-LOC-MSA = '2900'
464500            AND P-NEW-WAGE-INDEX-LOC-MSA = '2900'
464600            AND P-NEW-CHG-CODE-INDEX  = 'Y')
464700          MOVE 01.0074 TO W-NEW-INDEX-RECORD.
464800
464900     IF (P-NEW-PROVIDER-NO = '110130')
465000            AND (P-NEW-STAND-AMT-LOC-MSA = '0500'
465100            AND P-NEW-WAGE-INDEX-LOC-MSA = '0500'
465200            AND P-NEW-CHG-CODE-INDEX  = 'Y')
465300          MOVE 00.9739 TO W-NEW-INDEX-RECORD.
465400
465500     IF (P-NEW-PROVIDER-NO = '140230')
465600            AND (P-NEW-STAND-AMT-LOC-MSA = '1400'
465700            AND P-NEW-WAGE-INDEX-LOC-MSA = '1400'
465800            AND P-NEW-CHG-CODE-INDEX  = 'Y')
465900          MOVE 00.9069 TO W-NEW-INDEX-RECORD.
466000
466100     IF (P-NEW-PROVIDER-NO = '230027')
466200            AND (P-NEW-STAND-AMT-LOC-MSA = '3000'
466300            AND P-NEW-WAGE-INDEX-LOC-MSA = '3000'
466400            AND P-NEW-CHG-CODE-INDEX  = 'Y')
466500          MOVE 01.0119 TO W-NEW-INDEX-RECORD.
466600
466700     IF (P-NEW-PROVIDER-NO = '340071' OR '340124')
466800            AND (P-NEW-STAND-AMT-LOC-MSA = '6640'
466900            AND P-NEW-WAGE-INDEX-LOC-MSA = '6640'
467000            AND P-NEW-CHG-CODE-INDEX  = 'Y')
467100          MOVE 00.9506 TO W-NEW-INDEX-RECORD.
467200
467300     IF (P-NEW-PROVIDER-NO = '390030' OR '390181' OR '390183')
467400            AND (P-NEW-STAND-AMT-LOC-MSA = '6680'
467500            AND P-NEW-WAGE-INDEX-LOC-MSA = '6680'
467600            AND P-NEW-CHG-CODE-INDEX  = 'Y')
467700          MOVE 00.8992 TO W-NEW-INDEX-RECORD.
467800
467900     IF (P-NEW-PROVIDER-NO = '390201')
468000            AND (P-NEW-STAND-AMT-LOC-MSA = '5640'
468100            AND P-NEW-WAGE-INDEX-LOC-MSA = '5640'
468200            AND P-NEW-CHG-CODE-INDEX  = 'Y')
468300          MOVE 01.0890 TO W-NEW-INDEX-RECORD.
468400
468500 2500-2001-EXIT.   EXIT.
468600
468700 2500-2003-WI-LUGER.
468800***************************************************************
468900****    FOR FY 2003 NEW LUGAR HOSPITALS ONLY                  *
469000***************************************************************
469100     IF (P-NEW-PROVIDER-NO = '110130')
469200            AND (P-NEW-STAND-AMT-LOC-MSA = '  11'
469300            AND P-NEW-WAGE-INDEX-LOC-MSA = '  11'
469400            AND P-NEW-CHG-CODE-INDEX  = 'Y')
469500          MOVE 00.8230 TO W-NEW-INDEX-RECORD.
469600
469700
469800 2500-2003-EXIT.   EXIT.
469900
470000 2700-2002-WI-401-HOSPITAL.
470100***************************************************************
470200****    FOR FY 2002 SECTION 401 HOSPITALS                     *
470300***************************************************************
470400     IF (P-NEW-PROVIDER-NO = '050192' OR '050286' OR
470500                             '050446' OR '050469' OR
470600                             '050528' OR '050542')
470700         MOVE '  05' TO HOLD-PROV-MSAX
470800                        P-NEW-STAND-AMT-LOC-MSA.
470900
471000     IF (P-NEW-PROVIDER-NO = '100048' OR '100118')
471100         MOVE '  10' TO HOLD-PROV-MSAX
471200                        P-NEW-STAND-AMT-LOC-MSA.
471300
471400     IF (P-NEW-PROVIDER-NO = '170137')
471500         MOVE '  17' TO HOLD-PROV-MSAX
471600                        P-NEW-STAND-AMT-LOC-MSA.
471700
471800     IF (P-NEW-PROVIDER-NO = '190048' OR '190110')
471900         MOVE '  19' TO HOLD-PROV-MSAX
472000                        P-NEW-STAND-AMT-LOC-MSA.
472100
472200     IF (P-NEW-PROVIDER-NO = '230078')
472300         MOVE '  23' TO HOLD-PROV-MSAX
472400                        P-NEW-STAND-AMT-LOC-MSA.
472500
472600     IF (P-NEW-PROVIDER-NO = '260006')
472700         MOVE '  26' TO HOLD-PROV-MSAX
472800                        P-NEW-STAND-AMT-LOC-MSA.
472900
473000     IF (P-NEW-PROVIDER-NO = '290038')
473100         MOVE '  29' TO HOLD-PROV-MSAX
473200                        P-NEW-STAND-AMT-LOC-MSA.
473300
473400     IF (P-NEW-PROVIDER-NO = '300009')
473500         MOVE '  30' TO HOLD-PROV-MSAX
473600                        P-NEW-STAND-AMT-LOC-MSA.
473700
473800     IF (P-NEW-PROVIDER-NO = '390106')
473900         MOVE '  39' TO HOLD-PROV-MSAX
474000                        P-NEW-STAND-AMT-LOC-MSA.
474100
474200     IF (P-NEW-PROVIDER-NO = '520007' OR '520153')
474300         MOVE '  52' TO HOLD-PROV-MSAX
474400                        P-NEW-STAND-AMT-LOC-MSA.
474500
474600 2700-2002-EXIT.   EXIT.
474700
474800 2700-2003-WI-401-HOSPITAL.
474900***************************************************************
475000****    FOR FY 2003 SECTION 401 HOSPITALS                     *
475100***************************************************************
475200     IF (P-NEW-PROVIDER-NO = '050192' OR '050286' OR
475300                             '050446' OR '050469' OR
475400                             '050528')
475500         MOVE '  05' TO HOLD-PROV-MSAX
475600                        P-NEW-STAND-AMT-LOC-MSA.
475700
475800     IF (P-NEW-PROVIDER-NO = '100048' OR '100118')
475900         MOVE '  10' TO HOLD-PROV-MSAX
476000                        P-NEW-STAND-AMT-LOC-MSA.
476100
476200     IF (P-NEW-PROVIDER-NO = '170137')
476300         MOVE '  17' TO HOLD-PROV-MSAX
476400                        P-NEW-STAND-AMT-LOC-MSA.
476500
476600     IF (P-NEW-PROVIDER-NO = '190048' OR '190110')
476700         MOVE '  19' TO HOLD-PROV-MSAX
476800                        P-NEW-STAND-AMT-LOC-MSA.
476900
477000     IF (P-NEW-PROVIDER-NO = '230078')
477100         MOVE '  23' TO HOLD-PROV-MSAX
477200                        P-NEW-STAND-AMT-LOC-MSA.
477300
477400     IF (P-NEW-PROVIDER-NO = '260006')
477500         MOVE '  26' TO HOLD-PROV-MSAX
477600                        P-NEW-STAND-AMT-LOC-MSA.
477700
477800     IF (P-NEW-PROVIDER-NO = '300009')
477900         MOVE '  30' TO HOLD-PROV-MSAX
478000                        P-NEW-STAND-AMT-LOC-MSA.
478100
478200     IF (P-NEW-PROVIDER-NO = '380084')
478300         MOVE '  38' TO HOLD-PROV-MSAX
478400                        P-NEW-STAND-AMT-LOC-MSA.
478500
478600 2700-2003-EXIT.   EXIT.
478700
478800 2700-2004-WI-401-HOSPITAL.
478900***************************************************************
479000****    FOR FY 2004 SECTION 401 HOSPITALS                     *
479100***************************************************************
479200     IF (P-NEW-PROVIDER-NO = '050192' OR '050286' OR
479300                             '050469' OR '050528' OR
479400                             '050618')
479500         MOVE '  05' TO HOLD-PROV-MSAX
479600                        P-NEW-STAND-AMT-LOC-MSA.
479700
479800     IF (P-NEW-PROVIDER-NO = '100048' OR '100118')
479900         MOVE '  10' TO HOLD-PROV-MSAX
480000                        P-NEW-STAND-AMT-LOC-MSA.
480100
480200     IF (P-NEW-PROVIDER-NO = '170137')
480300         MOVE '  17' TO HOLD-PROV-MSAX
480400                        P-NEW-STAND-AMT-LOC-MSA.
480500
480600     IF (P-NEW-PROVIDER-NO = '190048' OR '190110')
480700         MOVE '  19' TO HOLD-PROV-MSAX
480800                        P-NEW-STAND-AMT-LOC-MSA.
480900
481000     IF (P-NEW-PROVIDER-NO = '230078')
481100         MOVE '  23' TO HOLD-PROV-MSAX
481200                        P-NEW-STAND-AMT-LOC-MSA.
481300
481400     IF (P-NEW-PROVIDER-NO = '260006')
481500         MOVE '  26' TO HOLD-PROV-MSAX
481600                        P-NEW-STAND-AMT-LOC-MSA.
481700
481800     IF (P-NEW-PROVIDER-NO = '300009')
481900         MOVE '  30' TO HOLD-PROV-MSAX
482000                        P-NEW-STAND-AMT-LOC-MSA.
482100
482200     IF (P-NEW-PROVIDER-NO = '380084')
482300         MOVE '  38' TO HOLD-PROV-MSAX
482400                        P-NEW-STAND-AMT-LOC-MSA.
482500
482600     IF (P-NEW-PROVIDER-NO = '390106')
482700         MOVE '  39' TO HOLD-PROV-MSAX
482800                        P-NEW-STAND-AMT-LOC-MSA.
482900
483000 2700-2004-EXIT.   EXIT.
483100
483200 2700-2005-WI-401-HOSPITAL.
483300***************************************************************
483400****    FOR FY 2005 SECTION 401 HOSPITALS  OCT THRU MAR 2005  *
483500***************************************************************
483600     IF (P-NEW-PROVIDER-NO = '050192' OR '050286' OR
483700                             '050446' OR '050469' OR
483800                             '050528' OR '050618' OR
483900                             '051301')
484000         MOVE '   05' TO HOLD-PROV-CBSA
484100                        P-NEW-CBSA-STAND-AMT-LOC.
484200
484300     IF (P-NEW-PROVIDER-NO = '070004')
484400         MOVE '   07' TO HOLD-PROV-CBSA
484500                        P-NEW-CBSA-STAND-AMT-LOC.
484600
484700     IF (P-NEW-PROVIDER-NO = '100048' OR '100118')
484800         MOVE '   10' TO HOLD-PROV-CBSA
484900                        P-NEW-CBSA-STAND-AMT-LOC.
485000
485100     IF (P-NEW-PROVIDER-NO = '170137')
485200         MOVE '   17' TO HOLD-PROV-CBSA
485300                        P-NEW-CBSA-STAND-AMT-LOC.
485400
485500     IF (P-NEW-PROVIDER-NO = '190048' OR '190110')
485600         MOVE '   19' TO HOLD-PROV-CBSA
485700                        P-NEW-CBSA-STAND-AMT-LOC.
485800
485900     IF (P-NEW-PROVIDER-NO = '230078')
486000         MOVE '   23' TO HOLD-PROV-CBSA
486100                        P-NEW-CBSA-STAND-AMT-LOC.
486200
486300     IF (P-NEW-PROVIDER-NO = '260006')
486400         MOVE '   26' TO HOLD-PROV-CBSA
486500                        P-NEW-CBSA-STAND-AMT-LOC.
486600
486700     IF (P-NEW-PROVIDER-NO = '290038' OR '291301')
486800         MOVE '   29' TO HOLD-PROV-CBSA
486900                        P-NEW-CBSA-STAND-AMT-LOC.
487000
487100     IF (P-NEW-PROVIDER-NO = '300009')
487200         MOVE '   30' TO HOLD-PROV-CBSA
487300                        P-NEW-CBSA-STAND-AMT-LOC.
487400
487500     IF (P-NEW-PROVIDER-NO = '380084')
487600         MOVE '   38' TO HOLD-PROV-CBSA
487700                        P-NEW-CBSA-STAND-AMT-LOC.
487800
487900     IF (P-NEW-PROVIDER-NO = '390106' OR '390181')
488000         MOVE '   39' TO HOLD-PROV-CBSA
488100                        P-NEW-CBSA-STAND-AMT-LOC.
488200
488300 2700-2005-EXIT.   EXIT.
488400
488500 2750-2005-WI-401-HOSPITAL.
488600***************************************************************
488700****  FOR FY 2005 SECTION 401 HOSPITALS EFFECTIVE APR 1,2005  *
488800***************************************************************
488900     IF (P-NEW-PROVIDER-NO = '030007')
489000         MOVE '   03' TO HOLD-PROV-CBSA
489100                        P-NEW-CBSA-STAND-AMT-LOC.
489200
489300     IF (P-NEW-PROVIDER-NO = '040075')
489400         MOVE '   04' TO HOLD-PROV-CBSA
489500                        P-NEW-CBSA-STAND-AMT-LOC.
489600
489700     IF (P-NEW-PROVIDER-NO = '050192' OR '050469' OR
489800                             '050528' OR '050618')
489900         MOVE '   05' TO HOLD-PROV-CBSA
490000                        P-NEW-CBSA-STAND-AMT-LOC.
490100
490200     IF (P-NEW-PROVIDER-NO = '070004')
490300         MOVE '   07' TO HOLD-PROV-CBSA
490400                        P-NEW-CBSA-STAND-AMT-LOC.
490500
490600     IF (P-NEW-PROVIDER-NO = '100048' OR '100134')
490700         MOVE '   10' TO HOLD-PROV-CBSA
490800                        P-NEW-CBSA-STAND-AMT-LOC.
490900
491000     IF (P-NEW-PROVIDER-NO = '130018')
491100         MOVE '   13' TO HOLD-PROV-CBSA
491200                        P-NEW-CBSA-STAND-AMT-LOC.
491300
491400     IF (P-NEW-PROVIDER-NO = '140167')
491500         MOVE '   14' TO HOLD-PROV-CBSA
491600                        P-NEW-CBSA-STAND-AMT-LOC.
491700
491800     IF (P-NEW-PROVIDER-NO = '150051' OR '150078')
491900         MOVE '   15' TO HOLD-PROV-CBSA
492000                        P-NEW-CBSA-STAND-AMT-LOC.
492100
492200     IF (P-NEW-PROVIDER-NO = '170137')
492300         MOVE '   17' TO HOLD-PROV-CBSA
492400                        P-NEW-CBSA-STAND-AMT-LOC.
492500
492600     IF (P-NEW-PROVIDER-NO = '190048')
492700         MOVE '   19' TO HOLD-PROV-CBSA
492800                        P-NEW-CBSA-STAND-AMT-LOC.
492900
493000     IF (P-NEW-PROVIDER-NO = '230078')
493100         MOVE '   23' TO HOLD-PROV-CBSA
493200                        P-NEW-CBSA-STAND-AMT-LOC.
493300
493400     IF (P-NEW-PROVIDER-NO = '240037')
493500         MOVE '   24' TO HOLD-PROV-CBSA
493600                        P-NEW-CBSA-STAND-AMT-LOC.
493700
493800     IF (P-NEW-PROVIDER-NO = '260006' OR '260122')
493900         MOVE '   26' TO HOLD-PROV-CBSA
494000                        P-NEW-CBSA-STAND-AMT-LOC.
494100
494200     IF (P-NEW-PROVIDER-NO = '300009')
494300         MOVE '   30' TO HOLD-PROV-CBSA
494400                        P-NEW-CBSA-STAND-AMT-LOC.
494500
494600     IF (P-NEW-PROVIDER-NO = '370054')
494700         MOVE '   37' TO HOLD-PROV-CBSA
494800                        P-NEW-CBSA-STAND-AMT-LOC.
494900
495000     IF (P-NEW-PROVIDER-NO = '380040' OR '380084')
495100         MOVE '   38' TO HOLD-PROV-CBSA
495200                        P-NEW-CBSA-STAND-AMT-LOC.
495300
495400     IF (P-NEW-PROVIDER-NO = '390181' OR '390183' OR
495500                             '390201')
495600         MOVE '   39' TO HOLD-PROV-CBSA
495700                        P-NEW-CBSA-STAND-AMT-LOC.
495800
495900     IF (P-NEW-PROVIDER-NO = '450052' OR '450078' OR
496000                             '450243' OR '450276' OR
496100                             '450348')
496200         MOVE '   45' TO HOLD-PROV-CBSA
496300                        P-NEW-CBSA-STAND-AMT-LOC.
496400
496500     IF (P-NEW-PROVIDER-NO = '500023' OR '500037' OR
496600                             '500122' OR '500147' OR
496700                             '500148')
496800         MOVE '   50' TO HOLD-PROV-CBSA
496900                        P-NEW-CBSA-STAND-AMT-LOC.
497000
497100 2750-2005-EXIT.   EXIT.
497200
497300 2800-2006-WI-401-HOSPITAL.
497400***************************************************************
497500****  FOR FY 2006 SECTION 401 HOSPITALS EFFECTIVE OCT 1,2005  *
497600***************************************************************
497700     IF (P-NEW-PROVIDER-NO = '030007')
497800         MOVE '   03' TO HOLD-PROV-CBSA
497900                        P-NEW-CBSA-STAND-AMT-LOC.
498000
498100     IF (P-NEW-PROVIDER-NO = '040075')
498200         MOVE '   04' TO HOLD-PROV-CBSA
498300                        P-NEW-CBSA-STAND-AMT-LOC.
498400
498500     IF (P-NEW-PROVIDER-NO = '050192' OR '050469' OR
498600                             '050528' OR '050618')
498700         MOVE '   05' TO HOLD-PROV-CBSA
498800                        P-NEW-CBSA-STAND-AMT-LOC.
498900
499000     IF (P-NEW-PROVIDER-NO = '070004')
499100         MOVE '   07' TO HOLD-PROV-CBSA
499200                        P-NEW-CBSA-STAND-AMT-LOC.
499300
499400     IF (P-NEW-PROVIDER-NO = '100048' OR '100134')
499500         MOVE '   10' TO HOLD-PROV-CBSA
499600                        P-NEW-CBSA-STAND-AMT-LOC.
499700
499800     IF (P-NEW-PROVIDER-NO = '130018')
499900         MOVE '   13' TO HOLD-PROV-CBSA
500000                        P-NEW-CBSA-STAND-AMT-LOC.
500100
500200     IF (P-NEW-PROVIDER-NO = '140167')
500300         MOVE '   14' TO HOLD-PROV-CBSA
500400                        P-NEW-CBSA-STAND-AMT-LOC.
500500
500600     IF B-N-DISCHARGE-DATE > 20051231
500700        IF (P-NEW-PROVIDER-NO = '150078')
500800           MOVE '   15' TO HOLD-PROV-CBSA
500900                          P-NEW-CBSA-STAND-AMT-LOC.
501000
501100     IF B-N-DISCHARGE-DATE < 20060101
501200        IF (P-NEW-PROVIDER-NO = '150051' OR '150078')
501300           MOVE '   15' TO HOLD-PROV-CBSA
501400                          P-NEW-CBSA-STAND-AMT-LOC.
501500
501600     IF (P-NEW-PROVIDER-NO = '170137')
501700         MOVE '   17' TO HOLD-PROV-CBSA
501800                        P-NEW-CBSA-STAND-AMT-LOC.
501900
502000     IF (P-NEW-PROVIDER-NO = '190048' OR '190110')
502100         MOVE '   19' TO HOLD-PROV-CBSA
502200                        P-NEW-CBSA-STAND-AMT-LOC.
502300
502400     IF (P-NEW-PROVIDER-NO = '230042' OR '230078')
502500         MOVE '   23' TO HOLD-PROV-CBSA
502600                        P-NEW-CBSA-STAND-AMT-LOC.
502700
502800     IF (P-NEW-PROVIDER-NO = '240037' OR '240122')
502900         MOVE '   24' TO HOLD-PROV-CBSA
503000                        P-NEW-CBSA-STAND-AMT-LOC.
503100
503200     IF (P-NEW-PROVIDER-NO = '260006')
503300         MOVE '   26' TO HOLD-PROV-CBSA
503400                        P-NEW-CBSA-STAND-AMT-LOC.
503500
503600     IF (P-NEW-PROVIDER-NO = '300009')
503700         MOVE '   30' TO HOLD-PROV-CBSA
503800                        P-NEW-CBSA-STAND-AMT-LOC.
503900
504000     IF (P-NEW-PROVIDER-NO = '330268')
504100         MOVE '   33' TO HOLD-PROV-CBSA
504200                        P-NEW-CBSA-STAND-AMT-LOC.
504300
504400     IF (P-NEW-PROVIDER-NO = '370054')
504500         MOVE '   37' TO HOLD-PROV-CBSA
504600                        P-NEW-CBSA-STAND-AMT-LOC.
504700
504800     IF (P-NEW-PROVIDER-NO = '380040' OR '380084')
504900         MOVE '   38' TO HOLD-PROV-CBSA
505000                        P-NEW-CBSA-STAND-AMT-LOC.
505100
505200     IF (P-NEW-PROVIDER-NO = '390181' OR '390183' OR
505300                             '390201')
505400         MOVE '   39' TO HOLD-PROV-CBSA
505500                        P-NEW-CBSA-STAND-AMT-LOC.
505600
505700     IF (P-NEW-PROVIDER-NO = '440135')
505800         MOVE '   44' TO HOLD-PROV-CBSA
505900                        P-NEW-CBSA-STAND-AMT-LOC.
506000
506100     IF (P-NEW-PROVIDER-NO = '450052' OR '450078' OR
506200                             '450243' OR '450276' OR
506300                             '450348')
506400         MOVE '   45' TO HOLD-PROV-CBSA
506500                        P-NEW-CBSA-STAND-AMT-LOC.
506600
506700     IF (P-NEW-PROVIDER-NO = '500023' OR '500043' OR
506800                             '500086' OR '500103' OR
506900                             '500122' OR '500147' OR
507000                             '500148')
507100         MOVE '   50' TO HOLD-PROV-CBSA
507200                        P-NEW-CBSA-STAND-AMT-LOC.
507300
507400 2800-2006-EXIT.   EXIT.
507500
507600 2800-2007-WI-401-HOSPITAL.
507700***************************************************************
507800****  FOR FY 2007 SECTION 401 HOSPITALS EFFECTIVE OCT 1,2006  *
507900***************************************************************
508000
508100     IF (P-NEW-PROVIDER-NO = '050192' OR '050469' OR
508200                             '050528' OR '050618')
508300         MOVE '   05' TO HOLD-PROV-CBSA
508400                        P-NEW-CBSA-STAND-AMT-LOC.
508500
508600     IF (P-NEW-PROVIDER-NO = '070004')
508700         MOVE '   07' TO HOLD-PROV-CBSA
508800                        P-NEW-CBSA-STAND-AMT-LOC.
508900
509000     IF (P-NEW-PROVIDER-NO = '100048' OR '100134')
509100         MOVE '   10' TO HOLD-PROV-CBSA
509200                        P-NEW-CBSA-STAND-AMT-LOC.
509300
509400     IF (P-NEW-PROVIDER-NO = '140167')
509500         MOVE '   14' TO HOLD-PROV-CBSA
509600                        P-NEW-CBSA-STAND-AMT-LOC.
509700
509800     IF (P-NEW-PROVIDER-NO = '170137')
509900         MOVE '   17' TO HOLD-PROV-CBSA
510000                        P-NEW-CBSA-STAND-AMT-LOC.
510100
510200     IF (P-NEW-PROVIDER-NO = '230078')
510300         MOVE '   23' TO HOLD-PROV-CBSA
510400                        P-NEW-CBSA-STAND-AMT-LOC.
510500
510600     IF (P-NEW-PROVIDER-NO = '260006' OR '260047' OR '260195')
510700         MOVE '   26' TO HOLD-PROV-CBSA
510800                        P-NEW-CBSA-STAND-AMT-LOC.
510900
511000     IF (P-NEW-PROVIDER-NO = '330044' OR '330245' OR '330268')
511100         MOVE '   33' TO HOLD-PROV-CBSA
511200                        P-NEW-CBSA-STAND-AMT-LOC.
511300
511400     IF (P-NEW-PROVIDER-NO = '360125')
511500         MOVE '   36' TO HOLD-PROV-CBSA
511600                        P-NEW-CBSA-STAND-AMT-LOC.
511700
511800     IF (P-NEW-PROVIDER-NO = '370054')
511900         MOVE '   37' TO HOLD-PROV-CBSA
512000                        P-NEW-CBSA-STAND-AMT-LOC.
512100
512200     IF (P-NEW-PROVIDER-NO = '380040')
512300         MOVE '   38' TO HOLD-PROV-CBSA
512400                        P-NEW-CBSA-STAND-AMT-LOC.
512500
512600     IF (P-NEW-PROVIDER-NO = '440135' OR '440144')
512700         MOVE '   44' TO HOLD-PROV-CBSA
512800                        P-NEW-CBSA-STAND-AMT-LOC.
512900
513000     IF (P-NEW-PROVIDER-NO = '450052' OR '450078' OR
513100                             '450243' OR '450348')
513200         MOVE '   45' TO HOLD-PROV-CBSA
513300                        P-NEW-CBSA-STAND-AMT-LOC.
513400
513500     IF (P-NEW-PROVIDER-NO = '500148')
513600         MOVE '   50' TO HOLD-PROV-CBSA
513700                        P-NEW-CBSA-STAND-AMT-LOC.
513800
513900     IF (P-NEW-PROVIDER-NO = '520060')
514000         MOVE '   52' TO HOLD-PROV-CBSA
514100                        P-NEW-CBSA-STAND-AMT-LOC.
514200
514300 2800-2007-EXIT.   EXIT.
514400
514500 2800-2008-WI-401-HOSPITAL.
514600***************************************************************
514700****  FOR FY 2008 SECTION 401 HOSPITALS EFFECTIVE OCT 1,2007  *
514800***************************************************************
514900
515000     IF (P-NEW-PROVIDER-NO = '050192' OR
515100                             '050528' OR '050618')
515200         MOVE '   05' TO HOLD-PROV-CBSA
515300                        P-NEW-CBSA-STAND-AMT-LOC.
515400
515500     IF (P-NEW-PROVIDER-NO = '100134')
515600         MOVE '   10' TO HOLD-PROV-CBSA
515700                        P-NEW-CBSA-STAND-AMT-LOC.
515800
515900     IF (P-NEW-PROVIDER-NO = '170137')
516000         MOVE '   17' TO HOLD-PROV-CBSA
516100                        P-NEW-CBSA-STAND-AMT-LOC.
516200
516300     IF (P-NEW-PROVIDER-NO = '220051' OR '230078')
516400         MOVE '   23' TO HOLD-PROV-CBSA
516500                        P-NEW-CBSA-STAND-AMT-LOC.
516600
516700     IF (P-NEW-PROVIDER-NO = '250017')
516800         MOVE '   25' TO HOLD-PROV-CBSA
516900                        P-NEW-CBSA-STAND-AMT-LOC.
517000
517100     IF (P-NEW-PROVIDER-NO = '260006' OR '260195')
517200         MOVE '   26' TO HOLD-PROV-CBSA
517300                        P-NEW-CBSA-STAND-AMT-LOC.
517400
517500     IF (P-NEW-PROVIDER-NO = '330268')
517600         MOVE '   33' TO HOLD-PROV-CBSA
517700                        P-NEW-CBSA-STAND-AMT-LOC.
517800
517900     IF (P-NEW-PROVIDER-NO = '360125')
518000         MOVE '   36' TO HOLD-PROV-CBSA
518100                        P-NEW-CBSA-STAND-AMT-LOC.
518200
518300     IF (P-NEW-PROVIDER-NO = '370054')
518400         MOVE '   37' TO HOLD-PROV-CBSA
518500                        P-NEW-CBSA-STAND-AMT-LOC.
518600
518700     IF (P-NEW-PROVIDER-NO = '380040')
518800         MOVE '   38' TO HOLD-PROV-CBSA
518900                        P-NEW-CBSA-STAND-AMT-LOC.
519000
519100     IF (P-NEW-PROVIDER-NO = '390130' OR '390183' OR
519200                             '390185' OR '390201')
519300         MOVE '   39' TO HOLD-PROV-CBSA
519400                        P-NEW-CBSA-STAND-AMT-LOC.
519500
519600     IF (P-NEW-PROVIDER-NO = '440135')
519700         MOVE '   44' TO HOLD-PROV-CBSA
519800                        P-NEW-CBSA-STAND-AMT-LOC.
519900
520000     IF (P-NEW-PROVIDER-NO = '450052' OR '450078' OR
520100                             '450243' OR '450348')
520200         MOVE '   45' TO HOLD-PROV-CBSA
520300                        P-NEW-CBSA-STAND-AMT-LOC.
520400
520500     IF (P-NEW-PROVIDER-NO = '500148')
520600         MOVE '   50' TO HOLD-PROV-CBSA
520700                        P-NEW-CBSA-STAND-AMT-LOC.
520800
520900 2800-2008-EXIT.   EXIT.
521000
521100 2800-2009-WI-401-HOSPITAL.
521200***************************************************************
521300****  FOR FY 2009 SECTION 401 HOSPITALS EFFECTIVE OCT 1, 2009 *
521400***************************************************************
521500
521600     IF (P-NEW-PROVIDER-NO = '040118')
521700         MOVE '   04' TO HOLD-PROV-CBSA
521800                        P-NEW-CBSA-STAND-AMT-LOC.
521900
522000     IF (P-NEW-PROVIDER-NO = '234202' OR
522100                             '329008' OR '040140')
522200         MOVE '   05' TO HOLD-PROV-CBSA
522300                        P-NEW-CBSA-STAND-AMT-LOC.
522400
522500     IF (P-NEW-PROVIDER-NO = '070004' OR
522600                             '070036')
522700         MOVE '   07' TO HOLD-PROV-CBSA
522800                        P-NEW-CBSA-STAND-AMT-LOC.
522900
523000     IF (P-NEW-PROVIDER-NO = '100048' OR
523100                             '100118' OR '100134')
523200         MOVE '   10' TO HOLD-PROV-CBSA
523300                        P-NEW-CBSA-STAND-AMT-LOC.
523400
523500     IF (P-NEW-PROVIDER-NO = '140167')
523600         MOVE '   14' TO HOLD-PROV-CBSA
523700                        P-NEW-CBSA-STAND-AMT-LOC.
523800
523900     IF (P-NEW-PROVIDER-NO = '170137')
524000         MOVE '   17' TO HOLD-PROV-CBSA
524100                        P-NEW-CBSA-STAND-AMT-LOC.
524200
524300     IF (P-NEW-PROVIDER-NO = '180038')
524400         MOVE '   18' TO HOLD-PROV-CBSA
524500                        P-NEW-CBSA-STAND-AMT-LOC.
524600
524700     IF (P-NEW-PROVIDER-NO = '220051')
524800         MOVE '   22' TO HOLD-PROV-CBSA
524900                        P-NEW-CBSA-STAND-AMT-LOC.
525000
525100     IF (P-NEW-PROVIDER-NO = '230078')
525200         MOVE '   23' TO HOLD-PROV-CBSA
525300                        P-NEW-CBSA-STAND-AMT-LOC.
525400
525500     IF (P-NEW-PROVIDER-NO = '250017')
525600         MOVE '   25' TO HOLD-PROV-CBSA
525700                        P-NEW-CBSA-STAND-AMT-LOC.
525800
525900     IF (P-NEW-PROVIDER-NO = '260006' OR '260047' OR '260195')
526000         MOVE '   26' TO HOLD-PROV-CBSA
526100                        P-NEW-CBSA-STAND-AMT-LOC.
526200
526300     IF (P-NEW-PROVIDER-NO = '330235' OR '330268')
526400         MOVE '   33' TO HOLD-PROV-CBSA
526500                        P-NEW-CBSA-STAND-AMT-LOC.
526600
526700     IF (P-NEW-PROVIDER-NO = '360125')
526800         MOVE '   36' TO HOLD-PROV-CBSA
526900                        P-NEW-CBSA-STAND-AMT-LOC.
527000
527100     IF (P-NEW-PROVIDER-NO = '370054')
527200         MOVE '   37' TO HOLD-PROV-CBSA
527300                        P-NEW-CBSA-STAND-AMT-LOC.
527400
527500     IF (P-NEW-PROVIDER-NO = '380040')
527600         MOVE '   38' TO HOLD-PROV-CBSA
527700                        P-NEW-CBSA-STAND-AMT-LOC.
527800
527900     IF (P-NEW-PROVIDER-NO = '390130' OR '390183' OR
528000                             '390233')
528100         MOVE '   39' TO HOLD-PROV-CBSA
528200                        P-NEW-CBSA-STAND-AMT-LOC.
528300
528400     IF (P-NEW-PROVIDER-NO = '440135')
528500         MOVE '   44' TO HOLD-PROV-CBSA
528600                        P-NEW-CBSA-STAND-AMT-LOC.
528700
528800     IF (P-NEW-PROVIDER-NO = '450052' OR '450078' OR
528900                             '450243' OR '450348')
529000         MOVE '   45' TO HOLD-PROV-CBSA
529100                        P-NEW-CBSA-STAND-AMT-LOC.
529200
529300     IF (P-NEW-PROVIDER-NO = '490116')
529400         MOVE '   49' TO HOLD-PROV-CBSA
529500                        P-NEW-CBSA-STAND-AMT-LOC.
529600
529700     IF (P-NEW-PROVIDER-NO = '500148')
529800         MOVE '   50' TO HOLD-PROV-CBSA
529900                        P-NEW-CBSA-STAND-AMT-LOC.
530000
530100 2800-2009-EXIT.   EXIT.
530200
530300 2800-2010-WI-401-HOSPITAL.
530400***************************************************************
530500****  FOR FY 2010 SECTION 401 HOSPITALS EFFECTIVE OCT 1, 2009 *
530600***************************************************************
530700
530800     IF (P-NEW-PROVIDER-NO = '040118')
530900         MOVE '   04' TO HOLD-PROV-CBSA
531000                        P-NEW-CBSA-STAND-AMT-LOC.
531100
531200     IF (P-NEW-PROVIDER-NO = '050192' OR
531300                             '050528' OR '050618')
531400         MOVE '   05' TO HOLD-PROV-CBSA
531500                        P-NEW-CBSA-STAND-AMT-LOC.
531600
531700     IF (P-NEW-PROVIDER-NO = '070004')
531800         MOVE '   07' TO HOLD-PROV-CBSA
531900                        P-NEW-CBSA-STAND-AMT-LOC.
532000
532100     IF (P-NEW-PROVIDER-NO = '100048' OR
532200                             '100118' OR '100134')
532300         MOVE '   10' TO HOLD-PROV-CBSA
532400                        P-NEW-CBSA-STAND-AMT-LOC.
532500
532600     IF (P-NEW-PROVIDER-NO = '140167')
532700         MOVE '   14' TO HOLD-PROV-CBSA
532800                        P-NEW-CBSA-STAND-AMT-LOC.
532900
533000     IF (P-NEW-PROVIDER-NO = '170137')
533100         MOVE '   17' TO HOLD-PROV-CBSA
533200                        P-NEW-CBSA-STAND-AMT-LOC.
533300
533400     IF (P-NEW-PROVIDER-NO = '180038')
533500         MOVE '   18' TO HOLD-PROV-CBSA
533600                        P-NEW-CBSA-STAND-AMT-LOC.
533700
533800     IF (P-NEW-PROVIDER-NO = '220051')
533900         MOVE '   22' TO HOLD-PROV-CBSA
534000                        P-NEW-CBSA-STAND-AMT-LOC.
534100
534200     IF (P-NEW-PROVIDER-NO = '230078')
534300         MOVE '   23' TO HOLD-PROV-CBSA
534400                        P-NEW-CBSA-STAND-AMT-LOC.
534500
534600     IF (P-NEW-PROVIDER-NO = '250017')
534700         MOVE '   25' TO HOLD-PROV-CBSA
534800                        P-NEW-CBSA-STAND-AMT-LOC.
534900
535000     IF (P-NEW-PROVIDER-NO = '260006' OR '260034' OR
535100                             '260047' OR '260195')
535200         MOVE '   26' TO HOLD-PROV-CBSA
535300                        P-NEW-CBSA-STAND-AMT-LOC.
535400
535500     IF (P-NEW-PROVIDER-NO = '330235' OR '330268')
535600         MOVE '   33' TO HOLD-PROV-CBSA
535700                        P-NEW-CBSA-STAND-AMT-LOC.
535800
535900     IF (P-NEW-PROVIDER-NO = '300023')
536000         MOVE '   30' TO HOLD-PROV-CBSA
536100                        P-NEW-CBSA-STAND-AMT-LOC.
536200
536300     IF (P-NEW-PROVIDER-NO = '360125')
536400         MOVE '   36' TO HOLD-PROV-CBSA
536500                        P-NEW-CBSA-STAND-AMT-LOC.
536600
536700     IF (P-NEW-PROVIDER-NO = '370054')
536800         MOVE '   37' TO HOLD-PROV-CBSA
536900                        P-NEW-CBSA-STAND-AMT-LOC.
537000
537100     IF (P-NEW-PROVIDER-NO = '380040')
537200         MOVE '   38' TO HOLD-PROV-CBSA
537300                        P-NEW-CBSA-STAND-AMT-LOC.
537400
537500     IF (P-NEW-PROVIDER-NO = '390130' OR '390183' OR
537600                             '390233')
537700         MOVE '   39' TO HOLD-PROV-CBSA
537800                        P-NEW-CBSA-STAND-AMT-LOC.
537900
538000     IF (P-NEW-PROVIDER-NO = '450052' OR '450078' OR
538100                             '450243' OR '450348')
538200         MOVE '   45' TO HOLD-PROV-CBSA
538300                        P-NEW-CBSA-STAND-AMT-LOC.
538400
538500     IF (P-NEW-PROVIDER-NO = '490116')
538600         MOVE '   49' TO HOLD-PROV-CBSA
538700                        P-NEW-CBSA-STAND-AMT-LOC.
538800
538900     IF (P-NEW-PROVIDER-NO = '500148')
539000         MOVE '   50' TO HOLD-PROV-CBSA
539100                        P-NEW-CBSA-STAND-AMT-LOC.
539200
539300 2800-2010-EXIT.   EXIT.
539400
539500 2800-2011-WI-401-HOSPITAL.
539600***************************************************************
539700****  FOR FY 2011 SECTION 401 HOSPITALS EFFECTIVE OCT 1, 2010 *
539800***************************************************************
539900*
540000
540100     IF (P-NEW-PROVIDER-NO = '040118')
540200         MOVE '   04' TO HOLD-PROV-CBSA
540300                        P-NEW-CBSA-STAND-AMT-LOC.
540400
540500     IF (P-NEW-PROVIDER-NO = '050192' OR
540600                             '050528' OR '050618')
540700         MOVE '   05' TO HOLD-PROV-CBSA
540800                        P-NEW-CBSA-STAND-AMT-LOC.
540900
541000     IF (P-NEW-PROVIDER-NO = '070004')
541100         MOVE '   07' TO HOLD-PROV-CBSA
541200                        P-NEW-CBSA-STAND-AMT-LOC.
541300
541400     IF (P-NEW-PROVIDER-NO = '100048' OR
541500                             '100118' OR '100134')
541600         MOVE '   10' TO HOLD-PROV-CBSA
541700                        P-NEW-CBSA-STAND-AMT-LOC.
541800
541900     IF (P-NEW-PROVIDER-NO = '140167')
542000         MOVE '   14' TO HOLD-PROV-CBSA
542100                        P-NEW-CBSA-STAND-AMT-LOC.
542200
542300     IF (P-NEW-PROVIDER-NO = '170037' OR '170137')
542400         MOVE '   17' TO HOLD-PROV-CBSA
542500                        P-NEW-CBSA-STAND-AMT-LOC.
542600
542700     IF (P-NEW-PROVIDER-NO = '180016' OR '180038')
542800         MOVE '   18' TO HOLD-PROV-CBSA
542900                        P-NEW-CBSA-STAND-AMT-LOC.
543000
543100     IF (P-NEW-PROVIDER-NO = '220051')
543200         MOVE '   22' TO HOLD-PROV-CBSA
543300                        P-NEW-CBSA-STAND-AMT-LOC.
543400
543500     IF (P-NEW-PROVIDER-NO = '230040' OR '230078')
543600         MOVE '   23' TO HOLD-PROV-CBSA
543700                        P-NEW-CBSA-STAND-AMT-LOC.
543800
543900     IF (P-NEW-PROVIDER-NO = '260006' OR '260034' OR
544000                             '260047' OR '260195')
544100         MOVE '   26' TO HOLD-PROV-CBSA
544200                        P-NEW-CBSA-STAND-AMT-LOC.
544300
544400     IF (P-NEW-PROVIDER-NO = '300023')
544500         MOVE '   30' TO HOLD-PROV-CBSA
544600                        P-NEW-CBSA-STAND-AMT-LOC.
544700
544800     IF (P-NEW-PROVIDER-NO = '330215' OR '330235' OR
544900                             '330268')
545000         MOVE '   33' TO HOLD-PROV-CBSA
545100                        P-NEW-CBSA-STAND-AMT-LOC.
545200
545300     IF (P-NEW-PROVIDER-NO = '340010')
545400         MOVE '   34' TO HOLD-PROV-CBSA
545500                        P-NEW-CBSA-STAND-AMT-LOC.
545600
545700     IF (P-NEW-PROVIDER-NO = '360125')
545800         MOVE '   36' TO HOLD-PROV-CBSA
545900                        P-NEW-CBSA-STAND-AMT-LOC.
546000
546100     IF (P-NEW-PROVIDER-NO = '370054')
546200         MOVE '   37' TO HOLD-PROV-CBSA
546300                        P-NEW-CBSA-STAND-AMT-LOC.
546400
546500     IF (P-NEW-PROVIDER-NO = '380040')
546600         MOVE '   38' TO HOLD-PROV-CBSA
546700                        P-NEW-CBSA-STAND-AMT-LOC.
546800
546900     IF (P-NEW-PROVIDER-NO = '390130' OR '390183' OR
547000                             '390233')
547100         MOVE '   39' TO HOLD-PROV-CBSA
547200                        P-NEW-CBSA-STAND-AMT-LOC.
547300
547400     IF (P-NEW-PROVIDER-NO = '450052' OR '450078' OR
547500                             '450243' OR '450348')
547600         MOVE '   45' TO HOLD-PROV-CBSA
547700                        P-NEW-CBSA-STAND-AMT-LOC.
547800
547900     IF (P-NEW-PROVIDER-NO = '490116')
548000         MOVE '   49' TO HOLD-PROV-CBSA
548100                        P-NEW-CBSA-STAND-AMT-LOC.
548200
548300     IF (P-NEW-PROVIDER-NO = '500148')
548400         MOVE '   50' TO HOLD-PROV-CBSA
548500                        P-NEW-CBSA-STAND-AMT-LOC.
548600
548700
548800 2800-2011-EXIT.   EXIT.
548900
549000
549100 2800-2012-WI-401-HOSPITAL.
549200***************************************************************
549300****  FOR FY 2012 SECTION 401 HOSPITALS EFFECTIVE OCT 1, 2011 *
549400***************************************************************
549500*
549600
549700     IF (P-NEW-PROVIDER-NO = '040118')
549800         MOVE '   04' TO HOLD-PROV-CBSA
549900                        P-NEW-CBSA-STAND-AMT-LOC.
550000
550100     IF (P-NEW-PROVIDER-NO = '050192' OR
550200                             '050528' OR '050618')
550300         MOVE '   05' TO HOLD-PROV-CBSA
550400                        P-NEW-CBSA-STAND-AMT-LOC.
550500
550600     IF (P-NEW-PROVIDER-NO = '070004')
550700         MOVE '   07' TO HOLD-PROV-CBSA
550800                        P-NEW-CBSA-STAND-AMT-LOC.
550900
551000     IF (P-NEW-PROVIDER-NO = '100048' OR
551100                             '100118' OR '100134')
551200         MOVE '   10' TO HOLD-PROV-CBSA
551300                        P-NEW-CBSA-STAND-AMT-LOC.
551400
551500     IF (P-NEW-PROVIDER-NO = '140167')
551600         MOVE '   14' TO HOLD-PROV-CBSA
551700                        P-NEW-CBSA-STAND-AMT-LOC.
551800
551900     IF (P-NEW-PROVIDER-NO = '150003')
552000         MOVE '   15' TO HOLD-PROV-CBSA
552100                        P-NEW-CBSA-STAND-AMT-LOC.
552200
552300     IF (P-NEW-PROVIDER-NO = '170074' OR '170137')
552400         MOVE '   17' TO HOLD-PROV-CBSA
552500                        P-NEW-CBSA-STAND-AMT-LOC.
552600
552700     IF (P-NEW-PROVIDER-NO = '180016' OR '180038')
552800         MOVE '   18' TO HOLD-PROV-CBSA
552900                        P-NEW-CBSA-STAND-AMT-LOC.
553000
553100     IF (P-NEW-PROVIDER-NO = '220051')
553200         MOVE '   22' TO HOLD-PROV-CBSA
553300                        P-NEW-CBSA-STAND-AMT-LOC.
553400
553500     IF (P-NEW-PROVIDER-NO = '230040' OR '230078')
553600         MOVE '   23' TO HOLD-PROV-CBSA
553700                        P-NEW-CBSA-STAND-AMT-LOC.
553800
553900     IF (P-NEW-PROVIDER-NO = '260006' OR '260034' OR
554000                             '260047' OR '260195')
554100         MOVE '   26' TO HOLD-PROV-CBSA
554200                        P-NEW-CBSA-STAND-AMT-LOC.
554300
554400     IF (P-NEW-PROVIDER-NO = '300023')
554500         MOVE '   30' TO HOLD-PROV-CBSA
554600                        P-NEW-CBSA-STAND-AMT-LOC.
554700
554800     IF (P-NEW-PROVIDER-NO = '330013' OR '330057' OR
554900                             '330108' OR '330164' OR
555000                             '330215' OR '330235' OR
555100                             '330268' OR '330285')
555200         MOVE '   33' TO HOLD-PROV-CBSA
555300                        P-NEW-CBSA-STAND-AMT-LOC.
555400
555500     IF (P-NEW-PROVIDER-NO = '340010')
555600         MOVE '   34' TO HOLD-PROV-CBSA
555700                        P-NEW-CBSA-STAND-AMT-LOC.
555800
555900     IF (P-NEW-PROVIDER-NO = '360125')
556000         MOVE '   36' TO HOLD-PROV-CBSA
556100                        P-NEW-CBSA-STAND-AMT-LOC.
556200
556300     IF (P-NEW-PROVIDER-NO = '370054')
556400         MOVE '   37' TO HOLD-PROV-CBSA
556500                        P-NEW-CBSA-STAND-AMT-LOC.
556600
556700     IF (P-NEW-PROVIDER-NO = '380040')
556800         MOVE '   38' TO HOLD-PROV-CBSA
556900                        P-NEW-CBSA-STAND-AMT-LOC.
557000
557100     IF (P-NEW-PROVIDER-NO = '390130' OR '390183' OR
557200                             '390233')
557300         MOVE '   39' TO HOLD-PROV-CBSA
557400                        P-NEW-CBSA-STAND-AMT-LOC.
557500
557600     IF (P-NEW-PROVIDER-NO = '420038')
557700         MOVE '   42' TO HOLD-PROV-CBSA
557800                        P-NEW-CBSA-STAND-AMT-LOC.
557900
558000     IF (P-NEW-PROVIDER-NO = '450052' OR '450078' OR
558100                             '450243' OR '450348')
558200         MOVE '   45' TO HOLD-PROV-CBSA
558300                        P-NEW-CBSA-STAND-AMT-LOC.
558400
558500     IF (P-NEW-PROVIDER-NO = '490116' OR '490116')
558600         MOVE '   49' TO HOLD-PROV-CBSA
558700                        P-NEW-CBSA-STAND-AMT-LOC.
558800
558900     IF (P-NEW-PROVIDER-NO = '500148')
559000         MOVE '   50' TO HOLD-PROV-CBSA
559100                        P-NEW-CBSA-STAND-AMT-LOC.
559200
559300
559400 2800-2012-EXIT.   EXIT.
559500
559600 2800-2013-WI-401-HOSPITAL.
559700***************************************************************
559800****  FOR FY 2013 SECTION 401 HOSPITALS EFFECTIVE OCT 1, 2012 *
559900***************************************************************
560000*
560100
560200     IF (P-NEW-PROVIDER-NO = '290009')
560300         MOVE '   29' TO HOLD-PROV-CBSA
560400                        P-NEW-CBSA-STAND-AMT-LOC.
560500
560600     IF (P-NEW-PROVIDER-NO = '030024')
560700         MOVE '   03' TO HOLD-PROV-CBSA
560800                        P-NEW-CBSA-STAND-AMT-LOC.
560900
561000     IF (P-NEW-PROVIDER-NO = '050192' OR
561100                             '050528' OR '050618')
561200         MOVE '   05' TO HOLD-PROV-CBSA
561300                        P-NEW-CBSA-STAND-AMT-LOC.
561400
561500     IF (P-NEW-PROVIDER-NO = '070004')
561600         MOVE '   07' TO HOLD-PROV-CBSA
561700                        P-NEW-CBSA-STAND-AMT-LOC.
561800
561900     IF (P-NEW-PROVIDER-NO = '100048' OR '100090' OR
562000                             '100118' OR '100134')
562100         MOVE '   10' TO HOLD-PROV-CBSA
562200                        P-NEW-CBSA-STAND-AMT-LOC.
562300
562400     IF (P-NEW-PROVIDER-NO = '170074' OR '170137')
562500         MOVE '   17' TO HOLD-PROV-CBSA
562600                        P-NEW-CBSA-STAND-AMT-LOC.
562700
562800     IF (P-NEW-PROVIDER-NO = '180016' OR '180038')
562900         MOVE '   18' TO HOLD-PROV-CBSA
563000                        P-NEW-CBSA-STAND-AMT-LOC.
563100
563200     IF (P-NEW-PROVIDER-NO = '220051')
563300         MOVE '   22' TO HOLD-PROV-CBSA
563400                        P-NEW-CBSA-STAND-AMT-LOC.
563500
563600     IF (P-NEW-PROVIDER-NO = '230040' OR '230078')
563700         MOVE '   23' TO HOLD-PROV-CBSA
563800                        P-NEW-CBSA-STAND-AMT-LOC.
563900
564000     IF (P-NEW-PROVIDER-NO = '260006' OR '260034' OR
564100                             '260047' OR '260195')
564200         MOVE '   26' TO HOLD-PROV-CBSA
564300                        P-NEW-CBSA-STAND-AMT-LOC.
564400
564500     IF (P-NEW-PROVIDER-NO = '330108' OR
564600                             '330215' OR '330235' OR
564700                             '330268')
564800         MOVE '   33' TO HOLD-PROV-CBSA
564900                        P-NEW-CBSA-STAND-AMT-LOC.
565000
565100     IF (P-NEW-PROVIDER-NO = '340010')
565200         MOVE '   34' TO HOLD-PROV-CBSA
565300                        P-NEW-CBSA-STAND-AMT-LOC.
565400
565500     IF (P-NEW-PROVIDER-NO = '350011')
565600         MOVE '   35' TO HOLD-PROV-CBSA
565700                        P-NEW-CBSA-STAND-AMT-LOC.
565800
565900     IF (P-NEW-PROVIDER-NO = '360125' OR '360141')
566000         MOVE '   36' TO HOLD-PROV-CBSA
566100                        P-NEW-CBSA-STAND-AMT-LOC.
566200
566300     IF (P-NEW-PROVIDER-NO = '370054')
566400         MOVE '   37' TO HOLD-PROV-CBSA
566500                        P-NEW-CBSA-STAND-AMT-LOC.
566600
566700     IF (P-NEW-PROVIDER-NO = '380040')
566800         MOVE '   38' TO HOLD-PROV-CBSA
566900                        P-NEW-CBSA-STAND-AMT-LOC.
567000
567100     IF (P-NEW-PROVIDER-NO = '390130' OR '390183' OR
567200                             '390233')
567300         MOVE '   39' TO HOLD-PROV-CBSA
567400                        P-NEW-CBSA-STAND-AMT-LOC.
567500
567600     IF (P-NEW-PROVIDER-NO = '420009' OR '420038')
567700         MOVE '   42' TO HOLD-PROV-CBSA
567800                        P-NEW-CBSA-STAND-AMT-LOC.
567900
568000     IF (P-NEW-PROVIDER-NO = '440189')
568100         MOVE '   44' TO HOLD-PROV-CBSA
568200                        P-NEW-CBSA-STAND-AMT-LOC.
568300
568400     IF (P-NEW-PROVIDER-NO = '450052' OR '450078' OR
568500                             '450243' OR '450348')
568600         MOVE '   45' TO HOLD-PROV-CBSA
568700                        P-NEW-CBSA-STAND-AMT-LOC.
568800
568900     IF (P-NEW-PROVIDER-NO = '490004' OR '490005' OR
569000                             '490116')
569100         MOVE '   49' TO HOLD-PROV-CBSA
569200                        P-NEW-CBSA-STAND-AMT-LOC.
569300
569400     IF (P-NEW-PROVIDER-NO = '500030' OR '500148')
569500         MOVE '   50' TO HOLD-PROV-CBSA
569600                        P-NEW-CBSA-STAND-AMT-LOC.
569700
569800 2800-2013-EXIT.   EXIT.
569900
570000
570100 2800-2014-WI-401-HOSPITAL.
570200***************************************************************
570300****  FOR FY 2014 SECTION 401 HOSPITALS EFFECTIVE OCT 1, 2012 *
570400***************************************************************
570500*
570600
570700     IF (P-NEW-PROVIDER-NO = '050192' OR
570800                             '050225' OR
570900                             '050528' OR
571000                             '050618')
571100         MOVE '   05' TO HOLD-PROV-CBSA
571200                        P-NEW-CBSA-STAND-AMT-LOC.
571300
571400     IF (P-NEW-PROVIDER-NO = '060010')
571500         MOVE '   06' TO HOLD-PROV-CBSA
571600                        P-NEW-CBSA-STAND-AMT-LOC.
571700
571800     IF (P-NEW-PROVIDER-NO = '070004' OR
571900                             '070005')
572000         MOVE '   07' TO HOLD-PROV-CBSA
572100                        P-NEW-CBSA-STAND-AMT-LOC.
572200
572300     IF (P-NEW-PROVIDER-NO = '100048' OR
572400                             '100090' OR
572500                             '100118' OR
572600                             '100134')
572700         MOVE '   10' TO HOLD-PROV-CBSA
572800                        P-NEW-CBSA-STAND-AMT-LOC.
572900
573000     IF (P-NEW-PROVIDER-NO = '140059' OR
573100                             '140145')
573200         MOVE '   14' TO HOLD-PROV-CBSA
573300                        P-NEW-CBSA-STAND-AMT-LOC.
573400
573500     IF (P-NEW-PROVIDER-NO = '170074' OR
573600                             '170137')
573700         MOVE '   17' TO HOLD-PROV-CBSA
573800                        P-NEW-CBSA-STAND-AMT-LOC.
573900
574000     IF (P-NEW-PROVIDER-NO = '180016' OR
574100                             '180038')
574200         MOVE '   18' TO HOLD-PROV-CBSA
574300                        P-NEW-CBSA-STAND-AMT-LOC.
574400
574500     IF (P-NEW-PROVIDER-NO = '190008')
574600         MOVE '   19' TO HOLD-PROV-CBSA
574700                        P-NEW-CBSA-STAND-AMT-LOC.
574800
574900     IF (P-NEW-PROVIDER-NO = '220051')
575000         MOVE '   22' TO HOLD-PROV-CBSA
575100                        P-NEW-CBSA-STAND-AMT-LOC.
575200
575300     IF (P-NEW-PROVIDER-NO = '230040' OR
575400                             '230078')
575500         MOVE '   23' TO HOLD-PROV-CBSA
575600                        P-NEW-CBSA-STAND-AMT-LOC.
575700
575800     IF (P-NEW-PROVIDER-NO = '260006' OR
575900                             '260034' OR
576000                             '260047' OR
576100                             '260195')
576200         MOVE '   26' TO HOLD-PROV-CBSA
576300                        P-NEW-CBSA-STAND-AMT-LOC.
576400
576500     IF (P-NEW-PROVIDER-NO = '290009')
576600         MOVE '   29' TO HOLD-PROV-CBSA
576700                        P-NEW-CBSA-STAND-AMT-LOC.
576800
576900     IF (P-NEW-PROVIDER-NO = '330108' OR
577000                             '330235' OR
577100                             '330268')
577200         MOVE '   33' TO HOLD-PROV-CBSA
577300                        P-NEW-CBSA-STAND-AMT-LOC.
577400
577500     IF (P-NEW-PROVIDER-NO = '340010')
577600         MOVE '   34' TO HOLD-PROV-CBSA
577700                        P-NEW-CBSA-STAND-AMT-LOC.
577800
577900     IF (P-NEW-PROVIDER-NO = '350011' OR
578000                             '350015')
578100         MOVE '   35' TO HOLD-PROV-CBSA
578200                        P-NEW-CBSA-STAND-AMT-LOC.
578300
578400     IF (P-NEW-PROVIDER-NO = '360125')
578500         MOVE '   36' TO HOLD-PROV-CBSA
578600                        P-NEW-CBSA-STAND-AMT-LOC.
578700
578800     IF (P-NEW-PROVIDER-NO = '370054')
578900         MOVE '   37' TO HOLD-PROV-CBSA
579000                        P-NEW-CBSA-STAND-AMT-LOC.
579100
579200     IF (P-NEW-PROVIDER-NO = '380040')
579300         MOVE '   38' TO HOLD-PROV-CBSA
579400                        P-NEW-CBSA-STAND-AMT-LOC.
579500
579600     IF (P-NEW-PROVIDER-NO = '390130' OR
579700                             '390183' OR
579800                             '390211')
579900         MOVE '   39' TO HOLD-PROV-CBSA
580000                        P-NEW-CBSA-STAND-AMT-LOC.
580100
580200     IF (P-NEW-PROVIDER-NO = '420009' OR
580300                             '420038')
580400         MOVE '   42' TO HOLD-PROV-CBSA
580500                        P-NEW-CBSA-STAND-AMT-LOC.
580600
580700     IF (P-NEW-PROVIDER-NO = '450052' OR
580800                             '450078' OR
580900                             '450243' OR
581000                             '450348')
581100         MOVE '   45' TO HOLD-PROV-CBSA
581200                        P-NEW-CBSA-STAND-AMT-LOC.
581300
581400     IF (P-NEW-PROVIDER-NO = '490004' OR
581500                             '490116')
581600         MOVE '   49' TO HOLD-PROV-CBSA
581700                        P-NEW-CBSA-STAND-AMT-LOC.
581800
581900     IF (P-NEW-PROVIDER-NO = '500030' OR
582000                             '500148')
582100         MOVE '   50' TO HOLD-PROV-CBSA
582200                        P-NEW-CBSA-STAND-AMT-LOC.
582300
582400     IF (P-NEW-PROVIDER-NO = '510039')
582500         MOVE '   51' TO HOLD-PROV-CBSA
582600                        P-NEW-CBSA-STAND-AMT-LOC.
582700
582800
582900 2800-2014-EXIT.   EXIT.
583000
583100
583200***************************************************************
583300******       L A S T   S O U R C E   S T A T E M E N T    *****
