      ****************************************************************  00010000
      * COPYBOOK: ADDONTBL                                           *  00020002
      * RURAL ADD ON BY STATE & COUNTY CODE                          *  00021000
      *--------------------------------------------------------------*  00022000
      * CATEGORY                    CY2019 CY2020 CY2021 CY2022      *  00030000
      * (A) HIGH UTILIZATION         1.5%   0.5%   ----   ----       *  00040000
      * (B) LOW POPULATION DENSITY   4.0%   3.0%   2.0%   1.0%       *  00040100
      * (C) ALL OTHER                3.0%   2.0%   1.0%   ----       *  00040200
      ****************************************************************  00060000
       01 T-STATE-COUNTY-CODES.                                         00140000
           05  T-STATE-COUNTY-CODE-DATA.                                00150000
               10  FILLER            PIC X(6) VALUE '01005A'.           00190001
               10  FILLER            PIC X(6) VALUE '01011A'.           00200001
               10  FILLER            PIC X(6) VALUE '01013A'.           00210001
               10  FILLER            PIC X(6) VALUE '01017C'.           00211001
               10  FILLER            PIC X(6) VALUE '01019A'.           00212001
               10  FILLER            PIC X(6) VALUE '01023A'.           00213001
               10  FILLER            PIC X(6) VALUE '01025A'.           00214001
               10  FILLER            PIC X(6) VALUE '01027C'.           00215001
               10  FILLER            PIC X(6) VALUE '01029A'.           00216001
               10  FILLER            PIC X(6) VALUE '01031A'.           00217001
               10  FILLER            PIC X(6) VALUE '01035A'.           00218001
               10  FILLER            PIC X(6) VALUE '01037C'.           00219001
               10  FILLER            PIC X(6) VALUE '01039A'.           00219101
               10  FILLER            PIC X(6) VALUE '01041A'.           00219201
               10  FILLER            PIC X(6) VALUE '01043A'.           00219301
               10  FILLER            PIC X(6) VALUE '01045A'.           00219401
               10  FILLER            PIC X(6) VALUE '01047C'.           00219501
               10  FILLER            PIC X(6) VALUE '01049A'.           00219601
               10  FILLER            PIC X(6) VALUE '01053A'.           00219701
               10  FILLER            PIC X(6) VALUE '01057A'.           00219801
               10  FILLER            PIC X(6) VALUE '01059A'.           00219901
               10  FILLER            PIC X(6) VALUE '01063A'.           00220001
               10  FILLER            PIC X(6) VALUE '01071A'.           00220101
               10  FILLER            PIC X(6) VALUE '01075A'.           00220201
               10  FILLER            PIC X(6) VALUE '01087C'.           00220301
               10  FILLER            PIC X(6) VALUE '01091A'.           00220401
               10  FILLER            PIC X(6) VALUE '01093A'.           00220501
               10  FILLER            PIC X(6) VALUE '01095A'.           00220601
               10  FILLER            PIC X(6) VALUE '01099A'.           00220701
               10  FILLER            PIC X(6) VALUE '01105A'.           00220801
               10  FILLER            PIC X(6) VALUE '01109A'.           00220901
               10  FILLER            PIC X(6) VALUE '01111C'.           00221001
               10  FILLER            PIC X(6) VALUE '01119A'.           00221101
               10  FILLER            PIC X(6) VALUE '01121C'.           00221201
               10  FILLER            PIC X(6) VALUE '01123A'.           00221301
               10  FILLER            PIC X(6) VALUE '01127A'.           00221404
               10  FILLER            PIC X(6) VALUE '01129A'.           00221504
               10  FILLER            PIC X(6) VALUE '01131A'.           00221604
               10  FILLER            PIC X(6) VALUE '01133A'.           00221704
               10  FILLER            PIC X(6) VALUE '02013B'.           00221804
               10  FILLER            PIC X(6) VALUE '02016B'.           00221904
               10  FILLER            PIC X(6) VALUE '02050B'.           00222004
               10  FILLER            PIC X(6) VALUE '02060B'.           00222104
               10  FILLER            PIC X(6) VALUE '02068B'.           00222204
               10  FILLER            PIC X(6) VALUE '02070B'.           00222304
               10  FILLER            PIC X(6) VALUE '02100B'.           00222404
               10  FILLER            PIC X(6) VALUE '02105B'.           00222504
               10  FILLER            PIC X(6) VALUE '02110C'.           00222604
               10  FILLER            PIC X(6) VALUE '02122B'.           00222704
               10  FILLER            PIC X(6) VALUE '02130B'.           00222804
               10  FILLER            PIC X(6) VALUE '02150B'.           00222904
               10  FILLER            PIC X(6) VALUE '02164B'.           00223004
               10  FILLER            PIC X(6) VALUE '02180B'.           00223104
               10  FILLER            PIC X(6) VALUE '02185B'.           00223204
               10  FILLER            PIC X(6) VALUE '02188B'.           00223304
               10  FILLER            PIC X(6) VALUE '02195B'.           00223404
               10  FILLER            PIC X(6) VALUE '02198B'.           00223504
               10  FILLER            PIC X(6) VALUE '02220B'.           00223604
               10  FILLER            PIC X(6) VALUE '02230B'.           00223704
               10  FILLER            PIC X(6) VALUE '02240B'.           00223804
               10  FILLER            PIC X(6) VALUE '02261B'.           00223904
               10  FILLER            PIC X(6) VALUE '02270B'.           00224004
               10  FILLER            PIC X(6) VALUE '02275B'.           00224104
               10  FILLER            PIC X(6) VALUE '02282B'.           00224204
               10  FILLER            PIC X(6) VALUE '02290B'.           00224304
               10  FILLER            PIC X(6) VALUE '04001C'.           00224404
               10  FILLER            PIC X(6) VALUE '04007C'.           00224504
               10  FILLER            PIC X(6) VALUE '04009C'.           00224604
               10  FILLER            PIC X(6) VALUE '04011B'.           00224704
               10  FILLER            PIC X(6) VALUE '04012B'.           00224804
               10  FILLER            PIC X(6) VALUE '04017C'.           00224904
               10  FILLER            PIC X(6) VALUE '04023C'.           00225004
               10  FILLER            PIC X(6) VALUE '05001C'.           00225104
               10  FILLER            PIC X(6) VALUE '05003C'.           00225204
               10  FILLER            PIC X(6) VALUE '05005C'.           00225304
               10  FILLER            PIC X(6) VALUE '05009C'.           00225404
               10  FILLER            PIC X(6) VALUE '05011A'.           00225504
               10  FILLER            PIC X(6) VALUE '05013A'.           00225604
               10  FILLER            PIC X(6) VALUE '05015C'.           00225704
               10  FILLER            PIC X(6) VALUE '05017C'.           00225804
               10  FILLER            PIC X(6) VALUE '05019C'.           00225904
               10  FILLER            PIC X(6) VALUE '05021C'.           00226004
               10  FILLER            PIC X(6) VALUE '05023C'.           00226104
               10  FILLER            PIC X(6) VALUE '05027C'.           00226204
               10  FILLER            PIC X(6) VALUE '05029C'.           00226304
               10  FILLER            PIC X(6) VALUE '05037A'.           00226404
               10  FILLER            PIC X(6) VALUE '05039A'.           00226504
               10  FILLER            PIC X(6) VALUE '05041A'.           00226604
               10  FILLER            PIC X(6) VALUE '05043A'.           00226704
               10  FILLER            PIC X(6) VALUE '05047C'.           00226804
               10  FILLER            PIC X(6) VALUE '05049A'.           00226904
               10  FILLER            PIC X(6) VALUE '05055C'.           00227004
               10  FILLER            PIC X(6) VALUE '05057A'.           00227104
               10  FILLER            PIC X(6) VALUE '05059C'.           00227204
               10  FILLER            PIC X(6) VALUE '05061A'.           00227304
               10  FILLER            PIC X(6) VALUE '05063A'.           00227404
               10  FILLER            PIC X(6) VALUE '05065A'.           00227504
               10  FILLER            PIC X(6) VALUE '05067C'.           00227604
               10  FILLER            PIC X(6) VALUE '05071C'.           00227704
               10  FILLER            PIC X(6) VALUE '05073A'.           00227804
               10  FILLER            PIC X(6) VALUE '05075C'.           00227904
               10  FILLER            PIC X(6) VALUE '05077A'.           00228004
               10  FILLER            PIC X(6) VALUE '05083C'.           00228104
               10  FILLER            PIC X(6) VALUE '05089C'.           00228204
               10  FILLER            PIC X(6) VALUE '05093C'.           00228304
               10  FILLER            PIC X(6) VALUE '05095C'.           00228404
               10  FILLER            PIC X(6) VALUE '05097C'.           00228504
               10  FILLER            PIC X(6) VALUE '05099C'.           00228604
               10  FILLER            PIC X(6) VALUE '05101C'.           00228704
               10  FILLER            PIC X(6) VALUE '05103C'.           00228804
               10  FILLER            PIC X(6) VALUE '05107A'.           00228904
               10  FILLER            PIC X(6) VALUE '05109C'.           00229004
               10  FILLER            PIC X(6) VALUE '05113A'.           00229104
               10  FILLER            PIC X(6) VALUE '05115C'.           00229204
               10  FILLER            PIC X(6) VALUE '05117C'.           00229304
               10  FILLER            PIC X(6) VALUE '05121A'.           00229404
               10  FILLER            PIC X(6) VALUE '05123C'.           00229504
               10  FILLER            PIC X(6) VALUE '05127C'.           00229604
               10  FILLER            PIC X(6) VALUE '05129A'.           00229704
               10  FILLER            PIC X(6) VALUE '05133A'.           00229804
               10  FILLER            PIC X(6) VALUE '05135A'.           00229904
               10  FILLER            PIC X(6) VALUE '05137A'.           00230004
               10  FILLER            PIC X(6) VALUE '05139C'.           00230104
               10  FILLER            PIC X(6) VALUE '05141A'.           00230204
               10  FILLER            PIC X(6) VALUE '05145C'.           00230304
               10  FILLER            PIC X(6) VALUE '05147A'.           00230404
               10  FILLER            PIC X(6) VALUE '05149C'.           00230504
               10  FILLER            PIC X(6) VALUE '06003B'.           00230604
               10  FILLER            PIC X(6) VALUE '06005C'.           00230704
               10  FILLER            PIC X(6) VALUE '06009C'.           00230804
               10  FILLER            PIC X(6) VALUE '06011C'.           00230904
               10  FILLER            PIC X(6) VALUE '06015C'.           00231004
               10  FILLER            PIC X(6) VALUE '06021C'.           00231104
               10  FILLER            PIC X(6) VALUE '06023C'.           00231204
               10  FILLER            PIC X(6) VALUE '06027B'.           00231304
               10  FILLER            PIC X(6) VALUE '06033C'.           00231404
               10  FILLER            PIC X(6) VALUE '06035C'.           00231504
               10  FILLER            PIC X(6) VALUE '06043C'.           00231604
               10  FILLER            PIC X(6) VALUE '06045C'.           00231704
               10  FILLER            PIC X(6) VALUE '06049B'.           00231804
               10  FILLER            PIC X(6) VALUE '06051B'.           00231904
               10  FILLER            PIC X(6) VALUE '06057C'.           00232004
               10  FILLER            PIC X(6) VALUE '06063C'.           00232104
               10  FILLER            PIC X(6) VALUE '06091B'.           00232204
               10  FILLER            PIC X(6) VALUE '06093C'.           00232304
               10  FILLER            PIC X(6) VALUE '06103C'.           00232404
               10  FILLER            PIC X(6) VALUE '06105B'.           00232504
               10  FILLER            PIC X(6) VALUE '06109C'.           00232604
               10  FILLER            PIC X(6) VALUE '08003C'.           00232704
               10  FILLER            PIC X(6) VALUE '08007C'.           00232804
               10  FILLER            PIC X(6) VALUE '08009B'.           00232904
               10  FILLER            PIC X(6) VALUE '08011B'.           00233004
               10  FILLER            PIC X(6) VALUE '08015C'.           00233104
               10  FILLER            PIC X(6) VALUE '08017B'.           00233204
               10  FILLER            PIC X(6) VALUE '08021C'.           00233304
               10  FILLER            PIC X(6) VALUE '08023B'.           00233404
               10  FILLER            PIC X(6) VALUE '08025C'.           00233504
               10  FILLER            PIC X(6) VALUE '08027B'.           00233604
               10  FILLER            PIC X(6) VALUE '08029C'.           00233704
               10  FILLER            PIC X(6) VALUE '08033B'.           00233804
               10  FILLER            PIC X(6) VALUE '08037C'.           00233904
               10  FILLER            PIC X(6) VALUE '08043C'.           00234004
               10  FILLER            PIC X(6) VALUE '08045C'.           00234104
               10  FILLER            PIC X(6) VALUE '08049C'.           00234204
               10  FILLER            PIC X(6) VALUE '08051B'.           00234304
               10  FILLER            PIC X(6) VALUE '08053B'.           00234404
               10  FILLER            PIC X(6) VALUE '08055B'.           00234504
               10  FILLER            PIC X(6) VALUE '08057B'.           00234604
               10  FILLER            PIC X(6) VALUE '08061B'.           00234704
               10  FILLER            PIC X(6) VALUE '08063B'.           00234804
               10  FILLER            PIC X(6) VALUE '08065C'.           00234904
               10  FILLER            PIC X(6) VALUE '08067C'.           00235004
               10  FILLER            PIC X(6) VALUE '08071B'.           00235104
               10  FILLER            PIC X(6) VALUE '08073B'.           00235204
               10  FILLER            PIC X(6) VALUE '08075C'.           00235304
               10  FILLER            PIC X(6) VALUE '08079B'.           00235404
               10  FILLER            PIC X(6) VALUE '08081B'.           00235504
               10  FILLER            PIC X(6) VALUE '08083C'.           00235604
               10  FILLER            PIC X(6) VALUE '08085C'.           00235704
               10  FILLER            PIC X(6) VALUE '08087C'.           00235804
               10  FILLER            PIC X(6) VALUE '08089C'.           00235904
               10  FILLER            PIC X(6) VALUE '08091C'.           00236004
               10  FILLER            PIC X(6) VALUE '08095C'.           00236104
               10  FILLER            PIC X(6) VALUE '08097C'.           00236204
               10  FILLER            PIC X(6) VALUE '08099C'.           00236304
               10  FILLER            PIC X(6) VALUE '08103B'.           00236404
               10  FILLER            PIC X(6) VALUE '08105C'.           00236504
               10  FILLER            PIC X(6) VALUE '08107C'.           00236604
               10  FILLER            PIC X(6) VALUE '08109B'.           00236704
               10  FILLER            PIC X(6) VALUE '08111B'.           00236804
               10  FILLER            PIC X(6) VALUE '08113B'.           00236904
               10  FILLER            PIC X(6) VALUE '08115B'.           00237004
               10  FILLER            PIC X(6) VALUE '08117C'.           00237104
               10  FILLER            PIC X(6) VALUE '08121B'.           00237204
               10  FILLER            PIC X(6) VALUE '08125B'.           00237304
               10  FILLER            PIC X(6) VALUE '09005A'.           00237404
               10  FILLER            PIC X(6) VALUE '12007A'.           00237504
               10  FILLER            PIC X(6) VALUE '12013C'.           00237604
               10  FILLER            PIC X(6) VALUE '12023A'.           00237704
               10  FILLER            PIC X(6) VALUE '12027A'.           00237804
               10  FILLER            PIC X(6) VALUE '12029A'.           00237904
               10  FILLER            PIC X(6) VALUE '12037C'.           00238004
               10  FILLER            PIC X(6) VALUE '12043A'.           00238104
               10  FILLER            PIC X(6) VALUE '12045A'.           00238204
               10  FILLER            PIC X(6) VALUE '12047A'.           00238304
               10  FILLER            PIC X(6) VALUE '12049A'.           00238404
               10  FILLER            PIC X(6) VALUE '12051A'.           00238504
               10  FILLER            PIC X(6) VALUE '12059A'.           00238604
               10  FILLER            PIC X(6) VALUE '12063C'.           00238704
               10  FILLER            PIC X(6) VALUE '12067A'.           00238804
               10  FILLER            PIC X(6) VALUE '12075A'.           00238904
               10  FILLER            PIC X(6) VALUE '12077A'.           00239004
               10  FILLER            PIC X(6) VALUE '12079C'.           00239104
               10  FILLER            PIC X(6) VALUE '12087C'.           00239204
               10  FILLER            PIC X(6) VALUE '12093A'.           00239304
               10  FILLER            PIC X(6) VALUE '12107A'.           00239404
               10  FILLER            PIC X(6) VALUE '12121A'.           00239504
               10  FILLER            PIC X(6) VALUE '12123C'.           00239604
               10  FILLER            PIC X(6) VALUE '12125A'.           00239704
               10  FILLER            PIC X(6) VALUE '12133C'.           00239804
               10  FILLER            PIC X(6) VALUE '13001C'.           00239904
               10  FILLER            PIC X(6) VALUE '13003C'.           00240004
               10  FILLER            PIC X(6) VALUE '13005A'.           00240104
               10  FILLER            PIC X(6) VALUE '13007A'.           00240204
               10  FILLER            PIC X(6) VALUE '13009C'.           00240304
               10  FILLER            PIC X(6) VALUE '13011C'.           00240404
               10  FILLER            PIC X(6) VALUE '13017C'.           00240504
               10  FILLER            PIC X(6) VALUE '13019A'.           00240604
               10  FILLER            PIC X(6) VALUE '13023C'.           00240704
               10  FILLER            PIC X(6) VALUE '13031C'.           00240804
               10  FILLER            PIC X(6) VALUE '13037C'.           00240904
               10  FILLER            PIC X(6) VALUE '13039C'.           00241004
               10  FILLER            PIC X(6) VALUE '13043C'.           00241104
               10  FILLER            PIC X(6) VALUE '13049C'.           00241204
               10  FILLER            PIC X(6) VALUE '13055A'.           00241304
               10  FILLER            PIC X(6) VALUE '13061C'.           00241404
               10  FILLER            PIC X(6) VALUE '13065A'.           00241504
               10  FILLER            PIC X(6) VALUE '13069C'.           00241604
               10  FILLER            PIC X(6) VALUE '13071C'.           00241704
               10  FILLER            PIC X(6) VALUE '13075A'.           00241804
               10  FILLER            PIC X(6) VALUE '13081C'.           00241904
               10  FILLER            PIC X(6) VALUE '13087C'.           00242004
               10  FILLER            PIC X(6) VALUE '13091A'.           00242104
               10  FILLER            PIC X(6) VALUE '13093C'.           00242204
               10  FILLER            PIC X(6) VALUE '13099A'.           00242304
               10  FILLER            PIC X(6) VALUE '13105C'.           00242404
               10  FILLER            PIC X(6) VALUE '13107C'.           00242504
               10  FILLER            PIC X(6) VALUE '13109C'.           00242604
               10  FILLER            PIC X(6) VALUE '13111C'.           00242704
               10  FILLER            PIC X(6) VALUE '13119A'.           00242804
               10  FILLER            PIC X(6) VALUE '13123C'.           00242904
               10  FILLER            PIC X(6) VALUE '13125C'.           00243004
               10  FILLER            PIC X(6) VALUE '13129C'.           00243104
               10  FILLER            PIC X(6) VALUE '13131C'.           00243204
               10  FILLER            PIC X(6) VALUE '13133C'.           00243304
               10  FILLER            PIC X(6) VALUE '13137C'.           00243404
               10  FILLER            PIC X(6) VALUE '13141C'.           00243504
               10  FILLER            PIC X(6) VALUE '13147C'.           00243604
               10  FILLER            PIC X(6) VALUE '13155C'.           00243704
               10  FILLER            PIC X(6) VALUE '13157C'.           00243804
               10  FILLER            PIC X(6) VALUE '13161C'.           00243904
               10  FILLER            PIC X(6) VALUE '13163C'.           00244004
               10  FILLER            PIC X(6) VALUE '13165C'.           00244104
               10  FILLER            PIC X(6) VALUE '13167C'.           00244204
               10  FILLER            PIC X(6) VALUE '13175C'.           00244304
               10  FILLER            PIC X(6) VALUE '13187C'.           00244404
               10  FILLER            PIC X(6) VALUE '13193C'.           00244504
               10  FILLER            PIC X(6) VALUE '13201C'.           00244604
               10  FILLER            PIC X(6) VALUE '13205C'.           00244704
               10  FILLER            PIC X(6) VALUE '13209C'.           00244804
               10  FILLER            PIC X(6) VALUE '13229C'.           00244904
               10  FILLER            PIC X(6) VALUE '13233A'.           00245004
               10  FILLER            PIC X(6) VALUE '13235A'.           00245104
               10  FILLER            PIC X(6) VALUE '13237C'.           00245204
               10  FILLER            PIC X(6) VALUE '13239C'.           00245304
               10  FILLER            PIC X(6) VALUE '13241C'.           00245404
               10  FILLER            PIC X(6) VALUE '13243C'.           00245504
               10  FILLER            PIC X(6) VALUE '13249C'.           00245604
               10  FILLER            PIC X(6) VALUE '13251C'.           00245704
               10  FILLER            PIC X(6) VALUE '13253C'.           00245804
               10  FILLER            PIC X(6) VALUE '13257A'.           00245904
               10  FILLER            PIC X(6) VALUE '13259A'.           00246004
               10  FILLER            PIC X(6) VALUE '13261C'.           00246104
               10  FILLER            PIC X(6) VALUE '13263C'.           00246204
               10  FILLER            PIC X(6) VALUE '13265C'.           00246304
               10  FILLER            PIC X(6) VALUE '13267C'.           00246404
               10  FILLER            PIC X(6) VALUE '13269C'.           00246504
               10  FILLER            PIC X(6) VALUE '13271A'.           00246604
               10  FILLER            PIC X(6) VALUE '13275C'.           00246704
               10  FILLER            PIC X(6) VALUE '13277C'.           00246804
               10  FILLER            PIC X(6) VALUE '13279C'.           00246904
               10  FILLER            PIC X(6) VALUE '13281C'.           00247004
               10  FILLER            PIC X(6) VALUE '13283C'.           00247104
               10  FILLER            PIC X(6) VALUE '13285C'.           00247204
               10  FILLER            PIC X(6) VALUE '13287A'.           00247304
               10  FILLER            PIC X(6) VALUE '13291C'.           00247404
               10  FILLER            PIC X(6) VALUE '13293C'.           00247504
               10  FILLER            PIC X(6) VALUE '13299C'.           00247604
               10  FILLER            PIC X(6) VALUE '13301C'.           00247704
               10  FILLER            PIC X(6) VALUE '13303C'.           00247804
               10  FILLER            PIC X(6) VALUE '13305C'.           00247904
               10  FILLER            PIC X(6) VALUE '13307C'.           00248004
               10  FILLER            PIC X(6) VALUE '13309C'.           00248104
               10  FILLER            PIC X(6) VALUE '13311C'.           00248204
               10  FILLER            PIC X(6) VALUE '13315A'.           00248304
               10  FILLER            PIC X(6) VALUE '13317C'.           00248404
               10  FILLER            PIC X(6) VALUE '13319C'.           00248504
               10  FILLER            PIC X(6) VALUE '15001C'.           00248604
               10  FILLER            PIC X(6) VALUE '15005A'.           00248704
               10  FILLER            PIC X(6) VALUE '15007C'.           00248804
               10  FILLER            PIC X(6) VALUE '16003B'.           00248904
               10  FILLER            PIC X(6) VALUE '16007C'.           00249004
               10  FILLER            PIC X(6) VALUE '16009C'.           00249104
               10  FILLER            PIC X(6) VALUE '16011C'.           00249204
               10  FILLER            PIC X(6) VALUE '16013C'.           00249304
               10  FILLER            PIC X(6) VALUE '16017C'.           00249404
               10  FILLER            PIC X(6) VALUE '16021C'.           00249504
               10  FILLER            PIC X(6) VALUE '16025B'.           00249604
               10  FILLER            PIC X(6) VALUE '16029B'.           00249704
               10  FILLER            PIC X(6) VALUE '16031C'.           00249804
               10  FILLER            PIC X(6) VALUE '16033B'.           00249904
               10  FILLER            PIC X(6) VALUE '16035B'.           00250004
               10  FILLER            PIC X(6) VALUE '16037B'.           00250104
               10  FILLER            PIC X(6) VALUE '16039C'.           00250204
               10  FILLER            PIC X(6) VALUE '16043C'.           00250304
               10  FILLER            PIC X(6) VALUE '16047A'.           00250404
               10  FILLER            PIC X(6) VALUE '16049B'.           00250504
               10  FILLER            PIC X(6) VALUE '16057C'.           00250604
               10  FILLER            PIC X(6) VALUE '16059B'.           00250704
               10  FILLER            PIC X(6) VALUE '16061C'.           00250804
               10  FILLER            PIC X(6) VALUE '16063B'.           00250904
               10  FILLER            PIC X(6) VALUE '16065C'.           00251004
               10  FILLER            PIC X(6) VALUE '16067C'.           00251104
               10  FILLER            PIC X(6) VALUE '16071B'.           00251204
               10  FILLER            PIC X(6) VALUE '16075C'.           00251304
               10  FILLER            PIC X(6) VALUE '16077A'.           00251404
               10  FILLER            PIC X(6) VALUE '16079B'.           00251504
               10  FILLER            PIC X(6) VALUE '16081C'.           00251604
               10  FILLER            PIC X(6) VALUE '16085B'.           00251704
               10  FILLER            PIC X(6) VALUE '16087C'.           00251804
               10  FILLER            PIC X(6) VALUE '17001C'.           00251904
               10  FILLER            PIC X(6) VALUE '17009C'.           00252004
               10  FILLER            PIC X(6) VALUE '17011C'.           00252104
               10  FILLER            PIC X(6) VALUE '17015C'.           00252204
               10  FILLER            PIC X(6) VALUE '17017C'.           00252304
               10  FILLER            PIC X(6) VALUE '17021C'.           00252404
               10  FILLER            PIC X(6) VALUE '17023C'.           00252504
               10  FILLER            PIC X(6) VALUE '17025C'.           00252604
               10  FILLER            PIC X(6) VALUE '17029C'.           00252704
               10  FILLER            PIC X(6) VALUE '17033C'.           00252804
               10  FILLER            PIC X(6) VALUE '17035C'.           00252904
               10  FILLER            PIC X(6) VALUE '17039A'.           00253004
               10  FILLER            PIC X(6) VALUE '17041C'.           00253104
               10  FILLER            PIC X(6) VALUE '17045C'.           00253204
               10  FILLER            PIC X(6) VALUE '17047C'.           00253304
               10  FILLER            PIC X(6) VALUE '17049C'.           00253404
               10  FILLER            PIC X(6) VALUE '17051C'.           00253504
               10  FILLER            PIC X(6) VALUE '17053A'.           00253604
               10  FILLER            PIC X(6) VALUE '17055C'.           00253704
               10  FILLER            PIC X(6) VALUE '17057C'.           00253804
               10  FILLER            PIC X(6) VALUE '17059C'.           00253904
               10  FILLER            PIC X(6) VALUE '17061C'.           00254004
               10  FILLER            PIC X(6) VALUE '17065C'.           00254104
               10  FILLER            PIC X(6) VALUE '17067C'.           00254204
               10  FILLER            PIC X(6) VALUE '17069C'.           00254304
               10  FILLER            PIC X(6) VALUE '17071C'.           00254404
               10  FILLER            PIC X(6) VALUE '17075C'.           00254504
               10  FILLER            PIC X(6) VALUE '17079C'.           00254604
               10  FILLER            PIC X(6) VALUE '17081C'.           00254704
               10  FILLER            PIC X(6) VALUE '17085C'.           00254804
               10  FILLER            PIC X(6) VALUE '17087C'.           00254904
               10  FILLER            PIC X(6) VALUE '17095C'.           00255004
               10  FILLER            PIC X(6) VALUE '17099C'.           00255104
               10  FILLER            PIC X(6) VALUE '17101C'.           00255204
               10  FILLER            PIC X(6) VALUE '17103C'.           00255304
               10  FILLER            PIC X(6) VALUE '17105C'.           00255404
               10  FILLER            PIC X(6) VALUE '17107C'.           00255504
               10  FILLER            PIC X(6) VALUE '17109C'.           00255604
               10  FILLER            PIC X(6) VALUE '17121C'.           00255704
               10  FILLER            PIC X(6) VALUE '17125C'.           00255804
               10  FILLER            PIC X(6) VALUE '17127C'.           00255904
               10  FILLER            PIC X(6) VALUE '17135C'.           00256004
               10  FILLER            PIC X(6) VALUE '17137C'.           00256104
               10  FILLER            PIC X(6) VALUE '17139C'.           00256204
               10  FILLER            PIC X(6) VALUE '17141C'.           00256304
               10  FILLER            PIC X(6) VALUE '17145C'.           00256404
               10  FILLER            PIC X(6) VALUE '17149C'.           00256504
               10  FILLER            PIC X(6) VALUE '17151C'.           00256604
               10  FILLER            PIC X(6) VALUE '17153C'.           00256704
               10  FILLER            PIC X(6) VALUE '17155C'.           00256804
               10  FILLER            PIC X(6) VALUE '17157C'.           00256904
               10  FILLER            PIC X(6) VALUE '17159C'.           00257004
               10  FILLER            PIC X(6) VALUE '17165C'.           00257104
               10  FILLER            PIC X(6) VALUE '17169C'.           00257204
               10  FILLER            PIC X(6) VALUE '17171C'.           00257304
               10  FILLER            PIC X(6) VALUE '17173C'.           00257404
               10  FILLER            PIC X(6) VALUE '17177C'.           00257504
               10  FILLER            PIC X(6) VALUE '17181C'.           00257604
               10  FILLER            PIC X(6) VALUE '17185C'.           00257704
               10  FILLER            PIC X(6) VALUE '17187C'.           00257804
               10  FILLER            PIC X(6) VALUE '17189C'.           00257904
               10  FILLER            PIC X(6) VALUE '17191C'.           00258004
               10  FILLER            PIC X(6) VALUE '17193C'.           00258104
               10  FILLER            PIC X(6) VALUE '17195C'.           00258204
               10  FILLER            PIC X(6) VALUE '18001C'.           00258304
               10  FILLER            PIC X(6) VALUE '18009C'.           00258404
               10  FILLER            PIC X(6) VALUE '18017C'.           00258504
               10  FILLER            PIC X(6) VALUE '18023C'.           00258604
               10  FILLER            PIC X(6) VALUE '18025C'.           00258704
               10  FILLER            PIC X(6) VALUE '18027C'.           00258804
               10  FILLER            PIC X(6) VALUE '18031C'.           00258904
               10  FILLER            PIC X(6) VALUE '18033C'.           00259004
               10  FILLER            PIC X(6) VALUE '18037C'.           00259104
               10  FILLER            PIC X(6) VALUE '18041C'.           00259204
               10  FILLER            PIC X(6) VALUE '18045C'.           00259304
               10  FILLER            PIC X(6) VALUE '18047C'.           00259404
               10  FILLER            PIC X(6) VALUE '18049C'.           00259504
               10  FILLER            PIC X(6) VALUE '18051C'.           00259604
               10  FILLER            PIC X(6) VALUE '18053C'.           00259704
               10  FILLER            PIC X(6) VALUE '18055C'.           00259804
               10  FILLER            PIC X(6) VALUE '18065C'.           00259904
               10  FILLER            PIC X(6) VALUE '18069C'.           00260004
               10  FILLER            PIC X(6) VALUE '18071C'.           00260104
               10  FILLER            PIC X(6) VALUE '18075C'.           00260204
               10  FILLER            PIC X(6) VALUE '18077C'.           00260304
               10  FILLER            PIC X(6) VALUE '18079C'.           00260404
               10  FILLER            PIC X(6) VALUE '18083C'.           00260504
               10  FILLER            PIC X(6) VALUE '18085C'.           00260604
               10  FILLER            PIC X(6) VALUE '18087C'.           00260704
               10  FILLER            PIC X(6) VALUE '18093C'.           00260804
               10  FILLER            PIC X(6) VALUE '18099C'.           00260904
               10  FILLER            PIC X(6) VALUE '18101C'.           00261004
               10  FILLER            PIC X(6) VALUE '18103C'.           00261104
               10  FILLER            PIC X(6) VALUE '18107C'.           00261204
               10  FILLER            PIC X(6) VALUE '18113C'.           00261304
               10  FILLER            PIC X(6) VALUE '18117C'.           00261404
               10  FILLER            PIC X(6) VALUE '18121C'.           00261504
               10  FILLER            PIC X(6) VALUE '18123C'.           00261604
               10  FILLER            PIC X(6) VALUE '18125C'.           00261704
               10  FILLER            PIC X(6) VALUE '18131C'.           00261804
               10  FILLER            PIC X(6) VALUE '18135C'.           00261904
               10  FILLER            PIC X(6) VALUE '18137C'.           00262004
               10  FILLER            PIC X(6) VALUE '18139C'.           00262104
               10  FILLER            PIC X(6) VALUE '18143A'.           00262204
               10  FILLER            PIC X(6) VALUE '18147C'.           00262304
               10  FILLER            PIC X(6) VALUE '18149C'.           00262404
               10  FILLER            PIC X(6) VALUE '18151C'.           00262504
               10  FILLER            PIC X(6) VALUE '18155C'.           00262604
               10  FILLER            PIC X(6) VALUE '18159C'.           00262704
               10  FILLER            PIC X(6) VALUE '18169C'.           00262804
               10  FILLER            PIC X(6) VALUE '18171C'.           00262904
               10  FILLER            PIC X(6) VALUE '18177C'.           00263004
               10  FILLER            PIC X(6) VALUE '18179A'.           00263104
               10  FILLER            PIC X(6) VALUE '18181C'.           00263204
               10  FILLER            PIC X(6) VALUE '19001C'.           00263304
               10  FILLER            PIC X(6) VALUE '19003C'.           00263404
               10  FILLER            PIC X(6) VALUE '19005C'.           00263504
               10  FILLER            PIC X(6) VALUE '19007C'.           00263604
               10  FILLER            PIC X(6) VALUE '19009C'.           00263704
               10  FILLER            PIC X(6) VALUE '19015C'.           00263804
               10  FILLER            PIC X(6) VALUE '19019C'.           00263904
               10  FILLER            PIC X(6) VALUE '19021C'.           00264004
               10  FILLER            PIC X(6) VALUE '19023C'.           00264104
               10  FILLER            PIC X(6) VALUE '19025C'.           00264204
               10  FILLER            PIC X(6) VALUE '19027C'.           00264304
               10  FILLER            PIC X(6) VALUE '19029C'.           00264404
               10  FILLER            PIC X(6) VALUE '19031C'.           00264504
               10  FILLER            PIC X(6) VALUE '19033C'.           00264604
               10  FILLER            PIC X(6) VALUE '19035C'.           00264704
               10  FILLER            PIC X(6) VALUE '19037C'.           00264804
               10  FILLER            PIC X(6) VALUE '19039C'.           00264904
               10  FILLER            PIC X(6) VALUE '19041C'.           00265004
               10  FILLER            PIC X(6) VALUE '19043C'.           00265104
               10  FILLER            PIC X(6) VALUE '19045C'.           00265204
               10  FILLER            PIC X(6) VALUE '19047C'.           00265304
               10  FILLER            PIC X(6) VALUE '19051C'.           00265404
               10  FILLER            PIC X(6) VALUE '19053C'.           00265504
               10  FILLER            PIC X(6) VALUE '19055C'.           00265604
               10  FILLER            PIC X(6) VALUE '19057C'.           00265704
               10  FILLER            PIC X(6) VALUE '19059C'.           00265804
               10  FILLER            PIC X(6) VALUE '19063C'.           00265904
               10  FILLER            PIC X(6) VALUE '19065C'.           00266004
               10  FILLER            PIC X(6) VALUE '19067C'.           00266104
               10  FILLER            PIC X(6) VALUE '19069C'.           00266204
               10  FILLER            PIC X(6) VALUE '19071C'.           00266304
               10  FILLER            PIC X(6) VALUE '19073C'.           00266404
               10  FILLER            PIC X(6) VALUE '19079C'.           00266504
               10  FILLER            PIC X(6) VALUE '19081C'.           00266604
               10  FILLER            PIC X(6) VALUE '19083C'.           00266704
               10  FILLER            PIC X(6) VALUE '19087C'.           00266804
               10  FILLER            PIC X(6) VALUE '19089C'.           00266904
               10  FILLER            PIC X(6) VALUE '19091C'.           00267004
               10  FILLER            PIC X(6) VALUE '19093C'.           00267104
               10  FILLER            PIC X(6) VALUE '19095C'.           00267204
               10  FILLER            PIC X(6) VALUE '19097C'.           00267304
               10  FILLER            PIC X(6) VALUE '19099C'.           00267404
               10  FILLER            PIC X(6) VALUE '19101C'.           00267504
               10  FILLER            PIC X(6) VALUE '19107C'.           00267604
               10  FILLER            PIC X(6) VALUE '19109C'.           00267704
               10  FILLER            PIC X(6) VALUE '19111C'.           00267804
               10  FILLER            PIC X(6) VALUE '19115C'.           00267904
               10  FILLER            PIC X(6) VALUE '19117C'.           00268004
               10  FILLER            PIC X(6) VALUE '19119C'.           00268104
               10  FILLER            PIC X(6) VALUE '19123C'.           00268204
               10  FILLER            PIC X(6) VALUE '19125C'.           00268304
               10  FILLER            PIC X(6) VALUE '19127C'.           00268404
               10  FILLER            PIC X(6) VALUE '19131C'.           00268504
               10  FILLER            PIC X(6) VALUE '19133C'.           00268604
               10  FILLER            PIC X(6) VALUE '19135C'.           00268704
               10  FILLER            PIC X(6) VALUE '19137C'.           00268804
               10  FILLER            PIC X(6) VALUE '19139C'.           00268904
               10  FILLER            PIC X(6) VALUE '19141C'.           00269004
               10  FILLER            PIC X(6) VALUE '19143C'.           00269104
               10  FILLER            PIC X(6) VALUE '19145C'.           00269204
               10  FILLER            PIC X(6) VALUE '19147C'.           00269304
               10  FILLER            PIC X(6) VALUE '19149A'.           00269404
               10  FILLER            PIC X(6) VALUE '19151C'.           00269504
               10  FILLER            PIC X(6) VALUE '19157C'.           00269604
               10  FILLER            PIC X(6) VALUE '19159C'.           00269704
               10  FILLER            PIC X(6) VALUE '19161C'.           00269804
               10  FILLER            PIC X(6) VALUE '19165C'.           00269904
               10  FILLER            PIC X(6) VALUE '19167C'.           00270004
               10  FILLER            PIC X(6) VALUE '19171C'.           00270104
               10  FILLER            PIC X(6) VALUE '19173C'.           00270204
               10  FILLER            PIC X(6) VALUE '19175C'.           00270304
               10  FILLER            PIC X(6) VALUE '19177C'.           00270404
               10  FILLER            PIC X(6) VALUE '19179C'.           00270504
               10  FILLER            PIC X(6) VALUE '19185C'.           00270604
               10  FILLER            PIC X(6) VALUE '19187C'.           00270704
               10  FILLER            PIC X(6) VALUE '19189C'.           00270804
               10  FILLER            PIC X(6) VALUE '19191C'.           00270904
               10  FILLER            PIC X(6) VALUE '19195C'.           00271004
               10  FILLER            PIC X(6) VALUE '19197C'.           00271104
               10  FILLER            PIC X(6) VALUE '20001C'.           00271204
               10  FILLER            PIC X(6) VALUE '20003C'.           00271304
               10  FILLER            PIC X(6) VALUE '20005C'.           00271404
               10  FILLER            PIC X(6) VALUE '20007B'.           00271504
               10  FILLER            PIC X(6) VALUE '20009C'.           00271604
               10  FILLER            PIC X(6) VALUE '20011C'.           00271704
               10  FILLER            PIC X(6) VALUE '20013C'.           00271804
               10  FILLER            PIC X(6) VALUE '20017B'.           00271904
               10  FILLER            PIC X(6) VALUE '20019A'.           00272004
               10  FILLER            PIC X(6) VALUE '20021C'.           00272104
               10  FILLER            PIC X(6) VALUE '20023B'.           00272204
               10  FILLER            PIC X(6) VALUE '20025B'.           00272304
               10  FILLER            PIC X(6) VALUE '20027C'.           00272404
               10  FILLER            PIC X(6) VALUE '20029C'.           00272504
               10  FILLER            PIC X(6) VALUE '20031C'.           00272604
               10  FILLER            PIC X(6) VALUE '20033B'.           00272704
               10  FILLER            PIC X(6) VALUE '20035C'.           00272804
               10  FILLER            PIC X(6) VALUE '20037C'.           00272904
               10  FILLER            PIC X(6) VALUE '20039B'.           00273004
               10  FILLER            PIC X(6) VALUE '20041C'.           00273104
               10  FILLER            PIC X(6) VALUE '20047B'.           00273204
               10  FILLER            PIC X(6) VALUE '20049B'.           00273304
               10  FILLER            PIC X(6) VALUE '20051C'.           00273404
               10  FILLER            PIC X(6) VALUE '20053A'.           00273504
               10  FILLER            PIC X(6) VALUE '20055C'.           00273604
               10  FILLER            PIC X(6) VALUE '20057C'.           00273704
               10  FILLER            PIC X(6) VALUE '20059C'.           00273804
               10  FILLER            PIC X(6) VALUE '20061C'.           00273904
               10  FILLER            PIC X(6) VALUE '20063B'.           00274004
               10  FILLER            PIC X(6) VALUE '20065A'.           00274104
               10  FILLER            PIC X(6) VALUE '20067C'.           00274204
               10  FILLER            PIC X(6) VALUE '20069C'.           00274304
               10  FILLER            PIC X(6) VALUE '20071B'.           00274404
               10  FILLER            PIC X(6) VALUE '20073A'.           00274504
               10  FILLER            PIC X(6) VALUE '20075B'.           00274604
               10  FILLER            PIC X(6) VALUE '20077C'.           00274704
               10  FILLER            PIC X(6) VALUE '20081C'.           00274804
               10  FILLER            PIC X(6) VALUE '20083B'.           00274904
               10  FILLER            PIC X(6) VALUE '20089B'.           00275004
               10  FILLER            PIC X(6) VALUE '20093B'.           00275104
               10  FILLER            PIC X(6) VALUE '20095A'.           00275204
               10  FILLER            PIC X(6) VALUE '20097B'.           00275304
               10  FILLER            PIC X(6) VALUE '20099C'.           00275404
               10  FILLER            PIC X(6) VALUE '20101B'.           00275504
               10  FILLER            PIC X(6) VALUE '20105B'.           00275604
               10  FILLER            PIC X(6) VALUE '20109B'.           00275704
               10  FILLER            PIC X(6) VALUE '20111C'.           00275804
               10  FILLER            PIC X(6) VALUE '20113C'.           00275904
               10  FILLER            PIC X(6) VALUE '20115C'.           00276004
               10  FILLER            PIC X(6) VALUE '20117C'.           00276104
               10  FILLER            PIC X(6) VALUE '20119B'.           00276204
               10  FILLER            PIC X(6) VALUE '20123C'.           00276304
               10  FILLER            PIC X(6) VALUE '20125C'.           00276404
               10  FILLER            PIC X(6) VALUE '20127C'.           00276504
               10  FILLER            PIC X(6) VALUE '20129B'.           00276604
               10  FILLER            PIC X(6) VALUE '20131C'.           00276704
               10  FILLER            PIC X(6) VALUE '20133C'.           00276804
               10  FILLER            PIC X(6) VALUE '20135B'.           00276904
               10  FILLER            PIC X(6) VALUE '20137C'.           00277004
               10  FILLER            PIC X(6) VALUE '20141B'.           00277104
               10  FILLER            PIC X(6) VALUE '20143C'.           00277204
               10  FILLER            PIC X(6) VALUE '20145C'.           00277304
               10  FILLER            PIC X(6) VALUE '20147C'.           00277404
               10  FILLER            PIC X(6) VALUE '20151C'.           00277504
               10  FILLER            PIC X(6) VALUE '20153B'.           00277604
               10  FILLER            PIC X(6) VALUE '20155C'.           00277704
               10  FILLER            PIC X(6) VALUE '20157C'.           00277804
               10  FILLER            PIC X(6) VALUE '20159C'.           00277904
               10  FILLER            PIC X(6) VALUE '20163B'.           00278004
               10  FILLER            PIC X(6) VALUE '20165B'.           00278104
               10  FILLER            PIC X(6) VALUE '20167A'.           00278204
               10  FILLER            PIC X(6) VALUE '20169A'.           00278304
               10  FILLER            PIC X(6) VALUE '20171C'.           00278404
               10  FILLER            PIC X(6) VALUE '20175C'.           00278504
               10  FILLER            PIC X(6) VALUE '20179B'.           00278604
               10  FILLER            PIC X(6) VALUE '20181B'.           00278704
               10  FILLER            PIC X(6) VALUE '20183B'.           00278804
               10  FILLER            PIC X(6) VALUE '20185B'.           00278904
               10  FILLER            PIC X(6) VALUE '20187B'.           00279004
               10  FILLER            PIC X(6) VALUE '20189C'.           00279104
               10  FILLER            PIC X(6) VALUE '20193C'.           00279204
               10  FILLER            PIC X(6) VALUE '20195B'.           00279304
               10  FILLER            PIC X(6) VALUE '20199B'.           00279404
               10  FILLER            PIC X(6) VALUE '20201C'.           00279504
               10  FILLER            PIC X(6) VALUE '20203B'.           00279604
               10  FILLER            PIC X(6) VALUE '20205A'.           00279704
               10  FILLER            PIC X(6) VALUE '20207C'.           00279804
               10  FILLER            PIC X(6) VALUE '21001A'.           00279904
               10  FILLER            PIC X(6) VALUE '21005C'.           00280004
               10  FILLER            PIC X(6) VALUE '21007C'.           00280104
               10  FILLER            PIC X(6) VALUE '21009C'.           00280204
               10  FILLER            PIC X(6) VALUE '21011A'.           00280304
               10  FILLER            PIC X(6) VALUE '21013A'.           00280404
               10  FILLER            PIC X(6) VALUE '21021A'.           00280504
               10  FILLER            PIC X(6) VALUE '21025A'.           00280604
               10  FILLER            PIC X(6) VALUE '21027C'.           00280704
               10  FILLER            PIC X(6) VALUE '21033C'.           00280804
               10  FILLER            PIC X(6) VALUE '21035C'.           00280904
               10  FILLER            PIC X(6) VALUE '21039C'.           00281004
               10  FILLER            PIC X(6) VALUE '21041A'.           00281104
               10  FILLER            PIC X(6) VALUE '21043C'.           00281204
               10  FILLER            PIC X(6) VALUE '21045A'.           00281304
               10  FILLER            PIC X(6) VALUE '21051A'.           00281404
               10  FILLER            PIC X(6) VALUE '21053A'.           00281504
               10  FILLER            PIC X(6) VALUE '21055C'.           00281604
               10  FILLER            PIC X(6) VALUE '21057A'.           00281704
               10  FILLER            PIC X(6) VALUE '21063C'.           00281804
               10  FILLER            PIC X(6) VALUE '21065A'.           00281904
               10  FILLER            PIC X(6) VALUE '21069C'.           00282004
               10  FILLER            PIC X(6) VALUE '21071C'.           00282104
               10  FILLER            PIC X(6) VALUE '21073C'.           00282204
               10  FILLER            PIC X(6) VALUE '21075A'.           00282304
               10  FILLER            PIC X(6) VALUE '21079A'.           00282404
               10  FILLER            PIC X(6) VALUE '21083C'.           00282504
               10  FILLER            PIC X(6) VALUE '21085A'.           00282604
               10  FILLER            PIC X(6) VALUE '21087A'.           00282704
               10  FILLER            PIC X(6) VALUE '21095C'.           00282804
               10  FILLER            PIC X(6) VALUE '21097C'.           00282904
               10  FILLER            PIC X(6) VALUE '21099C'.           00283004
               10  FILLER            PIC X(6) VALUE '21105A'.           00283104
               10  FILLER            PIC X(6) VALUE '21107C'.           00283204
               10  FILLER            PIC X(6) VALUE '21109C'.           00283304
               10  FILLER            PIC X(6) VALUE '21115C'.           00283404
               10  FILLER            PIC X(6) VALUE '21119C'.           00283504
               10  FILLER            PIC X(6) VALUE '21121A'.           00283604
               10  FILLER            PIC X(6) VALUE '21125C'.           00283704
               10  FILLER            PIC X(6) VALUE '21127A'.           00283804
               10  FILLER            PIC X(6) VALUE '21129C'.           00283904
               10  FILLER            PIC X(6) VALUE '21131C'.           00284004
               10  FILLER            PIC X(6) VALUE '21133C'.           00284104
               10  FILLER            PIC X(6) VALUE '21135C'.           00284204
               10  FILLER            PIC X(6) VALUE '21137A'.           00284304
               10  FILLER            PIC X(6) VALUE '21139C'.           00284404
               10  FILLER            PIC X(6) VALUE '21141C'.           00284504
               10  FILLER            PIC X(6) VALUE '21143C'.           00284604
               10  FILLER            PIC X(6) VALUE '21145C'.           00284704
               10  FILLER            PIC X(6) VALUE '21147A'.           00284804
               10  FILLER            PIC X(6) VALUE '21151C'.           00284904
               10  FILLER            PIC X(6) VALUE '21153C'.           00285004
               10  FILLER            PIC X(6) VALUE '21155A'.           00285104
               10  FILLER            PIC X(6) VALUE '21157C'.           00285204
               10  FILLER            PIC X(6) VALUE '21159C'.           00285304
               10  FILLER            PIC X(6) VALUE '21161C'.           00285404
               10  FILLER            PIC X(6) VALUE '21165C'.           00285504
               10  FILLER            PIC X(6) VALUE '21167A'.           00285604
               10  FILLER            PIC X(6) VALUE '21169C'.           00285704
               10  FILLER            PIC X(6) VALUE '21171C'.           00285804
               10  FILLER            PIC X(6) VALUE '21173C'.           00285904
               10  FILLER            PIC X(6) VALUE '21175C'.           00286004
               10  FILLER            PIC X(6) VALUE '21177C'.           00286104
               10  FILLER            PIC X(6) VALUE '21179A'.           00286204
               10  FILLER            PIC X(6) VALUE '21181A'.           00286304
               10  FILLER            PIC X(6) VALUE '21183C'.           00286404
               10  FILLER            PIC X(6) VALUE '21187C'.           00286504
               10  FILLER            PIC X(6) VALUE '21189C'.           00286604
               10  FILLER            PIC X(6) VALUE '21193C'.           00286704
               10  FILLER            PIC X(6) VALUE '21195C'.           00286804
               10  FILLER            PIC X(6) VALUE '21197C'.           00286904
               10  FILLER            PIC X(6) VALUE '21199C'.           00287004
               10  FILLER            PIC X(6) VALUE '21201C'.           00287104
               10  FILLER            PIC X(6) VALUE '21203C'.           00287204
               10  FILLER            PIC X(6) VALUE '21205A'.           00287304
               10  FILLER            PIC X(6) VALUE '21207A'.           00287404
               10  FILLER            PIC X(6) VALUE '21213C'.           00287504
               10  FILLER            PIC X(6) VALUE '21217A'.           00287604
               10  FILLER            PIC X(6) VALUE '21219A'.           00287704
               10  FILLER            PIC X(6) VALUE '21223A'.           00287804
               10  FILLER            PIC X(6) VALUE '21225A'.           00287904
               10  FILLER            PIC X(6) VALUE '21229A'.           00288004
               10  FILLER            PIC X(6) VALUE '21231C'.           00288104
               10  FILLER            PIC X(6) VALUE '21233C'.           00288204
               10  FILLER            PIC X(6) VALUE '21235A'.           00288304
               10  FILLER            PIC X(6) VALUE '21237C'.           00288404
               10  FILLER            PIC X(6) VALUE '22003A'.           00288504
               10  FILLER            PIC X(6) VALUE '22007A'.           00288604
               10  FILLER            PIC X(6) VALUE '22009A'.           00288704
               10  FILLER            PIC X(6) VALUE '22011A'.           00288804
               10  FILLER            PIC X(6) VALUE '22013A'.           00288904
               10  FILLER            PIC X(6) VALUE '22021A'.           00289004
               10  FILLER            PIC X(6) VALUE '22025A'.           00289104
               10  FILLER            PIC X(6) VALUE '22027A'.           00289204
               10  FILLER            PIC X(6) VALUE '22029A'.           00289304
               10  FILLER            PIC X(6) VALUE '22035A'.           00289404
               10  FILLER            PIC X(6) VALUE '22039A'.           00289504
               10  FILLER            PIC X(6) VALUE '22041A'.           00289604
               10  FILLER            PIC X(6) VALUE '22049A'.           00289704
               10  FILLER            PIC X(6) VALUE '22053A'.           00289804
               10  FILLER            PIC X(6) VALUE '22059A'.           00289904
               10  FILLER            PIC X(6) VALUE '22061A'.           00290004
               10  FILLER            PIC X(6) VALUE '22065A'.           00290104
               10  FILLER            PIC X(6) VALUE '22067A'.           00290204
               10  FILLER            PIC X(6) VALUE '22069A'.           00290304
               10  FILLER            PIC X(6) VALUE '22081A'.           00290404
               10  FILLER            PIC X(6) VALUE '22083A'.           00290504
               10  FILLER            PIC X(6) VALUE '22085A'.           00290604
               10  FILLER            PIC X(6) VALUE '22097A'.           00290704
               10  FILLER            PIC X(6) VALUE '22101A'.           00290804
               10  FILLER            PIC X(6) VALUE '22107A'.           00290904
               10  FILLER            PIC X(6) VALUE '22115A'.           00291004
               10  FILLER            PIC X(6) VALUE '22117A'.           00291104
               10  FILLER            PIC X(6) VALUE '22119A'.           00291204
               10  FILLER            PIC X(6) VALUE '22123A'.           00291304
               10  FILLER            PIC X(6) VALUE '22127A'.           00291404
               10  FILLER            PIC X(6) VALUE '23003C'.           00291504
               10  FILLER            PIC X(6) VALUE '23007C'.           00291604
               10  FILLER            PIC X(6) VALUE '23009C'.           00291704
               10  FILLER            PIC X(6) VALUE '23011C'.           00291804
               10  FILLER            PIC X(6) VALUE '23013C'.           00291904
               10  FILLER            PIC X(6) VALUE '23015C'.           00292004
               10  FILLER            PIC X(6) VALUE '23017C'.           00292104
               10  FILLER            PIC X(6) VALUE '23021B'.           00292204
               10  FILLER            PIC X(6) VALUE '23025C'.           00292304
               10  FILLER            PIC X(6) VALUE '23027C'.           00292404
               10  FILLER            PIC X(6) VALUE '23029C'.           00292504
               10  FILLER            PIC X(6) VALUE '24011C'.           00292604
               10  FILLER            PIC X(6) VALUE '24019C'.           00292704
               10  FILLER            PIC X(6) VALUE '24023C'.           00292804
               10  FILLER            PIC X(6) VALUE '24029C'.           00292904
               10  FILLER            PIC X(6) VALUE '24041C'.           00293004
               10  FILLER            PIC X(6) VALUE '25007C'.           00293104
               10  FILLER            PIC X(6) VALUE '25011C'.           00293204
               10  FILLER            PIC X(6) VALUE '25019C'.           00293304
               10  FILLER            PIC X(6) VALUE '26001C'.           00293404
               10  FILLER            PIC X(6) VALUE '26003A'.           00293504
               10  FILLER            PIC X(6) VALUE '26005C'.           00293604
               10  FILLER            PIC X(6) VALUE '26007C'.           00293704
               10  FILLER            PIC X(6) VALUE '26009C'.           00293804
               10  FILLER            PIC X(6) VALUE '26011C'.           00293904
               10  FILLER            PIC X(6) VALUE '26013C'.           00294004
               10  FILLER            PIC X(6) VALUE '26015A'.           00294104
               10  FILLER            PIC X(6) VALUE '26019C'.           00294204
               10  FILLER            PIC X(6) VALUE '26023C'.           00294304
               10  FILLER            PIC X(6) VALUE '26029C'.           00294404
               10  FILLER            PIC X(6) VALUE '26031C'.           00294504
               10  FILLER            PIC X(6) VALUE '26033C'.           00294604
               10  FILLER            PIC X(6) VALUE '26035C'.           00294704
               10  FILLER            PIC X(6) VALUE '26039C'.           00294804
               10  FILLER            PIC X(6) VALUE '26041C'.           00294904
               10  FILLER            PIC X(6) VALUE '26043C'.           00295004
               10  FILLER            PIC X(6) VALUE '26047C'.           00295104
               10  FILLER            PIC X(6) VALUE '26051C'.           00295204
               10  FILLER            PIC X(6) VALUE '26053C'.           00295304
               10  FILLER            PIC X(6) VALUE '26055C'.           00295404
               10  FILLER            PIC X(6) VALUE '26057C'.           00295504
               10  FILLER            PIC X(6) VALUE '26059C'.           00295604
               10  FILLER            PIC X(6) VALUE '26061C'.           00295704
               10  FILLER            PIC X(6) VALUE '26063C'.           00295804
               10  FILLER            PIC X(6) VALUE '26067C'.           00295904
               10  FILLER            PIC X(6) VALUE '26069C'.           00296004
               10  FILLER            PIC X(6) VALUE '26071C'.           00296104
               10  FILLER            PIC X(6) VALUE '26073C'.           00296204
               10  FILLER            PIC X(6) VALUE '26079C'.           00296304
               10  FILLER            PIC X(6) VALUE '26083B'.           00296404
               10  FILLER            PIC X(6) VALUE '26085C'.           00296504
               10  FILLER            PIC X(6) VALUE '26089C'.           00296604
               10  FILLER            PIC X(6) VALUE '26091C'.           00296704
               10  FILLER            PIC X(6) VALUE '26095A'.           00296804
               10  FILLER            PIC X(6) VALUE '26097C'.           00296904
               10  FILLER            PIC X(6) VALUE '26101C'.           00297004
               10  FILLER            PIC X(6) VALUE '26103C'.           00297104
               10  FILLER            PIC X(6) VALUE '26105C'.           00297204
               10  FILLER            PIC X(6) VALUE '26107C'.           00297304
               10  FILLER            PIC X(6) VALUE '26109C'.           00297404
               10  FILLER            PIC X(6) VALUE '26113C'.           00297504
               10  FILLER            PIC X(6) VALUE '26119C'.           00297604
               10  FILLER            PIC X(6) VALUE '26123C'.           00297704
               10  FILLER            PIC X(6) VALUE '26127C'.           00297804
               10  FILLER            PIC X(6) VALUE '26129A'.           00297904
               10  FILLER            PIC X(6) VALUE '26131B'.           00298004
               10  FILLER            PIC X(6) VALUE '26133C'.           00298104
               10  FILLER            PIC X(6) VALUE '26135C'.           00298204
               10  FILLER            PIC X(6) VALUE '26137C'.           00298304
               10  FILLER            PIC X(6) VALUE '26141C'.           00298404
               10  FILLER            PIC X(6) VALUE '26143C'.           00298504
               10  FILLER            PIC X(6) VALUE '26149C'.           00298604
               10  FILLER            PIC X(6) VALUE '26151C'.           00298704
               10  FILLER            PIC X(6) VALUE '26153A'.           00298804
               10  FILLER            PIC X(6) VALUE '26155C'.           00298904
               10  FILLER            PIC X(6) VALUE '26157C'.           00299004
               10  FILLER            PIC X(6) VALUE '26159A'.           00299104
               10  FILLER            PIC X(6) VALUE '26165C'.           00299204
               10  FILLER            PIC X(6) VALUE '27001C'.           00299304
               10  FILLER            PIC X(6) VALUE '27005C'.           00299404
               10  FILLER            PIC X(6) VALUE '27007C'.           00299504
               10  FILLER            PIC X(6) VALUE '27011C'.           00299604
               10  FILLER            PIC X(6) VALUE '27015C'.           00299704
               10  FILLER            PIC X(6) VALUE '27021C'.           00299804
               10  FILLER            PIC X(6) VALUE '27023C'.           00299904
               10  FILLER            PIC X(6) VALUE '27029C'.           00300004
               10  FILLER            PIC X(6) VALUE '27031B'.           00300104
               10  FILLER            PIC X(6) VALUE '27033C'.           00300204
               10  FILLER            PIC X(6) VALUE '27035C'.           00300304
               10  FILLER            PIC X(6) VALUE '27041A'.           00300404
               10  FILLER            PIC X(6) VALUE '27043C'.           00300504
               10  FILLER            PIC X(6) VALUE '27047C'.           00300604
               10  FILLER            PIC X(6) VALUE '27049C'.           00300704
               10  FILLER            PIC X(6) VALUE '27051C'.           00300804
               10  FILLER            PIC X(6) VALUE '27057C'.           00300904
               10  FILLER            PIC X(6) VALUE '27061C'.           00301004
               10  FILLER            PIC X(6) VALUE '27063C'.           00301104
               10  FILLER            PIC X(6) VALUE '27065C'.           00301204
               10  FILLER            PIC X(6) VALUE '27067C'.           00301304
               10  FILLER            PIC X(6) VALUE '27069B'.           00301404
               10  FILLER            PIC X(6) VALUE '27071B'.           00301504
               10  FILLER            PIC X(6) VALUE '27073C'.           00301604
               10  FILLER            PIC X(6) VALUE '27075B'.           00301704
               10  FILLER            PIC X(6) VALUE '27077B'.           00301804
               10  FILLER            PIC X(6) VALUE '27081C'.           00301904
               10  FILLER            PIC X(6) VALUE '27083C'.           00302004
               10  FILLER            PIC X(6) VALUE '27085C'.           00302104
               10  FILLER            PIC X(6) VALUE '27087C'.           00302204
               10  FILLER            PIC X(6) VALUE '27089B'.           00302304
               10  FILLER            PIC X(6) VALUE '27091C'.           00302404
               10  FILLER            PIC X(6) VALUE '27093C'.           00302504
               10  FILLER            PIC X(6) VALUE '27097C'.           00302604
               10  FILLER            PIC X(6) VALUE '27099C'.           00302704
               10  FILLER            PIC X(6) VALUE '27101C'.           00302804
               10  FILLER            PIC X(6) VALUE '27105C'.           00302904
               10  FILLER            PIC X(6) VALUE '27107C'.           00303004
               10  FILLER            PIC X(6) VALUE '27111C'.           00303104
               10  FILLER            PIC X(6) VALUE '27113C'.           00303204
               10  FILLER            PIC X(6) VALUE '27115C'.           00303304
               10  FILLER            PIC X(6) VALUE '27117C'.           00303404
               10  FILLER            PIC X(6) VALUE '27121C'.           00303504
               10  FILLER            PIC X(6) VALUE '27125C'.           00303604
               10  FILLER            PIC X(6) VALUE '27127C'.           00303704
               10  FILLER            PIC X(6) VALUE '27129C'.           00303804
               10  FILLER            PIC X(6) VALUE '27131C'.           00303904
               10  FILLER            PIC X(6) VALUE '27133C'.           00304004
               10  FILLER            PIC X(6) VALUE '27135C'.           00304104
               10  FILLER            PIC X(6) VALUE '27143A'.           00304204
               10  FILLER            PIC X(6) VALUE '27147C'.           00304304
               10  FILLER            PIC X(6) VALUE '27149C'.           00304404
               10  FILLER            PIC X(6) VALUE '27151C'.           00304504
               10  FILLER            PIC X(6) VALUE '27153C'.           00304604
               10  FILLER            PIC X(6) VALUE '27155C'.           00304704
               10  FILLER            PIC X(6) VALUE '27159C'.           00304804
               10  FILLER            PIC X(6) VALUE '27161C'.           00304904
               10  FILLER            PIC X(6) VALUE '27165C'.           00305004
               10  FILLER            PIC X(6) VALUE '27167C'.           00305104
               10  FILLER            PIC X(6) VALUE '27169C'.           00305204
               10  FILLER            PIC X(6) VALUE '27173C'.           00305304
               10  FILLER            PIC X(6) VALUE '28001A'.           00305404
               10  FILLER            PIC X(6) VALUE '28003A'.           00305504
               10  FILLER            PIC X(6) VALUE '28005A'.           00305604
               10  FILLER            PIC X(6) VALUE '28007A'.           00305704
               10  FILLER            PIC X(6) VALUE '28009A'.           00305804
               10  FILLER            PIC X(6) VALUE '28011A'.           00305904
               10  FILLER            PIC X(6) VALUE '28013A'.           00306004
               10  FILLER            PIC X(6) VALUE '28015A'.           00306104
               10  FILLER            PIC X(6) VALUE '28017A'.           00306204
               10  FILLER            PIC X(6) VALUE '28019A'.           00306304
               10  FILLER            PIC X(6) VALUE '28021A'.           00306404
               10  FILLER            PIC X(6) VALUE '28023A'.           00306504
               10  FILLER            PIC X(6) VALUE '28025A'.           00306604
               10  FILLER            PIC X(6) VALUE '28027A'.           00306704
               10  FILLER            PIC X(6) VALUE '28031A'.           00306804
               10  FILLER            PIC X(6) VALUE '28037A'.           00306904
               10  FILLER            PIC X(6) VALUE '28039A'.           00307004
               10  FILLER            PIC X(6) VALUE '28041A'.           00307104
               10  FILLER            PIC X(6) VALUE '28043A'.           00307204
               10  FILLER            PIC X(6) VALUE '28051A'.           00307304
               10  FILLER            PIC X(6) VALUE '28053A'.           00307404
               10  FILLER            PIC X(6) VALUE '28055A'.           00307504
               10  FILLER            PIC X(6) VALUE '28057A'.           00307604
               10  FILLER            PIC X(6) VALUE '28061A'.           00307704
               10  FILLER            PIC X(6) VALUE '28063A'.           00307804
               10  FILLER            PIC X(6) VALUE '28065A'.           00307904
               10  FILLER            PIC X(6) VALUE '28067A'.           00308004
               10  FILLER            PIC X(6) VALUE '28069A'.           00308104
               10  FILLER            PIC X(6) VALUE '28071C'.           00308204
               10  FILLER            PIC X(6) VALUE '28075A'.           00308304
               10  FILLER            PIC X(6) VALUE '28077A'.           00308404
               10  FILLER            PIC X(6) VALUE '28079A'.           00308504
               10  FILLER            PIC X(6) VALUE '28081A'.           00308604
               10  FILLER            PIC X(6) VALUE '28083A'.           00308704
               10  FILLER            PIC X(6) VALUE '28085A'.           00308804
               10  FILLER            PIC X(6) VALUE '28087A'.           00308904
               10  FILLER            PIC X(6) VALUE '28091A'.           00309004
               10  FILLER            PIC X(6) VALUE '28095A'.           00309104
               10  FILLER            PIC X(6) VALUE '28097A'.           00309204
               10  FILLER            PIC X(6) VALUE '28099A'.           00309304
               10  FILLER            PIC X(6) VALUE '28101A'.           00309404
               10  FILLER            PIC X(6) VALUE '28103A'.           00309504
               10  FILLER            PIC X(6) VALUE '28105A'.           00309604
               10  FILLER            PIC X(6) VALUE '28107A'.           00309704
               10  FILLER            PIC X(6) VALUE '28109A'.           00309804
               10  FILLER            PIC X(6) VALUE '28113A'.           00309904
               10  FILLER            PIC X(6) VALUE '28115C'.           00310004
               10  FILLER            PIC X(6) VALUE '28117A'.           00310104
               10  FILLER            PIC X(6) VALUE '28119A'.           00310204
               10  FILLER            PIC X(6) VALUE '28123A'.           00310304
               10  FILLER            PIC X(6) VALUE '28125A'.           00310404
               10  FILLER            PIC X(6) VALUE '28129A'.           00310504
               10  FILLER            PIC X(6) VALUE '28131A'.           00310604
               10  FILLER            PIC X(6) VALUE '28133A'.           00310704
               10  FILLER            PIC X(6) VALUE '28135A'.           00310804
               10  FILLER            PIC X(6) VALUE '28139A'.           00310904
               10  FILLER            PIC X(6) VALUE '28141A'.           00311004
               10  FILLER            PIC X(6) VALUE '28145C'.           00311104
               10  FILLER            PIC X(6) VALUE '28147A'.           00311204
               10  FILLER            PIC X(6) VALUE '28149A'.           00311304
               10  FILLER            PIC X(6) VALUE '28151A'.           00311404
               10  FILLER            PIC X(6) VALUE '28153A'.           00311504
               10  FILLER            PIC X(6) VALUE '28155A'.           00311604
               10  FILLER            PIC X(6) VALUE '28157A'.           00311704
               10  FILLER            PIC X(6) VALUE '28159A'.           00311804
               10  FILLER            PIC X(6) VALUE '28161A'.           00311904
               10  FILLER            PIC X(6) VALUE '29001C'.           00312004
               10  FILLER            PIC X(6) VALUE '29005C'.           00312104
               10  FILLER            PIC X(6) VALUE '29007C'.           00312204
               10  FILLER            PIC X(6) VALUE '29009C'.           00312304
               10  FILLER            PIC X(6) VALUE '29011C'.           00312404
               10  FILLER            PIC X(6) VALUE '29015C'.           00312504
               10  FILLER            PIC X(6) VALUE '29023C'.           00312604
               10  FILLER            PIC X(6) VALUE '29029C'.           00312704
               10  FILLER            PIC X(6) VALUE '29033C'.           00312804
               10  FILLER            PIC X(6) VALUE '29035C'.           00312904
               10  FILLER            PIC X(6) VALUE '29039C'.           00313004
               10  FILLER            PIC X(6) VALUE '29041C'.           00313104
               10  FILLER            PIC X(6) VALUE '29045C'.           00313204
               10  FILLER            PIC X(6) VALUE '29053C'.           00313304
               10  FILLER            PIC X(6) VALUE '29055C'.           00313404
               10  FILLER            PIC X(6) VALUE '29057C'.           00313504
               10  FILLER            PIC X(6) VALUE '29061C'.           00313604
               10  FILLER            PIC X(6) VALUE '29065C'.           00313704
               10  FILLER            PIC X(6) VALUE '29067C'.           00313804
               10  FILLER            PIC X(6) VALUE '29069C'.           00313904
               10  FILLER            PIC X(6) VALUE '29073C'.           00314004
               10  FILLER            PIC X(6) VALUE '29075C'.           00314104
               10  FILLER            PIC X(6) VALUE '29079C'.           00314204
               10  FILLER            PIC X(6) VALUE '29081C'.           00314304
               10  FILLER            PIC X(6) VALUE '29083C'.           00314404
               10  FILLER            PIC X(6) VALUE '29085C'.           00314504
               10  FILLER            PIC X(6) VALUE '29087C'.           00314604
               10  FILLER            PIC X(6) VALUE '29089C'.           00314704
               10  FILLER            PIC X(6) VALUE '29091C'.           00314804
               10  FILLER            PIC X(6) VALUE '29093C'.           00314904
               10  FILLER            PIC X(6) VALUE '29101C'.           00315004
               10  FILLER            PIC X(6) VALUE '29103C'.           00315104
               10  FILLER            PIC X(6) VALUE '29105C'.           00315204
               10  FILLER            PIC X(6) VALUE '29109C'.           00315304
               10  FILLER            PIC X(6) VALUE '29111C'.           00315404
               10  FILLER            PIC X(6) VALUE '29115C'.           00315504
               10  FILLER            PIC X(6) VALUE '29117C'.           00315604
               10  FILLER            PIC X(6) VALUE '29119A'.           00315704
               10  FILLER            PIC X(6) VALUE '29121C'.           00315804
               10  FILLER            PIC X(6) VALUE '29123C'.           00315904
               10  FILLER            PIC X(6) VALUE '29125C'.           00316004
               10  FILLER            PIC X(6) VALUE '29127C'.           00316104
               10  FILLER            PIC X(6) VALUE '29129C'.           00316204
               10  FILLER            PIC X(6) VALUE '29131C'.           00316304
               10  FILLER            PIC X(6) VALUE '29133C'.           00316404
               10  FILLER            PIC X(6) VALUE '29137C'.           00316504
               10  FILLER            PIC X(6) VALUE '29139C'.           00316604
               10  FILLER            PIC X(6) VALUE '29141C'.           00316704
               10  FILLER            PIC X(6) VALUE '29143C'.           00316804
               10  FILLER            PIC X(6) VALUE '29147C'.           00316904
               10  FILLER            PIC X(6) VALUE '29149C'.           00317004
               10  FILLER            PIC X(6) VALUE '29153C'.           00317104
               10  FILLER            PIC X(6) VALUE '29155C'.           00317204
               10  FILLER            PIC X(6) VALUE '29157C'.           00317304
               10  FILLER            PIC X(6) VALUE '29159C'.           00317404
               10  FILLER            PIC X(6) VALUE '29161C'.           00317504
               10  FILLER            PIC X(6) VALUE '29163C'.           00317604
               10  FILLER            PIC X(6) VALUE '29169C'.           00317704
               10  FILLER            PIC X(6) VALUE '29171C'.           00317804
               10  FILLER            PIC X(6) VALUE '29173C'.           00317904
               10  FILLER            PIC X(6) VALUE '29175C'.           00318004
               10  FILLER            PIC X(6) VALUE '29179C'.           00318104
               10  FILLER            PIC X(6) VALUE '29181A'.           00318204
               10  FILLER            PIC X(6) VALUE '29185C'.           00318304
               10  FILLER            PIC X(6) VALUE '29186C'.           00318404
               10  FILLER            PIC X(6) VALUE '29187C'.           00318504
               10  FILLER            PIC X(6) VALUE '29195C'.           00318604
               10  FILLER            PIC X(6) VALUE '29197C'.           00318704
               10  FILLER            PIC X(6) VALUE '29199C'.           00318804
               10  FILLER            PIC X(6) VALUE '29201C'.           00318904
               10  FILLER            PIC X(6) VALUE '29203C'.           00319004
               10  FILLER            PIC X(6) VALUE '29205C'.           00319104
               10  FILLER            PIC X(6) VALUE '29207C'.           00319204
               10  FILLER            PIC X(6) VALUE '29209C'.           00319304
               10  FILLER            PIC X(6) VALUE '29211C'.           00319404
               10  FILLER            PIC X(6) VALUE '29213C'.           00319504
               10  FILLER            PIC X(6) VALUE '29215C'.           00319604
               10  FILLER            PIC X(6) VALUE '29217C'.           00319704
               10  FILLER            PIC X(6) VALUE '29221C'.           00319804
               10  FILLER            PIC X(6) VALUE '29223C'.           00319904
               10  FILLER            PIC X(6) VALUE '29227C'.           00320004
               10  FILLER            PIC X(6) VALUE '29229C'.           00320104
               10  FILLER            PIC X(6) VALUE '30001B'.           00320204
               10  FILLER            PIC X(6) VALUE '30003B'.           00320304
               10  FILLER            PIC X(6) VALUE '30005B'.           00320404
               10  FILLER            PIC X(6) VALUE '30007B'.           00320504
               10  FILLER            PIC X(6) VALUE '30011B'.           00320604
               10  FILLER            PIC X(6) VALUE '30015B'.           00320704
               10  FILLER            PIC X(6) VALUE '30017B'.           00320804
               10  FILLER            PIC X(6) VALUE '30019B'.           00320904
               10  FILLER            PIC X(6) VALUE '30021B'.           00321004
               10  FILLER            PIC X(6) VALUE '30023C'.           00321104
               10  FILLER            PIC X(6) VALUE '30025B'.           00321204
               10  FILLER            PIC X(6) VALUE '30027B'.           00321304
               10  FILLER            PIC X(6) VALUE '30029C'.           00321404
               10  FILLER            PIC X(6) VALUE '30031C'.           00321504
               10  FILLER            PIC X(6) VALUE '30033B'.           00321604
               10  FILLER            PIC X(6) VALUE '30035B'.           00321704
               10  FILLER            PIC X(6) VALUE '30037A'.           00321804
               10  FILLER            PIC X(6) VALUE '30039B'.           00321904
               10  FILLER            PIC X(6) VALUE '30041B'.           00322004
               10  FILLER            PIC X(6) VALUE '30043C'.           00322104
               10  FILLER            PIC X(6) VALUE '30045B'.           00322204
               10  FILLER            PIC X(6) VALUE '30047C'.           00322304
               10  FILLER            PIC X(6) VALUE '30049C'.           00322404
               10  FILLER            PIC X(6) VALUE '30051B'.           00322504
               10  FILLER            PIC X(6) VALUE '30053B'.           00322604
               10  FILLER            PIC X(6) VALUE '30055B'.           00322704
               10  FILLER            PIC X(6) VALUE '30057B'.           00322804
               10  FILLER            PIC X(6) VALUE '30059B'.           00322904
               10  FILLER            PIC X(6) VALUE '30061B'.           00323004
               10  FILLER            PIC X(6) VALUE '30065B'.           00323104
               10  FILLER            PIC X(6) VALUE '30067B'.           00323204
               10  FILLER            PIC X(6) VALUE '30069B'.           00323304
               10  FILLER            PIC X(6) VALUE '30071B'.           00323404
               10  FILLER            PIC X(6) VALUE '30073B'.           00323504
               10  FILLER            PIC X(6) VALUE '30075B'.           00323604
               10  FILLER            PIC X(6) VALUE '30077B'.           00323704
               10  FILLER            PIC X(6) VALUE '30079B'.           00323804
               10  FILLER            PIC X(6) VALUE '30081C'.           00323904
               10  FILLER            PIC X(6) VALUE '30083B'.           00324004
               10  FILLER            PIC X(6) VALUE '30085B'.           00324104
               10  FILLER            PIC X(6) VALUE '30087B'.           00324204
               10  FILLER            PIC X(6) VALUE '30089B'.           00324304
               10  FILLER            PIC X(6) VALUE '30091B'.           00324404
               10  FILLER            PIC X(6) VALUE '30093C'.           00324504
               10  FILLER            PIC X(6) VALUE '30095B'.           00324604
               10  FILLER            PIC X(6) VALUE '30097B'.           00324704
               10  FILLER            PIC X(6) VALUE '30099B'.           00324804
               10  FILLER            PIC X(6) VALUE '30101B'.           00324904
               10  FILLER            PIC X(6) VALUE '30103B'.           00325004
               10  FILLER            PIC X(6) VALUE '30105B'.           00325104
               10  FILLER            PIC X(6) VALUE '30107B'.           00325204
               10  FILLER            PIC X(6) VALUE '30109B'.           00325304
               10  FILLER            PIC X(6) VALUE '31001C'.           00325404
               10  FILLER            PIC X(6) VALUE '31003C'.           00325504
               10  FILLER            PIC X(6) VALUE '31005B'.           00325604
               10  FILLER            PIC X(6) VALUE '31007B'.           00325704
               10  FILLER            PIC X(6) VALUE '31009B'.           00325804
               10  FILLER            PIC X(6) VALUE '31011C'.           00325904
               10  FILLER            PIC X(6) VALUE '31013C'.           00326004
               10  FILLER            PIC X(6) VALUE '31015B'.           00326104
               10  FILLER            PIC X(6) VALUE '31017B'.           00326204
               10  FILLER            PIC X(6) VALUE '31019C'.           00326304
               10  FILLER            PIC X(6) VALUE '31021C'.           00326404
               10  FILLER            PIC X(6) VALUE '31023C'.           00326504
               10  FILLER            PIC X(6) VALUE '31027C'.           00326604
               10  FILLER            PIC X(6) VALUE '31029B'.           00326704
               10  FILLER            PIC X(6) VALUE '31031B'.           00326804
               10  FILLER            PIC X(6) VALUE '31033C'.           00326904
               10  FILLER            PIC X(6) VALUE '31035C'.           00327004
               10  FILLER            PIC X(6) VALUE '31037C'.           00327104
               10  FILLER            PIC X(6) VALUE '31039C'.           00327204
               10  FILLER            PIC X(6) VALUE '31041B'.           00327304
               10  FILLER            PIC X(6) VALUE '31045C'.           00327404
               10  FILLER            PIC X(6) VALUE '31047C'.           00327504
               10  FILLER            PIC X(6) VALUE '31049B'.           00327604
               10  FILLER            PIC X(6) VALUE '31053C'.           00327704
               10  FILLER            PIC X(6) VALUE '31057B'.           00327804
               10  FILLER            PIC X(6) VALUE '31059C'.           00327904
               10  FILLER            PIC X(6) VALUE '31061B'.           00328004
               10  FILLER            PIC X(6) VALUE '31063B'.           00328104
               10  FILLER            PIC X(6) VALUE '31065C'.           00328204
               10  FILLER            PIC X(6) VALUE '31067C'.           00328304
               10  FILLER            PIC X(6) VALUE '31069B'.           00328404
               10  FILLER            PIC X(6) VALUE '31071B'.           00328504
               10  FILLER            PIC X(6) VALUE '31073B'.           00328604
               10  FILLER            PIC X(6) VALUE '31075B'.           00328704
               10  FILLER            PIC X(6) VALUE '31077B'.           00328804
               10  FILLER            PIC X(6) VALUE '31081A'.           00328904
               10  FILLER            PIC X(6) VALUE '31083C'.           00329004
               10  FILLER            PIC X(6) VALUE '31085B'.           00329104
               10  FILLER            PIC X(6) VALUE '31087B'.           00329204
               10  FILLER            PIC X(6) VALUE '31089B'.           00329304
               10  FILLER            PIC X(6) VALUE '31091B'.           00329404
               10  FILLER            PIC X(6) VALUE '31095C'.           00329504
               10  FILLER            PIC X(6) VALUE '31097C'.           00329604
               10  FILLER            PIC X(6) VALUE '31099C'.           00329704
               10  FILLER            PIC X(6) VALUE '31101C'.           00329804
               10  FILLER            PIC X(6) VALUE '31103B'.           00329904
               10  FILLER            PIC X(6) VALUE '31105B'.           00330004
               10  FILLER            PIC X(6) VALUE '31107C'.           00330104
               10  FILLER            PIC X(6) VALUE '31111C'.           00330204
               10  FILLER            PIC X(6) VALUE '31113B'.           00330304
               10  FILLER            PIC X(6) VALUE '31115B'.           00330404
               10  FILLER            PIC X(6) VALUE '31117B'.           00330504
               10  FILLER            PIC X(6) VALUE '31119C'.           00330604
               10  FILLER            PIC X(6) VALUE '31123B'.           00330704
               10  FILLER            PIC X(6) VALUE '31125C'.           00330804
               10  FILLER            PIC X(6) VALUE '31127C'.           00330904
               10  FILLER            PIC X(6) VALUE '31129C'.           00331004
               10  FILLER            PIC X(6) VALUE '31131C'.           00331104
               10  FILLER            PIC X(6) VALUE '31133C'.           00331204
               10  FILLER            PIC X(6) VALUE '31135B'.           00331304
               10  FILLER            PIC X(6) VALUE '31137C'.           00331404
               10  FILLER            PIC X(6) VALUE '31139C'.           00331504
               10  FILLER            PIC X(6) VALUE '31141C'.           00331604
               10  FILLER            PIC X(6) VALUE '31143C'.           00331704
               10  FILLER            PIC X(6) VALUE '31145C'.           00331804
               10  FILLER            PIC X(6) VALUE '31147C'.           00331904
               10  FILLER            PIC X(6) VALUE '31149B'.           00332004
               10  FILLER            PIC X(6) VALUE '31151C'.           00332104
               10  FILLER            PIC X(6) VALUE '31157C'.           00332204
               10  FILLER            PIC X(6) VALUE '31161B'.           00332304
               10  FILLER            PIC X(6) VALUE '31163B'.           00332404
               10  FILLER            PIC X(6) VALUE '31165B'.           00332504
               10  FILLER            PIC X(6) VALUE '31167C'.           00332604
               10  FILLER            PIC X(6) VALUE '31169C'.           00332704
               10  FILLER            PIC X(6) VALUE '31171B'.           00332804
               10  FILLER            PIC X(6) VALUE '31173C'.           00332904
               10  FILLER            PIC X(6) VALUE '31175C'.           00333004
               10  FILLER            PIC X(6) VALUE '31179C'.           00333104
               10  FILLER            PIC X(6) VALUE '31181C'.           00333204
               10  FILLER            PIC X(6) VALUE '31183B'.           00333304
               10  FILLER            PIC X(6) VALUE '31185C'.           00333404
               10  FILLER            PIC X(6) VALUE '32001B'.           00333504
               10  FILLER            PIC X(6) VALUE '32005C'.           00333604
               10  FILLER            PIC X(6) VALUE '32007B'.           00333704
               10  FILLER            PIC X(6) VALUE '32009B'.           00333804
               10  FILLER            PIC X(6) VALUE '32011B'.           00333904
               10  FILLER            PIC X(6) VALUE '32013B'.           00334004
               10  FILLER            PIC X(6) VALUE '32015B'.           00334104
               10  FILLER            PIC X(6) VALUE '32017A'.           00334204
               10  FILLER            PIC X(6) VALUE '32019C'.           00334304
               10  FILLER            PIC X(6) VALUE '32021B'.           00334404
               10  FILLER            PIC X(6) VALUE '32023B'.           00334504
               10  FILLER            PIC X(6) VALUE '32027B'.           00334604
               10  FILLER            PIC X(6) VALUE '32033B'.           00334704
               10  FILLER            PIC X(6) VALUE '33001C'.           00334804
               10  FILLER            PIC X(6) VALUE '33003C'.           00334904
               10  FILLER            PIC X(6) VALUE '33005C'.           00335004
               10  FILLER            PIC X(6) VALUE '33007C'.           00335104
               10  FILLER            PIC X(6) VALUE '33009C'.           00335204
               10  FILLER            PIC X(6) VALUE '33013A'.           00335304
               10  FILLER            PIC X(6) VALUE '33019C'.           00335404
               10  FILLER            PIC X(6) VALUE '35003B'.           00335504
               10  FILLER            PIC X(6) VALUE '35005A'.           00335604
               10  FILLER            PIC X(6) VALUE '35006B'.           00335704
               10  FILLER            PIC X(6) VALUE '35007B'.           00335804
               10  FILLER            PIC X(6) VALUE '35009C'.           00335904
               10  FILLER            PIC X(6) VALUE '35011B'.           00336004
               10  FILLER            PIC X(6) VALUE '35015A'.           00336104
               10  FILLER            PIC X(6) VALUE '35017C'.           00336204
               10  FILLER            PIC X(6) VALUE '35019B'.           00336304
               10  FILLER            PIC X(6) VALUE '35021B'.           00336404
               10  FILLER            PIC X(6) VALUE '35023B'.           00336504
               10  FILLER            PIC X(6) VALUE '35025A'.           00336604
               10  FILLER            PIC X(6) VALUE '35027B'.           00336704
               10  FILLER            PIC X(6) VALUE '35028C'.           00336804
               10  FILLER            PIC X(6) VALUE '35029C'.           00336904
               10  FILLER            PIC X(6) VALUE '35031C'.           00337004
               10  FILLER            PIC X(6) VALUE '35033B'.           00337104
               10  FILLER            PIC X(6) VALUE '35035C'.           00337204
               10  FILLER            PIC X(6) VALUE '35037B'.           00337304
               10  FILLER            PIC X(6) VALUE '35039C'.           00337404
               10  FILLER            PIC X(6) VALUE '35041A'.           00337504
               10  FILLER            PIC X(6) VALUE '35047C'.           00337604
               10  FILLER            PIC X(6) VALUE '35051B'.           00337704
               10  FILLER            PIC X(6) VALUE '35053B'.           00337804
               10  FILLER            PIC X(6) VALUE '35055C'.           00337904
               10  FILLER            PIC X(6) VALUE '35059B'.           00338004
               10  FILLER            PIC X(6) VALUE '36003C'.           00338104
               10  FILLER            PIC X(6) VALUE '36009C'.           00338204
               10  FILLER            PIC X(6) VALUE '36011C'.           00338304
               10  FILLER            PIC X(6) VALUE '36013C'.           00338404
               10  FILLER            PIC X(6) VALUE '36017C'.           00338504
               10  FILLER            PIC X(6) VALUE '36019C'.           00338604
               10  FILLER            PIC X(6) VALUE '36021C'.           00338704
               10  FILLER            PIC X(6) VALUE '36023C'.           00338804
               10  FILLER            PIC X(6) VALUE '36025C'.           00338904
               10  FILLER            PIC X(6) VALUE '36031C'.           00339004
               10  FILLER            PIC X(6) VALUE '36033C'.           00339104
               10  FILLER            PIC X(6) VALUE '36035C'.           00339204
               10  FILLER            PIC X(6) VALUE '36037C'.           00339304
               10  FILLER            PIC X(6) VALUE '36039C'.           00339404
               10  FILLER            PIC X(6) VALUE '36041B'.           00339504
               10  FILLER            PIC X(6) VALUE '36049C'.           00339604
               10  FILLER            PIC X(6) VALUE '36057C'.           00339704
               10  FILLER            PIC X(6) VALUE '36077C'.           00339804
               10  FILLER            PIC X(6) VALUE '36089C'.           00339904
               10  FILLER            PIC X(6) VALUE '36097C'.           00340004
               10  FILLER            PIC X(6) VALUE '36099C'.           00340104
               10  FILLER            PIC X(6) VALUE '36101C'.           00340204
               10  FILLER            PIC X(6) VALUE '36105C'.           00340304
               10  FILLER            PIC X(6) VALUE '36121C'.           00340404
               10  FILLER            PIC X(6) VALUE '37005C'.           00340504
               10  FILLER            PIC X(6) VALUE '37007C'.           00340604
               10  FILLER            PIC X(6) VALUE '37009C'.           00340704
               10  FILLER            PIC X(6) VALUE '37011A'.           00340804
               10  FILLER            PIC X(6) VALUE '37013C'.           00340904
               10  FILLER            PIC X(6) VALUE '37015C'.           00341004
               10  FILLER            PIC X(6) VALUE '37017C'.           00341104
               10  FILLER            PIC X(6) VALUE '37029C'.           00341204
               10  FILLER            PIC X(6) VALUE '37031C'.           00341304
               10  FILLER            PIC X(6) VALUE '37033C'.           00341404
               10  FILLER            PIC X(6) VALUE '37039C'.           00341504
               10  FILLER            PIC X(6) VALUE '37041C'.           00341604
               10  FILLER            PIC X(6) VALUE '37043C'.           00341704
               10  FILLER            PIC X(6) VALUE '37045A'.           00341804
               10  FILLER            PIC X(6) VALUE '37047A'.           00341904
               10  FILLER            PIC X(6) VALUE '37055C'.           00342004
               10  FILLER            PIC X(6) VALUE '37061C'.           00342104
               10  FILLER            PIC X(6) VALUE '37075C'.           00342204
               10  FILLER            PIC X(6) VALUE '37077C'.           00342304
               10  FILLER            PIC X(6) VALUE '37079C'.           00342404
               10  FILLER            PIC X(6) VALUE '37083C'.           00342504
               10  FILLER            PIC X(6) VALUE '37085C'.           00342604
               10  FILLER            PIC X(6) VALUE '37091C'.           00342704
               10  FILLER            PIC X(6) VALUE '37095C'.           00342804
               10  FILLER            PIC X(6) VALUE '37099C'.           00342904
               10  FILLER            PIC X(6) VALUE '37105C'.           00343004
               10  FILLER            PIC X(6) VALUE '37107C'.           00343104
               10  FILLER            PIC X(6) VALUE '37111C'.           00343204
               10  FILLER            PIC X(6) VALUE '37113C'.           00343304
               10  FILLER            PIC X(6) VALUE '37117C'.           00343404
               10  FILLER            PIC X(6) VALUE '37121C'.           00343504
               10  FILLER            PIC X(6) VALUE '37123C'.           00343604
               10  FILLER            PIC X(6) VALUE '37125C'.           00343704
               10  FILLER            PIC X(6) VALUE '37131C'.           00343804
               10  FILLER            PIC X(6) VALUE '37139C'.           00343904
               10  FILLER            PIC X(6) VALUE '37143C'.           00344004
               10  FILLER            PIC X(6) VALUE '37149C'.           00344104
               10  FILLER            PIC X(6) VALUE '37153C'.           00344204
               10  FILLER            PIC X(6) VALUE '37155C'.           00344304
               10  FILLER            PIC X(6) VALUE '37161C'.           00344404
               10  FILLER            PIC X(6) VALUE '37163C'.           00344504
               10  FILLER            PIC X(6) VALUE '37165C'.           00344604
               10  FILLER            PIC X(6) VALUE '37167C'.           00344704
               10  FILLER            PIC X(6) VALUE '37171C'.           00344804
               10  FILLER            PIC X(6) VALUE '37173C'.           00344904
               10  FILLER            PIC X(6) VALUE '37175C'.           00345004
               10  FILLER            PIC X(6) VALUE '37177C'.           00345104
               10  FILLER            PIC X(6) VALUE '37181C'.           00345204
               10  FILLER            PIC X(6) VALUE '37185C'.           00345304
               10  FILLER            PIC X(6) VALUE '37187C'.           00345404
               10  FILLER            PIC X(6) VALUE '37189C'.           00345504
               10  FILLER            PIC X(6) VALUE '37193C'.           00345604
               10  FILLER            PIC X(6) VALUE '37195C'.           00345704
               10  FILLER            PIC X(6) VALUE '37199C'.           00345804
               10  FILLER            PIC X(6) VALUE '38001B'.           00345904
               10  FILLER            PIC X(6) VALUE '38003C'.           00346004
               10  FILLER            PIC X(6) VALUE '38005B'.           00346104
               10  FILLER            PIC X(6) VALUE '38007B'.           00346204
               10  FILLER            PIC X(6) VALUE '38009B'.           00346304
               10  FILLER            PIC X(6) VALUE '38011B'.           00346404
               10  FILLER            PIC X(6) VALUE '38013B'.           00346504
               10  FILLER            PIC X(6) VALUE '38019B'.           00346604
               10  FILLER            PIC X(6) VALUE '38021B'.           00346704
               10  FILLER            PIC X(6) VALUE '38023B'.           00346804
               10  FILLER            PIC X(6) VALUE '38025B'.           00346904
               10  FILLER            PIC X(6) VALUE '38027B'.           00347004
               10  FILLER            PIC X(6) VALUE '38029B'.           00347104
               10  FILLER            PIC X(6) VALUE '38031B'.           00347204
               10  FILLER            PIC X(6) VALUE '38033B'.           00347304
               10  FILLER            PIC X(6) VALUE '38037B'.           00347404
               10  FILLER            PIC X(6) VALUE '38039B'.           00347504
               10  FILLER            PIC X(6) VALUE '38041B'.           00347604
               10  FILLER            PIC X(6) VALUE '38043B'.           00347704
               10  FILLER            PIC X(6) VALUE '38045B'.           00347804
               10  FILLER            PIC X(6) VALUE '38047B'.           00347904
               10  FILLER            PIC X(6) VALUE '38049B'.           00348004
               10  FILLER            PIC X(6) VALUE '38051B'.           00348104
               10  FILLER            PIC X(6) VALUE '38053B'.           00348204
               10  FILLER            PIC X(6) VALUE '38055B'.           00348304
               10  FILLER            PIC X(6) VALUE '38057C'.           00348404
               10  FILLER            PIC X(6) VALUE '38061B'.           00348504
               10  FILLER            PIC X(6) VALUE '38063B'.           00348604
               10  FILLER            PIC X(6) VALUE '38067C'.           00348704
               10  FILLER            PIC X(6) VALUE '38069B'.           00348804
               10  FILLER            PIC X(6) VALUE '38071C'.           00348904
               10  FILLER            PIC X(6) VALUE '38073C'.           00349004
               10  FILLER            PIC X(6) VALUE '38075B'.           00349104
               10  FILLER            PIC X(6) VALUE '38077C'.           00349204
               10  FILLER            PIC X(6) VALUE '38079C'.           00349304
               10  FILLER            PIC X(6) VALUE '38081B'.           00349404
               10  FILLER            PIC X(6) VALUE '38083B'.           00349504
               10  FILLER            PIC X(6) VALUE '38085A'.           00349604
               10  FILLER            PIC X(6) VALUE '38087B'.           00349704
               10  FILLER            PIC X(6) VALUE '38089C'.           00349804
               10  FILLER            PIC X(6) VALUE '38091B'.           00349904
               10  FILLER            PIC X(6) VALUE '38093C'.           00350004
               10  FILLER            PIC X(6) VALUE '38095B'.           00350104
               10  FILLER            PIC X(6) VALUE '38097C'.           00350204
               10  FILLER            PIC X(6) VALUE '38099C'.           00350304
               10  FILLER            PIC X(6) VALUE '38101C'.           00350404
               10  FILLER            PIC X(6) VALUE '38103B'.           00350504
               10  FILLER            PIC X(6) VALUE '38105C'.           00350604
               10  FILLER            PIC X(6) VALUE '39001C'.           00350704
               10  FILLER            PIC X(6) VALUE '39005C'.           00350804
               10  FILLER            PIC X(6) VALUE '39007C'.           00350904
               10  FILLER            PIC X(6) VALUE '39009C'.           00351004
               10  FILLER            PIC X(6) VALUE '39011C'.           00351104
               10  FILLER            PIC X(6) VALUE '39021C'.           00351204
               10  FILLER            PIC X(6) VALUE '39027C'.           00351304
               10  FILLER            PIC X(6) VALUE '39029C'.           00351404
               10  FILLER            PIC X(6) VALUE '39031C'.           00351504
               10  FILLER            PIC X(6) VALUE '39033C'.           00351604
               10  FILLER            PIC X(6) VALUE '39037C'.           00351704
               10  FILLER            PIC X(6) VALUE '39039C'.           00351804
               10  FILLER            PIC X(6) VALUE '39043C'.           00351904
               10  FILLER            PIC X(6) VALUE '39047C'.           00352004
               10  FILLER            PIC X(6) VALUE '39053C'.           00352104
               10  FILLER            PIC X(6) VALUE '39059C'.           00352204
               10  FILLER            PIC X(6) VALUE '39063C'.           00352304
               10  FILLER            PIC X(6) VALUE '39065C'.           00352404
               10  FILLER            PIC X(6) VALUE '39067C'.           00352504
               10  FILLER            PIC X(6) VALUE '39069C'.           00352604
               10  FILLER            PIC X(6) VALUE '39071C'.           00352704
               10  FILLER            PIC X(6) VALUE '39075C'.           00352804
               10  FILLER            PIC X(6) VALUE '39077C'.           00352904
               10  FILLER            PIC X(6) VALUE '39079A'.           00353004
               10  FILLER            PIC X(6) VALUE '39083C'.           00353104
               10  FILLER            PIC X(6) VALUE '39091C'.           00353204
               10  FILLER            PIC X(6) VALUE '39101C'.           00353304
               10  FILLER            PIC X(6) VALUE '39105A'.           00353404
               10  FILLER            PIC X(6) VALUE '39107C'.           00353504
               10  FILLER            PIC X(6) VALUE '39111C'.           00353604
               10  FILLER            PIC X(6) VALUE '39115C'.           00353704
               10  FILLER            PIC X(6) VALUE '39119C'.           00353804
               10  FILLER            PIC X(6) VALUE '39121C'.           00353904
               10  FILLER            PIC X(6) VALUE '39123C'.           00354004
               10  FILLER            PIC X(6) VALUE '39125C'.           00354104
               10  FILLER            PIC X(6) VALUE '39131C'.           00354204
               10  FILLER            PIC X(6) VALUE '39135C'.           00354304
               10  FILLER            PIC X(6) VALUE '39137C'.           00354404
               10  FILLER            PIC X(6) VALUE '39141C'.           00354504
               10  FILLER            PIC X(6) VALUE '39143C'.           00354604
               10  FILLER            PIC X(6) VALUE '39145A'.           00354704
               10  FILLER            PIC X(6) VALUE '39147C'.           00354804
               10  FILLER            PIC X(6) VALUE '39149C'.           00354904
               10  FILLER            PIC X(6) VALUE '39157C'.           00355004
               10  FILLER            PIC X(6) VALUE '39161C'.           00355104
               10  FILLER            PIC X(6) VALUE '39163C'.           00355204
               10  FILLER            PIC X(6) VALUE '39167C'.           00355304
               10  FILLER            PIC X(6) VALUE '39169C'.           00355404
               10  FILLER            PIC X(6) VALUE '39171C'.           00355504
               10  FILLER            PIC X(6) VALUE '39175C'.           00355604
               10  FILLER            PIC X(6) VALUE '40001A'.           00355704
               10  FILLER            PIC X(6) VALUE '40003C'.           00355804
               10  FILLER            PIC X(6) VALUE '40005A'.           00355904
               10  FILLER            PIC X(6) VALUE '40007B'.           00356004
               10  FILLER            PIC X(6) VALUE '40009A'.           00356104
               10  FILLER            PIC X(6) VALUE '40011A'.           00356204
               10  FILLER            PIC X(6) VALUE '40013A'.           00356304
               10  FILLER            PIC X(6) VALUE '40015A'.           00356404
               10  FILLER            PIC X(6) VALUE '40019A'.           00356504
               10  FILLER            PIC X(6) VALUE '40021A'.           00356604
               10  FILLER            PIC X(6) VALUE '40023A'.           00356704
               10  FILLER            PIC X(6) VALUE '40025B'.           00356804
               10  FILLER            PIC X(6) VALUE '40029A'.           00356904
               10  FILLER            PIC X(6) VALUE '40035A'.           00357004
               10  FILLER            PIC X(6) VALUE '40039A'.           00357104
               10  FILLER            PIC X(6) VALUE '40041A'.           00357204
               10  FILLER            PIC X(6) VALUE '40043A'.           00357304
               10  FILLER            PIC X(6) VALUE '40045B'.           00357404
               10  FILLER            PIC X(6) VALUE '40049A'.           00357504
               10  FILLER            PIC X(6) VALUE '40053B'.           00357604
               10  FILLER            PIC X(6) VALUE '40055A'.           00357704
               10  FILLER            PIC X(6) VALUE '40057A'.           00357804
               10  FILLER            PIC X(6) VALUE '40059B'.           00357904
               10  FILLER            PIC X(6) VALUE '40061A'.           00358004
               10  FILLER            PIC X(6) VALUE '40063A'.           00358104
               10  FILLER            PIC X(6) VALUE '40065A'.           00358204
               10  FILLER            PIC X(6) VALUE '40067A'.           00358304
               10  FILLER            PIC X(6) VALUE '40069A'.           00358404
               10  FILLER            PIC X(6) VALUE '40071A'.           00358504
               10  FILLER            PIC X(6) VALUE '40073A'.           00358604
               10  FILLER            PIC X(6) VALUE '40075A'.           00358704
               10  FILLER            PIC X(6) VALUE '40077A'.           00358804
               10  FILLER            PIC X(6) VALUE '40079A'.           00358904
               10  FILLER            PIC X(6) VALUE '40085A'.           00359004
               10  FILLER            PIC X(6) VALUE '40089A'.           00359104
               10  FILLER            PIC X(6) VALUE '40091A'.           00359204
               10  FILLER            PIC X(6) VALUE '40093A'.           00359304
               10  FILLER            PIC X(6) VALUE '40095A'.           00359404
               10  FILLER            PIC X(6) VALUE '40097A'.           00359504
               10  FILLER            PIC X(6) VALUE '40099A'.           00359604
               10  FILLER            PIC X(6) VALUE '40101A'.           00359704
               10  FILLER            PIC X(6) VALUE '40103C'.           00359804
               10  FILLER            PIC X(6) VALUE '40105C'.           00359904
               10  FILLER            PIC X(6) VALUE '40107A'.           00360004
               10  FILLER            PIC X(6) VALUE '40115A'.           00360104
               10  FILLER            PIC X(6) VALUE '40119A'.           00360204
               10  FILLER            PIC X(6) VALUE '40121A'.           00360304
               10  FILLER            PIC X(6) VALUE '40123A'.           00360404
               10  FILLER            PIC X(6) VALUE '40125A'.           00360504
               10  FILLER            PIC X(6) VALUE '40127A'.           00360604
               10  FILLER            PIC X(6) VALUE '40129A'.           00360704
               10  FILLER            PIC X(6) VALUE '40133A'.           00360804
               10  FILLER            PIC X(6) VALUE '40137A'.           00360904
               10  FILLER            PIC X(6) VALUE '40139C'.           00361004
               10  FILLER            PIC X(6) VALUE '40141A'.           00361104
               10  FILLER            PIC X(6) VALUE '40147A'.           00361204
               10  FILLER            PIC X(6) VALUE '40149A'.           00361304
               10  FILLER            PIC X(6) VALUE '40151C'.           00361404
               10  FILLER            PIC X(6) VALUE '40153C'.           00361504
               10  FILLER            PIC X(6) VALUE '41001B'.           00361604
               10  FILLER            PIC X(6) VALUE '41007C'.           00361704
               10  FILLER            PIC X(6) VALUE '41011C'.           00361804
               10  FILLER            PIC X(6) VALUE '41013C'.           00361904
               10  FILLER            PIC X(6) VALUE '41015C'.           00362004
               10  FILLER            PIC X(6) VALUE '41019C'.           00362104
               10  FILLER            PIC X(6) VALUE '41021B'.           00362204
               10  FILLER            PIC X(6) VALUE '41023B'.           00362304
               10  FILLER            PIC X(6) VALUE '41025B'.           00362404
               10  FILLER            PIC X(6) VALUE '41027C'.           00362504
               10  FILLER            PIC X(6) VALUE '41031C'.           00362604
               10  FILLER            PIC X(6) VALUE '41035C'.           00362704
               10  FILLER            PIC X(6) VALUE '41037B'.           00362804
               10  FILLER            PIC X(6) VALUE '41041C'.           00362904
               10  FILLER            PIC X(6) VALUE '41045B'.           00363004
               10  FILLER            PIC X(6) VALUE '41049B'.           00363104
               10  FILLER            PIC X(6) VALUE '41055B'.           00363204
               10  FILLER            PIC X(6) VALUE '41057C'.           00363304
               10  FILLER            PIC X(6) VALUE '41059C'.           00363404
               10  FILLER            PIC X(6) VALUE '41061C'.           00363504
               10  FILLER            PIC X(6) VALUE '41063B'.           00363604
               10  FILLER            PIC X(6) VALUE '41065C'.           00363704
               10  FILLER            PIC X(6) VALUE '41069B'.           00363804
               10  FILLER            PIC X(6) VALUE '42009C'.           00363904
               10  FILLER            PIC X(6) VALUE '42015C'.           00364004
               10  FILLER            PIC X(6) VALUE '42023C'.           00364104
               10  FILLER            PIC X(6) VALUE '42031C'.           00364204
               10  FILLER            PIC X(6) VALUE '42033A'.           00364304
               10  FILLER            PIC X(6) VALUE '42035C'.           00364404
               10  FILLER            PIC X(6) VALUE '42039C'.           00364504
               10  FILLER            PIC X(6) VALUE '42047A'.           00364604
               10  FILLER            PIC X(6) VALUE '42053C'.           00364704
               10  FILLER            PIC X(6) VALUE '42057C'.           00364804
               10  FILLER            PIC X(6) VALUE '42059C'.           00364904
               10  FILLER            PIC X(6) VALUE '42061C'.           00365004
               10  FILLER            PIC X(6) VALUE '42063A'.           00365104
               10  FILLER            PIC X(6) VALUE '42065A'.           00365204
               10  FILLER            PIC X(6) VALUE '42067C'.           00365304
               10  FILLER            PIC X(6) VALUE '42073C'.           00365404
               10  FILLER            PIC X(6) VALUE '42083C'.           00365504
               10  FILLER            PIC X(6) VALUE '42087C'.           00365604
               10  FILLER            PIC X(6) VALUE '42097C'.           00365704
               10  FILLER            PIC X(6) VALUE '42105C'.           00365804
               10  FILLER            PIC X(6) VALUE '42107C'.           00365904
               10  FILLER            PIC X(6) VALUE '42109C'.           00366004
               10  FILLER            PIC X(6) VALUE '42111C'.           00366104
               10  FILLER            PIC X(6) VALUE '42113C'.           00366204
               10  FILLER            PIC X(6) VALUE '42115C'.           00366304
               10  FILLER            PIC X(6) VALUE '42117C'.           00366404
               10  FILLER            PIC X(6) VALUE '42119C'.           00366504
               10  FILLER            PIC X(6) VALUE '42121C'.           00366604
               10  FILLER            PIC X(6) VALUE '42123C'.           00366704
               10  FILLER            PIC X(6) VALUE '42127C'.           00366804
               10  FILLER            PIC X(6) VALUE '45001A'.           00366904
               10  FILLER            PIC X(6) VALUE '45005C'.           00367004
               10  FILLER            PIC X(6) VALUE '45009C'.           00367104
               10  FILLER            PIC X(6) VALUE '45011C'.           00367204
               10  FILLER            PIC X(6) VALUE '45021C'.           00367304
               10  FILLER            PIC X(6) VALUE '45025C'.           00367404
               10  FILLER            PIC X(6) VALUE '45027C'.           00367504
               10  FILLER            PIC X(6) VALUE '45029C'.           00367604
               10  FILLER            PIC X(6) VALUE '45033C'.           00367704
               10  FILLER            PIC X(6) VALUE '45043C'.           00367804
               10  FILLER            PIC X(6) VALUE '45047A'.           00367904
               10  FILLER            PIC X(6) VALUE '45049C'.           00368004
               10  FILLER            PIC X(6) VALUE '45061C'.           00368104
               10  FILLER            PIC X(6) VALUE '45065C'.           00368204
               10  FILLER            PIC X(6) VALUE '45067C'.           00368304
               10  FILLER            PIC X(6) VALUE '45069C'.           00368404
               10  FILLER            PIC X(6) VALUE '45071C'.           00368504
               10  FILLER            PIC X(6) VALUE '45073C'.           00368604
               10  FILLER            PIC X(6) VALUE '45075C'.           00368704
               10  FILLER            PIC X(6) VALUE '45087A'.           00368804
               10  FILLER            PIC X(6) VALUE '45089C'.           00368904
               10  FILLER            PIC X(6) VALUE '46003B'.           00369004
               10  FILLER            PIC X(6) VALUE '46005C'.           00369104
               10  FILLER            PIC X(6) VALUE '46007B'.           00369204
               10  FILLER            PIC X(6) VALUE '46009C'.           00369304
               10  FILLER            PIC X(6) VALUE '46011C'.           00369404
               10  FILLER            PIC X(6) VALUE '46013C'.           00369504
               10  FILLER            PIC X(6) VALUE '46015C'.           00369604
               10  FILLER            PIC X(6) VALUE '46017B'.           00369704
               10  FILLER            PIC X(6) VALUE '46019B'.           00369804
               10  FILLER            PIC X(6) VALUE '46021B'.           00369904
               10  FILLER            PIC X(6) VALUE '46023C'.           00370004
               10  FILLER            PIC X(6) VALUE '46025B'.           00370104
               10  FILLER            PIC X(6) VALUE '46027C'.           00370204
               10  FILLER            PIC X(6) VALUE '46029C'.           00370304
               10  FILLER            PIC X(6) VALUE '46031B'.           00370404
               10  FILLER            PIC X(6) VALUE '46033A'.           00370504
               10  FILLER            PIC X(6) VALUE '46035C'.           00370604
               10  FILLER            PIC X(6) VALUE '46037B'.           00370704
               10  FILLER            PIC X(6) VALUE '46039C'.           00370804
               10  FILLER            PIC X(6) VALUE '46041A'.           00370904
               10  FILLER            PIC X(6) VALUE '46043C'.           00371004
               10  FILLER            PIC X(6) VALUE '46045B'.           00371104
               10  FILLER            PIC X(6) VALUE '46047B'.           00371204
               10  FILLER            PIC X(6) VALUE '46049B'.           00371304
               10  FILLER            PIC X(6) VALUE '46051C'.           00371404
               10  FILLER            PIC X(6) VALUE '46053B'.           00371504
               10  FILLER            PIC X(6) VALUE '46055B'.           00371604
               10  FILLER            PIC X(6) VALUE '46057C'.           00371704
               10  FILLER            PIC X(6) VALUE '46059B'.           00371804
               10  FILLER            PIC X(6) VALUE '46061C'.           00371904
               10  FILLER            PIC X(6) VALUE '46063B'.           00372004
               10  FILLER            PIC X(6) VALUE '46065C'.           00372104
               10  FILLER            PIC X(6) VALUE '46067C'.           00372204
               10  FILLER            PIC X(6) VALUE '46069B'.           00372304
               10  FILLER            PIC X(6) VALUE '46071B'.           00372404
               10  FILLER            PIC X(6) VALUE '46073B'.           00372504
               10  FILLER            PIC X(6) VALUE '46075B'.           00372604
               10  FILLER            PIC X(6) VALUE '46077C'.           00372704
               10  FILLER            PIC X(6) VALUE '46079C'.           00372804
               10  FILLER            PIC X(6) VALUE '46081C'.           00372904
               10  FILLER            PIC X(6) VALUE '46085B'.           00373004
               10  FILLER            PIC X(6) VALUE '46089B'.           00373104
               10  FILLER            PIC X(6) VALUE '46091B'.           00373204
               10  FILLER            PIC X(6) VALUE '46095B'.           00373304
               10  FILLER            PIC X(6) VALUE '46097B'.           00373404
               10  FILLER            PIC X(6) VALUE '46101C'.           00373504
               10  FILLER            PIC X(6) VALUE '46105B'.           00373604
               10  FILLER            PIC X(6) VALUE '46107B'.           00373704
               10  FILLER            PIC X(6) VALUE '46109C'.           00373804
               10  FILLER            PIC X(6) VALUE '46111B'.           00373904
               10  FILLER            PIC X(6) VALUE '46113C'.           00374004
               10  FILLER            PIC X(6) VALUE '46115B'.           00374104
               10  FILLER            PIC X(6) VALUE '46117B'.           00374204
               10  FILLER            PIC X(6) VALUE '46119B'.           00374304
               10  FILLER            PIC X(6) VALUE '46121C'.           00374404
               10  FILLER            PIC X(6) VALUE '46123B'.           00374504
               10  FILLER            PIC X(6) VALUE '46129C'.           00374604
               10  FILLER            PIC X(6) VALUE '46135C'.           00374704
               10  FILLER            PIC X(6) VALUE '46137B'.           00374804
               10  FILLER            PIC X(6) VALUE '47003C'.           00374904
               10  FILLER            PIC X(6) VALUE '47005A'.           00375004
               10  FILLER            PIC X(6) VALUE '47007A'.           00375104
               10  FILLER            PIC X(6) VALUE '47017A'.           00375204
               10  FILLER            PIC X(6) VALUE '47025A'.           00375304
               10  FILLER            PIC X(6) VALUE '47027C'.           00375404
               10  FILLER            PIC X(6) VALUE '47029A'.           00375504
               10  FILLER            PIC X(6) VALUE '47031A'.           00375604
               10  FILLER            PIC X(6) VALUE '47035C'.           00375704
               10  FILLER            PIC X(6) VALUE '47039A'.           00375804
               10  FILLER            PIC X(6) VALUE '47041A'.           00375904
               10  FILLER            PIC X(6) VALUE '47045A'.           00376004
               10  FILLER            PIC X(6) VALUE '47049A'.           00376104
               10  FILLER            PIC X(6) VALUE '47051A'.           00376204
               10  FILLER            PIC X(6) VALUE '47053A'.           00376304
               10  FILLER            PIC X(6) VALUE '47055A'.           00376404
               10  FILLER            PIC X(6) VALUE '47059C'.           00376504
               10  FILLER            PIC X(6) VALUE '47061A'.           00376604
               10  FILLER            PIC X(6) VALUE '47067A'.           00376704
               10  FILLER            PIC X(6) VALUE '47069A'.           00376804
               10  FILLER            PIC X(6) VALUE '47071A'.           00376904
               10  FILLER            PIC X(6) VALUE '47075A'.           00377004
               10  FILLER            PIC X(6) VALUE '47077A'.           00377104
               10  FILLER            PIC X(6) VALUE '47079A'.           00377204
               10  FILLER            PIC X(6) VALUE '47081A'.           00377304
               10  FILLER            PIC X(6) VALUE '47083A'.           00377404
               10  FILLER            PIC X(6) VALUE '47085A'.           00377504
               10  FILLER            PIC X(6) VALUE '47087A'.           00377604
               10  FILLER            PIC X(6) VALUE '47091A'.           00377704
               10  FILLER            PIC X(6) VALUE '47095A'.           00377804
               10  FILLER            PIC X(6) VALUE '47097A'.           00377904
               10  FILLER            PIC X(6) VALUE '47099A'.           00378004
               10  FILLER            PIC X(6) VALUE '47101A'.           00378104
               10  FILLER            PIC X(6) VALUE '47103A'.           00378204
               10  FILLER            PIC X(6) VALUE '47107A'.           00378304
               10  FILLER            PIC X(6) VALUE '47109A'.           00378404
               10  FILLER            PIC X(6) VALUE '47117A'.           00378504
               10  FILLER            PIC X(6) VALUE '47121A'.           00378604
               10  FILLER            PIC X(6) VALUE '47123C'.           00378704
               10  FILLER            PIC X(6) VALUE '47127A'.           00378804
               10  FILLER            PIC X(6) VALUE '47131A'.           00378904
               10  FILLER            PIC X(6) VALUE '47133A'.           00379004
               10  FILLER            PIC X(6) VALUE '47135A'.           00379104
               10  FILLER            PIC X(6) VALUE '47137A'.           00379204
               10  FILLER            PIC X(6) VALUE '47141A'.           00379304
               10  FILLER            PIC X(6) VALUE '47143C'.           00379404
               10  FILLER            PIC X(6) VALUE '47151A'.           00379504
               10  FILLER            PIC X(6) VALUE '47155C'.           00379604
               10  FILLER            PIC X(6) VALUE '47161C'.           00379704
               10  FILLER            PIC X(6) VALUE '47175A'.           00379804
               10  FILLER            PIC X(6) VALUE '47177A'.           00379904
               10  FILLER            PIC X(6) VALUE '47181A'.           00380004
               10  FILLER            PIC X(6) VALUE '47183A'.           00380104
               10  FILLER            PIC X(6) VALUE '47185A'.           00380204
               10  FILLER            PIC X(6) VALUE '48001A'.           00380304
               10  FILLER            PIC X(6) VALUE '48003A'.           00380404
               10  FILLER            PIC X(6) VALUE '48005A'.           00380504
               10  FILLER            PIC X(6) VALUE '48007A'.           00380604
               10  FILLER            PIC X(6) VALUE '48017A'.           00380704
               10  FILLER            PIC X(6) VALUE '48023A'.           00380804
               10  FILLER            PIC X(6) VALUE '48025A'.           00380904
               10  FILLER            PIC X(6) VALUE '48031A'.           00381004
               10  FILLER            PIC X(6) VALUE '48033A'.           00381104
               10  FILLER            PIC X(6) VALUE '48035C'.           00381204
               10  FILLER            PIC X(6) VALUE '48043B'.           00381304
               10  FILLER            PIC X(6) VALUE '48045A'.           00381404
               10  FILLER            PIC X(6) VALUE '48047A'.           00381504
               10  FILLER            PIC X(6) VALUE '48049A'.           00381604
               10  FILLER            PIC X(6) VALUE '48053A'.           00381704
               10  FILLER            PIC X(6) VALUE '48057A'.           00381804
               10  FILLER            PIC X(6) VALUE '48063A'.           00381904
               10  FILLER            PIC X(6) VALUE '48067A'.           00382004
               10  FILLER            PIC X(6) VALUE '48069A'.           00382104
               10  FILLER            PIC X(6) VALUE '48073A'.           00382204
               10  FILLER            PIC X(6) VALUE '48075A'.           00382304
               10  FILLER            PIC X(6) VALUE '48079A'.           00382404
               10  FILLER            PIC X(6) VALUE '48081A'.           00382504
               10  FILLER            PIC X(6) VALUE '48083A'.           00382604
               10  FILLER            PIC X(6) VALUE '48087A'.           00382704
               10  FILLER            PIC X(6) VALUE '48089A'.           00382804
               10  FILLER            PIC X(6) VALUE '48093A'.           00382904
               10  FILLER            PIC X(6) VALUE '48095A'.           00383004
               10  FILLER            PIC X(6) VALUE '48097A'.           00383104
               10  FILLER            PIC X(6) VALUE '48101A'.           00383204
               10  FILLER            PIC X(6) VALUE '48103A'.           00383304
               10  FILLER            PIC X(6) VALUE '48105A'.           00383404
               10  FILLER            PIC X(6) VALUE '48109A'.           00383504
               10  FILLER            PIC X(6) VALUE '48111A'.           00383604
               10  FILLER            PIC X(6) VALUE '48115A'.           00383704
               10  FILLER            PIC X(6) VALUE '48117A'.           00383804
               10  FILLER            PIC X(6) VALUE '48119A'.           00383904
               10  FILLER            PIC X(6) VALUE '48123A'.           00384004
               10  FILLER            PIC X(6) VALUE '48125A'.           00384104
               10  FILLER            PIC X(6) VALUE '48127A'.           00384204
               10  FILLER            PIC X(6) VALUE '48129A'.           00384304
               10  FILLER            PIC X(6) VALUE '48131A'.           00384404
               10  FILLER            PIC X(6) VALUE '48133A'.           00384504
               10  FILLER            PIC X(6) VALUE '48137A'.           00384604
               10  FILLER            PIC X(6) VALUE '48143A'.           00384704
               10  FILLER            PIC X(6) VALUE '48147A'.           00384804
               10  FILLER            PIC X(6) VALUE '48149A'.           00384904
               10  FILLER            PIC X(6) VALUE '48151A'.           00385004
               10  FILLER            PIC X(6) VALUE '48153A'.           00385104
               10  FILLER            PIC X(6) VALUE '48155A'.           00385204
               10  FILLER            PIC X(6) VALUE '48159A'.           00385304
               10  FILLER            PIC X(6) VALUE '48161A'.           00385404
               10  FILLER            PIC X(6) VALUE '48163A'.           00385504
               10  FILLER            PIC X(6) VALUE '48165A'.           00385604
               10  FILLER            PIC X(6) VALUE '48169A'.           00385704
               10  FILLER            PIC X(6) VALUE '48171C'.           00385804
               10  FILLER            PIC X(6) VALUE '48173B'.           00385904
               10  FILLER            PIC X(6) VALUE '48177A'.           00386004
               10  FILLER            PIC X(6) VALUE '48179A'.           00386104
               10  FILLER            PIC X(6) VALUE '48185A'.           00386204
               10  FILLER            PIC X(6) VALUE '48189A'.           00386304
               10  FILLER            PIC X(6) VALUE '48191A'.           00386404
               10  FILLER            PIC X(6) VALUE '48193A'.           00386504
               10  FILLER            PIC X(6) VALUE '48195A'.           00386604
               10  FILLER            PIC X(6) VALUE '48197A'.           00386704
               10  FILLER            PIC X(6) VALUE '48203A'.           00386804
               10  FILLER            PIC X(6) VALUE '48205A'.           00386904
               10  FILLER            PIC X(6) VALUE '48207A'.           00387004
               10  FILLER            PIC X(6) VALUE '48211B'.           00387104
               10  FILLER            PIC X(6) VALUE '48213A'.           00387204
               10  FILLER            PIC X(6) VALUE '48217A'.           00387304
               10  FILLER            PIC X(6) VALUE '48219A'.           00387404
               10  FILLER            PIC X(6) VALUE '48221A'.           00387504
               10  FILLER            PIC X(6) VALUE '48223A'.           00387604
               10  FILLER            PIC X(6) VALUE '48225A'.           00387704
               10  FILLER            PIC X(6) VALUE '48227A'.           00387804
               10  FILLER            PIC X(6) VALUE '48233A'.           00387904
               10  FILLER            PIC X(6) VALUE '48237A'.           00388004
               10  FILLER            PIC X(6) VALUE '48239A'.           00388104
               10  FILLER            PIC X(6) VALUE '48241A'.           00388204
               10  FILLER            PIC X(6) VALUE '48243B'.           00388304
               10  FILLER            PIC X(6) VALUE '48247A'.           00388404
               10  FILLER            PIC X(6) VALUE '48249A'.           00388504
               10  FILLER            PIC X(6) VALUE '48255A'.           00388604
               10  FILLER            PIC X(6) VALUE '48261A'.           00388704
               10  FILLER            PIC X(6) VALUE '48263A'.           00388804
               10  FILLER            PIC X(6) VALUE '48265C'.           00388904
               10  FILLER            PIC X(6) VALUE '48267A'.           00389004
               10  FILLER            PIC X(6) VALUE '48269B'.           00389104
               10  FILLER            PIC X(6) VALUE '48271B'.           00389204
               10  FILLER            PIC X(6) VALUE '48273A'.           00389304
               10  FILLER            PIC X(6) VALUE '48275A'.           00389404
               10  FILLER            PIC X(6) VALUE '48277A'.           00389504
               10  FILLER            PIC X(6) VALUE '48279A'.           00389604
               10  FILLER            PIC X(6) VALUE '48283A'.           00389704
               10  FILLER            PIC X(6) VALUE '48285A'.           00389804
               10  FILLER            PIC X(6) VALUE '48287A'.           00389904
               10  FILLER            PIC X(6) VALUE '48289A'.           00390004
               10  FILLER            PIC X(6) VALUE '48293A'.           00390104
               10  FILLER            PIC X(6) VALUE '48295B'.           00390204
               10  FILLER            PIC X(6) VALUE '48297A'.           00390304
               10  FILLER            PIC X(6) VALUE '48299A'.           00390404
               10  FILLER            PIC X(6) VALUE '48301B'.           00390504
               10  FILLER            PIC X(6) VALUE '48307A'.           00390604
               10  FILLER            PIC X(6) VALUE '48311A'.           00390704
               10  FILLER            PIC X(6) VALUE '48313A'.           00390804
               10  FILLER            PIC X(6) VALUE '48315A'.           00390904
               10  FILLER            PIC X(6) VALUE '48319A'.           00391004
               10  FILLER            PIC X(6) VALUE '48321A'.           00391104
               10  FILLER            PIC X(6) VALUE '48323A'.           00391204
               10  FILLER            PIC X(6) VALUE '48327A'.           00391304
               10  FILLER            PIC X(6) VALUE '48331A'.           00391404
               10  FILLER            PIC X(6) VALUE '48333A'.           00391504
               10  FILLER            PIC X(6) VALUE '48335A'.           00391604
               10  FILLER            PIC X(6) VALUE '48337A'.           00391704
               10  FILLER            PIC X(6) VALUE '48341A'.           00391804
               10  FILLER            PIC X(6) VALUE '48343A'.           00391904
               10  FILLER            PIC X(6) VALUE '48345A'.           00392004
               10  FILLER            PIC X(6) VALUE '48347A'.           00392204
               10  FILLER            PIC X(6) VALUE '48349A'.           00392304
               10  FILLER            PIC X(6) VALUE '48351A'.           00392404
               10  FILLER            PIC X(6) VALUE '48353A'.           00392504
               10  FILLER            PIC X(6) VALUE '48357A'.           00392604
               10  FILLER            PIC X(6) VALUE '48363A'.           00392704
               10  FILLER            PIC X(6) VALUE '48365A'.           00392804
               10  FILLER            PIC X(6) VALUE '48369A'.           00392904
               10  FILLER            PIC X(6) VALUE '48371A'.           00393004
               10  FILLER            PIC X(6) VALUE '48373A'.           00393104
               10  FILLER            PIC X(6) VALUE '48377B'.           00393204
               10  FILLER            PIC X(6) VALUE '48379A'.           00393304
               10  FILLER            PIC X(6) VALUE '48383A'.           00393404
               10  FILLER            PIC X(6) VALUE '48385A'.           00393504
               10  FILLER            PIC X(6) VALUE '48387A'.           00393604
               10  FILLER            PIC X(6) VALUE '48389A'.           00393704
               10  FILLER            PIC X(6) VALUE '48391A'.           00393804
               10  FILLER            PIC X(6) VALUE '48393A'.           00393904
               10  FILLER            PIC X(6) VALUE '48399A'.           00394004
               10  FILLER            PIC X(6) VALUE '48403A'.           00394104
               10  FILLER            PIC X(6) VALUE '48405A'.           00394204
               10  FILLER            PIC X(6) VALUE '48407A'.           00394304
               10  FILLER            PIC X(6) VALUE '48411A'.           00394404
               10  FILLER            PIC X(6) VALUE '48413A'.           00394504
               10  FILLER            PIC X(6) VALUE '48415A'.           00394604
               10  FILLER            PIC X(6) VALUE '48417A'.           00394704
               10  FILLER            PIC X(6) VALUE '48419A'.           00394804
               10  FILLER            PIC X(6) VALUE '48421A'.           00394904
               10  FILLER            PIC X(6) VALUE '48425A'.           00395004
               10  FILLER            PIC X(6) VALUE '48427A'.           00395104
               10  FILLER            PIC X(6) VALUE '48429A'.           00395204
               10  FILLER            PIC X(6) VALUE '48431A'.           00395304
               10  FILLER            PIC X(6) VALUE '48433B'.           00395404
               10  FILLER            PIC X(6) VALUE '48435A'.           00395504
               10  FILLER            PIC X(6) VALUE '48437A'.           00395604
               10  FILLER            PIC X(6) VALUE '48443A'.           00395704
               10  FILLER            PIC X(6) VALUE '48445A'.           00395804
               10  FILLER            PIC X(6) VALUE '48447A'.           00395904
               10  FILLER            PIC X(6) VALUE '48449A'.           00396004
               10  FILLER            PIC X(6) VALUE '48455A'.           00396104
               10  FILLER            PIC X(6) VALUE '48457A'.           00396204
               10  FILLER            PIC X(6) VALUE '48461A'.           00396304
               10  FILLER            PIC X(6) VALUE '48463A'.           00396404
               10  FILLER            PIC X(6) VALUE '48465A'.           00396504
               10  FILLER            PIC X(6) VALUE '48467A'.           00396604
               10  FILLER            PIC X(6) VALUE '48471A'.           00396704
               10  FILLER            PIC X(6) VALUE '48475A'.           00396804
               10  FILLER            PIC X(6) VALUE '48477A'.           00396904
               10  FILLER            PIC X(6) VALUE '48481A'.           00397004
               10  FILLER            PIC X(6) VALUE '48483A'.           00397104
               10  FILLER            PIC X(6) VALUE '48487A'.           00397204
               10  FILLER            PIC X(6) VALUE '48489A'.           00397304
               10  FILLER            PIC X(6) VALUE '48495A'.           00397404
               10  FILLER            PIC X(6) VALUE '48499A'.           00397504
               10  FILLER            PIC X(6) VALUE '48501A'.           00397604
               10  FILLER            PIC X(6) VALUE '48503A'.           00397704
               10  FILLER            PIC X(6) VALUE '48505A'.           00397804
               10  FILLER            PIC X(6) VALUE '48507A'.           00397904
               10  FILLER            PIC X(6) VALUE '49001B'.           00398004
               10  FILLER            PIC X(6) VALUE '49007C'.           00398104
               10  FILLER            PIC X(6) VALUE '49009B'.           00398204
               10  FILLER            PIC X(6) VALUE '49013B'.           00398304
               10  FILLER            PIC X(6) VALUE '49015B'.           00398404
               10  FILLER            PIC X(6) VALUE '49017B'.           00398504
               10  FILLER            PIC X(6) VALUE '49019B'.           00398604
               10  FILLER            PIC X(6) VALUE '49021C'.           00398704
               10  FILLER            PIC X(6) VALUE '49025B'.           00398804
               10  FILLER            PIC X(6) VALUE '49027B'.           00398904
               10  FILLER            PIC X(6) VALUE '49031B'.           00399004
               10  FILLER            PIC X(6) VALUE '49033A'.           00399104
               10  FILLER            PIC X(6) VALUE '49037B'.           00399204
               10  FILLER            PIC X(6) VALUE '49039C'.           00399304
               10  FILLER            PIC X(6) VALUE '49041C'.           00399404
               10  FILLER            PIC X(6) VALUE '49043C'.           00399504
               10  FILLER            PIC X(6) VALUE '49047C'.           00399604
               10  FILLER            PIC X(6) VALUE '49051C'.           00399704
               10  FILLER            PIC X(6) VALUE '49055B'.           00399804
               10  FILLER            PIC X(6) VALUE '50001A'.           00399904
               10  FILLER            PIC X(6) VALUE '50003C'.           00400004
               10  FILLER            PIC X(6) VALUE '50005C'.           00400104
               10  FILLER            PIC X(6) VALUE '50009C'.           00400204
               10  FILLER            PIC X(6) VALUE '50015C'.           00400304
               10  FILLER            PIC X(6) VALUE '50017C'.           00400404
               10  FILLER            PIC X(6) VALUE '50019C'.           00400504
               10  FILLER            PIC X(6) VALUE '50021C'.           00400604
               10  FILLER            PIC X(6) VALUE '50023C'.           00400704
               10  FILLER            PIC X(6) VALUE '50025C'.           00400804
               10  FILLER            PIC X(6) VALUE '50027C'.           00400904
               10  FILLER            PIC X(6) VALUE '51001C'.           00401004
               10  FILLER            PIC X(6) VALUE '51005C'.           00401104
               10  FILLER            PIC X(6) VALUE '51017C'.           00401204
               10  FILLER            PIC X(6) VALUE '51021C'.           00401304
               10  FILLER            PIC X(6) VALUE '51025C'.           00401404
               10  FILLER            PIC X(6) VALUE '51027A'.           00401504
               10  FILLER            PIC X(6) VALUE '51029A'.           00401604
               10  FILLER            PIC X(6) VALUE '51033A'.           00401704
               10  FILLER            PIC X(6) VALUE '51035A'.           00401804
               10  FILLER            PIC X(6) VALUE '51037C'.           00401904
               10  FILLER            PIC X(6) VALUE '51049C'.           00402004
               10  FILLER            PIC X(6) VALUE '51051A'.           00402104
               10  FILLER            PIC X(6) VALUE '51057C'.           00402204
               10  FILLER            PIC X(6) VALUE '51063A'.           00402304
               10  FILLER            PIC X(6) VALUE '51077A'.           00402404
               10  FILLER            PIC X(6) VALUE '51081A'.           00402504
               10  FILLER            PIC X(6) VALUE '51083C'.           00402604
               10  FILLER            PIC X(6) VALUE '51089C'.           00402704
               10  FILLER            PIC X(6) VALUE '51091B'.           00402804
               10  FILLER            PIC X(6) VALUE '51097C'.           00402904
               10  FILLER            PIC X(6) VALUE '51099C'.           00403004
               10  FILLER            PIC X(6) VALUE '51103C'.           00403104
               10  FILLER            PIC X(6) VALUE '51105A'.           00403204
               10  FILLER            PIC X(6) VALUE '51109C'.           00403304
               10  FILLER            PIC X(6) VALUE '51111C'.           00403404
               10  FILLER            PIC X(6) VALUE '51113C'.           00403504
               10  FILLER            PIC X(6) VALUE '51117C'.           00403604
               10  FILLER            PIC X(6) VALUE '51119C'.           00403704
               10  FILLER            PIC X(6) VALUE '51131C'.           00403804
               10  FILLER            PIC X(6) VALUE '51133C'.           00403904
               10  FILLER            PIC X(6) VALUE '51135C'.           00404004
               10  FILLER            PIC X(6) VALUE '51137C'.           00404104
               10  FILLER            PIC X(6) VALUE '51139C'.           00404204
               10  FILLER            PIC X(6) VALUE '51141C'.           00404304
               10  FILLER            PIC X(6) VALUE '51143C'.           00404404
               10  FILLER            PIC X(6) VALUE '51147C'.           00404504
               10  FILLER            PIC X(6) VALUE '51159C'.           00404604
               10  FILLER            PIC X(6) VALUE '51163C'.           00404704
               10  FILLER            PIC X(6) VALUE '51167A'.           00404804
               10  FILLER            PIC X(6) VALUE '51171C'.           00404904
               10  FILLER            PIC X(6) VALUE '51173A'.           00405004
               10  FILLER            PIC X(6) VALUE '51175C'.           00405104
               10  FILLER            PIC X(6) VALUE '51181C'.           00405204
               10  FILLER            PIC X(6) VALUE '51185A'.           00405304
               10  FILLER            PIC X(6) VALUE '51193C'.           00405404
               10  FILLER            PIC X(6) VALUE '51195A'.           00405504
               10  FILLER            PIC X(6) VALUE '51197A'.           00405604
               10  FILLER            PIC X(6) VALUE '51530C'.           00405704
               10  FILLER            PIC X(6) VALUE '51580C'.           00405804
               10  FILLER            PIC X(6) VALUE '51590C'.           00405904
               10  FILLER            PIC X(6) VALUE '51595A'.           00406004
               10  FILLER            PIC X(6) VALUE '51620C'.           00406104
               10  FILLER            PIC X(6) VALUE '51640A'.           00406204
               10  FILLER            PIC X(6) VALUE '51678C'.           00406304
               10  FILLER            PIC X(6) VALUE '51690C'.           00406404
               10  FILLER            PIC X(6) VALUE '51720A'.           00406504
               10  FILLER            PIC X(6) VALUE '53001C'.           00406604
               10  FILLER            PIC X(6) VALUE '53009C'.           00406704
               10  FILLER            PIC X(6) VALUE '53013A'.           00406804
               10  FILLER            PIC X(6) VALUE '53019B'.           00406904
               10  FILLER            PIC X(6) VALUE '53023B'.           00407004
               10  FILLER            PIC X(6) VALUE '53025C'.           00407104
               10  FILLER            PIC X(6) VALUE '53027C'.           00407204
               10  FILLER            PIC X(6) VALUE '53029C'.           00407304
               10  FILLER            PIC X(6) VALUE '53031C'.           00407404
               10  FILLER            PIC X(6) VALUE '53037C'.           00407504
               10  FILLER            PIC X(6) VALUE '53039C'.           00407604
               10  FILLER            PIC X(6) VALUE '53041C'.           00407704
               10  FILLER            PIC X(6) VALUE '53043B'.           00407804
               10  FILLER            PIC X(6) VALUE '53045C'.           00407904
               10  FILLER            PIC X(6) VALUE '53047C'.           00408004
               10  FILLER            PIC X(6) VALUE '53049C'.           00408104
               10  FILLER            PIC X(6) VALUE '53051A'.           00408204
               10  FILLER            PIC X(6) VALUE '53055C'.           00408304
               10  FILLER            PIC X(6) VALUE '53069C'.           00408404
               10  FILLER            PIC X(6) VALUE '53075C'.           00408504
               10  FILLER            PIC X(6) VALUE '54001C'.           00408604
               10  FILLER            PIC X(6) VALUE '54007C'.           00408704
               10  FILLER            PIC X(6) VALUE '54013C'.           00408804
               10  FILLER            PIC X(6) VALUE '54017C'.           00408904
               10  FILLER            PIC X(6) VALUE '54021C'.           00409004
               10  FILLER            PIC X(6) VALUE '54023C'.           00409104
               10  FILLER            PIC X(6) VALUE '54025A'.           00409204
               10  FILLER            PIC X(6) VALUE '54031C'.           00409304
               10  FILLER            PIC X(6) VALUE '54033C'.           00409404
               10  FILLER            PIC X(6) VALUE '54035C'.           00409504
               10  FILLER            PIC X(6) VALUE '54041C'.           00409604
               10  FILLER            PIC X(6) VALUE '54045C'.           00409704
               10  FILLER            PIC X(6) VALUE '54047C'.           00409804
               10  FILLER            PIC X(6) VALUE '54049C'.           00409904
               10  FILLER            PIC X(6) VALUE '54053C'.           00410004
               10  FILLER            PIC X(6) VALUE '54055C'.           00410104
               10  FILLER            PIC X(6) VALUE '54059C'.           00410204
               10  FILLER            PIC X(6) VALUE '54063C'.           00410304
               10  FILLER            PIC X(6) VALUE '54065C'.           00410404
               10  FILLER            PIC X(6) VALUE '54067C'.           00410504
               10  FILLER            PIC X(6) VALUE '54071C'.           00410604
               10  FILLER            PIC X(6) VALUE '54073C'.           00410704
               10  FILLER            PIC X(6) VALUE '54075C'.           00410804
               10  FILLER            PIC X(6) VALUE '54083C'.           00410904
               10  FILLER            PIC X(6) VALUE '54085A'.           00411004
               10  FILLER            PIC X(6) VALUE '54087C'.           00411104
               10  FILLER            PIC X(6) VALUE '54089C'.           00411204
               10  FILLER            PIC X(6) VALUE '54091C'.           00411304
               10  FILLER            PIC X(6) VALUE '54093C'.           00411404
               10  FILLER            PIC X(6) VALUE '54095C'.           00411504
               10  FILLER            PIC X(6) VALUE '54097C'.           00411604
               10  FILLER            PIC X(6) VALUE '54101C'.           00411704
               10  FILLER            PIC X(6) VALUE '54103A'.           00411804
               10  FILLER            PIC X(6) VALUE '54109C'.           00411904
               10  FILLER            PIC X(6) VALUE '55001C'.           00412004
               10  FILLER            PIC X(6) VALUE '55003C'.           00412104
               10  FILLER            PIC X(6) VALUE '55005C'.           00412204
               10  FILLER            PIC X(6) VALUE '55007C'.           00412304
               10  FILLER            PIC X(6) VALUE '55011C'.           00412404
               10  FILLER            PIC X(6) VALUE '55013C'.           00412504
               10  FILLER            PIC X(6) VALUE '55019C'.           00412604
               10  FILLER            PIC X(6) VALUE '55023C'.           00412704
               10  FILLER            PIC X(6) VALUE '55027C'.           00412804
               10  FILLER            PIC X(6) VALUE '55029C'.           00412904
               10  FILLER            PIC X(6) VALUE '55033C'.           00413004
               10  FILLER            PIC X(6) VALUE '55037C'.           00413104
               10  FILLER            PIC X(6) VALUE '55041C'.           00413204
               10  FILLER            PIC X(6) VALUE '55043C'.           00413304
               10  FILLER            PIC X(6) VALUE '55047C'.           00413404
               10  FILLER            PIC X(6) VALUE '55051C'.           00413504
               10  FILLER            PIC X(6) VALUE '55053C'.           00413604
               10  FILLER            PIC X(6) VALUE '55055C'.           00413704
               10  FILLER            PIC X(6) VALUE '55057C'.           00413804
               10  FILLER            PIC X(6) VALUE '55065C'.           00413904
               10  FILLER            PIC X(6) VALUE '55067C'.           00414004
               10  FILLER            PIC X(6) VALUE '55069C'.           00414104
               10  FILLER            PIC X(6) VALUE '55071C'.           00414204
               10  FILLER            PIC X(6) VALUE '55075C'.           00414304
               10  FILLER            PIC X(6) VALUE '55077C'.           00414404
               10  FILLER            PIC X(6) VALUE '55078C'.           00414504
               10  FILLER            PIC X(6) VALUE '55081C'.           00414604
               10  FILLER            PIC X(6) VALUE '55085C'.           00414704
               10  FILLER            PIC X(6) VALUE '55091C'.           00414804
               10  FILLER            PIC X(6) VALUE '55095C'.           00414904
               10  FILLER            PIC X(6) VALUE '55097C'.           00415004
               10  FILLER            PIC X(6) VALUE '55099C'.           00415104
               10  FILLER            PIC X(6) VALUE '55103C'.           00415204
               10  FILLER            PIC X(6) VALUE '55107C'.           00415304
               10  FILLER            PIC X(6) VALUE '55111C'.           00415404
               10  FILLER            PIC X(6) VALUE '55113C'.           00415504
               10  FILLER            PIC X(6) VALUE '55115C'.           00415604
               10  FILLER            PIC X(6) VALUE '55119C'.           00415704
               10  FILLER            PIC X(6) VALUE '55121C'.           00415804
               10  FILLER            PIC X(6) VALUE '55123C'.           00415904
               10  FILLER            PIC X(6) VALUE '55125C'.           00416004
               10  FILLER            PIC X(6) VALUE '55127C'.           00416104
               10  FILLER            PIC X(6) VALUE '55129C'.           00416204
               10  FILLER            PIC X(6) VALUE '55135C'.           00416304
               10  FILLER            PIC X(6) VALUE '55137C'.           00416404
               10  FILLER            PIC X(6) VALUE '55141C'.           00416504
               10  FILLER            PIC X(6) VALUE '56001C'.           00416604
               10  FILLER            PIC X(6) VALUE '56003B'.           00416704
               10  FILLER            PIC X(6) VALUE '56005C'.           00416804
               10  FILLER            PIC X(6) VALUE '56007B'.           00416904
               10  FILLER            PIC X(6) VALUE '56009B'.           00417004
               10  FILLER            PIC X(6) VALUE '56011B'.           00417104
               10  FILLER            PIC X(6) VALUE '56013B'.           00417204
               10  FILLER            PIC X(6) VALUE '56015B'.           00417304
               10  FILLER            PIC X(6) VALUE '56017B'.           00417404
               10  FILLER            PIC X(6) VALUE '56019B'.           00417504
               10  FILLER            PIC X(6) VALUE '56023B'.           00417604
               10  FILLER            PIC X(6) VALUE '56027B'.           00417704
               10  FILLER            PIC X(6) VALUE '56029B'.           00417804
               10  FILLER            PIC X(6) VALUE '56031B'.           00417904
               10  FILLER            PIC X(6) VALUE '56033C'.           00418004
               10  FILLER            PIC X(6) VALUE '56035B'.           00418104
               10  FILLER            PIC X(6) VALUE '56037B'.           00418204
               10  FILLER            PIC X(6) VALUE '56039B'.           00418304
               10  FILLER            PIC X(6) VALUE '56041C'.           00418404
               10  FILLER            PIC X(6) VALUE '56043B'.           00418504
               10  FILLER            PIC X(6) VALUE '56045B'.           00418604
               10  FILLER            PIC X(6) VALUE '66000C'.           00418704
               10  FILLER            PIC X(6) VALUE '72001C'.           00418804
               10  FILLER            PIC X(6) VALUE '72043C'.           00418904
               10  FILLER            PIC X(6) VALUE '72049C'.           00419004
               10  FILLER            PIC X(6) VALUE '72073C'.           00419104
               10  FILLER            PIC X(6) VALUE '72083C'.           00419204
               10  FILLER            PIC X(6) VALUE '72093C'.           00419304
               10  FILLER            PIC X(6) VALUE '72123C'.           00419404
               10  FILLER            PIC X(6) VALUE '72133C'.           00419504
               10  FILLER            PIC X(6) VALUE '72147C'.           00419604
               10  FILLER            PIC X(6) VALUE '78000C'.           00419704
           05  FILLER     REDEFINES  T-STATE-COUNTY-CODE-DATA.          00419804
               10  T-SCC-DATA         OCCURS    2018 TIMES              00419904
                                      ASCENDING KEY IS T-SCC-CODE       00420004
                                      INDEXED BY IX-SCC.                00420104
                   15  T-SCC-CODE     PIC X(5).                         00420204
                   15  T-SCC-CATEGORY PIC X(1).                         00421004
                                                                        00430004
