000100 IDENTIFICATION DIVISION.                                         00010000
000200 PROGRAM-ID.    HHDRV20Y.                                         00020000
000300 DATE-COMPILED.                                                   00030000
000400******************************************************************00040000
000820*                CY2020.Y CHANGES                                *00082000
000830*----------------------------------------------------------------*00083000
000850* MODIFIED THE RECODING ROUTINES SERV-THRU-DATE FOR THE          *00085000
000851* CY2020 RELASE AS : HHA-SERV-THRU-DATE < 20200301               *00085100
000852*----------------------------------------------------------------*00085200
000854* INCREASED CBSA OCCURS FROM 7000 TO 7500                        *00085400
000860* ADDED CALL TO HHCAL20X                                         *00086000
005800******************************************************************00580000
005900*     RETURN CODES                                                00590000
006000*          00 = FINAL PAYMENT                                     00600000
006100*               TOB = 329,339,327,337                             00610000
006200*                  OR 32G OR 33G OR 32I OR 33I OR 32Q             00620000
006300*                  OR 32J OR 33J OR 32M OR 33M OR 33Q             00630000
006400*                  OR 32F OR 32K OR 32P OR 32H                    00640000
006500*                  OR 33F OR 33K OR 33P OR 33H                    00650000
006600*               WITH HRG,REVENUE CODE WHERE NO OUTLIER APPLIES    00660000
006700*          01 = FINAL PAYMENT                                     00670000
006800*               TOB = 329,339,327,337                             00680000
006900*                  OR 32G OR 33G OR 32I OR 33I OR 32Q             00690000
007000*                  OR 32J OR 33J OR 32M OR 33M OR 33Q             00700000
007100*                  OR 32F OR 32K OR 32P OR 32H                    00710000
007200*                  OR 33F OR 33K OR 33P OR 33H                    00720000
007300*               WITH HRG,REVENUE CODE WHERE OUTLIER APPLIES       00730000
007400*          03 = INITIAL HALF PAYMENT PAYMENT WILL BE ZERO         00740000
007500*               TOB = 332 AND 322                                 00750000
007600*          04 = INITIAL HALF PAYMENT PAID AT 50%                  00760000
007700*               TOB = 332 AND 322                                 00770000
007800*               WITH INITIAL (FIRST) HRG AND NO REVENUE CODES     00780000
007900*          05 = INITIAL HALF PAYMENT PAID AT 60%                  00790000
008000*               TOB = 332 AND 322                                 00800000
008100*               WITH INITIAL (FIRST) HRG AND NO REVENUE CODES     00810000
008200*          06 = LUPA PAYMENT ONLY                                 00820000
008300*               TOB = 329,339,327,337                             00830000
008400*                  OR 32G OR 33G OR 32I OR 33I OR 32Q             00840000
008500*                  OR 32J OR 33J OR 32M OR 33M OR 33Q             00850000
008600*                  OR 32F OR 32K OR 32P OR 32H                    00860000
008700*                  OR 33F OR 33K OR 33P OR 33H                    00870000
008800*               WITH REVENUE CODES AND REVENUE QTYS < 5       *   00880000
008900******************************************************************00890000
009000**  RTC CODES 07,08,09,11,12,13 EFFECTIVE 10/01/2002          ****00900000
009100******************************************************************00910000
009200******************************************************************00920000
009300*          07 = FINAL PAYMENT, SCIC, PEP = N, NO OUTLIER          00930000
009400*               TOB = 329,339,327,337                             00940000
009500*                  OR 32G OR 33G OR 32I OR 33I OR 32Q             00950000
009600*                  OR 32J OR 33J OR 32M OR 33M OR 33Q             00960000
009700*                  OR 32F OR 32K OR 32P OR 32H                    00970000
009800*                  OR 33F OR 33K OR 33P OR 33H                    00980000
009900*               WITH REVENUE CODE WHERE NO OUTLIER APPLIES        00990000
010000*               WITH MORE THAN ONE HRG OCCURRENCE             *   01000000
010100*          08 = FINAL PAYMENT, SCIC, PEP = N, WITH OUTLIER        01010000
010200*               TOB = 329,339,327,337                             01020000
010300*                  OR 32G OR 33G OR 32I OR 33I OR 32Q             01030000
010400*                  OR 32J OR 33J OR 32M OR 33M OR 33Q             01040000
010500*                  OR 32F OR 32K OR 32P OR 32H                    01050000
010600*                  OR 33F OR 33K OR 33P OR 33H                    01060000
010700*               WITH REVENUE CODE WHERE OUTLIER APPLIES           01070000
010800*               WITH MORE THAN ONE HRG OCCURRENCE             *   01080000
010900******************************************************************01090000
011000*          09 = FINAL PAYMENT, PEP = Y, NO OUTLIER                01100000
011100*               TOB = 329,339,327,337                             01110000
011200*                  OR 32G OR 33G OR 32I OR 33I OR 32Q             01120000
011300*                  OR 32J OR 33J OR 32M OR 33M OR 33Q             01130000
011400*                  OR 32F OR 32K OR 32P OR 32H                    01140000
011500*                  OR 33F OR 33K OR 33P OR 33H                    01150000
011600*               WITH REVENUE CODE WHERE NO OUTLIER APPLIES        01160000
011700*               WITH ONE HRG OCCURRENCE                       *   01170000
011800*          11 = FINAL PAYMENT, PEP = Y, WITH OUTLIER              01180000
011900*               TOB = 329,339,327,337                             01190000
012000*                  OR 32G OR 33G OR 32I OR 33I OR 32Q             01200000
012100*                  OR 32J OR 33J OR 32M OR 33M OR 33Q             01210000
012200*                  OR 32F OR 32K OR 32P OR 32H                    01220000
012300*                  OR 33F OR 33K OR 33P OR 33H                    01230000
012400*               WITH REVENUE CODE WHERE OUTLIER APPLIES           01240000
012500*               WITH ONE HRG OCCURRENCE                       *   01250000
012600******************************************************************01260000
012700*          12 = FINAL PAYMENT, SCIC, PEP = Y, NO OUTLIER          01270000
012800*               TOB = 329,339,327,337                             01280000
012900*                  OR 32G OR 33G OR 32I OR 33I OR 32Q             01290000
013000*                  OR 32J OR 33J OR 32M OR 33M OR 33Q             01300000
013100*                  OR 32F OR 32K OR 32P OR 32H                    01310000
013200*                  OR 33F OR 33K OR 33P OR 33H                    01320000
013300*               WITH REVENUE CODE WHERE NO OUTLIER APPLIES        01330000
013400*               WITH MORE THAN ONE HRG OCCURRENCE             *   01340000
013500*          13 = FINAL PAYMENT, SCIC, PEP = Y, WITH OUTLIER        01350000
013600*               TOB = 329,339,327,337                             01360000
013700*                  OR 32G OR 33G OR 32I OR 33I OR 32Q             01370000
013800*                  OR 32J OR 33J OR 32M OR 33M OR 33Q             01380000
013900*                  OR 32F OR 32K OR 32P OR 32H                    01390000
014000*                  OR 33F OR 33K OR 33P OR 33H                    01400000
014100*               WITH REVENUE CODE WHERE OUTLIER APPLIES           01410000
014200*               WITH MORE THAN ONE HRG OCCURRENCE             *   01420000
014300******************************************************************01430000
014400******************************************************************01440000
014500******************************************************************01450000
014600******************************************************************01460000
014700*                                                             *   01470000
014800*            HHA-RTC   NO PAYMENTS RETURNED                   *   01480000
014900*                                                             *   01490000
015000*              10 = INVALID TOB                               *   01500000
015100*                                                             *   01510000
015200*              15 = INVALID PEP DAYS                          *   01520000
015300*                   FOR SHORTENED EPISODE                     *   01530000
015400*                                                             *   01540000
015500*              20 = INVALID PEP INDICATOR                     *   01550000
015600*                                                             *   01560000
015700*              25 = INVALID MED REVIEW INDICATOR              *   01570000
015800*                                                             *   01580000
015900*              30 = INVALID MSA CODE                          *   01590000
016000*                                                             *   01600000
016010*              31 = COUNTY CODE MISSING OR INVALID            *   01601000
016020*                                                             *   01602000
016100*              35 = INVALID INITIAL PAYMENT INDICATOR         *   01610000
016200*                        0 = MAKE NORMAL INITIAL PAYMENT      *   01620000
016300*                        1 = MAKE ZERO PAYMANT                *   01630000
016400*                                                             *   01640000
016500*              40 = FROM DATE  < OCT 1, 2000 OR INVALID       *   01650000
016600*                   THRU DATE  < OCT 1, 2000 OR INVALID       *   01660000
016700*                   ADMIT DATE < OCT 1, 2000 OR INVALID       *   01670000
016800*                                                             *   01680000
016900*              70 = INVALID OR NO HRG CODE PRESENT            *   01690000
017000*                                                             *   01700000
017100*              75 = NO HRG PRESENT IN FIRST OCCURANCE AND     *   01710000
017200*                   REVENUE-QTY-COV-VISITS > 4  AND           *   01720000
017300*                       TOB = 329,339,327,337                 *   01730000
017400*                          OR 32G OR 33G OR 32I OR 33I OR 32Q *   01740000
017500*                          OR 32J OR 33J OR 32M OR 33M OR 33Q *   01750000
017600*                          OR 32F OR 32K OR 32P OR 32H            01760000
017700*                          OR 33F OR 33K OR 33P OR 33H            01770000
017800*                                                             *   01780000
017900*              80 = INVALID REVENUE CODE                      *   01790000
018000*                                                             *   01800000
018100*              85 = NO REVENUE CODE PRESENT                   *   01810000
018200*                   WITH TOB 329 OR 339 OR 327 OR 337 OR 32Q  *   01820000
018300*                         OR 32G OR 33G OR 32I OR 33I OR 33Q  *   01830000
018400*                         OR 32J OR 33J OR 32M OR 33M         *   01840000
018500*                         OR 32F OR 32K OR 32P OR 32H             01850000
018600*                         OR 33F OR 33K OR 33P OR 33H             01860000
018700*                                                             *   01870000
018800***************************************************************   01880000
018810******************************************************************01881000
018820* LUPA = LOW UTILIZATION PAYMENT ADJUSTMENT                      *01882000
018830******************************************************************01883000
019000                                                                  01900000
019100 ENVIRONMENT                     DIVISION.                        01910000
019200 CONFIGURATION                   SECTION.                         01920000
019300 SOURCE-COMPUTER.                IBM-370.                         01930000
019400 OBJECT-COMPUTER.                IBM-370.                         01940000
019500                                                                  01950000
019600 INPUT-OUTPUT SECTION.                                            01960000
019700 FILE-CONTROL.                                                    01970000
019800                                                                  01980000
019900 DATA DIVISION.                                                   01990000
020000 FILE SECTION.                                                    02000000
020100 WORKING-STORAGE SECTION.                                         02010000
020200 77  W-STORAGE-REF               PIC X(49)  VALUE                 02020000
020300     'HHDRV20Y          - W O R K I N G   S T O R A G E'.         02030000
020400 01  DRV-VERSION                 PIC X(07)  VALUE 'D2020.Y'.      02040000
020500 01  HHCAL016                    PIC X(08)  VALUE 'HHCAL016'.     02050000
020600 01  HHCAL023                    PIC X(08)  VALUE 'HHCAL023'.     02060000
020700 01  HHCAL033                    PIC X(08)  VALUE 'HHCAL033'.     02070000
020800 01  HHCAL044                    PIC X(08)  VALUE 'HHCAL044'.     02080000
020900 01  HHCAL053                    PIC X(08)  VALUE 'HHCAL053'.     02090000
021000 01  HHCAL066                    PIC X(08)  VALUE 'HHCAL066'.     02100000
021100 01  HHCAL074                    PIC X(08)  VALUE 'HHCAL074'.     02110000
021200 01  HHCAL088                    PIC X(08)  VALUE 'HHCAL088'.     02120000
021300 01  HHCAL095                    PIC X(08)  VALUE 'HHCAL095'.     02130000
021400 01  HHCAL10D                    PIC X(08)  VALUE 'HHCAL10D'.     02140000
021500 01  HHCAL10A                    PIC X(08)  VALUE 'HHCAL10A'.     02150000
021600 01  HHCAL113                    PIC X(08)  VALUE 'HHCAL113'.     02160000
021700 01  HHCAL122                    PIC X(08)  VALUE 'HHCAL122'.     02170000
021800 01  HHCAL132                    PIC X(08)  VALUE 'HHCAL132'.     02180000
021900 01  HHCAL145                    PIC X(08)  VALUE 'HHCAL145'.     02190000
022000 01  HHCAL152                    PIC X(08)  VALUE 'HHCAL152'.     02200000
022100 01  HHCAL160                    PIC X(08)  VALUE 'HHCAL160'.     02210000
022200 01  HHCAL171                    PIC X(08)  VALUE 'HHCAL171'.     02220000
022210 01  HHCAL181                    PIC X(08)  VALUE 'HHCAL181'.     02221000
022220 01  HHCAL190                    PIC X(08)  VALUE 'HHCAL190'.     02222000
022230 01  HHCAL20X                    PIC X(08)  VALUE 'HHCAL20X'.     02223000
022300 01  SUB1                        PIC 9(03)  VALUE 0.              02230000
022400 01  EOF-SW                      PIC 9(01)  VALUE 0.              02240000
022500 01  EOF-MSA                     PIC 9(01)  VALUE 0.              02250000
022600 01  EOF-CBSA                    PIC 9(01)  VALUE 0.              02260000
022700 01  EOF-HRG                     PIC 9(01)  VALUE 0.              02270000
022800 01  SEARCH-HRG.                                                  02280000
022900     05  SEARCH-HRG1             PIC X(01).                       02290000
023000     05  SEARCH-HRG2             PIC X(01).                       02300000
023100     05  SEARCH-HRG3             PIC X(01).                       02310000
023200     05  SEARCH-HRG4             PIC X(01).                       02320000
023300     05  SEARCH-HRG5             PIC X(01).                       02330000
023400 01  WORK-ORIG-HRG.                                               02340000
023500     05  WORK-ORIG-HRG1          PIC X(01).                       02350000
023600     05  WORK-ORIG-HRG2          PIC X(01).                       02360000
023700     05  WORK-ORIG-HRG3          PIC X(01).                       02370000
023800     05  WORK-ORIG-HRG4          PIC X(01).                       02380000
023900     05  WORK-ORIG-HRG5          PIC X(01).                       02390000
024000 01  WORK-HRG.                                                    02400000
024100     05  WORK-HRG1               PIC X(01).                       02410000
024200     05  WORK-HRG2               PIC X(01).                       02420000
024300     05  WORK-HRG3               PIC X(01).                       02430000
024400     05  WORK-HRG4               PIC X(01).                       02440000
024500     05  WORK-HRG5               PIC X(01).                       02450000
024600 01  EOF-REV                     PIC 9(01)  VALUE 0.              02460000
024700 01  LOAD-TABLES-SW              PIC 9(01)  VALUE 0.              02470000
024800 01  TABLES-LOADED-SW            PIC 9(01)  VALUE 0.              02480000
024900 01  HRG-RECODE-SW               PIC 9(01)  VALUE 0.              02490000
025000 01  HRG-KEEP5-SW1               PIC 9(01)  VALUE 0.              02500000
025100 01  HRG-CT                      PIC 9(10)  VALUE 0.              02510000
025200 01  TB-REV-DOLL-RATE-UNITS.                                      02520000
025300     05  WK-REV-DOLL-RATE-UNITS  PIC 9(07)V9(02)                  02530000
025400                                 OCCURS 6.                        02540000
025410 01  TB-STDV-DATA.                                                02541000
025420     05 TB-STDV-TABLE           OCCURS 6.                         02542000
025430        10  TB-STDV-REV-CODE           PIC X(04).                 02543000
025440        10  TB-STDV-REV-DOLL-RATE      PIC 9(07)V9(02).           02544000
025500 01  SUBSCRIPTS.                                                  02550000
025600     05  SS-REV                  PIC 9      VALUE 0.              02560000
025700 01  WK-600-DATA.                                                 02570000
025800     05  WK-DATA              PIC X(250).                         02580000
025900     05  WK-REV-DATA.                                             02590000
026000         10  WK-REVENUE-DATA     OCCURS 6.                        02600000
026100             15  WK-REVENUE-CODE                PIC X(04).        02610000
026200             15  WK-REVENUE-QTY-COV-VISITS      PIC 9(03).        02620000
026300             15  WK-REVENUE-EARLIEST-DATE       PIC 9(08).        02630000
026410             15  WK-REVENUE-DOLL-RATE           PIC 9(07)V9(02).  02641000
026500             15  WK-REVENUE-COST                PIC 9(07)V9(02).  02650000
026600             15  WK-REVENUE-ADD-ON-VISIT-AMT    PIC 9(07)V9(02).  02660000
026700     05  WK-PASSBACK-DATA     PIC X(030).                         02670000
026800     05  WK-CASE-MIX-DATA     PIC X(016).                         02680000
026900     05  WK-PROV-TOTAL-DATA   PIC X(021).                         02690000
027000                                                                  02700000
027100 01  MSA-STAT.                                                    02710000
027200     05  MSA-STAT1               PIC X.                           02720000
027300     05  MSA-STAT2               PIC X.                           02730000
027400 01  CBSA-STAT.                                                   02740000
027500     05  CBSA-STAT1               PIC X.                          02750000
027600     05  CBSA-STAT2               PIC X.                          02760000
027700 01  HRG-STAT.                                                    02770000
027800     05  HRG-STAT1               PIC X.                           02780000
027900     05  HRG-STAT2               PIC X.                           02790000
028000 01  REV-STAT.                                                    02800000
028100     05  REV-STAT1               PIC X.                           02810000
028200     05  REV-STAT2               PIC X.                           02820000
028300                                                                  02830000
028400 LINKAGE SECTION.                                                 02840000
028500*******************************************************           02850000
028600*******************************************************           02860000
028700*    PASSED TO HHCAL PROGRAM                          *           02870000
028800*******************************************************           02880000
028900 01  WAGE-INDEX-DATA.                                             02890000
029000     02  WIR-MSA               PIC X(04).                         02900000
029100     02  WIR-EFFDATE           PIC X(08).                         02910000
029200     02  WIR-AREA-WAGEIND      PIC 9(02)V9(04).                   02920000
029300                                                                  02930000
029400 01  MSA-WI-TABLE.                                                02940000
029500     05  M-MSA-DATA        OCCURS 4000                            02950000
029600                           INDEXED BY MU1 MU2 MU3.                02960000
029700         10  TB-MSA        PIC X(04).                             02970000
029800         10  FILLER        PIC X(01).                             02980000
029900         10  TB-EFFDATE    PIC X(08).                             02990000
030000         10  FILLER        PIC X(01).                             03000000
030100         10  TB-WAGEIND    PIC 9(02)V9(04).                       03010000
030200                                                                  03020000
030300 01  CBSA-WAGE-INDEX-DATA.                                        03030000
030400     02  WIR-CBSA              PIC X(05).                         03040000
030500     02  WIR-CBSA-EFFDATE      PIC X(08).                         03050000
030600     02  WIR-CBSA-WAGEIND      PIC 9(02)V9(04).                   03060000
030700                                                                  03070000
030800 01  CBSA-WI-TABLE.                                               03080000
030900     05  T-CBSA-DATA        OCCURS 7500                           03090000
031000                           INDEXED BY MA1 MA2 MA3.                03100000
031100         10  T-CBSA            PIC X(05).                         03110000
031200         10  FILLER            PIC X(01).                         03120000
031300         10  T-CBSA-EFFDATE    PIC X(08).                         03130000
031400         10  FILLER            PIC X(01).                         03140000
031500         10  T-CBSA-WAGEIND    PIC 9(02)V9(04).                   03150000
031600                                                                  03160000
031700 01  HRG-WI-TABLE.                                                03170000
031800     05  M-HRG-DATA        OCCURS 4000                            03180000
031900                           INDEXED BY HU1 HU2 HU3.                03190000
032000         10  TB-HRG-HRG        PIC X(05).                         03200000
032100         10  FILLER            PIC X(01).                         03210000
032200         10  TB-HRG-EFFDATE    PIC X(08).                         03220000
032300         10  FILLER            PIC X(01).                         03230000
032400         10  TB-HRG-WGTS       PIC 9(02)V9(04).                   03240000
032500         10  FILLER            PIC X(01).                         03250000
032600         10  TB-HRG-HRG2       PIC X(05).                         03260000
032700         10  FILLER            PIC X(01).                         03270000
032800         10  TB-HRG-WGTS2      PIC 9(02)V9(04).                   03280000
032900                                                                  03290000
033000 01  REVENUE-TABLE.                                               03300000
033100     05  M-REV-DATA        OCCURS 200                             03310000
033200                           INDEXED BY RU1 RU2 RU3.                03320000
033300         10  TB-REV-CODE.                                         03330000
033400             15  TB-REV-CODE-1ST.                                 03340000
033500                 88  TB-REV-CODE-RURAL-CHECK   VALUE '99'.        03350000
033600                 20  TB-REV-CODE-RURAL       PIC XX.              03360000
033700             15  TB-REV-CODE-2ND           PIC XX.                03370000
033800         10  FILLER                        PIC X(01).             03380000
033900         10  TB-REV-EFFDATE                PIC X(08).             03390000
034000         10  FILLER                        PIC X(01).             03400000
034100         10  TB-REV-DOLL-RATE-NRURAL       PIC 9(07)V9(02).       03410000
034200         10  FILLER                        PIC X(01).             03420000
034300         10  TB-REV-DOLL-RATE-RURAL        PIC 9(07)V9(02).       03430000
034400         10  FILLER                        PIC X.                 03440000
034500         10  TB-DOLL-RATE-NRURAL-NOSUBMIT  PIC 9(07)V9(02).       03450000
034600         10  FILLER                        PIC X.                 03460000
034700         10  TB-DOLL-RATE-RURAL-NOSUBMIT   PIC 9(07)V9(02).       03470000
034800         10  FILLER                        PIC X(01).             03480000
034900         10  TB-REV-UDOLL-RATE-NRURAL      PIC 9(07)V9(02).       03490000
035000         10  FILLER                        PIC X(01).             03500000
035100         10  TB-REV-UDOLL-RATE-RURAL       PIC 9(07)V9(02).       03510000
035200         10  FILLER                        PIC X.                 03520000
035300         10  TB-UDOLL-RATE-NRURAL-NOSUBMIT PIC 9(07)V9(02).       03530000
035400         10  FILLER                        PIC X.                 03540000
035500         10  TB-UDOLL-RATE-RURAL-NOSUBMIT  PIC 9(07)V9(02).       03550000
035600                                                                  03560000
035700*******************************************************           03570000
035800* NATIONAL HHA RECORD FORMAT PASSED TO HHCAL PROGRAM  *           03580000
035900*******************************************************           03590000
036000 01  HHA-INPUT-DATA.                                              03600000
036100     05  HHA-DATA.                                                03610000
036200         10  HHA-NPI                 PIC X(10).                   03620000
036300         10  HHA-HIC                 PIC X(12).                   03630000
036400         10  HHA-PROV-NO             PIC X(06).                   03640000
036500         10  HHA-TOB                 PIC XXX.                     03650000
036600             88 HHA-VALID-TOB-CLAIM       VALUE                   03660000
036700             '329', '339', '327', '337',                          03670000
036800             '32G', '33G', '32I', '33I',                          03680000
036900             '32J', '33J', '32M', '33M', '32Q',                   03690000
037000             '32F', '32K', '32P', '32H', '33Q',                   03700000
037100             '33F', '33K', '33P', '33H'.                          03710000
037200             88 HHA-VALID-TOB-RAP         VALUE                   03720000
037300             '322', '332'.                                        03730000
037400*                                                             *   03740000
037500         10  HHA-PEP-INDICATOR       PIC X.                       03750000
037600         10  HHA-PEP-DAYS            PIC 999.                     03760000
037700         10  HHA-INIT-PAY-INDICATOR  PIC X.                       03770000
037800             88  HHA-WITH-DATA-CHECK VALUE '0', '1'.              03780000
037900             88  HHA-NO-DATA-CHECK   VALUE '2', '3'.              03790000
038000         10  HHA-COUNTY-CODE         PIC X(05).                   03800000
038010         10  FILLER                  PIC X(02).                   03801000
038100         10  HHA-MSA1                PIC 9(07)V9(02).             03810000
038200         10  HHA-MSA2-DATA REDEFINES HHA-MSA1.                    03820000
038300             15  FILLER             PIC XXX.                      03830000
038400             15  HHA-MSA2.                                        03840000
038500                 20  HHA-MSA2-1ST.                                03850000
038600                     25  HHA-MSA2-RURAL        PIC XX.            03860000
038700                         88  HHA-MSA2-RURAL-CHECK  VALUE '99'.    03870000
038800                 20  HHA-MSA2-2ND              PIC XX.            03880000
038900             15  FILLER             PIC XX.                       03890000
039000         10  HHA-CBSA-DATA REDEFINES HHA-MSA1.                    03900000
039100             15  FILLER             PIC XX.                       03910000
039200             15  HHA-CBSA.                                        03920000
039300                 88  HHA-CBSA-RURAL-CHECK-ALL VALUE               03930000
039400                 '50001', '50002', '50005', '50007', '50025',     03940000
039500                 '50028', '50031', '50035', '50036', '50037',     03950000
039600                 '50041', '50045', '50047', '50048', '50050',     03960000
039700                 '50056', '50057', '50066', '50068', '50071',     03970000
039800                 '50073', '50080', '50084', '50087', '50089',     03980000
039900                 '50090', '50091', '50103', '50104', '50111',     03990000
040000                 '50115', '50117', '50118', '50120', '50121',     04000000
040100                 '50139', '50146', '50147', '50149', '50151',     04010000
040200                 '50164', '50165', '50168', '50169', '50173',     04020000
040300                 '50174', '50177', '50180', '50182', '50183'.     04030000
040400                                                                  04040000
040500                 20  HHA-CBSA-1ST.                                04050000
040600                     25  HHA-CBSA-RURAL        PIC XXX.           04060000
040700                         88  HHA-CBSA-RURAL-CHECK  VALUE '999'.   04070000
040800                 20  HHA-CBSA-2ND              PIC XX.            04080000
040900             15  FILLER             PIC XX.                       04090000
041000         10  HHA-SERV-FROM-DATE.                                  04100000
041100             15  HHA-FROM-CC         PIC XX.                      04110000
041200             15  HHA-FROM-YYMMDD.                                 04120000
041300                 25  HHA-FROM-YY     PIC XX.                      04130000
041400                 25  HHA-FROM-MM     PIC XX.                      04140000
041500                 25  HHA-FROM-DD     PIC XX.                      04150000
041600         10  HHA-SERV-THRU-DATE.                                  04160000
041700             15  HHA-THRU-CC         PIC XX.                      04170000
041800             15  HHA-THRU-YYMMDD.                                 04180000
041900                 25  HHA-THRU-YY     PIC XX.                      04190000
042000                 25  HHA-THRU-MM     PIC XX.                      04200000
042100                 25  HHA-THRU-DD     PIC XX.                      04210000
042200         10  HHA-ADMIT-DATE.                                      04220000
042300             15  HHA-ADMIT-CC        PIC XX.                      04230000
042400             15  HHA-ADMIT-YYMMDD.                                04240000
042500                 25  HHA-ADMIT-YY    PIC XX.                      04250000
042600                 25  HHA-ADMIT-MM    PIC XX.                      04260000
042700                 25  HHA-ADMIT-DD    PIC XX.                      04270000
042800         10  HHA-HRG-DATA      OCCURS 6.                          04280000
042900             15  HHA-MED-REVIEW-INDICATOR PIC X.                  04290000
043000             15  HHA-HRG-INPUT-CODE       PIC X(05).              04300000
043100             15  HHA-HRG-OUTPUT-CODE      PIC X(05).              04310000
043200             15  HHA-HRG-NO-OF-DAYS       PIC 9(03).              04320000
043300             15  HHA-HRG-WGTS             PIC 9(02)V9(04).        04330000
043400             15  HHA-HRG-PAY              PIC 9(07)V9(02).        04340000
043500         10  HHA-REVENUE-DATA     OCCURS 6.                       04350000
043600             15  HHA-REVENUE-CODE                PIC X(04).       04360000
043700             15  HHA-REVENUE-QTY-COV-VISITS      PIC 9(03).       04370000
043800             15  HHA-REVENUE-QTY-OUTL-UNITS      PIC 9(05).       04380000
043900             15  HHA-REVENUE-EARLIEST-DATE       PIC 9(08).       04390000
044000             15  HHA-REVENUE-DOLL-RATE           PIC 9(07)V9(02). 04400000
044100             15  HHA-REVENUE-COST                PIC 9(07)V9(02). 04410000
044200             15  HHA-REVENUE-ADD-ON-VISIT-AMT    PIC 9(07)V9(02). 04420000
044300     05  HHA-PASSBACK-DATA.                                       04430000
044400         10  HHA-PAY-RTC                PIC 99.                   04440000
044500         10  HHA-REVENUE-SUM1-3-QTY-THR PIC 9(05).                04450000
044600         10  HHA-REVENUE-SUM1-6-QTY-ALL PIC 9(05).                04460000
044700         10  HHA-OUTLIER-PAYMENT        PIC 9(07)V9(02).          04470000
044800         10  HHA-TOTAL-PAYMENT          PIC 9(07)V9(02).          04480000
044900     05  HHA-CASE-MIX-DATA.                                       04490000
045000         10  HHA-LUPA-ADD-ON-PAYMENT    PIC 9(03)V9(02).          04500000
045100         10  HHA-LUPA-SRC-ADM           PIC X.                    04510000
045200         10  HHA-RECODE-IND             PIC X.                    04520000
045300         10  HHA-EPISODE-TIMING         PIC 9.                    04530000
045400         10  HHA-SEVERITY-POINTS.                                 04540000
045500             15  HHA-CLINICAL-SEV-EQ1   PIC X(01).                04550000
045600             15  HHA-FUNCTION-SEV-EQ1   PIC X(01).                04560000
045700             15  HHA-CLINICAL-SEV-EQ2   PIC X(01).                04570000
045800             15  HHA-FUNCTION-SEV-EQ2   PIC X(01).                04580000
045900             15  HHA-CLINICAL-SEV-EQ3   PIC X(01).                04590000
046000             15  HHA-FUNCTION-SEV-EQ3   PIC X(01).                04600000
046100             15  HHA-CLINICAL-SEV-EQ4   PIC X(01).                04610000
046200             15  HHA-FUNCTION-SEV-EQ4   PIC X(01).                04620000
046300     05  HHA-PROV-TOTAL-DATA.                                     04630000
046400         10  HHA-PROV-OUTLIER-PAY-TOTAL PIC 9(08)V9(02).          04640000
046500         10  HHA-PROV-PAYMENT-TOTAL     PIC 9(09)V9(02).          04650000
046510     05  HHA-PROV-VBP-ADJ-FAC           PIC 9V9(5).               04651000
046520     05  HHA-VBP-ADJ-AMT                PIC S9(7)V99.             04652000
046530     05  HHA-PPS-STD-VALUE              PIC 9(7)V99.              04653000
046550     05  FILLER                         PIC X(27).                04655000
046700                                                                  04670000
046800*******************************************************           04680000
046900*    RETURNED BY HHCAL PROGRAM AND PASSED ON TO MGR   *           04690000
047000*******************************************************           04700000
047100 01  HOLD-VARIABLES-DATA.                                         04710000
047200     02  HOLD-VAR-DATA.                                           04720000
047300         05  PRICER-OPTION-SW              PIC X(01).             04730000
047400         05  HHOPN-VERSION                 PIC X(07).             04740000
047500         05  HHDRV-VERSION                 PIC X(07).             04750000
047600         05  HHCAL-VERSION                 PIC X(07).             04760000
047700         05  FILLER                        PIC X(20).             04770000
047800                                                                  04780000
047900**===========================================================     04790000
048000 PROCEDURE  DIVISION USING WAGE-INDEX-DATA                        04800000
048100                           MSA-WI-TABLE                           04810000
048200                           CBSA-WAGE-INDEX-DATA                   04820000
048300                           CBSA-WI-TABLE                          04830000
048400                           HRG-WI-TABLE                           04840000
048500                           REVENUE-TABLE                          04850000
048600                           HHA-INPUT-DATA                         04860000
048700                           HOLD-VARIABLES-DATA.                   04870000
048800                                                                  04880000
048900 0000-MAINLINE  SECTION.                                          04890000
049020                                                                  04902000
049100     MOVE DRV-VERSION TO HHDRV-VERSION.                           04910000
049200                                                                  04920000
049300 0100-PROCESS-RECORDS.                                            04930000
049400                                                                  04940000
049500     MOVE ALL '0' TO HHA-PASSBACK-DATA.                           04950000
049600     MOVE SPACES  TO CBSA-WAGE-INDEX-DATA.                        04960000
049700     INITIALIZE      TB-REV-DOLL-RATE-UNITS.                      04970000
049800                                                                  04980000
049900     IF HHA-VALID-TOB-CLAIM OR                                    04990000
050000        HHA-VALID-TOB-RAP                                         05000000
050100        NEXT SENTENCE                                             05010000
050200     ELSE                                                         05020000
050300        MOVE '10' TO HHA-PAY-RTC                                  05030000
050400        GOBACK.                                                   05040000
050500                                                                  05050000
050600     IF HHA-SERV-FROM-DATE < 20001001 OR                          05060000
050700        HHA-SERV-THRU-DATE < 20001001 OR                          05070000
050800        HHA-ADMIT-DATE < 20001001                                 05080000
050900        MOVE '40' TO HHA-PAY-RTC                                  05090000
051000        GOBACK.                                                   05100000
051100                                                                  05110000
051200     IF HHA-ADMIT-DATE >                                          05120000
051300        HHA-SERV-FROM-DATE                                        05130000
051400        MOVE '40' TO HHA-PAY-RTC                                  05140000
051500        GOBACK.                                                   05150000
051600                                                                  05160000
051700     IF HHA-REVENUE-QTY-COV-VISITS (1) NOT NUMERIC                05170000
051800        MOVE ZEROES TO HHA-REVENUE-QTY-COV-VISITS (1).            05180000
051900     IF HHA-REVENUE-QTY-COV-VISITS (2) NOT NUMERIC                05190000
052000        MOVE ZEROES TO HHA-REVENUE-QTY-COV-VISITS (2).            05200000
052100     IF HHA-REVENUE-QTY-COV-VISITS (3) NOT NUMERIC                05210000
052200        MOVE ZEROES TO HHA-REVENUE-QTY-COV-VISITS (3).            05220000
052300     IF HHA-REVENUE-QTY-COV-VISITS (4) NOT NUMERIC                05230000
052400        MOVE ZEROES TO HHA-REVENUE-QTY-COV-VISITS (4).            05240000
052500     IF HHA-REVENUE-QTY-COV-VISITS (5) NOT NUMERIC                05250000
052600        MOVE ZEROES TO HHA-REVENUE-QTY-COV-VISITS (5).            05260000
052700     IF HHA-REVENUE-QTY-COV-VISITS (6) NOT NUMERIC                05270000
052800        MOVE ZEROES TO HHA-REVENUE-QTY-COV-VISITS (6).            05280000
052900                                                                  05290000
053000     IF HHA-REVENUE-QTY-OUTL-UNITS (1) NOT NUMERIC                05300000
053100        MOVE ZEROES TO HHA-REVENUE-QTY-OUTL-UNITS (1).            05310000
053200     IF HHA-REVENUE-QTY-OUTL-UNITS (2) NOT NUMERIC                05320000
053300        MOVE ZEROES TO HHA-REVENUE-QTY-OUTL-UNITS (2).            05330000
053400     IF HHA-REVENUE-QTY-OUTL-UNITS (3) NOT NUMERIC                05340000
053500        MOVE ZEROES TO HHA-REVENUE-QTY-OUTL-UNITS (3).            05350000
053600     IF HHA-REVENUE-QTY-OUTL-UNITS (4) NOT NUMERIC                05360000
053700        MOVE ZEROES TO HHA-REVENUE-QTY-OUTL-UNITS (4).            05370000
053800     IF HHA-REVENUE-QTY-OUTL-UNITS (5) NOT NUMERIC                05380000
053900        MOVE ZEROES TO HHA-REVENUE-QTY-OUTL-UNITS (5).            05390000
054000     IF HHA-REVENUE-QTY-OUTL-UNITS (6) NOT NUMERIC                05400000
054100        MOVE ZEROES TO HHA-REVENUE-QTY-OUTL-UNITS (6).            05410000
054200                                                                  05420000
054300     COMPUTE HHA-REVENUE-SUM1-3-QTY-THR =                         05430000
054400                 HHA-REVENUE-QTY-COV-VISITS (1) +                 05440000
054500                 HHA-REVENUE-QTY-COV-VISITS (2) +                 05450000
054600                 HHA-REVENUE-QTY-COV-VISITS (3).                  05460000
054700                                                                  05470000
054800     COMPUTE HHA-REVENUE-SUM1-6-QTY-ALL =                         05480000
054900                 HHA-REVENUE-QTY-COV-VISITS (1) +                 05490000
055000                 HHA-REVENUE-QTY-COV-VISITS (2) +                 05500000
055100                 HHA-REVENUE-QTY-COV-VISITS (3) +                 05510000
055200                 HHA-REVENUE-QTY-COV-VISITS (4) +                 05520000
055300                 HHA-REVENUE-QTY-COV-VISITS (5) +                 05530000
055400                 HHA-REVENUE-QTY-COV-VISITS (6).                  05540000
055500                                                                  05550000
055600     IF  ((HHA-VALID-TOB-CLAIM) AND                               05560000
055700         (HHA-REVENUE-SUM1-6-QTY-ALL > 4) AND                     05570000
055800         (HHA-HRG-INPUT-CODE (1) = SPACE))                        05580000
055900         MOVE '75' TO HHA-PAY-RTC                                 05590000
056000         GOBACK.                                                  05600000
056100                                                                  05610000
056200     IF  ((HHA-VALID-TOB-RAP  ) AND                               05620000
056300         (HHA-HRG-INPUT-CODE (1) = SPACE))                        05630000
056400         MOVE '70' TO HHA-PAY-RTC                                 05640000
056500         GOBACK.                                                  05650000
056600                                                                  05660000
056700     IF HHA-PAY-RTC NOT = '00'                                    05670000
056800        GOBACK.                                                   05680000
056900                                                                  05690000
057000     IF  ((HHA-VALID-TOB-CLAIM) AND                               05700000
057100         (HHA-REVENUE-CODE (1) = SPACE OR                         05710000
057200          HHA-REVENUE-CODE (2) = SPACE OR                         05720000
057300          HHA-REVENUE-CODE (3) = SPACE OR                         05730000
057400          HHA-REVENUE-CODE (4) = SPACE OR                         05740000
057500          HHA-REVENUE-CODE (5) = SPACE OR                         05750000
057600          HHA-REVENUE-CODE (6) = SPACE))                          05760000
057700         MOVE '85' TO HHA-PAY-RTC.                                05770000
057800                                                                  05780000
057900     IF HHA-PAY-RTC NOT = '00'                                    05790000
058000        GOBACK.                                                   05800000
058100                                                                  05810000
058200     IF HHA-SERV-THRU-DATE < 20060101                             05820000
058300        PERFORM 1600-GET-MSA THRU 1600-EXIT                       05830000
058400     ELSE                                                         05840000
058500        PERFORM 1250-GET-CBSA THRU 1250-EXIT.                     05850000
058600                                                                  05860000
058700     IF HHA-SERV-THRU-DATE < 20060101                             05870000
058800        IF HHA-PAY-RTC = '00'                                     05880000
058900           PERFORM 1700-GET-WAGE-INDEX THRU 1700-EXIT             05890000
059000           VARYING MU2 FROM MU1 BY 1 UNTIL                        05900000
059100           TB-MSA (MU2) NOT = HHA-MSA2.                           05910000
059200                                                                  05920000
059300     IF HHA-SERV-THRU-DATE > 20051231                             05930000
059400        IF HHA-PAY-RTC = '00'                                     05940000
059500           PERFORM 1260-GET-CBSA-WAGE-INDEX THRU 1260-EXIT        05950000
059600           VARYING MA2 FROM MA1 BY 1 UNTIL                        05960000
059700           T-CBSA (MA2) NOT = HHA-CBSA.                           05970000
059900                                                                  05990000
060000     IF HHA-PAY-RTC = '00'                                        06000000
060100        MOVE 0 TO  HRG-RECODE-SW                                  06010000
060200                                                                  06020000
060300        PERFORM 2000-GET-HRG THRU 2000-EXIT                       06030000
060400             VARYING SUB1 FROM 1 BY 1 UNTIL                       06040000
060500*           (HHA-HRG-INPUT-CODE (SUB1) = SPACES OR                06050000
060600             SUB1 > 6.                                            06060000
060700                                                                  06070000
060800     IF HHA-PAY-RTC = '00'                                        06080000
060900        IF (HHA-VALID-TOB-CLAIM)                                  06090000
061000           PERFORM 2700-GET-REV THRU 2700-EXIT                    06100000
061100               VARYING SUB1 FROM 1 BY 1 UNTIL                     06110000
061200*             (HHA-REVENUE-CODE (SUB1) = SPACES OR                06120000
061300                SUB1 > 6.                                         06130000
061400                                                                  06140000
061500     IF HHA-PAY-RTC NOT = '00'                                    06150000
061600         GOBACK.                                                  06160000
061700                                                                  06170000
061800*******************************************************           06180000
061900*****    FY 2020 VERSION X                                        06190000
062000***                                                               06200000
062110     IF  HHA-SERV-FROM-DATE < 20200101                            06211000
062120     AND HHA-SERV-THRU-DATE > 20191231                            06212000
062200         CALL  HHCAL20X   USING HHA-INPUT-DATA                    06220000
062300                                HOLD-VARIABLES-DATA               06230000
062400                                CBSA-WAGE-INDEX-DATA              06240000
062500                                TB-REV-DOLL-RATE-UNITS            06250000
062510                                TB-STDV-DATA                      06251000
062600         GOBACK.                                                  06260000
062601                                                                  06260100
062602*******************************************************           06260200
062603*****    FY 2019 VERSION 0                                        06260300
062604***                                                               06260400
062605     IF  HHA-SERV-THRU-DATE > 20181231                            06260500
062606         CALL  HHCAL190   USING HHA-INPUT-DATA                    06260600
062607                                HOLD-VARIABLES-DATA               06260700
062608                                CBSA-WAGE-INDEX-DATA              06260800
062609                                TB-REV-DOLL-RATE-UNITS            06260900
062610                                TB-STDV-DATA                      06261000
062611         GOBACK.                                                  06261100
062612                                                                  06261200
062613*******************************************************           06261300
062614*****    FY 2018 VERSION 1                                        06261400
062615***                                                               06261500
062616     IF  HHA-SERV-THRU-DATE > 20171231                            06261600
062617         CALL  HHCAL181   USING HHA-INPUT-DATA                    06261700
062618                                HOLD-VARIABLES-DATA               06261800
062619                                CBSA-WAGE-INDEX-DATA              06261900
062620                                TB-REV-DOLL-RATE-UNITS            06262000
062621                                TB-STDV-DATA                      06262100
062622         GOBACK.                                                  06262200
062623                                                                  06262300
062624*******************************************************           06262400
062630*****    FY 2017 VERSION 1                                        06263000
062640***                                                               06264000
062650     IF  HHA-SERV-THRU-DATE > 20161231                            06265000
062660         CALL  HHCAL171   USING HHA-INPUT-DATA                    06266000
062670                                HOLD-VARIABLES-DATA               06267000
062680                                CBSA-WAGE-INDEX-DATA              06268000
062690                                TB-REV-DOLL-RATE-UNITS            06269000
062691         GOBACK.                                                  06269100
062700                                                                  06270000
062800*******************************************************           06280000
062900*****    FY 2016 VERSION 0                                        06290000
063000***                                                               06300000
063100     IF  HHA-SERV-THRU-DATE > 20151231                            06310000
063200         PERFORM Z900-CONV-650-TO-600 THRU Z900-EXIT              06320000
063300         CALL  HHCAL160   USING WK-600-DATA                       06330000
063400                                HOLD-VARIABLES-DATA               06340000
063500                                CBSA-WAGE-INDEX-DATA              06350000
063600         PERFORM Z950-CONV-600-TO-650 THRU Z950-EXIT              06360000
063700         GOBACK.                                                  06370000
063800                                                                  06380000
063900*******************************************************           06390000
064000*****    FY 2015 VERSION 0                                        06400000
064100***                                                               06410000
064200     IF  HHA-SERV-THRU-DATE > 20141231                            06420000
064300         PERFORM Z900-CONV-650-TO-600 THRU Z900-EXIT              06430000
064400         CALL  HHCAL152   USING WK-600-DATA                       06440000
064500                                HOLD-VARIABLES-DATA               06450000
064600                                CBSA-WAGE-INDEX-DATA              06460000
064700         PERFORM Z950-CONV-600-TO-650 THRU Z950-EXIT              06470000
064800         GOBACK.                                                  06480000
064900                                                                  06490000
065000*******************************************************           06500000
065100*****    FY 2014 VERSION 0                                        06510000
065200***                                                               06520000
065300     IF  HHA-SERV-THRU-DATE > 20131231                            06530000
065400         PERFORM Z900-CONV-650-TO-600 THRU Z900-EXIT              06540000
065500         CALL  HHCAL145   USING WK-600-DATA                       06550000
065600                                HOLD-VARIABLES-DATA               06560000
065700                                CBSA-WAGE-INDEX-DATA              06570000
065800         PERFORM Z950-CONV-600-TO-650 THRU Z950-EXIT              06580000
065900         GOBACK.                                                  06590000
066000                                                                  06600000
066100*******************************************************           06610000
066200*****    FY 2013 VERSION 0                                        06620000
066300***                                                               06630000
066400     IF  HHA-SERV-THRU-DATE > 20121231                            06640000
066500         PERFORM Z900-CONV-650-TO-600 THRU Z900-EXIT              06650000
066600         CALL  HHCAL132   USING WK-600-DATA                       06660000
066700                                HOLD-VARIABLES-DATA               06670000
066800                                CBSA-WAGE-INDEX-DATA              06680000
066900         PERFORM Z950-CONV-600-TO-650 THRU Z950-EXIT              06690000
067000         GOBACK.                                                  06700000
067100                                                                  06710000
067200*******************************************************           06720000
067300*****    FY 2012 VERSION 0                                        06730000
067400***                                                               06740000
067500     IF  HHA-SERV-THRU-DATE > 20111231                            06750000
067600         PERFORM Z900-CONV-650-TO-600 THRU Z900-EXIT              06760000
067700         CALL  HHCAL122   USING WK-600-DATA                       06770000
067800                                HOLD-VARIABLES-DATA               06780000
067900                                CBSA-WAGE-INDEX-DATA              06790000
068000         PERFORM Z950-CONV-600-TO-650 THRU Z950-EXIT              06800000
068100         GOBACK.                                                  06810000
068200                                                                  06820000
068300*******************************************************           06830000
068400*****    FY 2011 VERSION 0                                        06840000
068500***                                                               06850000
068600     IF  HHA-SERV-THRU-DATE > 20101231                            06860000
068700         PERFORM Z900-CONV-650-TO-600 THRU Z900-EXIT              06870000
068800         CALL  HHCAL113   USING WK-600-DATA                       06880000
068900                                HOLD-VARIABLES-DATA               06890000
069000                                CBSA-WAGE-INDEX-DATA              06900000
069100         PERFORM Z950-CONV-600-TO-650 THRU Z950-EXIT              06910000
069200         GOBACK.                                                  06920000
069300                                                                  06930000
069400*******************************************************           06940000
069500*****    FY 2010 VERSION B                                        06950000
069600***                                                               06960000
069700     IF  HHA-SERV-THRU-DATE > 20100331                            06970000
069800         PERFORM Z900-CONV-650-TO-600 THRU Z900-EXIT              06980000
069900         CALL  HHCAL10A   USING WK-600-DATA                       06990000
070000                                HOLD-VARIABLES-DATA               07000000
070100                                CBSA-WAGE-INDEX-DATA              07010000
070200         PERFORM Z950-CONV-600-TO-650 THRU Z950-EXIT              07020000
070300         GOBACK.                                                  07030000
070400                                                                  07040000
070500*******************************************************           07050000
070600*****    FY 2010 VERSION A                                        07060000
070700***                                                               07070000
070800     IF  HHA-SERV-THRU-DATE > 20091231                            07080000
070900         PERFORM Z900-CONV-650-TO-600 THRU Z900-EXIT              07090000
071000         CALL  HHCAL10D   USING WK-600-DATA                       07100000
071100                                HOLD-VARIABLES-DATA               07110000
071200                                CBSA-WAGE-INDEX-DATA              07120000
071300         PERFORM Z950-CONV-600-TO-650 THRU Z950-EXIT              07130000
071400         GOBACK.                                                  07140000
071500                                                                  07150000
071600*******************************************************           07160000
071700*****    FY 2009 VERSION 3                                        07170000
071800***                                                               07180000
071900     IF  HHA-SERV-THRU-DATE > 20081231                            07190000
072000         PERFORM Z900-CONV-650-TO-600 THRU Z900-EXIT              07200000
072100         CALL  HHCAL095   USING WK-600-DATA                       07210000
072200                                HOLD-VARIABLES-DATA               07220000
072300                                CBSA-WAGE-INDEX-DATA              07230000
072400         PERFORM Z950-CONV-600-TO-650 THRU Z950-EXIT              07240000
072500         GOBACK.                                                  07250000
072600                                                                  07260000
072700*******************************************************           07270000
072800*****    FY 2008 VERSION 6                                        07280000
072900***                                                               07290000
073000     IF  HHA-SERV-THRU-DATE > 20071231                            07300000
073100         PERFORM Z900-CONV-650-TO-600 THRU Z900-EXIT              07310000
073200         CALL  HHCAL088   USING WK-600-DATA                       07320000
073300                                HOLD-VARIABLES-DATA               07330000
073400                                CBSA-WAGE-INDEX-DATA              07340000
073500         PERFORM Z950-CONV-600-TO-650 THRU Z950-EXIT              07350000
073600         GOBACK.                                                  07360000
073700                                                                  07370000
073800*******************************************************           07380000
073900*****    FY 2007 VERSION 2                                        07390000
074000***                                                               07400000
074100     IF  HHA-SERV-THRU-DATE > 20061231                            07410000
074200         PERFORM Z900-CONV-650-TO-600 THRU Z900-EXIT              07420000
074300         CALL  HHCAL074   USING WK-600-DATA                       07430000
074400                                HOLD-VARIABLES-DATA               07440000
074500                                CBSA-WAGE-INDEX-DATA              07450000
074600         PERFORM Z950-CONV-600-TO-650 THRU Z950-EXIT              07460000
074700         GOBACK.                                                  07470000
074800                                                                  07480000
074900*******************************************************           07490000
075000*******************************************************           07500000
075100*****    FY 2006 VERSION 4                                        07510000
075200***                                                               07520000
075300     IF  HHA-SERV-THRU-DATE > 20051231                            07530000
075400         PERFORM Z900-CONV-650-TO-600 THRU Z900-EXIT              07540000
075500         CALL  HHCAL066   USING WK-600-DATA                       07550000
075600                                HOLD-VARIABLES-DATA               07560000
075700                                CBSA-WAGE-INDEX-DATA              07570000
075800         PERFORM Z950-CONV-600-TO-650 THRU Z950-EXIT              07580000
075900         GOBACK.                                                  07590000
076000                                                                  07600000
076100*******************************************************           07610000
076200*******************************************************           07620000
076300*****    FY 2005 VERSION 1                                        07630000
076400***                                                               07640000
076500     IF  HHA-SERV-THRU-DATE > 20041231                            07650000
076600         PERFORM Z900-CONV-650-TO-600 THRU Z900-EXIT              07660000
076700         CALL  HHCAL053   USING WK-600-DATA                       07670000
076800                                HOLD-VARIABLES-DATA               07680000
076900                                WAGE-INDEX-DATA                   07690000
077000         PERFORM Z950-CONV-600-TO-650 THRU Z950-EXIT              07700000
077100         GOBACK.                                                  07710000
077200                                                                  07720000
077300*******************************************************           07730000
077400*******************************************************           07740000
077500*****    FY 2004 VERSION 2                                        07750000
077600***                                                               07760000
077700     IF  HHA-SERV-THRU-DATE > 20030930                            07770000
077800         PERFORM Z900-CONV-650-TO-600 THRU Z900-EXIT              07780000
077900         CALL  HHCAL044   USING WK-600-DATA                       07790000
078000                                HOLD-VARIABLES-DATA               07800000
078100                                WAGE-INDEX-DATA                   07810000
078200         PERFORM Z950-CONV-600-TO-650 THRU Z950-EXIT              07820000
078300         GOBACK.                                                  07830000
078400                                                                  07840000
078500*******************************************************           07850000
078600*****    FY 2003 VERSION 1                                        07860000
078700***                                                               07870000
078800     IF  HHA-SERV-THRU-DATE > 20020930                            07880000
078900         PERFORM Z900-CONV-650-TO-600 THRU Z900-EXIT              07890000
079000         CALL  HHCAL033   USING WK-600-DATA                       07900000
079100                                HOLD-VARIABLES-DATA               07910000
079200                                WAGE-INDEX-DATA                   07920000
079300         PERFORM Z950-CONV-600-TO-650 THRU Z950-EXIT              07930000
079400         GOBACK.                                                  07940000
079500                                                                  07950000
079600*******************************************************           07960000
079700*****    FY 2002 VERSION 1                                        07970000
079800***                                                               07980000
079900     IF  HHA-SERV-THRU-DATE > 20010930                            07990000
080000         PERFORM Z900-CONV-650-TO-600 THRU Z900-EXIT              08000000
080100         CALL  HHCAL023   USING WK-600-DATA                       08010000
080200                                HOLD-VARIABLES-DATA               08020000
080300                                WAGE-INDEX-DATA                   08030000
080400         PERFORM Z950-CONV-600-TO-650 THRU Z950-EXIT              08040000
080500         GOBACK.                                                  08050000
080600                                                                  08060000
080700*******************************************************           08070000
080800*****    FY 2001 VERSION 4                                        08080000
080900***                                                               08090000
081000     IF  HHA-SERV-THRU-DATE > 20000930                            08100000
081100         PERFORM Z900-CONV-650-TO-600 THRU Z900-EXIT              08110000
081200         CALL  HHCAL016   USING WK-600-DATA                       08120000
081300                                HOLD-VARIABLES-DATA               08130000
081400                                WAGE-INDEX-DATA                   08140000
081500         PERFORM Z950-CONV-600-TO-650 THRU Z950-EXIT              08150000
081600         GOBACK.                                                  08160000
081700                                                                  08170000
081800*******************************************************           08180000
081900     MOVE '40' TO HHA-PAY-RTC.                                    08190000
082000     GOBACK.                                                      08200000
082100                                                                  08210000
082200 0100-EXIT.  EXIT.                                                08220000
082300                                                                  08230000
082400 1250-GET-CBSA.                                                   08240000
082410                                                                  08241000
082500     SET MA1 TO 1.                                                08250000
082620                                                                  08262000
082700     SEARCH T-CBSA-DATA VARYING MA1                               08270000
082800            AT END                                                08280000
082900               MOVE '30' TO HHA-PAY-RTC                           08290000
083000               GO TO 1250-EXIT                                    08300000
083100            WHEN T-CBSA (MA1) = HHA-CBSA                          08310000
083200               SET MA2 TO MA1.                                    08320000
083300                                                                  08330000
083400 1250-EXIT.  EXIT.                                                08340000
083500                                                                  08350000
083600 1260-GET-CBSA-WAGE-INDEX.                                        08360000
084400                                                                  08440000
084500     IF HHA-VALID-TOB-CLAIM OR HHA-VALID-TOB-RAP                  08450000
084530       IF HHA-SERV-THRU-DATE (1:4) = T-CBSA-EFFDATE (MA2) (1:4)   08453000
084600         IF HHA-SERV-THRU-DATE NOT < T-CBSA-EFFDATE (MA2)         08460000
084700            MOVE T-CBSA       (MA2) TO WIR-CBSA                   08470000
084800            MOVE T-CBSA-EFFDATE (MA2) TO WIR-CBSA-EFFDATE         08480000
084900            MOVE T-CBSA-WAGEIND (MA2) TO WIR-CBSA-WAGEIND         08490000
084901            MOVE '00' TO HHA-PAY-RTC                              08490100
084920            GO TO 1260-EXIT.                                      08492000
085100                                                                  08510000
085200     IF WIR-CBSA-WAGEIND NOT NUMERIC                              08520000
085300           MOVE '30' TO HHA-PAY-RTC.                              08530000
085400                                                                  08540000
085500 1260-EXIT.  EXIT.                                                08550000
085600                                                                  08560000
085700 1600-GET-MSA.                                                    08570000
085800     SET MU1 TO 1.                                                08580000
085900                                                                  08590000
086000     SEARCH M-MSA-DATA VARYING MU1                                08600000
086100            AT END                                                08610000
086200               MOVE '30' TO HHA-PAY-RTC                           08620000
086300               GO TO 1600-EXIT                                    08630000
086400            WHEN TB-MSA (MU1) = HHA-MSA2                          08640000
086500               SET MU2 TO MU1.                                    08650000
086600                                                                  08660000
086700 1600-EXIT.  EXIT.                                                08670000
086800                                                                  08680000
086900 1700-GET-WAGE-INDEX.                                             08690000
087000                                                                  08700000
087100     IF HHA-VALID-TOB-RAP                                         08710000
087200        IF HHA-SERV-FROM-DATE NOT < TB-EFFDATE (MU2)              08720000
087300           MOVE TB-MSA     (MU2) TO WIR-MSA                       08730000
087400           MOVE TB-EFFDATE (MU2) TO WIR-EFFDATE                   08740000
087500           MOVE TB-WAGEIND (MU2) TO WIR-AREA-WAGEIND.             08750000
087600                                                                  08760000
087700     IF HHA-VALID-TOB-CLAIM                                       08770000
087800        IF HHA-SERV-THRU-DATE NOT < TB-EFFDATE (MU2)              08780000
087900           MOVE TB-MSA     (MU2) TO WIR-MSA                       08790000
088000           MOVE TB-EFFDATE (MU2) TO WIR-EFFDATE                   08800000
088100           MOVE TB-WAGEIND (MU2) TO WIR-AREA-WAGEIND.             08810000
088200                                                                  08820000
088300 1700-EXIT.  EXIT.                                                08830000
088400                                                                  08840000
088500 2000-GET-HRG.                                                    08850000
088600                                                                  08860000
088700     IF HHA-HRG-INPUT-CODE (SUB1) = SPACES                        08870000
088800        MOVE 6 TO SUB1                                            08880000
088900        GO TO 2000-EXIT.                                          08890000
089000                                                                  08900000
089100     MOVE HHA-HRG-INPUT-CODE (SUB1) TO SEARCH-HRG.                08910000
089200     MOVE HHA-HRG-INPUT-CODE (SUB1) TO WORK-HRG.                  08920000
089300     MOVE HHA-HRG-INPUT-CODE (SUB1) TO WORK-ORIG-HRG.             08930000
089400     MOVE HHA-HRG-INPUT-CODE (SUB1) TO HHA-HRG-OUTPUT-CODE (SUB1).08940000
089500                                                                  08950000
089600     IF HHA-MED-REVIEW-INDICATOR (SUB1) = 'Y' AND                 08960000
089700        HHA-RECODE-IND = '0'                                      08970000
089800        GO TO 2000-SEARCH-HRG.                                    08980000
089900                                                                  08990000
090000******************************************************************09000000
090100*  IF LUPA SKIP RECODING OF HIPPS CODE                           *09010000
090200******************************************************************09020000
090300                                                                  09030000
090400     IF HHA-VALID-TOB-CLAIM AND                                   09040000
090500         (HHA-REVENUE-SUM1-6-QTY-ALL < 5 )                        09050000
090600        GO TO 2000-SEARCH-HRG.                                    09060000
090700                                                                  09070000
090800*================================================================*09080000
090900*             *** RECODESTART ***                                *09090000
091000*================================================================*09100000
091100                                                                  09110000
091200     IF HHA-VALID-TOB-RAP                                         09120000
091300        GO TO 2000-SEARCH-HRG.                                    09130000
091400                                                                  09140000
091500     IF SEARCH-HRG1 = '0' OR '6' OR '7' OR '8' OR '9'             09150000
091600        MOVE '70' TO HHA-PAY-RTC                                  09160000
091700        MOVE 6 TO SUB1                                            09170000
091800        GO TO 2000-EXIT.                                          09180000
091900                                                                  09190000
092000******************************************************************09200000
092100*   RECODING OF HIPPS CODE DEPENDING ON CLAIM INFORMATION        *09210000
092200******************************************************************09220000
092300                                                                  09230000
092400     IF HHA-RECODE-IND = '1' OR '3'                               09240000
092500        PERFORM 2300-RECODE-HRG THRU 2300-EXIT                    09250000
092600         MOVE WORK-HRG TO HHA-HRG-OUTPUT-CODE (SUB1)              09260000
092700         MOVE WORK-HRG TO SEARCH-HRG                              09270000
092800        GO TO 2000-GET-HRG-TWO.                                   09280000
092900                                                                  09290000
093000**** V161 ****                                                    09300000
093100     IF WORK-HRG1 = '5' AND                                       09310000
093200        HHA-REVENUE-SUM1-3-QTY-THR < 20                           09320000
093300        PERFORM 2305-RECODE-EPISODE THRU 2305-EXIT                09330000
093400         MOVE WORK-HRG TO HHA-HRG-OUTPUT-CODE (SUB1)              09340000
093500         MOVE WORK-HRG TO SEARCH-HRG                              09350000
093600        GO TO 2000-GET-HRG-TWO.                                   09360000
093700                                                                  09370000
093800                                                                  09380000
093900     IF SEARCH-HRG1 = '1' OR '2' OR '3' OR '4' OR '5'             09390000
094000        PERFORM 2430-RECODE-HRG4-1 THRU 2430-EXIT                 09400000
094100         MOVE WORK-HRG TO HHA-HRG-OUTPUT-CODE (SUB1)              09410000
094200         MOVE WORK-HRG TO SEARCH-HRG                              09420000
094300        GO TO 2000-GET-HRG-TWO.                                   09430000
094400                                                                  09440000
094500                                                                  09450000
094600 2000-GET-HRG-TWO.                                                09460000
094700                                                                  09470000
094800     IF HHA-RECODE-IND = '1' OR '3'                               09480000
094900        PERFORM 2300-RECODE-HRG THRU 2300-EXIT                    09490000
095000         MOVE WORK-HRG TO HHA-HRG-OUTPUT-CODE (SUB1)              09500000
095100         MOVE WORK-HRG TO SEARCH-HRG                              09510000
095200        GO TO 2000-SEARCH-HRG.                                    09520000
095300                                                                  09530000
095400     IF WORK-HRG1 = '5' AND                                       09540000
095500        WORK-ORIG-HRG1 NOT = '5'                                  09550000
095600        PERFORM 2305-RECODE-EPISODE THRU 2305-EXIT                09560000
095700         MOVE WORK-HRG TO HHA-HRG-OUTPUT-CODE (SUB1)              09570000
095800         MOVE WORK-HRG TO SEARCH-HRG                              09580000
095900        GO TO 2000-SEARCH-HRG.                                    09590000
096000                                                                  09600000
096100     IF SEARCH-HRG1 = '1' OR '2' OR '3' OR '4' OR '5'             09610000
096200        PERFORM 2430-RECODE-HRG4-1 THRU 2430-EXIT                 09620000
096300         MOVE WORK-HRG TO HHA-HRG-OUTPUT-CODE (SUB1)              09630000
096400         MOVE WORK-HRG TO SEARCH-HRG.                             09640000
096500                                                                  09650000
096600 2000-SEARCH-HRG.                                                 09660000
096700                                                                  09670000
096800     IF SEARCH-HRG1 = '1' OR '2' OR '3' OR '4' OR '5'             09680000
096900        MOVE ' ' TO SEARCH-HRG5.                                  09690000
097000                                                                  09700000
097100                                                                  09710000
097200     SET HU1 TO 1.                                                09720000
097300     SEARCH M-HRG-DATA VARYING HU1                                09730000
097400            AT END                                                09740000
097500               MOVE '70' TO HHA-PAY-RTC                           09750000
097600               MOVE 6 TO SUB1                                     09760000
097700               GO TO 2000-EXIT                                    09770000
097800            WHEN TB-HRG-HRG (HU1) = SEARCH-HRG                    09780000
097900               SET HU2 TO HU1                                     09790000
098000               PERFORM 2100-GET-HRG-WIEGHTS THRU 2100-EXIT.       09800000
098100                                                                  09810000
098200 2000-EXIT.  EXIT.                                                09820000
098300                                                                  09830000
098400 2100-GET-HRG-WIEGHTS.                                            09840000
098500                                                                  09850000
098600      PERFORM 2200-GET-HRG-SEARCH THRU 2200-EXIT                  09860000
098700           VARYING HU2 FROM HU1 BY 1 UNTIL                        09870000
098800           TB-HRG-HRG (HU2) NOT = SEARCH-HRG.                     09880000
098900                                                                  09890000
099000 2100-EXIT.   EXIT.                                               09900000
099100                                                                  09910000
099200 2200-GET-HRG-SEARCH.                                             09920000
099300                                                                  09930000
099400     IF HHA-VALID-TOB-RAP                                         09940000
099500        IF HHA-SERV-FROM-DATE NOT < TB-HRG-EFFDATE (HU2)          09950000
099600*          MOVE HHA-HRG-INPUT-CODE (SUB1)                         09960000
099700*                                 TO HHA-HRG-OUTPUT-CODE (SUB1)   09970000
099800           MOVE TB-HRG-WGTS (HU2) TO HHA-HRG-WGTS (SUB1).         09980000
099900                                                                  09990000
100000     IF HHA-VALID-TOB-CLAIM                                       10000000
100100        IF HHA-SERV-THRU-DATE NOT < TB-HRG-EFFDATE (HU2)          10010000
100200           PERFORM 2250-CHECK-FOR-WHICH-HRG THRU 2250-EXIT.       10020000
100300                                                                  10030000
100400 2200-EXIT.  EXIT.                                                10040000
100500                                                                  10050000
100600 2250-CHECK-FOR-WHICH-HRG.                                        10060000
100700                                                                  10070000
100800     IF HHA-MED-REVIEW-INDICATOR (SUB1) NOT = 'Y' AND             10080000
100900                                        NOT = 'N'                 10090000
101000               MOVE '25' TO HHA-PAY-RTC                           10100000
101100               MOVE 6 TO SUB1                                     10110000
101200               GO TO 2250-EXIT.                                   10120000
101300                                                                  10130000
101400     IF SEARCH-HRG1    = '1' OR '2' OR '3' OR '4' OR '5'          10140000
101500             MOVE TB-HRG-WGTS (HU2) TO HHA-HRG-WGTS (SUB1)        10150000
101600             MOVE WORK-HRG TO HHA-HRG-OUTPUT-CODE (SUB1)          10160000
101700               GO TO 2250-EXIT.                                   10170000
101800                                                                  10180000
101900     IF (HHA-REVENUE-SUM1-3-QTY-THR < 10)                         10190000
102000        IF (HHA-MED-REVIEW-INDICATOR (SUB1) = 'N')                10200000
102100          IF TB-HRG-HRG (HU2) NOT = TB-HRG-HRG2 (HU2)             10210000
102200             MOVE TB-HRG-HRG2 (HU2) TO HHA-HRG-OUTPUT-CODE (SUB1) 10220000
102300             MOVE TB-HRG-WGTS2 (HU2) TO HHA-HRG-WGTS (SUB1)       10230000
102400          ELSE                                                    10240000
102500             MOVE TB-HRG-HRG  (HU2) TO HHA-HRG-OUTPUT-CODE (SUB1) 10250000
102600             MOVE TB-HRG-WGTS (HU2) TO HHA-HRG-WGTS (SUB1)        10260000
102700        ELSE                                                      10270000
102800           MOVE TB-HRG-HRG  (HU2) TO HHA-HRG-OUTPUT-CODE (SUB1)   10280000
102900           MOVE TB-HRG-WGTS (HU2) TO HHA-HRG-WGTS (SUB1)          10290000
103000     ELSE                                                         10300000
103100       MOVE TB-HRG-HRG  (HU2) TO HHA-HRG-OUTPUT-CODE (SUB1)       10310000
103200       MOVE TB-HRG-WGTS (HU2) TO HHA-HRG-WGTS (SUB1).             10320000
103300                                                                  10330000
103400     IF (HHA-REVENUE-SUM1-6-QTY-ALL < 5)                          10340000
103500       MOVE TB-HRG-HRG  (HU2) TO HHA-HRG-OUTPUT-CODE (SUB1)       10350000
103600       MOVE ZEROES            TO HHA-HRG-WGTS (SUB1).             10360000
103700                                                                  10370000
103800                                                                  10380000
103900 2250-EXIT.  EXIT.                                                10390000
104000                                                                  10400000
104100 2300-RECODE-HRG.                                                 10410000
104200                                                                  10420000
104300       MOVE ZEROES            TO HRG-KEEP5-SW1.                   10430000
104400                                                                  10440000
104500     IF HHA-RECODE-IND = '1'                                      10450000
104600        PERFORM 2310-RECODE-HRG1 THRU 2310-EXIT                   10460000
104700               GO TO 2300-EXIT.                                   10470000
104800                                                                  10480000
104900                                                                  10490000
105000     IF HHA-RECODE-IND = '3'                                      10500000
105100        PERFORM 2312-RECODE-HRG2 THRU 2312-EXIT                   10510000
105200               GO TO 2300-EXIT.                                   10520000
105300                                                                  10530000
105400                                                                  10540000
105500 2300-EXIT.  EXIT.                                                10550000
105600                                                                  10560000
105700 2305-RECODE-EPISODE.                                             10570000
105800                                                                  10580000
105900     IF HHA-EPISODE-TIMING = 1                                    10590000
106000        PERFORM 2410-RECODE-EPP1 THRU 2410-EXIT                   10600000
106100               GO TO 2305-EXIT.                                   10610000
106200                                                                  10620000
106300                                                                  10630000
106400     IF HHA-EPISODE-TIMING = 2                                    10640000
106500        PERFORM 2415-RECODE-EPP2 THRU 2415-EXIT                   10650000
106600               GO TO 2305-EXIT.                                   10660000
106700                                                                  10670000
106800                                                                  10680000
106900 2305-EXIT.  EXIT.                                                10690000
107000                                                                  10700000
107100 2310-RECODE-HRG1.                                                10710000
107200                                                                  10720000
107300       IF (HHA-REVENUE-SUM1-3-QTY-THR < 14)                       10730000
107400         MOVE '1' TO WORK-HRG1                                    10740000
107500        PERFORM 2315-RECODE-HRG1-1 THRU 2315-EXIT                 10750000
107600               GO TO 2310-EXIT.                                   10760000
107700                                                                  10770000
107800       IF (HHA-REVENUE-SUM1-3-QTY-THR > 13 AND                    10780000
107900           HHA-REVENUE-SUM1-3-QTY-THR < 20)                       10790000
108000             MOVE '2' TO WORK-HRG1                                10800000
108100        PERFORM 2320-RECODE-HRG1-2 THRU 2320-EXIT                 10810000
108200               GO TO 2310-EXIT.                                   10820000
108300                                                                  10830000
108400**** V161 ****                                                    10840000
108500*      IF (HHA-REVENUE-SUM1-3-QTY-THR > 19)                       10850000
108600*            MOVE '2' TO WORK-HRG1                                10860000
108700*            MOVE '1' TO HRG-KEEP5-SW1                            10870000
108800*       PERFORM 2320-RECODE-HRG1-2 THRU 2320-EXIT                 10880000
108900*              GO TO 2310-EXIT.                                   10890000
109000                                                                  10900000
109100 2310-EXIT.  EXIT.                                                10910000
109200                                                                  10920000
109300 2312-RECODE-HRG2.                                                10930000
109400                                                                  10940000
109500       IF (HHA-REVENUE-SUM1-3-QTY-THR < 14)                       10950000
109600         MOVE '3' TO WORK-HRG1                                    10960000
109700        PERFORM 2325-RECODE-HRG1-3 THRU 2325-EXIT                 10970000
109800               GO TO 2312-EXIT.                                   10980000
109900                                                                  10990000
110000       IF (HHA-REVENUE-SUM1-3-QTY-THR > 13 AND                    11000000
110100           HHA-REVENUE-SUM1-3-QTY-THR < 20)                       11010000
110200             MOVE '4' TO WORK-HRG1                                11020000
110300        PERFORM 2330-RECODE-HRG1-4 THRU 2330-EXIT                 11030000
110400               GO TO 2312-EXIT.                                   11040000
110500                                                                  11050000
110600**** V161 ****                                                    11060000
110700*      IF (HHA-REVENUE-SUM1-3-QTY-THR > 20)                       11070000
110800*            MOVE '4' TO WORK-HRG1                                11080000
110900*            MOVE '1' TO HRG-KEEP5-SW1                            11090000
111000*       PERFORM 2330-RECODE-HRG1-4 THRU 2330-EXIT                 11100000
111100*              GO TO 2312-EXIT.                                   11110000
111200                                                                  11120000
111300 2312-EXIT.  EXIT.                                                11130000
111400                                                                  11140000
111500 2410-RECODE-EPP1.                                                11150000
111600                                                                  11160000
111700       IF (HHA-REVENUE-SUM1-3-QTY-THR < 14)                       11170000
111800         MOVE '1' TO WORK-HRG1                                    11180000
111900        PERFORM 2315-RECODE-HRG1-1 THRU 2315-EXIT                 11190000
112000               GO TO 2410-EXIT.                                   11200000
112100                                                                  11210000
112200       IF (HHA-REVENUE-SUM1-3-QTY-THR > 13 AND                    11220000
112300           HHA-REVENUE-SUM1-3-QTY-THR < 20)                       11230000
112400             MOVE '2' TO WORK-HRG1                                11240000
112500        PERFORM 2320-RECODE-HRG1-2 THRU 2320-EXIT                 11250000
112600               GO TO 2410-EXIT.                                   11260000
112700                                                                  11270000
112800**** V161 ****                                                    11280000
112900*      IF (HHA-REVENUE-SUM1-3-QTY-THR > 19)                       11290000
113000*        MOVE 'K' TO WORK-HRG4                                    11300000
113100*        IF WORK-ORIG-HRG1 = '1' OR '2'                           11310000
113200*           PERFORM 2475-RECODE-HRG5-3  THRU 2475-EXIT            11320000
113300*        ELSE                                                     11330000
113400*           PERFORM 2480-RECODE-HRG5-4 THRU 2480-EXIT             11340000
113500*              GO TO 2410-EXIT.                                   11350000
113600                                                                  11360000
113700                                                                  11370000
113800 2410-EXIT.  EXIT.                                                11380000
113900                                                                  11390000
114000 2415-RECODE-EPP2.                                                11400000
114100                                                                  11410000
114200       IF (HHA-REVENUE-SUM1-3-QTY-THR < 14)                       11420000
114300         MOVE '3' TO WORK-HRG1                                    11430000
114400        PERFORM 2325-RECODE-HRG1-3 THRU 2325-EXIT                 11440000
114500               GO TO 2415-EXIT.                                   11450000
114600                                                                  11460000
114700                                                                  11470000
114800       IF (HHA-REVENUE-SUM1-3-QTY-THR > 13 AND                    11480000
114900           HHA-REVENUE-SUM1-3-QTY-THR < 20)                       11490000
115000             MOVE '4' TO WORK-HRG1                                11500000
115100        PERFORM 2330-RECODE-HRG1-4 THRU 2330-EXIT                 11510000
115200               GO TO 2415-EXIT.                                   11520000
115300                                                                  11530000
115400**** V161 ****                                                    11540000
115500*      IF (HHA-REVENUE-SUM1-3-QTY-THR > 19)                       11550000
115600*            MOVE 'K' TO WORK-HRG4                                11560000
115700*        IF WORK-ORIG-HRG1 = '1' OR '2'                           11570000
115800*           PERFORM 2475-RECODE-HRG5-3  THRU 2475-EXIT            11580000
115900*        ELSE                                                     11590000
116000*           PERFORM 2480-RECODE-HRG5-4 THRU 2480-EXIT             11600000
116100*              GO TO 2415-EXIT.                                   11610000
116200                                                                  11620000
116300 2415-EXIT.  EXIT.                                                11630000
116400                                                                  11640000
116500 2430-RECODE-HRG4-1.                                              11650000
116600                                                                  11660000
116700     IF WORK-HRG1 = '1' OR '3'                                    11670000
116800        PERFORM 2440-RECODE-HRG4-2  THRU 2440-EXIT                11680000
116900        GO TO 2430-EXIT.                                          11690000
117000                                                                  11700000
117100                                                                  11710000
117200     IF WORK-HRG1 = '2' OR '4'                                    11720000
117300        PERFORM 2450-RECODE-HRG4-3  THRU 2450-EXIT                11730000
117400        GO TO 2430-EXIT.                                          11740000
117500                                                                  11750000
117600 2430-EXIT.  EXIT.                                                11760000
117700                                                                  11770000
117800                                                                  11780000
117900 2440-RECODE-HRG4-2.                                              11790000
118000                                                                  11800000
118100     IF  HHA-REVENUE-SUM1-3-QTY-THR < 6                           11810000
118200             MOVE 'K' TO WORK-HRG4.                               11820000
118300                                                                  11830000
118400     IF  HHA-REVENUE-SUM1-3-QTY-THR = 6                           11840000
118500             MOVE 'L' TO WORK-HRG4.                               11850000
118600                                                                  11860000
118700                                                                  11870000
118800     IF (HHA-REVENUE-SUM1-3-QTY-THR >  6 AND                      11880000
118900         HHA-REVENUE-SUM1-3-QTY-THR < 10)                         11890000
119000             MOVE 'M' TO WORK-HRG4.                               11900000
119100                                                                  11910000
119200     IF  HHA-REVENUE-SUM1-3-QTY-THR = 10                          11920000
119300             MOVE 'N' TO WORK-HRG4.                               11930000
119400                                                                  11940000
119500     IF (HHA-REVENUE-SUM1-3-QTY-THR > 10 AND                      11950000
119600         HHA-REVENUE-SUM1-3-QTY-THR < 14)                         11960000
119700             MOVE 'P' TO WORK-HRG4.                               11970000
119800                                                                  11980000
119900     IF (WORK-HRG1 = '1' AND                                      11990000
120000         HHA-REVENUE-SUM1-3-QTY-THR > 13 AND                      12000000
120100         HHA-REVENUE-SUM1-3-QTY-THR < 20)                         12010000
120200           MOVE '2' TO WORK-HRG1                                  12020000
120300           MOVE '1' TO HHA-RECODE-IND                             12030000
120400           COMPUTE HRG-RECODE-SW = HRG-RECODE-SW + 1              12040000
120500           GO TO 2440-EXIT.                                       12050000
120600                                                                  12060000
120700                                                                  12070000
120800     IF (WORK-HRG1 = '3' AND                                      12080000
120900         HHA-REVENUE-SUM1-3-QTY-THR > 13 AND                      12090000
121000         HHA-REVENUE-SUM1-3-QTY-THR < 20)                         12100000
121100           MOVE '4' TO WORK-HRG1                                  12110000
121200           MOVE '3' TO HHA-RECODE-IND                             12120000
121300           COMPUTE HRG-RECODE-SW = HRG-RECODE-SW + 1              12130000
121400           GO TO 2440-EXIT.                                       12140000
121500                                                                  12150000
121600                                                                  12160000
121700     IF (WORK-HRG1 = '1' AND                                      12170000
121800         HHA-REVENUE-SUM1-3-QTY-THR > 19)                         12180000
121900           MOVE '5' TO WORK-HRG1                                  12190000
122000*          MOVE '1' TO HHA-RECODE-IND                             12200000
122100          PERFORM 2475-RECODE-HRG5-3  THRU 2475-EXIT              12210000
122200           GO TO 2440-EXIT.                                       12220000
122300                                                                  12230000
122400                                                                  12240000
122500     IF (WORK-HRG1 = '3' AND                                      12250000
122600         HHA-REVENUE-SUM1-3-QTY-THR > 19)                         12260000
122700           MOVE '5' TO WORK-HRG1                                  12270000
122800*          MOVE '1' TO HHA-RECODE-IND                             12280000
122900          PERFORM 2480-RECODE-HRG5-4  THRU 2480-EXIT              12290000
123000           GO TO 2440-EXIT.                                       12300000
123100                                                                  12310000
123200                                                                  12320000
123300 2440-EXIT.  EXIT.                                                12330000
123400                                                                  12340000
123500                                                                  12350000
123600 2450-RECODE-HRG4-3.                                              12360000
123700                                                                  12370000
123800                                                                  12380000
123900     IF (HHA-REVENUE-SUM1-3-QTY-THR > 13 AND                      12390000
124000         HHA-REVENUE-SUM1-3-QTY-THR < 16)                         12400000
124100             MOVE 'K' TO WORK-HRG4                                12410000
124200             GO TO 2450-EXIT.                                     12420000
124300                                                                  12430000
124400     IF (HHA-REVENUE-SUM1-3-QTY-THR > 15 AND                      12440000
124500         HHA-REVENUE-SUM1-3-QTY-THR < 18)                         12450000
124600             MOVE 'L' TO WORK-HRG4                                12460000
124700             GO TO 2450-EXIT.                                     12470000
124800                                                                  12480000
124900     IF (HHA-REVENUE-SUM1-3-QTY-THR > 17 AND                      12490000
125000         HHA-REVENUE-SUM1-3-QTY-THR < 20)                         12500000
125100             MOVE 'M' TO WORK-HRG4                                12510000
125200             GO TO 2450-EXIT.                                     12520000
125300                                                                  12530000
125400     IF (WORK-HRG1 = '2' AND                                      12540000
125500         HHA-REVENUE-SUM1-3-QTY-THR < 14)                         12550000
125600           MOVE '1' TO WORK-HRG1                                  12560000
125700           MOVE '1' TO HHA-RECODE-IND                             12570000
125800           COMPUTE HRG-RECODE-SW = HRG-RECODE-SW + 1              12580000
125900             GO TO 2450-EXIT.                                     12590000
126000                                                                  12600000
126100                                                                  12610000
126200     IF (WORK-HRG1 = '4' AND                                      12620000
126300         HHA-REVENUE-SUM1-3-QTY-THR < 14)                         12630000
126400           MOVE '3' TO WORK-HRG1                                  12640000
126500           MOVE '3' TO HHA-RECODE-IND                             12650000
126600           COMPUTE HRG-RECODE-SW = HRG-RECODE-SW + 1              12660000
126700             GO TO 2450-EXIT.                                     12670000
126800                                                                  12680000
126900                                                                  12690000
127000     IF (WORK-HRG1 = '2' AND                                      12700000
127100         HHA-REVENUE-SUM1-3-QTY-THR > 19)                         12710000
127200           MOVE '5' TO WORK-HRG1                                  12720000
127300*          MOVE '1' TO HHA-RECODE-IND                             12730000
127400*       IF HRG-KEEP5-SW1 = 1                                      12740000
127500*         PERFORM 2480-RECODE-HRG5-4  THRU 2480-EXIT              12750000
127600*          MOVE WORK-HRG TO HHA-HRG-OUTPUT-CODE (SUB1)            12760000
127700*          MOVE WORK-HRG TO SEARCH-HRG                            12770000
127800*          GO TO 2450-EXIT                                        12780000
127900*       ELSE                                                      12790000
128000          PERFORM 2475-RECODE-HRG5-3  THRU 2475-EXIT              12800000
128100           GO TO 2450-EXIT.                                       12810000
128200                                                                  12820000
128300     IF (WORK-HRG1 = '4' AND                                      12830000
128400         HHA-REVENUE-SUM1-3-QTY-THR > 19)                         12840000
128500           MOVE '5' TO WORK-HRG1                                  12850000
128600*          MOVE '1' TO HHA-RECODE-IND                             12860000
128700          PERFORM 2480-RECODE-HRG5-4  THRU 2480-EXIT              12870000
128800           GO TO 2450-EXIT.                                       12880000
128900                                                                  12890000
129000                                                                  12900000
129100 2450-EXIT.  EXIT.                                                12910000
129200                                                                  12920000
129300                                                                  12930000
129400 2600-RECODE-HRG-POS4.                                            12940000
129500                                                                  12950000
129600        IF  HHA-REVENUE-SUM1-3-QTY-THR < 6                        12960000
129700             MOVE 'K' TO WORK-HRG4.                               12970000
129800                                                                  12980000
129900        IF  HHA-REVENUE-SUM1-3-QTY-THR = 6                        12990000
130000             MOVE 'L' TO WORK-HRG4.                               13000000
130100                                                                  13010000
130200        IF (HHA-REVENUE-SUM1-3-QTY-THR >  6 AND                   13020000
130300            HHA-REVENUE-SUM1-3-QTY-THR < 10)                      13030000
130400             MOVE 'M' TO WORK-HRG4.                               13040000
130500                                                                  13050000
130600        IF  HHA-REVENUE-SUM1-3-QTY-THR = 10                       13060000
130700             MOVE 'N' TO WORK-HRG4.                               13070000
130800                                                                  13080000
130900        IF (HHA-REVENUE-SUM1-3-QTY-THR > 10 AND                   13090000
131000            HHA-REVENUE-SUM1-3-QTY-THR < 14)                      13100000
131100             MOVE 'P' TO WORK-HRG4.                               13110000
131200                                                                  13120000
131300        IF (HHA-REVENUE-SUM1-3-QTY-THR > 13 AND                   13130000
131400            HHA-REVENUE-SUM1-3-QTY-THR < 16)                      13140000
131500             MOVE 'K' TO WORK-HRG4.                               13150000
131600                                                                  13160000
131700        IF (HHA-REVENUE-SUM1-3-QTY-THR > 15 AND                   13170000
131800            HHA-REVENUE-SUM1-3-QTY-THR < 18)                      13180000
131900             MOVE 'L' TO WORK-HRG4.                               13190000
132000                                                                  13200000
132100        IF (HHA-REVENUE-SUM1-3-QTY-THR > 17 AND                   13210000
132200            HHA-REVENUE-SUM1-3-QTY-THR < 20)                      13220000
132300             MOVE 'M' TO WORK-HRG4.                               13230000
132400                                                                  13240000
132500        IF  HHA-REVENUE-SUM1-3-QTY-THR > 19                       13250000
132600             MOVE 'K' TO WORK-HRG4.                               13260000
132700                                                                  13270000
132800 2600-EXIT.  EXIT.                                                13280000
132900***===================================================***         13290000
133000                                                                  13300000
133100 2700-GET-REV.                                                    13310000
133200                                                                  13320000
133300     IF HHA-REVENUE-CODE (SUB1) = SPACES                          13330000
133400        MOVE 6 TO SUB1                                            13340000
133500        GO TO 2700-EXIT.                                          13350000
133600                                                                  13360000
133700     SET RU1 TO 1.                                                13370000
133800     SEARCH M-REV-DATA VARYING RU1                                13380000
133900            AT END                                                13390000
134000               MOVE '80' TO HHA-PAY-RTC                           13400000
134100               MOVE 6 TO SUB1                                     13410000
134200               GO TO 2700-EXIT                                    13420000
134300            WHEN TB-REV-CODE (RU1) = HHA-REVENUE-CODE (SUB1)      13430000
134400               SET RU2 TO RU1                                     13440000
134500               PERFORM 2750-GET-REV-DOLLARS THRU 2750-EXIT.       13450000
134600                                                                  13460000
134700 2700-EXIT.  EXIT.                                                13470000
134800                                                                  13480000
134900 2750-GET-REV-DOLLARS.                                            13490000
135000                                                                  13500000
135100      PERFORM 2800-GET-REV-SEARCH THRU 2800-EXIT                  13510000
135200           VARYING RU2 FROM RU1 BY 1 UNTIL                        13520000
135300           TB-REV-CODE (RU2) NOT = HHA-REVENUE-CODE (SUB1).       13530000
135400                                                                  13540000
135500 2750-EXIT.   EXIT.                                               13550000
135600                                                                  13560000
135700 2800-GET-REV-SEARCH.                                             13570000
135800                                                                  13580000
135900     IF HHA-SERV-THRU-DATE NOT < TB-REV-EFFDATE (RU2)             13590000
136000         MOVE TB-REV-CODE             (RU2) TO                    13600000
136100              TB-STDV-REV-CODE      (SUB1)                        13610000
136101         MOVE TB-REV-DOLL-RATE-NRURAL (RU2) TO                    13610100
136102              TB-STDV-REV-DOLL-RATE (SUB1)                        13610200
136110         MOVE TB-REV-DOLL-RATE-NRURAL (RU2) TO                    13611000
136120              HHA-REVENUE-DOLL-RATE (SUB1)                        13612000
136200         MOVE TB-REV-UDOLL-RATE-NRURAL (RU2) TO                   13620000
136300              WK-REV-DOLL-RATE-UNITS (SUB1)                       13630000
136400     ELSE                                                         13640000
136500         GO TO 2800-EXIT.                                         13650000
136600                                                                  13660000
136700     IF HHA-SERV-THRU-DATE > 20010331 AND                         13670000
136800        HHA-SERV-THRU-DATE < 20060101                             13680000
136900        IF HHA-MSA2-RURAL-CHECK                                   13690000
137000            MOVE TB-REV-DOLL-RATE-RURAL (RU2) TO                  13700000
137100                 HHA-REVENUE-DOLL-RATE (SUB1).                    13710000
137200                                                                  13720000
137300     IF HHA-SERV-THRU-DATE > 20051231 AND                         13730000
137400        HHA-SERV-THRU-DATE < 20070101 AND                         13740000
137500        HHA-SERV-FROM-DATE > 20051231                             13750000
137600        IF HHA-CBSA-RURAL-CHECK                                   13760000
137700        OR HHA-CBSA-RURAL-CHECK-ALL                               13770000
137800            MOVE TB-REV-DOLL-RATE-RURAL (RU2) TO                  13780000
137900                 HHA-REVENUE-DOLL-RATE (SUB1)                     13790000
138000            GO TO 2800-EXIT.                                      13800000
138100                                                                  13810000
138200     IF HHA-SERV-THRU-DATE > 20061231 AND                         13820000
138300        HHA-SERV-FROM-DATE > 20061231 AND                         13830000
138400        HHA-SERV-THRU-DATE < 20070101                             13840000
138500        IF HHA-CBSA-RURAL-CHECK                                   13850000
138600        OR HHA-CBSA-RURAL-CHECK-ALL                               13860000
138700            IF HHA-WITH-DATA-CHECK                                13870000
138800                MOVE TB-REV-DOLL-RATE-RURAL (RU2) TO              13880000
138900                     HHA-REVENUE-DOLL-RATE (SUB1)                 13890000
139000            ELSE                                                  13900000
139100                MOVE TB-DOLL-RATE-RURAL-NOSUBMIT (RU2) TO         13910000
139200                     HHA-REVENUE-DOLL-RATE (SUB1)                 13920000
139300            END-IF                                                13930000
139400        ELSE                                                      13940000
139500            IF HHA-WITH-DATA-CHECK                                13950000
139600                MOVE TB-REV-DOLL-RATE-NRURAL (RU2) TO             13960000
139700                     HHA-REVENUE-DOLL-RATE (SUB1)                 13970000
139800            ELSE                                                  13980000
139900                MOVE TB-DOLL-RATE-NRURAL-NOSUBMIT (RU2) TO        13990000
140000                     HHA-REVENUE-DOLL-RATE (SUB1)                 14000000
140100            END-IF                                                14010000
140200        END-IF                                                    14020000
140300     END-IF.                                                      14030000
140400                                                                  14040000
140500     IF HHA-CBSA-RURAL-CHECK                                      14050000
140600     OR HHA-CBSA-RURAL-CHECK-ALL                                  14060000
140601        MOVE TB-REV-CODE             (RU2) TO                     14060100
140602             TB-STDV-REV-CODE      (SUB1)                         14060200
140610        MOVE TB-REV-DOLL-RATE-NRURAL (RU2) TO                     14061000
140620             TB-STDV-REV-DOLL-RATE  (SUB1)                        14062000
140700        IF HHA-WITH-DATA-CHECK                                    14070000
140800            MOVE TB-REV-DOLL-RATE-RURAL (RU2) TO                  14080000
140900                 HHA-REVENUE-DOLL-RATE (SUB1)                     14090000
141000            MOVE TB-REV-UDOLL-RATE-RURAL (RU2) TO                 14100000
141100              WK-REV-DOLL-RATE-UNITS (SUB1)                       14110000
141200        ELSE                                                      14120000
141300            MOVE TB-DOLL-RATE-RURAL-NOSUBMIT (RU2) TO             14130000
141400                 HHA-REVENUE-DOLL-RATE (SUB1)                     14140000
141500            MOVE TB-UDOLL-RATE-RURAL-NOSUBMIT (RU2) TO            14150000
141600              WK-REV-DOLL-RATE-UNITS (SUB1)                       14160000
141700        END-IF                                                    14170000
141800     ELSE                                                         14180000
141801        MOVE TB-REV-CODE             (RU2) TO                     14180100
141802             TB-STDV-REV-CODE      (SUB1)                         14180200
141810        MOVE TB-REV-DOLL-RATE-NRURAL (RU2) TO                     14181000
141820             TB-STDV-REV-DOLL-RATE  (SUB1)                        14182000
141900        IF HHA-WITH-DATA-CHECK                                    14190000
142000           MOVE TB-REV-DOLL-RATE-NRURAL (RU2) TO                  14200000
142100                HHA-REVENUE-DOLL-RATE (SUB1)                      14210000
142200           MOVE TB-REV-UDOLL-RATE-NRURAL (RU2) TO                 14220000
142300              WK-REV-DOLL-RATE-UNITS (SUB1)                       14230000
142400        ELSE                                                      14240000
142500            MOVE TB-DOLL-RATE-NRURAL-NOSUBMIT (RU2) TO            14250000
142600                 HHA-REVENUE-DOLL-RATE (SUB1)                     14260000
142700            MOVE TB-UDOLL-RATE-NRURAL-NOSUBMIT (RU2) TO           14270000
142800              WK-REV-DOLL-RATE-UNITS (SUB1)                       14280000
142900        END-IF                                                    14290000
143000     END-IF.                                                      14300000
143100                                                                  14310000
143200 2800-EXIT.  EXIT.                                                14320000
143300                                                                  14330000
143400*================================================================*14340000
143500*                *** RECODING LOGIC ***                          *14350000
143600*================================================================*14360000
143700                                                                  14370000
143800 2315-RECODE-HRG1-1.                                              14380000
143900                                                                  14390000
144000     IF HHA-SERV-THRU-DATE < 20150101                             14400000
144100        PERFORM 2315-RECODE-HRG1-1-2014                           14410000
144200           THRU 2315-RECORD-HRG1-1-2014-EXIT                      14420000
144300     ELSE                                                         14430000
144400     IF HHA-SERV-THRU-DATE < 20160101                             14440000
144500        PERFORM 2315-RECODE-HRG1-1-2015                           14450000
144600           THRU 2315-RECORD-HRG1-1-2015-EXIT                      14460000
144700     ELSE                                                         14470000
144800     IF HHA-SERV-THRU-DATE < 20170101                             14480000
144900        PERFORM 2315-RECODE-HRG1-1-2016                           14490000
145000           THRU 2315-RECORD-HRG1-1-2016-EXIT                      14500000
145100     ELSE                                                         14510000
145200     IF HHA-SERV-THRU-DATE < 20180101                             14520000
145300        PERFORM 2315-RECODE-HRG1-1-2017                           14530000
145400           THRU 2315-RECORD-HRG1-1-2017-EXIT                      14540000
145410     ELSE                                                         14541000
145420     IF HHA-SERV-THRU-DATE < 20190101                             14542000
145430        PERFORM 2315-RECODE-HRG1-1-2018                           14543000
145440           THRU 2315-RECORD-HRG1-1-2018-EXIT                      14544000
145510     ELSE                                                         14551000
145520     IF HHA-SERV-THRU-DATE < 20200301                             14552000
145530        PERFORM 2315-RECODE-HRG1-1-2019                           14553000
145540           THRU 2315-RECORD-HRG1-1-2019-EXIT                      14554000
145550     END-IF.                                                      14555000
145600                                                                  14560000
145700     PERFORM 2430-RECODE-HRG4-1 THRU 2430-EXIT.                   14570000
145800                                                                  14580000
145900 2315-EXIT.  EXIT.                                                14590000
146000                                                                  14600000
146100 2315-RECODE-HRG1-1-2014.                                         14610000
146200                                                                  14620000
146300     IF HHA-CLINICAL-SEV-EQ1 = 'A' OR 'B' OR 'C' OR 'D'           14630000
146400        MOVE 'A'     TO WORK-HRG2.                                14640000
146500                                                                  14650000
146600     IF HHA-CLINICAL-SEV-EQ1 = 'E' OR 'F' OR 'G' OR 'H'           14660000
146700        MOVE 'B'     TO WORK-HRG2.                                14670000
146800                                                                  14680000
146900     IF HHA-CLINICAL-SEV-EQ1 = 'I' OR 'J' OR 'K' OR               14690000
147000                               'L' OR 'M' OR 'N' OR 'O' OR        14700000
147100                 'P' OR 'Q' OR 'R' OR 'S' OR 'T' OR 'U' OR        14710000
147200                 'V' OR 'W' OR 'X' OR 'Y' OR 'Z'                  14720000
147300        MOVE 'C'     TO WORK-HRG2.                                14730000
147400                                                                  14740000
147500     IF HHA-FUNCTION-SEV-EQ1 = 'A' OR 'B' OR 'C' OR 'D' OR 'E'    14750000
147600        MOVE 'F'     TO WORK-HRG3.                                14760000
147700                                                                  14770000
147800     IF HHA-FUNCTION-SEV-EQ1 = 'F'                                14780000
147900        MOVE 'G'     TO WORK-HRG3.                                14790000
148000                                                                  14800000
148100     IF HHA-FUNCTION-SEV-EQ1 =     'G' OR 'H' OR 'I' OR           14810000
148200                  'J' OR 'K' OR 'L' OR 'M' OR 'N' OR 'O' OR       14820000
148300                  'P' OR 'Q' OR 'R' OR 'S' OR 'T' OR 'U' OR       14830000
148400                  'V' OR 'W' OR 'X' OR 'Y' OR 'Z'                 14840000
148500        MOVE 'H'     TO WORK-HRG3.                                14850000
148600                                                                  14860000
148700 2315-RECORD-HRG1-1-2014-EXIT.                                    14870000
148800     EXIT.                                                        14880000
148900                                                                  14890000
149000 2315-RECODE-HRG1-1-2015.                                         14900000
149100                                                                  14910000
149200     IF HHA-CLINICAL-SEV-EQ1 = 'A' OR 'B'                         14920000
149300        MOVE 'A'     TO WORK-HRG2.                                14930000
149400                                                                  14940000
149500     IF HHA-CLINICAL-SEV-EQ1 = 'C' OR 'D'                         14950000
149600        MOVE 'B'     TO WORK-HRG2.                                14960000
149700                                                                  14970000
149800     IF HHA-CLINICAL-SEV-EQ1 = 'E' OR 'F' OR 'G' OR 'H' OR        14980000
149900                               'I' OR 'J' OR 'K' OR               14990000
150000                               'L' OR 'M' OR 'N' OR 'O' OR        15000000
150100                 'P' OR 'Q' OR 'R' OR 'S' OR 'T' OR 'U' OR        15010000
150200                 'V' OR 'W' OR 'X' OR 'Y' OR 'Z'                  15020000
150300        MOVE 'C'     TO WORK-HRG2.                                15030000
150400                                                                  15040000
150500     IF HHA-FUNCTION-SEV-EQ1 = 'A' OR 'B' OR 'C' OR 'D' OR 'E'    15050000
150600                            OR 'F' OR 'G' OR 'H' OR 'I' OR 'J'    15060000
150700                            OR 'K' OR 'L' OR 'M' OR 'N' OR 'O'    15070000
150800        MOVE 'F'     TO WORK-HRG3.                                15080000
150900                                                                  15090000
151000     IF HHA-FUNCTION-SEV-EQ1 = 'P'                                15100000
151100        MOVE 'G'     TO WORK-HRG3.                                15110000
151200                                                                  15120000
151300     IF HHA-FUNCTION-SEV-EQ1 =     'Q' OR 'R' OR 'S' OR           15130000
151400                                'T' OR 'U' OR 'V' OR              15140000
151500                                'W' OR 'X' OR 'Y' OR 'Z'          15150000
151600        MOVE 'H'     TO WORK-HRG3.                                15160000
151700                                                                  15170000
151800 2315-RECORD-HRG1-1-2015-EXIT.                                    15180000
151900     EXIT.                                                        15190000
152000                                                                  15200000
152100 2315-RECODE-HRG1-1-2016.                                         15210000
152200                                                                  15220000
152300     IF HHA-CLINICAL-SEV-EQ1 = 'A' OR 'B'                         15230000
152400        MOVE 'A'     TO WORK-HRG2.                                15240000
152500                                                                  15250000
152600     IF HHA-CLINICAL-SEV-EQ1 = 'C' OR 'D'                         15260000
152700        MOVE 'B'     TO WORK-HRG2.                                15270000
152800                                                                  15280000
152900     IF HHA-CLINICAL-SEV-EQ1 = 'E' OR 'F' OR 'G' OR 'H' OR        15290000
153000                               'I' OR 'J' OR 'K' OR               15300000
153100                               'L' OR 'M' OR 'N' OR 'O' OR        15310000
153200                 'P' OR 'Q' OR 'R' OR 'S' OR 'T' OR 'U' OR        15320000
153300                 'V' OR 'W' OR 'X' OR 'Y' OR 'Z'                  15330000
153400        MOVE 'C'     TO WORK-HRG2.                                15340000
153500                                                                  15350000
153600     IF HHA-FUNCTION-SEV-EQ1 = 'A' OR 'B' OR 'C' OR 'D' OR 'E'    15360000
153700                            OR 'F' OR 'G' OR 'H' OR 'I' OR 'J'    15370000
153800                            OR 'K' OR 'L' OR 'M' OR 'N' OR 'O'    15380000
153900        MOVE 'F'     TO WORK-HRG3.                                15390000
154000                                                                  15400000
154100     IF HHA-FUNCTION-SEV-EQ1 = 'P'                                15410000
154200        MOVE 'G'     TO WORK-HRG3.                                15420000
154300                                                                  15430000
154400     IF HHA-FUNCTION-SEV-EQ1 =     'Q' OR 'R' OR 'S' OR           15440000
154500                                'T' OR 'U' OR 'V' OR              15450000
154600                                'W' OR 'X' OR 'Y' OR 'Z'          15460000
154700        MOVE 'H'     TO WORK-HRG3.                                15470000
154800                                                                  15480000
154900 2315-RECORD-HRG1-1-2016-EXIT.                                    15490000
155000     EXIT.                                                        15500000
155100                                                                  15510000
155200 2315-RECODE-HRG1-1-2017.                                         15520000
155300                                                                  15530000
155400     IF HHA-CLINICAL-SEV-EQ1 = 'A' OR 'B'                         15540000
155500        MOVE 'A'     TO WORK-HRG2.                                15550000
155600                                                                  15560000
155700     IF HHA-CLINICAL-SEV-EQ1 = 'C' OR 'D'                         15570000
155800        MOVE 'B'     TO WORK-HRG2.                                15580000
155900                                                                  15590000
156000     IF HHA-CLINICAL-SEV-EQ1 = 'E' OR 'F' OR 'G' OR 'H' OR        15600000
156100                               'I' OR 'J' OR 'K' OR               15610000
156200                               'L' OR 'M' OR 'N' OR 'O' OR        15620000
156300                 'P' OR 'Q' OR 'R' OR 'S' OR 'T' OR 'U' OR        15630000
156400                 'V' OR 'W' OR 'X' OR 'Y' OR 'Z'                  15640000
156500        MOVE 'C'     TO WORK-HRG2.                                15650000
156600                                                                  15660000
156700     IF HHA-FUNCTION-SEV-EQ1 = 'A' OR 'B' OR 'C' OR 'D' OR 'E'    15670000
156800                            OR 'F' OR 'G' OR 'H' OR 'I' OR 'J'    15680000
156900                            OR 'K' OR 'L' OR 'M' OR 'N'           15690000
157000        MOVE 'F'     TO WORK-HRG3.                                15700000
157100                                                                  15710000
157200     IF HHA-FUNCTION-SEV-EQ1 = 'O'                                15720000
157300        MOVE 'G'     TO WORK-HRG3.                                15730000
157400                                                                  15740000
157500     IF HHA-FUNCTION-SEV-EQ1 = 'P' OR 'Q' OR 'R' OR 'S' OR        15750000
157600                               'T' OR 'U' OR 'V' OR               15760000
157700                               'W' OR 'X' OR 'Y' OR 'Z'           15770000
157800        MOVE 'H'     TO WORK-HRG3.                                15780000
157900                                                                  15790000
158000 2315-RECORD-HRG1-1-2017-EXIT.                                    15800000
158100     EXIT.                                                        15810000
158110                                                                  15811000
158120 2315-RECODE-HRG1-1-2018.                                         15812000
158130                                                                  15813000
158140     IF HHA-CLINICAL-SEV-EQ1 = 'A' OR 'B'                         15814000
158150        MOVE 'A'     TO WORK-HRG2.                                15815000
158160                                                                  15816000
158170     IF HHA-CLINICAL-SEV-EQ1 = 'C' OR 'D'                         15817000
158180        MOVE 'B'     TO WORK-HRG2.                                15818000
158190                                                                  15819000
158191     IF HHA-CLINICAL-SEV-EQ1 = 'E' OR 'F' OR 'G' OR 'H' OR        15819100
158192                               'I' OR 'J' OR 'K' OR               15819200
158193                               'L' OR 'M' OR 'N' OR 'O' OR        15819300
158194                 'P' OR 'Q' OR 'R' OR 'S' OR 'T' OR 'U' OR        15819400
158195                 'V' OR 'W' OR 'X' OR 'Y' OR 'Z'                  15819500
158196        MOVE 'C'     TO WORK-HRG2.                                15819600
158197                                                                  15819700
158198     IF HHA-FUNCTION-SEV-EQ1 = 'A' OR 'B' OR 'C' OR 'D' OR 'E'    15819800
158199                            OR 'F' OR 'G' OR 'H' OR 'I' OR 'J'    15819900
158200                            OR 'K' OR 'L' OR 'M' OR 'N'           15820000
158201        MOVE 'F'     TO WORK-HRG3.                                15820100
158202                                                                  15820200
158203     IF HHA-FUNCTION-SEV-EQ1 = 'O'                                15820300
158204        MOVE 'G'     TO WORK-HRG3.                                15820400
158205                                                                  15820500
158206     IF HHA-FUNCTION-SEV-EQ1 = 'P' OR 'Q' OR 'R' OR 'S' OR        15820600
158207                               'T' OR 'U' OR 'V' OR               15820700
158208                               'W' OR 'X' OR 'Y' OR 'Z'           15820800
158209        MOVE 'H'     TO WORK-HRG3.                                15820900
158210                                                                  15821000
158211 2315-RECORD-HRG1-1-2018-EXIT.                                    15821100
158212     EXIT.                                                        15821200
158213                                                                  15821300
158214 2315-RECODE-HRG1-1-2019.                                         15821400
158215*    CY2019 UPDATED.                                              15821500
158216                                                                  15821600
158217     IF HHA-CLINICAL-SEV-EQ1 = 'A' OR 'B'                         15821700
158218        MOVE 'A'     TO WORK-HRG2.                                15821800
158219                                                                  15821900
158220     IF HHA-CLINICAL-SEV-EQ1 = 'C' OR 'D'                         15822000
158221        MOVE 'B'     TO WORK-HRG2.                                15822100
158222                                                                  15822200
158223     IF HHA-CLINICAL-SEV-EQ1 = 'E' OR 'F' OR 'G' OR 'H' OR        15822300
158224                               'I' OR 'J' OR 'K' OR               15822400
158225                               'L' OR 'M' OR 'N' OR 'O' OR        15822500
158226                 'P' OR 'Q' OR 'R' OR 'S' OR 'T' OR 'U' OR        15822600
158227                 'V' OR 'W' OR 'X' OR 'Y' OR 'Z'                  15822700
158228        MOVE 'C'     TO WORK-HRG2.                                15822800
158229                                                                  15822900
158230     IF HHA-FUNCTION-SEV-EQ1 = 'A' OR 'B' OR 'C' OR 'D' OR 'E'    15823000
158231                            OR 'F' OR 'G' OR 'H' OR 'I' OR 'J'    15823100
158232                            OR 'K' OR 'L' OR 'M'                  15823200
158233        MOVE 'F'     TO WORK-HRG3.                                15823300
158234                                                                  15823400
158235     IF HHA-FUNCTION-SEV-EQ1 = 'N'                                15823500
158236        MOVE 'G'     TO WORK-HRG3.                                15823600
158237                                                                  15823700
158238     IF HHA-FUNCTION-SEV-EQ1 = 'O' OR 'P' OR 'Q' OR 'R' OR        15823800
158239                               'S' OR 'T' OR 'U' OR 'V' OR        15823900
158240                               'W' OR 'X' OR 'Y' OR 'Z'           15824000
158241        MOVE 'H'     TO WORK-HRG3.                                15824100
158242                                                                  15824200
158243 2315-RECORD-HRG1-1-2019-EXIT.                                    15824300
158244     EXIT.                                                        15824400
158250                                                                  15825000
158300 2320-RECODE-HRG1-2.                                              15830000
158400                                                                  15840000
158500     IF HHA-SERV-THRU-DATE < 20150101                             15850000
158600        PERFORM 2320-RECODE-HRG1-2-2014                           15860000
158700           THRU 2320-RECORD-HRG1-2-2014-EXIT                      15870000
158800     ELSE                                                         15880000
158900     IF HHA-SERV-THRU-DATE < 20160101                             15890000
159000        PERFORM 2320-RECODE-HRG1-2-2015                           15900000
159100           THRU 2320-RECORD-HRG1-2-2015-EXIT                      15910000
159200     ELSE                                                         15920000
159300     IF HHA-SERV-THRU-DATE < 20170101                             15930000
159400        PERFORM 2320-RECODE-HRG1-2-2016                           15940000
159500           THRU 2320-RECORD-HRG1-2-2016-EXIT                      15950000
159600     ELSE                                                         15960000
159700     IF HHA-SERV-THRU-DATE < 20180101                             15970000
159800        PERFORM 2320-RECODE-HRG1-2-2017                           15980000
159900           THRU 2320-RECORD-HRG1-2-2017-EXIT                      15990000
159910     ELSE                                                         15991000
159920     IF HHA-SERV-THRU-DATE < 20190101                             15992000
159930        PERFORM 2320-RECODE-HRG1-2-2018                           15993000
159940           THRU 2320-RECORD-HRG1-2-2018-EXIT                      15994000
159950     ELSE                                                         15995000
159960     IF HHA-SERV-THRU-DATE < 20200301                             15996000
159970        PERFORM 2320-RECODE-HRG1-2-2019                           15997000
159980           THRU 2320-RECORD-HRG1-2-2019-EXIT                      15998000
160000     END-IF.                                                      16000000
160100                                                                  16010000
160200     PERFORM 2430-RECODE-HRG4-1  THRU 2430-EXIT.                  16020000
160300                                                                  16030000
160400 2320-EXIT.                                                       16040000
160500     EXIT.                                                        16050000
160600                                                                  16060000
160700 2320-RECODE-HRG1-2-2014.                                         16070000
160800                                                                  16080000
160900     IF HHA-CLINICAL-SEV-EQ2 = 'A' OR 'B' OR 'C' OR 'D' OR        16090000
161000                               'E' OR 'F'                         16100000
161100        MOVE 'A'     TO WORK-HRG2.                                16110000
161200                                                                  16120000
161300     IF HHA-CLINICAL-SEV-EQ2 = 'G' OR 'H' OR                      16130000
161400                               'I' OR 'J' OR 'K' OR 'L' OR        16140000
161500                               'M' OR 'N'                         16150000
161600        MOVE 'B'     TO WORK-HRG2.                                16160000
161700                                                                  16170000
161800     IF HHA-CLINICAL-SEV-EQ2 = 'O' OR 'P' OR 'Q' OR 'R' OR        16180000
161900                               'S' OR 'T' OR 'U' OR               16190000
162000                               'V' OR 'W' OR 'X' OR 'Y' OR 'Z'    16200000
162100        MOVE 'C'     TO WORK-HRG2.                                16210000
162200                                                                  16220000
162300     IF HHA-FUNCTION-SEV-EQ2 = 'A' OR 'B' OR 'C' OR 'D' OR        16230000
162400                               'E' OR 'F'                         16240000
162500        MOVE 'F'     TO WORK-HRG3.                                16250000
162600                                                                  16260000
162700     IF HHA-FUNCTION-SEV-EQ2 = 'G'                                16270000
162800        MOVE 'G'     TO WORK-HRG3.                                16280000
162900                                                                  16290000
163000     IF HHA-FUNCTION-SEV-EQ2 =     'H' OR 'I' OR                  16300000
163100                  'J' OR 'K' OR 'L' OR 'M' OR 'N' OR 'O' OR       16310000
163200                  'P' OR 'Q' OR 'R' OR 'S' OR 'T' OR 'U' OR       16320000
163300                  'V' OR 'W' OR 'X' OR 'Y' OR 'Z'                 16330000
163400        MOVE 'H'     TO WORK-HRG3.                                16340000
163500                                                                  16350000
163600 2320-RECORD-HRG1-2-2014-EXIT.                                    16360000
163700     EXIT.                                                        16370000
163800                                                                  16380000
163900 2320-RECODE-HRG1-2-2015.                                         16390000
164000                                                                  16400000
164100     IF HHA-CLINICAL-SEV-EQ2 = 'A' OR 'B'                         16410000
164200        MOVE 'A'     TO WORK-HRG2.                                16420000
164300                                                                  16430000
164400     IF HHA-CLINICAL-SEV-EQ2 = 'C' OR 'D' OR 'E' OR               16440000
164500                               'F' OR 'G' OR 'H'                  16450000
164600        MOVE 'B'     TO WORK-HRG2.                                16460000
164700                                                                  16470000
164800     IF HHA-CLINICAL-SEV-EQ2 = 'I' OR 'J' OR 'K' OR 'L' OR        16480000
164900                               'M' OR 'N' OR                      16490000
165000                               'O' OR 'P' OR 'Q' OR 'R' OR        16500000
165100                               'S' OR 'T' OR 'U' OR               16510000
165200                               'V' OR 'W' OR 'X' OR 'Y' OR 'Z'    16520000
165300        MOVE 'C'     TO WORK-HRG2.                                16530000
165400                                                                  16540000
165500     IF HHA-FUNCTION-SEV-EQ2 = 'A' OR 'B' OR 'C' OR 'D'           16550000
165600        MOVE 'F'     TO WORK-HRG3.                                16560000
165700                                                                  16570000
165800     IF HHA-FUNCTION-SEV-EQ2 = 'E' OR 'F' OR 'G' OR               16580000
165900                               'H' OR 'I' OR                      16590000
166000                               'J' OR 'K' OR 'L' OR 'M' OR 'N'    16600000
166100        MOVE 'G'     TO WORK-HRG3.                                16610000
166200                                                                  16620000
166300     IF HHA-FUNCTION-SEV-EQ2 =     'O' OR                         16630000
166400                                'P' OR 'Q' OR 'R' OR              16640000
166500                                'S' OR 'T' OR 'U' OR              16650000
166600                                'V' OR 'W' OR 'X' OR 'Y' OR 'Z'   16660000
166700        MOVE 'H'     TO WORK-HRG3.                                16670000
166800                                                                  16680000
166900 2320-RECORD-HRG1-2-2015-EXIT.                                    16690000
167000     EXIT.                                                        16700000
167100                                                                  16710000
167200 2320-RECODE-HRG1-2-2016.                                         16720000
167300                                                                  16730000
167400     IF HHA-CLINICAL-SEV-EQ2 = 'A' OR 'B'                         16740000
167500        MOVE 'A'     TO WORK-HRG2.                                16750000
167600                                                                  16760000
167700     IF HHA-CLINICAL-SEV-EQ2 = 'C' OR 'D' OR 'E' OR               16770000
167800                               'F' OR 'G' OR 'H'                  16780000
167900        MOVE 'B'     TO WORK-HRG2.                                16790000
168000                                                                  16800000
168100     IF HHA-CLINICAL-SEV-EQ2 = 'I' OR 'J' OR 'K' OR 'L' OR        16810000
168200                               'M' OR 'N' OR                      16820000
168300                               'O' OR 'P' OR 'Q' OR 'R' OR        16830000
168400                               'S' OR 'T' OR 'U' OR               16840000
168500                               'V' OR 'W' OR 'X' OR 'Y' OR 'Z'    16850000
168600        MOVE 'C'     TO WORK-HRG2.                                16860000
168700                                                                  16870000
168800     IF HHA-FUNCTION-SEV-EQ2 = 'A' OR 'B' OR 'C' OR 'D' OR        16880000
168900                               'E' OR 'F' OR 'G'                  16890000
169000        MOVE 'F'     TO WORK-HRG3.                                16900000
169100                                                                  16910000
169200     IF HHA-FUNCTION-SEV-EQ2 = 'H' OR 'I' OR                      16920000
169300                               'J' OR 'K' OR 'L' OR 'M' OR 'N'    16930000
169400        MOVE 'G'     TO WORK-HRG3.                                16940000
169500                                                                  16950000
169600     IF HHA-FUNCTION-SEV-EQ2 =  'O' OR                            16960000
169700                                'P' OR 'Q' OR 'R' OR              16970000
169800                                'S' OR 'T' OR 'U' OR              16980000
169900                                'V' OR 'W' OR 'X' OR 'Y' OR 'Z'   16990000
170000        MOVE 'H'     TO WORK-HRG3.                                17000000
170100                                                                  17010000
170200 2320-RECORD-HRG1-2-2016-EXIT.                                    17020000
170300     EXIT.                                                        17030000
170400                                                                  17040000
170500 2320-RECODE-HRG1-2-2017.                                         17050000
170600                                                                  17060000
170700     IF HHA-CLINICAL-SEV-EQ2 = 'A' OR 'B'                         17070000
170800        MOVE 'A'     TO WORK-HRG2.                                17080000
170900                                                                  17090000
171000     IF HHA-CLINICAL-SEV-EQ2 = 'C' OR 'D' OR 'E' OR               17100000
171100                               'F' OR 'G' OR 'H'                  17110000
171200        MOVE 'B'     TO WORK-HRG2.                                17120000
171300                                                                  17130000
171400     IF HHA-CLINICAL-SEV-EQ2 = 'I' OR 'J' OR 'K' OR 'L' OR        17140000
171500                               'M' OR 'N' OR                      17150000
171600                               'O' OR 'P' OR 'Q' OR 'R' OR        17160000
171700                               'S' OR 'T' OR 'U' OR               17170000
171800                               'V' OR 'W' OR 'X' OR 'Y' OR 'Z'    17180000
171900        MOVE 'C'     TO WORK-HRG2.                                17190000
172000                                                                  17200000
172100     IF HHA-FUNCTION-SEV-EQ2 = 'A' OR 'B' OR 'C' OR 'D' OR        17210000
172200                               'E' OR 'F' OR 'G'                  17220000
172300        MOVE 'F'     TO WORK-HRG3.                                17230000
172400                                                                  17240000
172500     IF HHA-FUNCTION-SEV-EQ2 = 'H' OR 'I' OR                      17250000
172600                               'J' OR 'K' OR 'L' OR 'M' OR 'N'    17260000
172700        MOVE 'G'     TO WORK-HRG3.                                17270000
172800                                                                  17280000
172900     IF HHA-FUNCTION-SEV-EQ2 =  'O' OR                            17290000
173000                                'P' OR 'Q' OR 'R' OR              17300000
173100                                'S' OR 'T' OR 'U' OR              17310000
173200                                'V' OR 'W' OR 'X' OR 'Y' OR 'Z'   17320000
173300        MOVE 'H'     TO WORK-HRG3.                                17330000
173400                                                                  17340000
173500 2320-RECORD-HRG1-2-2017-EXIT.                                    17350000
173600     EXIT.                                                        17360000
173610                                                                  17361000
173620 2320-RECODE-HRG1-2-2018.                                         17362000
173630                                                                  17363000
173640     IF HHA-CLINICAL-SEV-EQ2 = 'A' OR 'B'                         17364000
173650        MOVE 'A'     TO WORK-HRG2.                                17365000
173660                                                                  17366000
173670     IF HHA-CLINICAL-SEV-EQ2 = 'C' OR 'D' OR 'E' OR               17367000
173680                               'F' OR 'G' OR 'H'                  17368000
173690        MOVE 'B'     TO WORK-HRG2.                                17369000
173691                                                                  17369100
173692     IF HHA-CLINICAL-SEV-EQ2 = 'I' OR 'J' OR 'K' OR 'L' OR        17369200
173693                               'M' OR 'N' OR                      17369300
173694                               'O' OR 'P' OR 'Q' OR 'R' OR        17369400
173695                               'S' OR 'T' OR 'U' OR               17369500
173696                               'V' OR 'W' OR 'X' OR 'Y' OR 'Z'    17369600
173697        MOVE 'C'     TO WORK-HRG2.                                17369700
173698                                                                  17369800
173699* V180 UPDATED                                                    17369900
173700                                                                  17370000
173701**   IF HHA-FUNCTION-SEV-EQ2 = 'A' OR 'B' OR 'C' OR 'D' OR        17370100
173702**                             'E' OR 'F' OR 'G'                  17370200
173703**      MOVE 'F'     TO WORK-HRG3.                                17370300
173704                                                                  17370400
173705     IF HHA-FUNCTION-SEV-EQ2 = 'A' OR 'B' OR 'C' OR 'D' OR        17370500
173706                               'E' OR 'F' OR 'G' OR 'H'           17370600
173707        MOVE 'F'     TO WORK-HRG3.                                17370700
173708                                                                  17370800
173709**   IF HHA-FUNCTION-SEV-EQ2 = 'H' OR 'I' OR                      17370900
173710**                             'J' OR 'K' OR 'L' OR 'M' OR 'N'    17371000
173711**      MOVE 'G'     TO WORK-HRG3.                                17371100
173712                                                                  17371200
173713     IF HHA-FUNCTION-SEV-EQ2 = 'I' OR 'J' OR                      17371300
173714                               'K' OR 'L' OR 'M' OR 'N' OR        17371400
173715                               'O' OR 'P'                         17371500
173716        MOVE 'G'     TO WORK-HRG3.                                17371600
173717                                                                  17371700
173718**   IF HHA-FUNCTION-SEV-EQ2 =  'O' OR                            17371800
173719**                              'P' OR 'Q' OR 'R' OR              17371900
173720**                              'S' OR 'T' OR 'U' OR              17372000
173721**                              'V' OR 'W' OR 'X' OR 'Y' OR 'Z'   17372100
173722**      MOVE 'H'     TO WORK-HRG3.                                17372200
173723                                                                  17372300
173725     IF HHA-FUNCTION-SEV-EQ2 =  'Q' OR 'R' OR                     17372500
173726                                'S' OR 'T' OR 'U' OR              17372600
173727                                'V' OR 'W' OR 'X' OR 'Y' OR 'Z'   17372700
173728        MOVE 'H'     TO WORK-HRG3.                                17372800
173729                                                                  17372900
173730 2320-RECORD-HRG1-2-2018-EXIT.                                    17373000
173731     EXIT.                                                        17373100
173732                                                                  17373200
173733 2320-RECODE-HRG1-2-2019.                                         17373300
173734*    CY2019 UPDATED.                                              17373400
173735                                                                  17373500
173736     IF HHA-CLINICAL-SEV-EQ2 = 'A' OR 'B'                         17373600
173737        MOVE 'A'     TO WORK-HRG2.                                17373700
173738                                                                  17373800
173739     IF HHA-CLINICAL-SEV-EQ2 = 'C' OR 'D' OR 'E' OR               17373900
173740                               'F' OR 'G' OR 'H'                  17374000
173741        MOVE 'B'     TO WORK-HRG2.                                17374100
173742                                                                  17374200
173743     IF HHA-CLINICAL-SEV-EQ2 = 'I' OR 'J' OR 'K' OR 'L' OR        17374300
173744                               'M' OR 'N' OR                      17374400
173745                               'O' OR 'P' OR 'Q' OR 'R' OR        17374500
173746                               'S' OR 'T' OR 'U' OR               17374600
173747                               'V' OR 'W' OR 'X' OR 'Y' OR 'Z'    17374700
173748        MOVE 'C'     TO WORK-HRG2.                                17374800
173749                                                                  17374900
173754                                                                  17375400
173755     IF HHA-FUNCTION-SEV-EQ2 = 'A' OR 'B' OR 'C' OR 'D' OR        17375500
173756                               'E' OR 'F' OR 'G' OR 'H'           17375600
173757        MOVE 'F'     TO WORK-HRG3.                                17375700
173758                                                                  17375800
173762                                                                  17376200
173763     IF HHA-FUNCTION-SEV-EQ2 = 'I' OR 'J' OR                      17376300
173764                               'K' OR 'L' OR 'M'                  17376400
173766        MOVE 'G'     TO WORK-HRG3.                                17376600
173767                                                                  17376700
173773                                                                  17377300
173774     IF HHA-FUNCTION-SEV-EQ2 =  'N' OR 'O' OR 'P' OR 'Q' OR       17377400
173775                                'R' OR 'S' OR 'T' OR 'U' OR       17377500
173776                                'V' OR 'W' OR 'X' OR 'Y' OR 'Z'   17377600
173777        MOVE 'H'     TO WORK-HRG3.                                17377700
173778                                                                  17377800
173779 2320-RECORD-HRG1-2-2019-EXIT.                                    17377900
173780     EXIT.                                                        17378000
173790                                                                  17379000
173800 2325-RECODE-HRG1-3.                                              17380000
173900                                                                  17390000
174000     IF HHA-SERV-THRU-DATE < 20150101                             17400000
174100        PERFORM 2325-RECODE-HRG1-3-2014                           17410000
174200           THRU 2325-RECORD-HRG1-3-2014-EXIT                      17420000
174300     ELSE                                                         17430000
174400     IF HHA-SERV-THRU-DATE < 20160101                             17440000
174500        PERFORM 2325-RECODE-HRG1-3-2015                           17450000
174600           THRU 2325-RECORD-HRG1-3-2015-EXIT                      17460000
174700     ELSE                                                         17470000
174800     IF HHA-SERV-THRU-DATE < 20170101                             17480000
174900        PERFORM 2325-RECODE-HRG1-3-2016                           17490000
175000           THRU 2325-RECORD-HRG1-3-2016-EXIT                      17500000
175100     ELSE                                                         17510000
175200     IF HHA-SERV-THRU-DATE < 20180101                             17520000
175300        PERFORM 2325-RECODE-HRG1-3-2017                           17530000
175400           THRU 2325-RECORD-HRG1-3-2017-EXIT                      17540000
175410     ELSE                                                         17541000
175420     IF HHA-SERV-THRU-DATE < 20190101                             17542000
175430        PERFORM 2325-RECODE-HRG1-3-2018                           17543000
175440           THRU 2325-RECORD-HRG1-3-2018-EXIT                      17544000
175450     ELSE                                                         17545000
175460     IF HHA-SERV-THRU-DATE < 20200301                             17546000
175470        PERFORM 2325-RECODE-HRG1-3-2019                           17547000
175480           THRU 2325-RECORD-HRG1-3-2019-EXIT                      17548000
175500     END-IF.                                                      17550000
175600                                                                  17560000
175700     PERFORM 2430-RECODE-HRG4-1 THRU 2430-EXIT.                   17570000
175800                                                                  17580000
175900 2325-EXIT.                                                       17590000
176000     EXIT.                                                        17600000
176100                                                                  17610000
176200 2325-RECODE-HRG1-3-2014.                                         17620000
176300                                                                  17630000
176400     IF HHA-CLINICAL-SEV-EQ3 = 'A' OR 'B'                         17640000
176500        MOVE 'A'     TO WORK-HRG2.                                17650000
176600                                                                  17660000
176700     IF HHA-CLINICAL-SEV-EQ3 = 'C' OR 'D' OR 'E'                  17670000
176800        MOVE 'B'     TO WORK-HRG2.                                17680000
176900                                                                  17690000
177000     IF HHA-CLINICAL-SEV-EQ3 = 'F' OR 'G' OR 'H' OR               17700000
177100                               'I' OR 'J' OR 'K' OR 'L' OR        17710000
177200                               'M' OR 'N' OR 'O' OR               17720000
177300                 'P' OR 'Q' OR 'R' OR 'S' OR 'T' OR 'U' OR        17730000
177400                 'V' OR 'W' OR 'X' OR 'Y' OR 'Z'                  17740000
177500        MOVE 'C'     TO WORK-HRG2.                                17750000
177600                                                                  17760000
177700     IF HHA-FUNCTION-SEV-EQ3 = 'A' OR 'B' OR 'C' OR 'D' OR        17770000
177800                               'E' OR 'F' OR 'G' OR 'H'           17780000
177900        MOVE 'F'     TO WORK-HRG3.                                17790000
178000                                                                  17800000
178100     IF HHA-FUNCTION-SEV-EQ3 = 'I'                                17810000
178200        MOVE 'G'     TO WORK-HRG3.                                17820000
178300                                                                  17830000
178400     IF HHA-FUNCTION-SEV-EQ3 =     'J' OR 'K' OR                  17840000
178500                                'L' OR 'M' OR 'N' OR 'O' OR       17850000
178600                  'P' OR 'Q' OR 'R' OR 'S' OR 'T' OR 'U' OR       17860000
178700                  'V' OR 'W' OR 'X' OR 'Y' OR 'Z'                 17870000
178800        MOVE 'H'     TO WORK-HRG3.                                17880000
178900                                                                  17890000
179000 2325-RECORD-HRG1-3-2014-EXIT.                                    17900000
179100     EXIT.                                                        17910000
179200                                                                  17920000
179300 2325-RECODE-HRG1-3-2015.                                         17930000
179400                                                                  17940000
179500     IF HHA-CLINICAL-SEV-EQ3 = 'A'                                17950000
179600        MOVE 'A'     TO WORK-HRG2.                                17960000
179700                                                                  17970000
179800     IF HHA-CLINICAL-SEV-EQ3 = 'B'                                17980000
179900        MOVE 'B'     TO WORK-HRG2.                                17990000
180000                                                                  18000000
180100     IF HHA-CLINICAL-SEV-EQ3 = 'C' OR 'D' OR 'E' OR               18010000
180200                               'F' OR 'G' OR 'H' OR               18020000
180300                               'I' OR 'J' OR 'K' OR 'L' OR        18030000
180400                               'M' OR 'N' OR 'O' OR               18040000
180500                 'P' OR 'Q' OR 'R' OR 'S' OR 'T' OR 'U' OR        18050000
180600                 'V' OR 'W' OR 'X' OR 'Y' OR 'Z'                  18060000
180700        MOVE 'C'     TO WORK-HRG2.                                18070000
180800                                                                  18080000
180900     IF HHA-FUNCTION-SEV-EQ3 = 'A' OR 'B' OR 'C' OR 'D' OR        18090000
181000                               'E' OR 'F' OR 'G' OR 'H' OR        18100000
181100                               'I' OR 'J'                         18110000
181200        MOVE 'F'     TO WORK-HRG3.                                18120000
181300                                                                  18130000
181400     IF HHA-FUNCTION-SEV-EQ3 = 'K'                                18140000
181500        MOVE 'G'     TO WORK-HRG3.                                18150000
181600                                                                  18160000
181700     IF HHA-FUNCTION-SEV-EQ3 = 'L' OR 'M' OR 'N' OR 'O' OR        18170000
181800                               'P' OR 'Q' OR                      18180000
181900                               'R' OR 'S' OR 'T' OR 'U' OR        18190000
182000                               'V' OR 'W' OR 'X' OR 'Y' OR 'Z'    18200000
182100        MOVE 'H'     TO WORK-HRG3.                                18210000
182200                                                                  18220000
182300 2325-RECORD-HRG1-3-2015-EXIT.                                    18230000
182400     EXIT.                                                        18240000
182500                                                                  18250000
182600 2325-RECODE-HRG1-3-2016.                                         18260000
182700                                                                  18270000
182800     IF HHA-CLINICAL-SEV-EQ3 = 'A'                                18280000
182900        MOVE 'A'     TO WORK-HRG2.                                18290000
183000                                                                  18300000
183100     IF HHA-CLINICAL-SEV-EQ3 = 'B'                                18310000
183200        MOVE 'B'     TO WORK-HRG2.                                18320000
183300                                                                  18330000
183400     IF HHA-CLINICAL-SEV-EQ3 = 'C' OR 'D' OR 'E' OR               18340000
183500                               'F' OR 'G' OR 'H' OR               18350000
183600                               'I' OR 'J' OR 'K' OR 'L' OR        18360000
183700                               'M' OR 'N' OR 'O' OR               18370000
183800                 'P' OR 'Q' OR 'R' OR 'S' OR 'T' OR 'U' OR        18380000
183900                 'V' OR 'W' OR 'X' OR 'Y' OR 'Z'                  18390000
184000        MOVE 'C'     TO WORK-HRG2.                                18400000
184100                                                                  18410000
184200     IF HHA-FUNCTION-SEV-EQ3 = 'A' OR 'B' OR 'C' OR 'D' OR        18420000
184300                               'E' OR 'F' OR 'G'                  18430000
184400        MOVE 'F'     TO WORK-HRG3.                                18440000
184500                                                                  18450000
184600     IF HHA-FUNCTION-SEV-EQ3 = 'H' OR 'I' OR 'J' OR 'K'           18460000
184700        MOVE 'G'     TO WORK-HRG3.                                18470000
184800                                                                  18480000
184900     IF HHA-FUNCTION-SEV-EQ3 = 'L' OR 'M' OR 'N' OR 'O' OR        18490000
185000                               'P' OR 'Q' OR                      18500000
185100                               'R' OR 'S' OR 'T' OR 'U' OR        18510000
185200                               'V' OR 'W' OR 'X' OR 'Y' OR 'Z'    18520000
185300        MOVE 'H'     TO WORK-HRG3.                                18530000
185400                                                                  18540000
185500 2325-RECORD-HRG1-3-2016-EXIT.                                    18550000
185600     EXIT.                                                        18560000
185700                                                                  18570000
185800 2325-RECODE-HRG1-3-2017.                                         18580000
185900                                                                  18590000
186000     IF HHA-CLINICAL-SEV-EQ3 = 'A' OR 'B'                         18600000
186100        MOVE 'A'     TO WORK-HRG2.                                18610000
186200                                                                  18620000
186300     IF HHA-CLINICAL-SEV-EQ3 = 'C'                                18630000
186400        MOVE 'B'     TO WORK-HRG2.                                18640000
186500                                                                  18650000
186600     IF HHA-CLINICAL-SEV-EQ3 = 'D' OR 'E' OR                      18660000
186700                               'F' OR 'G' OR 'H' OR               18670000
186800                               'I' OR 'J' OR 'K' OR 'L' OR        18680000
186900                               'M' OR 'N' OR 'O' OR               18690000
187000                 'P' OR 'Q' OR 'R' OR 'S' OR 'T' OR 'U' OR        18700000
187100                 'V' OR 'W' OR 'X' OR 'Y' OR 'Z'                  18710000
187200        MOVE 'C'     TO WORK-HRG2.                                18720000
187300                                                                  18730000
187400     IF HHA-FUNCTION-SEV-EQ3 = 'A' OR 'B' OR 'C' OR 'D' OR        18740000
187500                               'E' OR 'F' OR 'G'                  18750000
187600        MOVE 'F'     TO WORK-HRG3.                                18760000
187700                                                                  18770000
187800     IF HHA-FUNCTION-SEV-EQ3 = 'H' OR 'I' OR 'J' OR 'K'           18780000
187900        MOVE 'G'     TO WORK-HRG3.                                18790000
188000                                                                  18800000
188100     IF HHA-FUNCTION-SEV-EQ3 = 'L' OR 'M' OR 'N' OR 'O' OR        18810000
188200                               'P' OR 'Q' OR                      18820000
188300                               'R' OR 'S' OR 'T' OR 'U' OR        18830000
188400                               'V' OR 'W' OR 'X' OR 'Y' OR 'Z'    18840000
188500        MOVE 'H'     TO WORK-HRG3.                                18850000
188600                                                                  18860000
188700 2325-RECORD-HRG1-3-2017-EXIT.                                    18870000
188800     EXIT.                                                        18880000
188810                                                                  18881000
188820 2325-RECODE-HRG1-3-2018.                                         18882000
188830                                                                  18883000
188840     IF HHA-CLINICAL-SEV-EQ3 = 'A' OR 'B'                         18884000
188850        MOVE 'A'     TO WORK-HRG2.                                18885000
188860                                                                  18886000
188870     IF HHA-CLINICAL-SEV-EQ3 = 'C'                                18887000
188880        MOVE 'B'     TO WORK-HRG2.                                18888000
188890                                                                  18889000
188891     IF HHA-CLINICAL-SEV-EQ3 = 'D' OR 'E' OR                      18889100
188892                               'F' OR 'G' OR 'H' OR               18889200
188893                               'I' OR 'J' OR 'K' OR 'L' OR        18889300
188894                               'M' OR 'N' OR 'O' OR               18889400
188895                 'P' OR 'Q' OR 'R' OR 'S' OR 'T' OR 'U' OR        18889500
188896                 'V' OR 'W' OR 'X' OR 'Y' OR 'Z'                  18889600
188897        MOVE 'C'     TO WORK-HRG2.                                18889700
188898                                                                  18889800
188899     IF HHA-FUNCTION-SEV-EQ3 = 'A' OR 'B' OR 'C' OR 'D' OR        18889900
188900                               'E' OR 'F' OR 'G'                  18890000
188901        MOVE 'F'     TO WORK-HRG3.                                18890100
188902                                                                  18890200
188903     IF HHA-FUNCTION-SEV-EQ3 = 'H' OR 'I' OR 'J' OR 'K'           18890300
188904        MOVE 'G'     TO WORK-HRG3.                                18890400
188905                                                                  18890500
188906     IF HHA-FUNCTION-SEV-EQ3 = 'L' OR 'M' OR 'N' OR 'O' OR        18890600
188907                               'P' OR 'Q' OR                      18890700
188908                               'R' OR 'S' OR 'T' OR 'U' OR        18890800
188909                               'V' OR 'W' OR 'X' OR 'Y' OR 'Z'    18890900
188910        MOVE 'H'     TO WORK-HRG3.                                18891000
188911                                                                  18891100
188912 2325-RECORD-HRG1-3-2018-EXIT.                                    18891200
188913     EXIT.                                                        18891300
188914                                                                  18891400
188915 2325-RECODE-HRG1-3-2019.                                         18891500
188917                                                                  18891700
188918     IF HHA-CLINICAL-SEV-EQ3 = 'A' OR 'B'                         18891800
188919        MOVE 'A'     TO WORK-HRG2.                                18891900
188920                                                                  18892000
188921     IF HHA-CLINICAL-SEV-EQ3 = 'C'                                18892100
188922        MOVE 'B'     TO WORK-HRG2.                                18892200
188923                                                                  18892300
188924     IF HHA-CLINICAL-SEV-EQ3 = 'D' OR 'E' OR                      18892400
188925                               'F' OR 'G' OR 'H' OR               18892500
188926                               'I' OR 'J' OR 'K' OR 'L' OR        18892600
188927                               'M' OR 'N' OR 'O' OR               18892700
188928                 'P' OR 'Q' OR 'R' OR 'S' OR 'T' OR 'U' OR        18892800
188929                 'V' OR 'W' OR 'X' OR 'Y' OR 'Z'                  18892900
188930        MOVE 'C'     TO WORK-HRG2.                                18893000
188931                                                                  18893100
188932     IF HHA-FUNCTION-SEV-EQ3 = 'A' OR 'B' OR 'C' OR 'D' OR        18893200
188933                               'E' OR 'F' OR 'G'                  18893300
188934        MOVE 'F'     TO WORK-HRG3.                                18893400
188935                                                                  18893500
188936     IF HHA-FUNCTION-SEV-EQ3 = 'H' OR 'I' OR 'J' OR 'K'           18893600
188937        MOVE 'G'     TO WORK-HRG3.                                18893700
188938                                                                  18893800
188939     IF HHA-FUNCTION-SEV-EQ3 = 'L' OR 'M' OR 'N' OR 'O' OR        18893900
188940                               'P' OR 'Q' OR                      18894000
188941                               'R' OR 'S' OR 'T' OR 'U' OR        18894100
188942                               'V' OR 'W' OR 'X' OR 'Y' OR 'Z'    18894200
188943        MOVE 'H'     TO WORK-HRG3.                                18894300
188944                                                                  18894400
188945 2325-RECORD-HRG1-3-2019-EXIT.                                    18894500
188946     EXIT.                                                        18894600
188950                                                                  18895000
189000 2330-RECODE-HRG1-4.                                              18900000
189100                                                                  18910000
189200     IF HHA-SERV-THRU-DATE < 20150101                             18920000
189300        PERFORM 2330-RECODE-HRG1-4-2014                           18930000
189400           THRU 2330-RECORD-HRG1-4-2014-EXIT                      18940000
189500     ELSE                                                         18950000
189600     IF HHA-SERV-THRU-DATE < 20160101                             18960000
189700        PERFORM 2330-RECODE-HRG1-4-2015                           18970000
189800           THRU 2330-RECORD-HRG1-4-2015-EXIT                      18980000
189900     ELSE                                                         18990000
190000     IF HHA-SERV-THRU-DATE < 20170101                             19000000
190100        PERFORM 2330-RECODE-HRG1-4-2016                           19010000
190200           THRU 2330-RECORD-HRG1-4-2016-EXIT                      19020000
190300     ELSE                                                         19030000
190400     IF HHA-SERV-THRU-DATE < 20180101                             19040000
190500        PERFORM 2330-RECODE-HRG1-4-2017                           19050000
190600           THRU 2330-RECORD-HRG1-4-2017-EXIT                      19060000
190610     ELSE                                                         19061000
190620     IF HHA-SERV-THRU-DATE < 20190101                             19062000
190630        PERFORM 2330-RECODE-HRG1-4-2018                           19063000
190640           THRU 2330-RECORD-HRG1-4-2018-EXIT                      19064000
190650     ELSE                                                         19065000
190660     IF HHA-SERV-THRU-DATE < 20200301                             19066000
190670        PERFORM 2330-RECODE-HRG1-4-2019                           19067000
190680           THRU 2330-RECORD-HRG1-4-2019-EXIT                      19068000
190700     END-IF.                                                      19070000
190800                                                                  19080000
190900     PERFORM 2430-RECODE-HRG4-1 THRU 2430-EXIT.                   19090000
191000                                                                  19100000
191100 2330-EXIT.  EXIT.                                                19110000
191200                                                                  19120000
191300 2330-RECODE-HRG1-4-2014.                                         19130000
191400                                                                  19140000
191500     IF HHA-CLINICAL-SEV-EQ4 = 'A' OR 'B' OR 'C' OR 'D' OR        19150000
191600                               'E' OR 'F' OR 'G' OR 'H'           19160000
191700        MOVE 'A'     TO WORK-HRG2.                                19170000
191800                                                                  19180000
191900                                                                  19190000
192000     IF HHA-CLINICAL-SEV-EQ4 = 'I' OR 'J' OR 'K' OR 'L' OR        19200000
192100                               'M' OR 'N' OR 'O' OR 'P'           19210000
192200        MOVE 'B'     TO WORK-HRG2.                                19220000
192300                                                                  19230000
192400     IF HHA-CLINICAL-SEV-EQ4 = 'Q' OR 'R' OR 'S' OR               19240000
192500                               'T' OR 'U' OR                      19250000
192600                               'V' OR 'W' OR 'X' OR 'Y' OR 'Z'    19260000
192700        MOVE 'C'     TO WORK-HRG2.                                19270000
192800                                                                  19280000
192900     IF HHA-FUNCTION-SEV-EQ4 = 'A' OR 'B' OR 'C' OR 'D' OR        19290000
193000                               'E' OR 'F' OR 'G'                  19300000
193100        MOVE 'F'     TO WORK-HRG3.                                19310000
193200                                                                  19320000
193300     IF HHA-FUNCTION-SEV-EQ4 = 'H'                                19330000
193400        MOVE 'G'     TO WORK-HRG3.                                19340000
193500                                                                  19350000
193600     IF HHA-FUNCTION-SEV-EQ4 =     'I' OR 'J' OR 'K' OR           19360000
193700                                'L' OR 'M' OR 'N' OR 'O' OR       19370000
193800                  'P' OR 'Q' OR 'R' OR 'S' OR 'T' OR 'U' OR       19380000
193900                  'V' OR 'W' OR 'X' OR 'Y' OR 'Z'                 19390000
194000        MOVE 'H'     TO WORK-HRG3.                                19400000
194100                                                                  19410000
194200 2330-RECORD-HRG1-4-2014-EXIT.                                    19420000
194300     EXIT.                                                        19430000
194400                                                                  19440000
194500 2330-RECODE-HRG1-4-2015.                                         19450000
194600                                                                  19460000
194700     IF HHA-CLINICAL-SEV-EQ4 = 'A' OR 'B' OR 'C' OR 'D' OR        19470000
194800                               'E' OR 'F'                         19480000
194900        MOVE 'A'     TO WORK-HRG2.                                19490000
195000                                                                  19500000
195100                                                                  19510000
195200     IF HHA-CLINICAL-SEV-EQ4 = 'G' OR 'H' OR                      19520000
195300                               'I' OR 'J' OR 'K' OR 'L' OR        19530000
195400                               'M'                                19540000
195500        MOVE 'B'     TO WORK-HRG2.                                19550000
195600                                                                  19560000
195700     IF HHA-CLINICAL-SEV-EQ4 = 'N' OR 'O' OR 'P' OR               19570000
195800                               'Q' OR 'R' OR 'S' OR               19580000
195900                               'T' OR 'U' OR                      19590000
196000                               'V' OR 'W' OR 'X' OR 'Y' OR 'Z'    19600000
196100        MOVE 'C'     TO WORK-HRG2.                                19610000
196200                                                                  19620000
196300     IF HHA-FUNCTION-SEV-EQ4 = 'A'                                19630000
196400        MOVE 'F'     TO WORK-HRG3.                                19640000
196500                                                                  19650000
196600     IF HHA-FUNCTION-SEV-EQ4 = 'B' OR                             19660000
196700                               'C' OR 'D' OR 'E' OR               19670000
196800                               'F' OR 'G' OR 'H'                  19680000
196900        MOVE 'G'     TO WORK-HRG3.                                19690000
197000                                                                  19700000
197100     IF HHA-FUNCTION-SEV-EQ4 =     'I' OR 'J' OR 'K' OR           19710000
197200                                'L' OR 'M' OR 'N' OR 'O' OR       19720000
197300                  'P' OR 'Q' OR 'R' OR 'S' OR 'T' OR 'U' OR       19730000
197400                  'V' OR 'W' OR 'X' OR 'Y' OR 'Z'                 19740000
197500        MOVE 'H'     TO WORK-HRG3.                                19750000
197600                                                                  19760000
197700 2330-RECORD-HRG1-4-2015-EXIT.                                    19770000
197800     EXIT.                                                        19780000
197900                                                                  19790000
198000 2330-RECODE-HRG1-4-2016.                                         19800000
198100                                                                  19810000
198200     IF HHA-CLINICAL-SEV-EQ4 = 'A' OR 'B' OR 'C' OR 'D'           19820000
198300        MOVE 'A'     TO WORK-HRG2.                                19830000
198400                                                                  19840000
198500     IF HHA-CLINICAL-SEV-EQ4 = 'E' OR 'F' OR 'G' OR 'H' OR        19850000
198600                               'I' OR 'J' OR 'K' OR 'L' OR        19860000
198700                               'M'                                19870000
198800        MOVE 'B'     TO WORK-HRG2.                                19880000
198900                                                                  19890000
199000     IF HHA-CLINICAL-SEV-EQ4 = 'N' OR 'O' OR 'P' OR               19900000
199100                               'Q' OR 'R' OR 'S' OR               19910000
199200                               'T' OR 'U' OR                      19920000
199300                               'V' OR 'W' OR 'X' OR 'Y' OR 'Z'    19930000
199400        MOVE 'C'     TO WORK-HRG2.                                19940000
199500                                                                  19950000
199600     IF HHA-FUNCTION-SEV-EQ4 = 'A'                                19960000
199700        MOVE 'F'     TO WORK-HRG3.                                19970000
199800                                                                  19980000
199900     IF HHA-FUNCTION-SEV-EQ4 = 'B' OR                             19990000
200000                               'C' OR 'D' OR 'E' OR               20000000
200100                               'F' OR 'G' OR 'H'                  20010000
200200        MOVE 'G'     TO WORK-HRG3.                                20020000
200300                                                                  20030000
200400     IF HHA-FUNCTION-SEV-EQ4 =     'I' OR 'J' OR 'K' OR           20040000
200500                                'L' OR 'M' OR 'N' OR 'O' OR       20050000
200600                  'P' OR 'Q' OR 'R' OR 'S' OR 'T' OR 'U' OR       20060000
200700                  'V' OR 'W' OR 'X' OR 'Y' OR 'Z'                 20070000
200800        MOVE 'H'     TO WORK-HRG3.                                20080000
200900                                                                  20090000
201000 2330-RECORD-HRG1-4-2016-EXIT.                                    20100000
201100     EXIT.                                                        20110000
201200                                                                  20120000
201300 2330-RECODE-HRG1-4-2017.                                         20130000
201400                                                                  20140000
201500     IF HHA-CLINICAL-SEV-EQ4 = 'A' OR 'B'                         20150000
201600        MOVE 'A'     TO WORK-HRG2.                                20160000
201700                                                                  20170000
201800     IF HHA-CLINICAL-SEV-EQ4 = 'C' OR 'D' OR 'E' OR 'F' OR        20180000
201810                               'G' OR 'H' OR 'I' OR 'J'           20181000
202100        MOVE 'B'     TO WORK-HRG2.                                20210000
202200                                                                  20220000
202300     IF HHA-CLINICAL-SEV-EQ4 = 'K' OR 'L' OR 'M' OR               20230000
202310                               'N' OR 'O' OR 'P' OR               20231000
202400                               'Q' OR 'R' OR 'S' OR               20240000
202500                               'T' OR 'U' OR                      20250000
202600                               'V' OR 'W' OR 'X' OR 'Y' OR 'Z'    20260000
202700        MOVE 'C'     TO WORK-HRG2.                                20270000
202800                                                                  20280000
202900     IF HHA-FUNCTION-SEV-EQ4 = 'A' OR 'B'                         20290000
203000        MOVE 'F'     TO WORK-HRG3.                                20300000
203100                                                                  20310000
203300     IF HHA-FUNCTION-SEV-EQ4 = 'C' OR 'D' OR 'E' OR               20330000
203400                               'F' OR 'G' OR 'H' OR               20340000
203410                               'I' OR 'J'                         20341000
203500        MOVE 'G'     TO WORK-HRG3.                                20350000
203600                                                                  20360000
203700     IF HHA-FUNCTION-SEV-EQ4 =                                    20370000
203800                         'K' OR 'L' OR 'M' OR 'N' OR 'O' OR       20380000
203900                  'P' OR 'Q' OR 'R' OR 'S' OR 'T' OR 'U' OR       20390000
204000                  'V' OR 'W' OR 'X' OR 'Y' OR 'Z'                 20400000
204100        MOVE 'H'     TO WORK-HRG3.                                20410000
204200                                                                  20420000
204300 2330-RECORD-HRG1-4-2017-EXIT.                                    20430000
204400     EXIT.                                                        20440000
204410                                                                  20441000
204420 2330-RECODE-HRG1-4-2018.                                         20442000
204430                                                                  20443000
204440     IF HHA-CLINICAL-SEV-EQ4 = 'A' OR 'B'                         20444000
204450        MOVE 'A'     TO WORK-HRG2.                                20445000
204460                                                                  20446000
204470     IF HHA-CLINICAL-SEV-EQ4 = 'C' OR 'D' OR 'E' OR 'F' OR        20447000
204480                               'G' OR 'H' OR 'I' OR 'J'           20448000
204490        MOVE 'B'     TO WORK-HRG2.                                20449000
204491                                                                  20449100
204492     IF HHA-CLINICAL-SEV-EQ4 = 'K' OR 'L' OR 'M' OR               20449200
204493                               'N' OR 'O' OR 'P' OR               20449300
204494                               'Q' OR 'R' OR 'S' OR               20449400
204495                               'T' OR 'U' OR                      20449500
204496                               'V' OR 'W' OR 'X' OR 'Y' OR 'Z'    20449600
204497        MOVE 'C'     TO WORK-HRG2.                                20449700
204498                                                                  20449800
204499* V180 UPDATED                                                    20449900
204500                                                                  20450000
204501**   IF HHA-FUNCTION-SEV-EQ4 = 'A' OR 'B'                         20450100
204502**      MOVE 'F'     TO WORK-HRG3.                                20450200
204503                                                                  20450300
204504     IF HHA-FUNCTION-SEV-EQ4 = 'A' OR 'B' OR 'C'                  20450400
204505        MOVE 'F'     TO WORK-HRG3.                                20450500
204506                                                                  20450600
204507**   IF HHA-FUNCTION-SEV-EQ4 = 'C' OR 'D' OR 'E' OR               20450700
204508**                             'F' OR 'G' OR 'H' OR               20450800
204509**                             'I' OR 'J'                         20450900
204510**      MOVE 'G'     TO WORK-HRG3.                                20451000
204511                                                                  20451100
204512     IF HHA-FUNCTION-SEV-EQ4 = 'D' OR 'E' OR                      20451200
204513                               'F' OR 'G' OR 'H'                  20451300
204515        MOVE 'G'     TO WORK-HRG3.                                20451500
204516                                                                  20451600
204517**   IF HHA-FUNCTION-SEV-EQ4 =                                    20451700
204518**                       'K' OR 'L' OR 'M' OR 'N' OR 'O' OR       20451800
204519**                'P' OR 'Q' OR 'R' OR 'S' OR 'T' OR 'U' OR       20451900
204520**                'V' OR 'W' OR 'X' OR 'Y' OR 'Z'                 20452000
204521**      MOVE 'H'     TO WORK-HRG3.                                20452100
204522                                                                  20452200
204523     IF HHA-FUNCTION-SEV-EQ4 = 'I' OR 'J' OR                      20452300
204524                         'K' OR 'L' OR 'M' OR 'N' OR 'O' OR       20452400
204525                  'P' OR 'Q' OR 'R' OR 'S' OR 'T' OR 'U' OR       20452500
204526                  'V' OR 'W' OR 'X' OR 'Y' OR 'Z'                 20452600
204527        MOVE 'H'     TO WORK-HRG3.                                20452700
204528                                                                  20452800
204529 2330-RECORD-HRG1-4-2018-EXIT.                                    20452900
204530     EXIT.                                                        20453000
204531                                                                  20453100
204532 2330-RECODE-HRG1-4-2019.                                         20453200
204533                                                                  20453300
204534     IF HHA-CLINICAL-SEV-EQ4 = 'A' OR 'B'                         20453400
204535        MOVE 'A'     TO WORK-HRG2.                                20453500
204536                                                                  20453600
204537     IF HHA-CLINICAL-SEV-EQ4 = 'C' OR 'D' OR 'E' OR 'F' OR        20453700
204538                               'G' OR 'H' OR 'I' OR 'J'           20453800
204539        MOVE 'B'     TO WORK-HRG2.                                20453900
204540                                                                  20454000
204541     IF HHA-CLINICAL-SEV-EQ4 = 'K' OR 'L' OR 'M' OR               20454100
204542                               'N' OR 'O' OR 'P' OR               20454200
204543                               'Q' OR 'R' OR 'S' OR               20454300
204544                               'T' OR 'U' OR                      20454400
204545                               'V' OR 'W' OR 'X' OR 'Y' OR 'Z'    20454500
204546        MOVE 'C'     TO WORK-HRG2.                                20454600
204552                                                                  20455200
204553     IF HHA-FUNCTION-SEV-EQ4 = 'A' OR 'B' OR 'C'                  20455300
204554        MOVE 'F'     TO WORK-HRG3.                                20455400
204555                                                                  20455500
204561     IF HHA-FUNCTION-SEV-EQ4 = 'D' OR 'E' OR                      20456100
204562                               'F' OR 'G' OR 'H'                  20456200
204563        MOVE 'G'     TO WORK-HRG3.                                20456300
204570                                                                  20457000
204571     IF HHA-FUNCTION-SEV-EQ4 = 'I' OR 'J' OR                      20457100
204572                         'K' OR 'L' OR 'M' OR 'N' OR 'O' OR       20457200
204573                  'P' OR 'Q' OR 'R' OR 'S' OR 'T' OR 'U' OR       20457300
204574                  'V' OR 'W' OR 'X' OR 'Y' OR 'Z'                 20457400
204575        MOVE 'H'     TO WORK-HRG3.                                20457500
204576                                                                  20457600
204577 2330-RECORD-HRG1-4-2019-EXIT.                                    20457700
204578     EXIT.                                                        20457800
204580                                                                  20458000
204600 2475-RECODE-HRG5-3.                                              20460000
204700                                                                  20470000
204800     IF HHA-SERV-THRU-DATE < 20150101                             20480000
204900        PERFORM 2475-RECODE-HRG5-3-2014                           20490000
205000           THRU 2475-RECORD-HRG5-3-2014-EXIT                      20500000
205100     ELSE                                                         20510000
205200     IF HHA-SERV-THRU-DATE < 20160101                             20520000
205300        PERFORM 2475-RECODE-HRG5-3-2015                           20530000
205400           THRU 2475-RECORD-HRG5-3-2015-EXIT                      20540000
205500     ELSE                                                         20550000
205600     IF HHA-SERV-THRU-DATE < 20170101                             20560000
205700        PERFORM 2475-RECODE-HRG5-3-2016                           20570000
205800           THRU 2475-RECORD-HRG5-3-2016-EXIT                      20580000
205900     ELSE                                                         20590000
206000     IF HHA-SERV-THRU-DATE < 20180101                             20600000
206100        PERFORM 2475-RECODE-HRG5-3-2017                           20610000
206200           THRU 2475-RECORD-HRG5-3-2017-EXIT                      20620000
206210     ELSE                                                         20621000
206220     IF HHA-SERV-THRU-DATE < 20190101                             20622000
206230        PERFORM 2475-RECODE-HRG5-3-2018                           20623000
206240           THRU 2475-RECORD-HRG5-3-2018-EXIT                      20624000
206250     ELSE                                                         20625000
206260     IF HHA-SERV-THRU-DATE < 20200301                             20626000
206270        PERFORM 2475-RECODE-HRG5-3-2019                           20627000
206280           THRU 2475-RECORD-HRG5-3-2019-EXIT                      20628000
206300     END-IF.                                                      20630000
206400                                                                  20640000
206500     PERFORM 2600-RECODE-HRG-POS4 THRU 2600-EXIT.                 20650000
206600                                                                  20660000
206700 2475-EXIT.                                                       20670000
206800     EXIT.                                                        20680000
206900                                                                  20690000
207000 2475-RECODE-HRG5-3-2014.                                         20700000
207100                                                                  20710000
207200     IF HHA-CLINICAL-SEV-EQ2 = 'A' OR 'B' OR 'C' OR 'D' OR        20720000
207300                               'E' OR 'F' OR 'G'                  20730000
207400        MOVE 'A'     TO WORK-HRG2.                                20740000
207500                                                                  20750000
207600     IF HHA-CLINICAL-SEV-EQ2 = 'H' OR                             20760000
207700                               'I' OR 'J' OR 'K' OR 'L' OR        20770000
207800                               'M' OR 'N'                         20780000
207900        MOVE 'B'     TO WORK-HRG2.                                20790000
208000                                                                  20800000
208100     IF HHA-CLINICAL-SEV-EQ2 = 'O' OR 'P' OR 'Q' OR 'R' OR        20810000
208200                               'S' OR 'T' OR 'U' OR               20820000
208300                               'V' OR 'W' OR 'X' OR 'Y' OR 'Z'    20830000
208400        MOVE 'C'     TO WORK-HRG2.                                20840000
208500                                                                  20850000
208600     IF HHA-FUNCTION-SEV-EQ2 = 'A' OR 'B' OR 'C' OR 'D' OR        20860000
208700                               'E' OR 'F'                         20870000
208800        MOVE 'F'     TO WORK-HRG3.                                20880000
208900                                                                  20890000
209000     IF HHA-FUNCTION-SEV-EQ2 = 'G'                                20900000
209100        MOVE 'G'     TO WORK-HRG3.                                20910000
209200                                                                  20920000
209300     IF HHA-FUNCTION-SEV-EQ2 =     'H' OR 'I' OR                  20930000
209400                  'J' OR 'K' OR 'L' OR 'M' OR 'N' OR 'O' OR       20940000
209500                  'P' OR 'Q' OR 'R' OR 'S' OR 'T' OR 'U' OR       20950000
209600                  'V' OR 'W' OR 'X' OR 'Y' OR 'Z'                 20960000
209700        MOVE 'H'     TO WORK-HRG3.                                20970000
209800                                                                  20980000
209900                                                                  20990000
210000     IF HHA-REVENUE-SUM1-3-QTY-THR > 19                           21000000
210100          MOVE 'K' TO WORK-HRG4.                                  21010000
210200                                                                  21020000
210300 2475-RECORD-HRG5-3-2014-EXIT.                                    21030000
210400     EXIT.                                                        21040000
210500                                                                  21050000
210600 2475-RECODE-HRG5-3-2015.                                         21060000
210700                                                                  21070000
210800     IF HHA-CLINICAL-SEV-EQ2 = 'A' OR 'B' OR 'C' OR 'D'           21080000
210900        MOVE 'A'     TO WORK-HRG2.                                21090000
211000                                                                  21100000
211100     IF HHA-CLINICAL-SEV-EQ2 = 'E' OR 'F' OR 'G' OR 'H' OR        21110000
211200                               'I' OR 'J' OR 'K' OR 'L' OR        21120000
211300                               'M' OR 'N' OR 'O' OR 'P' OR        21130000
211400                               'Q'                                21140000
211500        MOVE 'B'     TO WORK-HRG2.                                21150000
211600                                                                  21160000
211700     IF HHA-CLINICAL-SEV-EQ2 = 'R' OR                             21170000
211800                               'S' OR 'T' OR 'U' OR               21180000
211900                               'V' OR 'W' OR 'X' OR 'Y' OR 'Z'    21190000
212000        MOVE 'C'     TO WORK-HRG2.                                21200000
212100                                                                  21210000
212200     IF HHA-FUNCTION-SEV-EQ2 = 'A' OR 'B' OR 'C'                  21220000
212300        MOVE 'F'     TO WORK-HRG3.                                21230000
212400                                                                  21240000
212500     IF HHA-FUNCTION-SEV-EQ2 = 'D' OR                             21250000
212600                               'E' OR 'F'                         21260000
212700        MOVE 'G'     TO WORK-HRG3.                                21270000
212800                                                                  21280000
212900     IF HHA-FUNCTION-SEV-EQ2 =     'G' OR 'H' OR 'I' OR           21290000
213000                  'J' OR 'K' OR 'L' OR 'M' OR 'N' OR 'O' OR       21300000
213100                  'P' OR 'Q' OR 'R' OR 'S' OR 'T' OR 'U' OR       21310000
213200                  'V' OR 'W' OR 'X' OR 'Y' OR 'Z'                 21320000
213300        MOVE 'H'     TO WORK-HRG3.                                21330000
213400                                                                  21340000
213500**** V161 ****                                                    21350000
213600     IF HHA-REVENUE-SUM1-3-QTY-THR > 19                           21360000
213700          MOVE 'K' TO WORK-HRG4.                                  21370000
213800                                                                  21380000
213900 2475-RECORD-HRG5-3-2015-EXIT.                                    21390000
214000     EXIT.                                                        21400000
214100                                                                  21410000
214200 2475-RECODE-HRG5-3-2016.                                         21420000
214300                                                                  21430000
214400     IF HHA-CLINICAL-SEV-EQ2 = 'A' OR 'B' OR 'C' OR 'D'           21440000
214500        MOVE 'A'     TO WORK-HRG2.                                21450000
214600                                                                  21460000
214700     IF HHA-CLINICAL-SEV-EQ2 = 'E' OR 'F' OR 'G' OR 'H' OR        21470000
214800                               'I' OR 'J' OR 'K' OR 'L' OR        21480000
214900                               'M' OR 'N' OR 'O' OR 'P' OR        21490000
215000                               'Q'                                21500000
215100        MOVE 'B'     TO WORK-HRG2.                                21510000
215200                                                                  21520000
215300     IF HHA-CLINICAL-SEV-EQ2 = 'R' OR                             21530000
215400                               'S' OR 'T' OR 'U' OR               21540000
215500                               'V' OR 'W' OR 'X' OR 'Y' OR 'Z'    21550000
215600        MOVE 'C'     TO WORK-HRG2.                                21560000
215700                                                                  21570000
215800     IF HHA-FUNCTION-SEV-EQ2 = 'A' OR 'B' OR 'C'                  21580000
215900        MOVE 'F'     TO WORK-HRG3.                                21590000
216000                                                                  21600000
216100     IF HHA-FUNCTION-SEV-EQ2 = 'D' OR                             21610000
216200                               'E' OR 'F' OR 'G'                  21620000
216300        MOVE 'G'     TO WORK-HRG3.                                21630000
216400                                                                  21640000
216500     IF HHA-FUNCTION-SEV-EQ2 =  'H' OR 'I' OR                     21650000
216600                  'J' OR 'K' OR 'L' OR 'M' OR 'N' OR 'O' OR       21660000
216700                  'P' OR 'Q' OR 'R' OR 'S' OR 'T' OR 'U' OR       21670000
216800                  'V' OR 'W' OR 'X' OR 'Y' OR 'Z'                 21680000
216900        MOVE 'H'     TO WORK-HRG3.                                21690000
217000                                                                  21700000
217200     IF HHA-REVENUE-SUM1-3-QTY-THR > 19                           21720000
217300          MOVE 'K' TO WORK-HRG4.                                  21730000
217400                                                                  21740000
217500 2475-RECORD-HRG5-3-2016-EXIT.                                    21750000
217600     EXIT.                                                        21760000
217700                                                                  21770000
217800 2475-RECODE-HRG5-3-2017.                                         21780000
217900                                                                  21790000
218000     IF HHA-CLINICAL-SEV-EQ2 = 'A' OR 'B' OR 'C' OR 'D'           21800000
218100        MOVE 'A'     TO WORK-HRG2.                                21810000
218200                                                                  21820000
218300     IF HHA-CLINICAL-SEV-EQ2 = 'E' OR 'F' OR 'G' OR 'H' OR        21830000
218400                               'I' OR 'J' OR 'K' OR 'L' OR        21840000
218500                               'M' OR 'N' OR 'O' OR 'P' OR        21850000
218600                               'Q'                                21860000
218700        MOVE 'B'     TO WORK-HRG2.                                21870000
218800                                                                  21880000
218900     IF HHA-CLINICAL-SEV-EQ2 = 'R' OR                             21890000
219000                               'S' OR 'T' OR 'U' OR               21900000
219100                               'V' OR 'W' OR 'X' OR 'Y' OR 'Z'    21910000
219200        MOVE 'C'     TO WORK-HRG2.                                21920000
219300                                                                  21930000
219400     IF HHA-FUNCTION-SEV-EQ2 = 'A' OR 'B' OR 'C'                  21940000
219500        MOVE 'F'     TO WORK-HRG3.                                21950000
219600                                                                  21960000
219700     IF HHA-FUNCTION-SEV-EQ2 = 'D' OR                             21970000
219800                               'E' OR 'F' OR 'G'                  21980000
219900        MOVE 'G'     TO WORK-HRG3.                                21990000
220000                                                                  22000000
220100     IF HHA-FUNCTION-SEV-EQ2 =  'H' OR 'I' OR                     22010000
220200                  'J' OR 'K' OR 'L' OR 'M' OR 'N' OR 'O' OR       22020000
220300                  'P' OR 'Q' OR 'R' OR 'S' OR 'T' OR 'U' OR       22030000
220400                  'V' OR 'W' OR 'X' OR 'Y' OR 'Z'                 22040000
220500        MOVE 'H'     TO WORK-HRG3.                                22050000
220600                                                                  22060000
220800     IF HHA-REVENUE-SUM1-3-QTY-THR > 19                           22080000
220900          MOVE 'K' TO WORK-HRG4.                                  22090000
221000                                                                  22100000
221100 2475-RECORD-HRG5-3-2017-EXIT.                                    22110000
221200     EXIT.                                                        22120000
221210                                                                  22121000
221220 2475-RECODE-HRG5-3-2018.                                         22122000
221230                                                                  22123000
221240     IF HHA-CLINICAL-SEV-EQ2 = 'A' OR 'B' OR 'C' OR 'D'           22124000
221250        MOVE 'A'     TO WORK-HRG2.                                22125000
221260                                                                  22126000
221270     IF HHA-CLINICAL-SEV-EQ2 = 'E' OR 'F' OR 'G' OR 'H' OR        22127000
221280                               'I' OR 'J' OR 'K' OR 'L' OR        22128000
221290                               'M' OR 'N' OR 'O' OR 'P' OR        22129000
221291                               'Q'                                22129100
221292        MOVE 'B'     TO WORK-HRG2.                                22129200
221293                                                                  22129300
221294     IF HHA-CLINICAL-SEV-EQ2 = 'R' OR                             22129400
221295                               'S' OR 'T' OR 'U' OR               22129500
221296                               'V' OR 'W' OR 'X' OR 'Y' OR 'Z'    22129600
221297        MOVE 'C'     TO WORK-HRG2.                                22129700
221298                                                                  22129800
221299     IF HHA-FUNCTION-SEV-EQ2 = 'A' OR 'B' OR 'C'                  22129900
221300        MOVE 'F'     TO WORK-HRG3.                                22130000
221301                                                                  22130100
221302     IF HHA-FUNCTION-SEV-EQ2 = 'D' OR                             22130200
221303                               'E' OR 'F' OR 'G'                  22130300
221304        MOVE 'G'     TO WORK-HRG3.                                22130400
221305                                                                  22130500
221306     IF HHA-FUNCTION-SEV-EQ2 =  'H' OR 'I' OR                     22130600
221307                  'J' OR 'K' OR 'L' OR 'M' OR 'N' OR 'O' OR       22130700
221308                  'P' OR 'Q' OR 'R' OR 'S' OR 'T' OR 'U' OR       22130800
221309                  'V' OR 'W' OR 'X' OR 'Y' OR 'Z'                 22130900
221310        MOVE 'H'     TO WORK-HRG3.                                22131000
221311                                                                  22131100
221313     IF HHA-REVENUE-SUM1-3-QTY-THR > 19                           22131300
221314          MOVE 'K' TO WORK-HRG4.                                  22131400
221315                                                                  22131500
221316 2475-RECORD-HRG5-3-2018-EXIT.                                    22131600
221317     EXIT.                                                        22131700
221318                                                                  22131800
221319 2475-RECODE-HRG5-3-2019.                                         22131900
221320                                                                  22132000
221321     IF HHA-CLINICAL-SEV-EQ2 = 'A' OR 'B' OR 'C' OR 'D'           22132100
221322        MOVE 'A'     TO WORK-HRG2.                                22132200
221323                                                                  22132300
221324     IF HHA-CLINICAL-SEV-EQ2 = 'E' OR 'F' OR 'G' OR 'H' OR        22132400
221325                               'I' OR 'J' OR 'K' OR 'L' OR        22132500
221326                               'M' OR 'N' OR 'O' OR 'P' OR        22132600
221327                               'Q'                                22132700
221328        MOVE 'B'     TO WORK-HRG2.                                22132800
221329                                                                  22132900
221330     IF HHA-CLINICAL-SEV-EQ2 = 'R' OR                             22133000
221331                               'S' OR 'T' OR 'U' OR               22133100
221332                               'V' OR 'W' OR 'X' OR 'Y' OR 'Z'    22133200
221333        MOVE 'C'     TO WORK-HRG2.                                22133300
221334                                                                  22133400
221335     IF HHA-FUNCTION-SEV-EQ2 = 'A' OR 'B' OR 'C'                  22133500
221336        MOVE 'F'     TO WORK-HRG3.                                22133600
221337                                                                  22133700
221338     IF HHA-FUNCTION-SEV-EQ2 = 'D' OR                             22133800
221339                               'E' OR 'F' OR 'G'                  22133900
221340        MOVE 'G'     TO WORK-HRG3.                                22134000
221341                                                                  22134100
221342     IF HHA-FUNCTION-SEV-EQ2 =  'H' OR 'I' OR                     22134200
221343                  'J' OR 'K' OR 'L' OR 'M' OR 'N' OR 'O' OR       22134300
221344                  'P' OR 'Q' OR 'R' OR 'S' OR 'T' OR 'U' OR       22134400
221345                  'V' OR 'W' OR 'X' OR 'Y' OR 'Z'                 22134500
221346        MOVE 'H'     TO WORK-HRG3.                                22134600
221347                                                                  22134700
221348     IF HHA-REVENUE-SUM1-3-QTY-THR > 19                           22134800
221349          MOVE 'K' TO WORK-HRG4.                                  22134900
221350                                                                  22135000
221351 2475-RECORD-HRG5-3-2019-EXIT.                                    22135100
221352     EXIT.                                                        22135200
221360                                                                  22136000
221400 2480-RECODE-HRG5-4.                                              22140000
221500                                                                  22150000
221600     IF HHA-SERV-THRU-DATE < 20150101                             22160000
221700        PERFORM 2480-RECODE-HRG5-4-2014                           22170000
221800           THRU 2480-RECORD-HRG5-4-2014-EXIT                      22180000
221900     ELSE                                                         22190000
222000     IF HHA-SERV-THRU-DATE < 20160101                             22200000
222100        PERFORM 2480-RECODE-HRG5-4-2015                           22210000
222200           THRU 2480-RECORD-HRG5-4-2015-EXIT                      22220000
222300     ELSE                                                         22230000
222400     IF HHA-SERV-THRU-DATE < 20170101                             22240000
222500        PERFORM 2480-RECODE-HRG5-4-2016                           22250000
222600           THRU 2480-RECORD-HRG5-4-2016-EXIT                      22260000
222700     ELSE                                                         22270000
222800     IF HHA-SERV-THRU-DATE < 20180101                             22280000
222900        PERFORM 2480-RECODE-HRG5-4-2017                           22290000
223000           THRU 2480-RECORD-HRG5-4-2017-EXIT                      22300000
223010     ELSE                                                         22301000
223020     IF HHA-SERV-THRU-DATE < 20190101                             22302000
223030        PERFORM 2480-RECODE-HRG5-4-2018                           22303000
223040           THRU 2480-RECORD-HRG5-4-2018-EXIT                      22304000
223050     ELSE                                                         22305000
223060     IF HHA-SERV-THRU-DATE < 20200301                             22306000
223070        PERFORM 2480-RECODE-HRG5-4-2019                           22307000
223080           THRU 2480-RECORD-HRG5-4-2019-EXIT                      22308000
223100     END-IF.                                                      22310000
223200                                                                  22320000
223300     PERFORM 2600-RECODE-HRG-POS4 THRU 2600-EXIT.                 22330000
223400                                                                  22340000
223500 2480-EXIT.  EXIT.                                                22350000
223600                                                                  22360000
223700 2480-RECODE-HRG5-4-2014.                                         22370000
223800                                                                  22380000
223900     IF HHA-CLINICAL-SEV-EQ4 = 'A' OR 'B' OR 'C' OR 'D' OR        22390000
224000                               'E' OR 'F' OR 'G'                  22400000
224100        MOVE 'A'     TO WORK-HRG2.                                22410000
224200                                                                  22420000
224300     IF HHA-CLINICAL-SEV-EQ4 = 'H' OR                             22430000
224400                               'I' OR 'J' OR 'K' OR 'L' OR        22440000
224500                               'M' OR 'N'                         22450000
224600        MOVE 'B'     TO WORK-HRG2.                                22460000
224700                                                                  22470000
224800     IF HHA-CLINICAL-SEV-EQ4 = 'O' OR 'P' OR 'Q' OR 'R' OR        22480000
224900                               'S' OR 'T' OR 'U' OR               22490000
225000                               'V' OR 'W' OR 'X' OR 'Y' OR 'Z'    22500000
225100        MOVE 'C'     TO WORK-HRG2.                                22510000
225200                                                                  22520000
225300     IF HHA-FUNCTION-SEV-EQ4 = 'A' OR 'B' OR 'C' OR 'D' OR        22530000
225400                               'E' OR 'F'                         22540000
225500        MOVE 'F'     TO WORK-HRG3.                                22550000
225600                                                                  22560000
225700     IF HHA-FUNCTION-SEV-EQ4 = 'G'                                22570000
225800        MOVE 'G'     TO WORK-HRG3.                                22580000
225900                                                                  22590000
226000     IF HHA-FUNCTION-SEV-EQ4 =     'H' OR 'I' OR                  22600000
226100                  'J' OR 'K' OR 'L' OR 'M' OR 'N' OR 'O' OR       22610000
226200                  'P' OR 'Q' OR 'R' OR 'S' OR 'T' OR 'U' OR       22620000
226300                  'V' OR 'W' OR 'X' OR 'Y' OR 'Z'                 22630000
226400        MOVE 'H'     TO WORK-HRG3.                                22640000
226500                                                                  22650000
226600     IF HHA-REVENUE-SUM1-3-QTY-THR > 19                           22660000
226700          MOVE 'K' TO WORK-HRG4.                                  22670000
226800                                                                  22680000
226900 2480-RECORD-HRG5-4-2014-EXIT.                                    22690000
227000     EXIT.                                                        22700000
227100                                                                  22710000
227200 2480-RECODE-HRG5-4-2015.                                         22720000
227300                                                                  22730000
227400     IF HHA-CLINICAL-SEV-EQ4 = 'A' OR 'B' OR 'C' OR 'D'           22740000
227500        MOVE 'A'     TO WORK-HRG2.                                22750000
227600                                                                  22760000
227700     IF HHA-CLINICAL-SEV-EQ4 = 'E' OR                             22770000
227800                               'F' OR 'G' OR 'H' OR               22780000
227900                               'I' OR 'J' OR 'K' OR 'L' OR        22790000
228000                               'M' OR 'N' OR                      22800000
228100                               'O' OR 'P' OR 'Q'                  22810000
228200        MOVE 'B'     TO WORK-HRG2.                                22820000
228300                                                                  22830000
228400     IF HHA-CLINICAL-SEV-EQ4 = 'R' OR                             22840000
228500                               'S' OR 'T' OR 'U' OR               22850000
228600                               'V' OR 'W' OR 'X' OR 'Y' OR 'Z'    22860000
228700        MOVE 'C'     TO WORK-HRG2.                                22870000
228800                                                                  22880000
228900     IF HHA-FUNCTION-SEV-EQ4 = 'A' OR 'B' OR 'C'                  22890000
229000        MOVE 'F'     TO WORK-HRG3.                                22900000
229100                                                                  22910000
229200     IF HHA-FUNCTION-SEV-EQ4 = 'D' OR                             22920000
229300                               'E' OR 'F'                         22930000
229400        MOVE 'G'     TO WORK-HRG3.                                22940000
229500                                                                  22950000
229600     IF HHA-FUNCTION-SEV-EQ4 =     'G' OR 'H' OR 'I' OR           22960000
229700                  'J' OR 'K' OR 'L' OR 'M' OR 'N' OR 'O' OR       22970000
229800                  'P' OR 'Q' OR 'R' OR 'S' OR 'T' OR 'U' OR       22980000
229900                  'V' OR 'W' OR 'X' OR 'Y' OR 'Z'                 22990000
230000        MOVE 'H'     TO WORK-HRG3.                                23000000
230100                                                                  23010000
230200 2480-RECORD-HRG5-4-2015-EXIT.                                    23020000
230300     EXIT.                                                        23030000
230400                                                                  23040000
230500 2480-RECODE-HRG5-4-2016.                                         23050000
230600                                                                  23060000
230700     IF HHA-CLINICAL-SEV-EQ4 = 'A' OR 'B' OR 'C' OR 'D'           23070000
230800        MOVE 'A'     TO WORK-HRG2.                                23080000
230900                                                                  23090000
231000     IF HHA-CLINICAL-SEV-EQ4 = 'E' OR                             23100000
231100                               'F' OR 'G' OR 'H' OR               23110000
231200                               'I' OR 'J' OR 'K' OR 'L' OR        23120000
231300                               'M' OR 'N' OR                      23130000
231400                               'O' OR 'P' OR 'Q'                  23140000
231500        MOVE 'B'     TO WORK-HRG2.                                23150000
231600                                                                  23160000
231700     IF HHA-CLINICAL-SEV-EQ4 = 'R' OR                             23170000
231800                               'S' OR 'T' OR 'U' OR               23180000
231900                               'V' OR 'W' OR 'X' OR 'Y' OR 'Z'    23190000
232000        MOVE 'C'     TO WORK-HRG2.                                23200000
232100                                                                  23210000
232200     IF HHA-FUNCTION-SEV-EQ4 = 'A' OR 'B' OR 'C'                  23220000
232300        MOVE 'F'     TO WORK-HRG3.                                23230000
232400                                                                  23240000
232500     IF HHA-FUNCTION-SEV-EQ4 = 'D' OR                             23250000
232600                               'E' OR 'F' OR 'G'                  23260000
232700        MOVE 'G'     TO WORK-HRG3.                                23270000
232800                                                                  23280000
232900     IF HHA-FUNCTION-SEV-EQ4 =  'H' OR 'I' OR                     23290000
233000                  'J' OR 'K' OR 'L' OR 'M' OR 'N' OR 'O' OR       23300000
233100                  'P' OR 'Q' OR 'R' OR 'S' OR 'T' OR 'U' OR       23310000
233200                  'V' OR 'W' OR 'X' OR 'Y' OR 'Z'                 23320000
233300        MOVE 'H'     TO WORK-HRG3.                                23330000
233400                                                                  23340000
233500 2480-RECORD-HRG5-4-2016-EXIT.                                    23350000
233600     EXIT.                                                        23360000
233700                                                                  23370000
233800 2480-RECODE-HRG5-4-2017.                                         23380000
233900                                                                  23390000
234000     IF HHA-CLINICAL-SEV-EQ4 = 'A' OR 'B' OR 'C' OR 'D'           23400000
234100        MOVE 'A'     TO WORK-HRG2.                                23410000
234200                                                                  23420000
234300     IF HHA-CLINICAL-SEV-EQ4 = 'E' OR                             23430000
234400                               'F' OR 'G' OR 'H' OR               23440000
234500                               'I' OR 'J' OR 'K' OR 'L' OR        23450000
234600                               'M' OR 'N' OR                      23460000
234700                               'O' OR 'P' OR 'Q'                  23470000
234800        MOVE 'B'     TO WORK-HRG2.                                23480000
234900                                                                  23490000
235000     IF HHA-CLINICAL-SEV-EQ4 = 'R' OR                             23500000
235100                               'S' OR 'T' OR 'U' OR               23510000
235200                               'V' OR 'W' OR 'X' OR 'Y' OR 'Z'    23520000
235300        MOVE 'C'     TO WORK-HRG2.                                23530000
235400                                                                  23540000
235500     IF HHA-FUNCTION-SEV-EQ4 = 'A' OR 'B' OR 'C'                  23550000
235600        MOVE 'F'     TO WORK-HRG3.                                23560000
235700                                                                  23570000
235800     IF HHA-FUNCTION-SEV-EQ4 = 'D' OR                             23580000
235900                               'E' OR 'F' OR 'G'                  23590000
236000        MOVE 'G'     TO WORK-HRG3.                                23600000
236100                                                                  23610000
236200     IF HHA-FUNCTION-SEV-EQ4 =  'H' OR 'I' OR                     23620000
236300                  'J' OR 'K' OR 'L' OR 'M' OR 'N' OR 'O' OR       23630000
236400                  'P' OR 'Q' OR 'R' OR 'S' OR 'T' OR 'U' OR       23640000
236500                  'V' OR 'W' OR 'X' OR 'Y' OR 'Z'                 23650000
236600        MOVE 'H'     TO WORK-HRG3.                                23660000
236700                                                                  23670000
236800 2480-RECORD-HRG5-4-2017-EXIT.                                    23680000
236900     EXIT.                                                        23690000
236910                                                                  23691000
236920 2480-RECODE-HRG5-4-2018.                                         23692000
236930                                                                  23693000
236940     IF HHA-CLINICAL-SEV-EQ4 = 'A' OR 'B' OR 'C' OR 'D'           23694000
236950        MOVE 'A'     TO WORK-HRG2.                                23695000
236960                                                                  23696000
236970     IF HHA-CLINICAL-SEV-EQ4 = 'E' OR                             23697000
236980                               'F' OR 'G' OR 'H' OR               23698000
236990                               'I' OR 'J' OR 'K' OR 'L' OR        23699000
236991                               'M' OR 'N' OR                      23699100
236992                               'O' OR 'P' OR 'Q'                  23699200
236993        MOVE 'B'     TO WORK-HRG2.                                23699300
236994                                                                  23699400
236995     IF HHA-CLINICAL-SEV-EQ4 = 'R' OR                             23699500
236996                               'S' OR 'T' OR 'U' OR               23699600
236997                               'V' OR 'W' OR 'X' OR 'Y' OR 'Z'    23699700
236998        MOVE 'C'     TO WORK-HRG2.                                23699800
236999                                                                  23699900
237000     IF HHA-FUNCTION-SEV-EQ4 = 'A' OR 'B' OR 'C'                  23700000
237001        MOVE 'F'     TO WORK-HRG3.                                23700100
237002                                                                  23700200
237003     IF HHA-FUNCTION-SEV-EQ4 = 'D' OR                             23700300
237004                               'E' OR 'F' OR 'G'                  23700400
237005        MOVE 'G'     TO WORK-HRG3.                                23700500
237006                                                                  23700600
237007     IF HHA-FUNCTION-SEV-EQ4 =  'H' OR 'I' OR                     23700700
237008                  'J' OR 'K' OR 'L' OR 'M' OR 'N' OR 'O' OR       23700800
237009                  'P' OR 'Q' OR 'R' OR 'S' OR 'T' OR 'U' OR       23700900
237010                  'V' OR 'W' OR 'X' OR 'Y' OR 'Z'                 23701000
237011        MOVE 'H'     TO WORK-HRG3.                                23701100
237012                                                                  23701200
237013 2480-RECORD-HRG5-4-2018-EXIT.                                    23701300
237014     EXIT.                                                        23701400
237015                                                                  23701500
237016 2480-RECODE-HRG5-4-2019.                                         23701600
237017                                                                  23701700
237018     IF HHA-CLINICAL-SEV-EQ4 = 'A' OR 'B' OR 'C' OR 'D'           23701800
237019        MOVE 'A'     TO WORK-HRG2.                                23701900
237020                                                                  23702000
237021     IF HHA-CLINICAL-SEV-EQ4 = 'E' OR                             23702100
237022                               'F' OR 'G' OR 'H' OR               23702200
237023                               'I' OR 'J' OR 'K' OR 'L' OR        23702300
237024                               'M' OR 'N' OR                      23702400
237025                               'O' OR 'P' OR 'Q'                  23702500
237026        MOVE 'B'     TO WORK-HRG2.                                23702600
237027                                                                  23702700
237028     IF HHA-CLINICAL-SEV-EQ4 = 'R' OR                             23702800
237029                               'S' OR 'T' OR 'U' OR               23702900
237030                               'V' OR 'W' OR 'X' OR 'Y' OR 'Z'    23703000
237031        MOVE 'C'     TO WORK-HRG2.                                23703100
237032                                                                  23703200
237033     IF HHA-FUNCTION-SEV-EQ4 = 'A' OR 'B' OR 'C'                  23703300
237034        MOVE 'F'     TO WORK-HRG3.                                23703400
237035                                                                  23703500
237036     IF HHA-FUNCTION-SEV-EQ4 = 'D' OR                             23703600
237037                               'E' OR 'F' OR 'G'                  23703700
237038        MOVE 'G'     TO WORK-HRG3.                                23703800
237039                                                                  23703900
237040     IF HHA-FUNCTION-SEV-EQ4 =  'H' OR 'I' OR                     23704000
237041                  'J' OR 'K' OR 'L' OR 'M' OR 'N' OR 'O' OR       23704100
237042                  'P' OR 'Q' OR 'R' OR 'S' OR 'T' OR 'U' OR       23704200
237043                  'V' OR 'W' OR 'X' OR 'Y' OR 'Z'                 23704300
237044        MOVE 'H'     TO WORK-HRG3.                                23704400
237045                                                                  23704500
237046 2480-RECORD-HRG5-4-2019-EXIT.                                    23704600
237047     EXIT.                                                        23704700
237050                                                                  23705000
237100**----------------------------------------------------            23710000
237200*  HHA-WITH-DATA-CHECK  (0, 1)                                    23720000
237300*  HHA-NO-DATA-CHECK (2, 3)                                       23730000
237400*                                                                 23740000
237500*COL 1 TB-REV-DOLL-RATE-NRURAL                                    23750000
237600*COL 2 TB-REV-DOLL-RATE-RURAL                                     23760000
237700*COL 3 TB-DOLL-RATE-NRURAL-NOSUBMIT                               23770000
237800*COL 4 TB-DOLL-RATE-RURAL-NOSUBMIT                                23780000
237900*                                                                 23790000
238000*                                                                 23800000
238100                                                                  23810000
238200 Z900-CONV-650-TO-600.                                            23820000
238300                                                                  23830000
238400     INITIALIZE                  WK-DATA.                         23840000
238500     MOVE HHA-DATA            TO WK-DATA.                         23850000
238600     MOVE HHA-PASSBACK-DATA   TO WK-PASSBACK-DATA                 23860000
238700     MOVE HHA-CASE-MIX-DATA   TO WK-CASE-MIX-DATA                 23870000
238800     MOVE HHA-PROV-TOTAL-DATA TO WK-PROV-TOTAL-DATA               23880000
238900                                                                  23890000
239000     PERFORM VARYING SS-REV FROM 1 BY 1                           23900000
239100             UNTIL SS-REV > 6                                     23910000
239200       MOVE HHA-REVENUE-CODE (SS-REV)                             23920000
239300         TO  WK-REVENUE-CODE (SS-REV)                             23930000
239400       MOVE HHA-REVENUE-QTY-COV-VISITS (SS-REV)                   23940000
239500         TO  WK-REVENUE-QTY-COV-VISITS (SS-REV)                   23950000
239600       MOVE HHA-REVENUE-EARLIEST-DATE (SS-REV)                    23960000
239700         TO  WK-REVENUE-EARLIEST-DATE (SS-REV)                    23970000
239800       MOVE HHA-REVENUE-DOLL-RATE (SS-REV)                        23980000
239900         TO  WK-REVENUE-DOLL-RATE (SS-REV)                        23990000
240000       MOVE HHA-REVENUE-COST (SS-REV)                             24000000
240100         TO  WK-REVENUE-COST (SS-REV)                             24010000
240200       MOVE HHA-REVENUE-ADD-ON-VISIT-AMT (SS-REV)                 24020000
240300         TO  WK-REVENUE-ADD-ON-VISIT-AMT (SS-REV)                 24030000
240400     END-PERFORM.                                                 24040000
240500                                                                  24050000
240600 Z900-EXIT. EXIT.                                                 24060000
240700                                                                  24070000
240800 Z950-CONV-600-TO-650.                                            24080000
240900                                                                  24090000
241000     MOVE WK-DATA            TO HHA-DATA.                         24100000
241100     MOVE WK-PASSBACK-DATA   TO HHA-PASSBACK-DATA                 24110000
241200     MOVE WK-CASE-MIX-DATA   TO HHA-CASE-MIX-DATA                 24120000
241300     MOVE WK-PROV-TOTAL-DATA TO HHA-PROV-TOTAL-DATA               24130000
241400                                                                  24140000
241500     PERFORM VARYING SS-REV FROM 1 BY 1                           24150000
241600             UNTIL SS-REV > 6                                     24160000
241700       MOVE WK-REVENUE-CODE (SS-REV)                              24170000
241800         TO  HHA-REVENUE-CODE (SS-REV)                            24180000
241900       MOVE WK-REVENUE-QTY-COV-VISITS (SS-REV)                    24190000
242000         TO  HHA-REVENUE-QTY-COV-VISITS (SS-REV)                  24200000
242100       MOVE WK-REVENUE-EARLIEST-DATE (SS-REV)                     24210000
242200         TO  HHA-REVENUE-EARLIEST-DATE (SS-REV)                   24220000
242300       MOVE WK-REVENUE-DOLL-RATE (SS-REV)                         24230000
242400         TO  HHA-REVENUE-DOLL-RATE (SS-REV)                       24240000
242500       MOVE WK-REVENUE-COST (SS-REV)                              24250000
242600         TO  HHA-REVENUE-COST (SS-REV)                            24260000
242700       MOVE WK-REVENUE-ADD-ON-VISIT-AMT (SS-REV)                  24270000
242800         TO  HHA-REVENUE-ADD-ON-VISIT-AMT (SS-REV)                24280000
242900     END-PERFORM.                                                 24290000
243000                                                                  24300000
243100 Z950-EXIT. EXIT.                                                 24310000
243200*****        LAST STATEMENT               *************           24320000
